{
    "name": "Job 31",
    "book": "Job",
    "chapter": 31,
    "audio_sermons": [
        {
            "title": "(Through The Bible) Job 31-37",
            "url": "http:\/\/sermonindex.net\/SID6407",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 31-37",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6407-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "Dealing With Temptation",
            "url": "http:\/\/sermonindex.net\/SID26070",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 39:7-18, Job 31:1",
            "topic": "Temptation",
            "description": "Every Christian should have made a covenant with his eyes not even to look upon temptation. Some temptations only need a spark before it brings forth sin. Remember Job who made a covenant with his eyes not even to look upon a young girl, a virgin (Job 31:1). Why would you live among sinners and those who are corrupt in word and deed. A person is known by his friends. Look at who your friends are, then you know who you are. In Ps 1 we read that \"blessed is the man who walk not after the counsel of the ungodly, nor stand in the way of sinners, nor sit in the seat of the scornful\".",
            "download": "http:\/\/sermonindex.net\/SID26070-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "39"
                },
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "God At Work in Every Womb (Sanctity of Human Life Sunday)",
            "url": "http:\/\/sermonindex.net\/SID7164",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 31:13-15",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7164-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": [
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "Kiss The Son",
            "url": "http:\/\/sermonindex.net\/SID18526",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 2:12, 1 Kings 19:18, Job 31:24",
            "topic": "Wrath Of God",
            "description": "Throughout the Scriptures the Kiss is found in different relationships all of which are to be applied to Christ and none of which stand alone. The Kiss of Worship (I Kings 19:18; Job 31:24-27). The Kiss of Allegiance (I Samuel 10:1; Hosea 13:2). The Kiss of Love (Song of Solomon 1:2). The kiss of love without shame (Song of Solomon 8:1).",
            "download": "http:\/\/sermonindex.net\/SID18526-download",
            "preacher_name": "Aaron Dunlop",
            "preacher_image": "",
            "preacher_description": "Aaron Dunlop ( - )\r\nListen to freely downloadable audio sermons by the speaker Aaron Dunlop in mp3 format. Mr. Dunlop who is originally from Northern Ireland, graduated from the Geneva Reformed Seminary, SC. and is currently pioneering a Free Presbyterian Church in Victoria, British Columbia.\r\nReformed in Doctrine, believing in the divine authority and verbal inspiration of the Bible, and the great fundamental doctrines of grace it contains. The Scriptures alone are the supreme authority in matters of faith and practice. Separatist in Practice, believing and practicing the doctrine of Biblical separatism. In accordance with this, the Free Presbyterian Church has no association with the modern Ecumenical or Charismatic movements, nor will it fellowship with any church which has departed from the fundamental doctrines of the Word of God.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "2"
                },
                {
                    "book": "1 Kings",
                    "chapter": "19"
                },
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        }
    ]
}