{
    "name": "Job 7",
    "book": "Job",
    "chapter": 7,
    "sermons": [
        {
            "title": "The Purpose of Trials",
            "url": "http:\/\/sermonindex.net\/SID16246",
            "size": "0",
            "format": "mp3",
            "scripture": "James 1:2-5, 1 Peter 1:6-7, Job 7:17-18",
            "topic": "",
            "description": "A message that explores the primary reason why God allows different fiery trials and temptations to afflict a saint. Learn how to prepare for tests and progress in the school of God. The preacher seeks to communicate the deep practicality of God's refining process in the hearts of His people.",
            "download": "http:\/\/sermonindex.net\/SID16246-download",
            "preacher_name": "Paul West",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "1"
                },
                {
                    "book": "1 Peter",
                    "chapter": "1"
                },
                {
                    "book": "Job",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "When God Sets His Heart On You",
            "url": "http:\/\/sermonindex.net\/SID13964",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 7:17",
            "topic": "",
            "description": "God still has His heart set on saving this world. He loves mankind, and He is still moving by His Holy Spirit. God's heart is set on His church, in spite if all the apostasy and false teachers, He will not allow the Cross of Jesus Christ to be in vain. The Lord is calling us to complete confidence in the remission of sins. God's plan for us is not to walk in guilt and condemnation, He is calling us to enjoy Jesus and trust in the Power of the Blood of Jesus. When we embrace this we will come into truly find rest in Jesus.",
            "download": "http:\/\/sermonindex.net\/SID13964-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Job",
                    "chapter": "7"
                }
            ]
        }
    ]
}