{
    "name": "Joel 1",
    "book": "Joel",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Joel) The Day of the Lord Brings Judah Low",
            "url": "http:\/\/sermonindex.net\/SID11034",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1:1-2:20",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11034-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) Joel 1-2",
            "url": "http:\/\/sermonindex.net\/SID6482",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1-2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6482-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Beware When You Are Full",
            "url": "http:\/\/sermonindex.net\/SID4243",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1:14, Joel 1:6-7, 2 Timothy 3:1-4",
            "topic": "Beware",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4243-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "3"
                },
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "God Will Resore All Your Wasted Years",
            "url": "http:\/\/sermonindex.net\/SID4179",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1:4,Joel 2:25",
            "topic": "Restoration",
            "description": "Date delivered: 3\/26\/90. This is what you were and what you are. God can restore your wasted years, no matter if you have not been saved, if you've been saved 3 months, 3 years or 3 decades. God wants to restore what has been wasted or stolen.",
            "download": "http:\/\/sermonindex.net\/SID4179-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "2"
                },
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Joel 1-2: Repentance & Revival",
            "url": "http:\/\/sermonindex.net\/SID28130",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28130-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Tell your children",
            "url": "http:\/\/sermonindex.net\/SID27963",
            "size": "0",
            "format": "mp3",
            "scripture": "Joel 1:1-3",
            "topic": "Children",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27963-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "1"
                }
            ]
        }
    ]
}