{
    "name": "Ecclesiastes 11",
    "book": "Ecclesiastes",
    "chapter": 11,
    "sermons": [
        {
            "title": "Where A Tree Falls It Shall Lay",
            "url": "https:\/\/sermonindex.info\/SID24523",
            "size": "0",
            "format": "mp3",
            "scripture": "Ecclesiastes 11:3 ",
            "topic": "Regeneration",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24523-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Ecclesiastes",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Youth",
            "url": "https:\/\/sermonindex.info\/SID22537",
            "size": "0",
            "format": "mp3",
            "scripture": "Ecclesiastes 11:9",
            "topic": "Youth",
            "description": "Chandler began by sharing about trials at the Village Church and in his own walk through brain cancer. The Book of Ecclesiastes speaks into the reality of life and gives a message we need to hear. God constantly calls us back to remember—remember who he is, what he’s done, and his commands intended for our joy. Remembering God’s work on our behalf rightly redeems our rejoicing in him. Revisiting the Ecclesiastes 11:9 command to rejoice, Chandler explains that by remembering God, we get beneath our rejoicing in mere youth to rejoice in what God has done for us in Christ.",
            "download": "https:\/\/sermonindex.info\/SID22537-download",
            "preacher_name": "Matt Chandler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ecclesiastes",
                    "chapter": "11"
                }
            ]
        }
    ]
}