{
    "name": "Ecclesiastes 3",
    "book": "Ecclesiastes",
    "chapter": 3,
    "sermons": [
        {
            "title": "A Time To Weep and a Time To Laugh",
            "url": "http:\/\/api.sermonindex.net\/SID15479",
            "size": "0",
            "format": "mp3",
            "scripture": "Ecclesiastes 3:1-4",
            "topic": "Plan Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15479-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ecclesiastes",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Practical Response Resulting From Our View of God",
            "url": "http:\/\/api.sermonindex.net\/SID19876",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8:40, Proverbs 23:17, Ecclesiastes 3:14",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19876-download",
            "preacher_name": "Lou Sutera",
            "preacher_image": "",
            "preacher_description": "Lou Sutera ( - )\r\nListen to freely downloadable audio sermons by the speaker Lou Sutera in mp3 format. Twin brothers Used of God in revival since 1971. Single and joint church revival ministries usually two and one-half weeks in length. Characterized by straight-forward preaching, visual presentations, follow-through teaching, personal counselling by lay-team workers, etc. Crusades include sessions for men, ladies, youth, children, church leaders and pastoral staffs.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                },
                {
                    "book": "Proverbs",
                    "chapter": "23"
                },
                {
                    "book": "Ecclesiastes",
                    "chapter": "3"
                }
            ]
        }
    ]
}