{
    "name": "Numbers 11",
    "book": "Numbers",
    "chapter": 11,
    "sermons": [
        {
            "title": "(Through The Bible) Numbers 11-20",
            "url": "http:\/\/api.sermonindex.net\/SID6324",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 11-20",
            "topic": "",
            "description": "In numbers there is a pattern of chronic complaining. In asmuich as God is in control of the circumstances of our live but if we complain against the circumstances then we are actually complaining against God Himself. All things work together to the good of those who are called by God and according to His purposes. We are to be thankful in all circumstances. So if I start to murmur and complain then I am murming and complaining against the Lord. God continually forgives his people because He is loving and is longsuffering. God’s patience and longsuffering are shown through Gods dealings with the nation of Israel. God is about to wipe out Israel and start a new nation, but because of Moses pleadings He didn’t do it. God is immutable which means that he does not change. Behold I am the Lord God that changeth not. This planet is in rebellion to God but God wants to bless this planet and bring it back into harmony with Him. Through those life’s that God touches He wants through us to touch others life’s. Then God shows us His will and purpose so that we can share in His heart for the lost.",
            "download": "http:\/\/api.sermonindex.net\/SID6324-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Desert Survival Series Pt 28- Moses The Servant of God",
            "url": "http:\/\/api.sermonindex.net\/SID20037",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 11:1-35",
            "topic": "Desert Survival",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20037-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Let Me Not See My Wretchedness by Carter Conlon",
            "url": "http:\/\/api.sermonindex.net\/SID16259",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 11:10-35",
            "topic": "Revival Conference",
            "description": "Carter Conlon delivers a very powerful message on the great need for personal revival in these last days. We need to realize our great need to confess our sinfulness and the need for the righteousness of Christ. We can only be agents of revival and be filled with Christ when we fully surrender to God.",
            "download": "http:\/\/api.sermonindex.net\/SID16259-download",
            "preacher_name": "Revival Conference Canton 2007",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Graves of Lust",
            "url": "http:\/\/api.sermonindex.net\/SID3219",
            "size": "9085440",
            "format": "mp3",
            "scripture": "Numbers 11,Psalm 105:40",
            "topic": "",
            "description": "God was taking Israel through the wilderness and preparing them to enter the promised land. But they did not like what God was feeding them, and complained wanting flesh. God wanted to feed them what would make them strong, and they wanted what would make them fat and slow. A great contrast between today's church seeking the flesh more than Spirit.",
            "download": "http:\/\/api.sermonindex.net\/SID3219-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "11"
                },
                {
                    "book": "Psalms",
                    "chapter": "105"
                }
            ]
        }
    ]
}