{
    "name": "Numbers 13",
    "book": "Numbers",
    "chapter": 13,
    "audio_sermons": [
        {
            "title": "Desert Survival Series Pt 29- Moses The Servant of God",
            "url": "http:\/\/sermonindex.net\/SID20042",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 13-14",
            "topic": "Desert Survival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20042-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "I Can't Take It",
            "url": "http:\/\/sermonindex.net\/SID25998",
            "size": "0",
            "format": "mp3",
            "scripture": "Num 13:25-33, Numbers 14:1-4",
            "topic": "Faith",
            "description": "In this study, Pastor Cymbala takes us to the Old Testament and we learn that bad things can happen when God's people loose their faith. Num 13:25-14:4; I Corinth 10:6,10; Phil 2:14-15 (GNT)",
            "download": "http:\/\/sermonindex.net\/SID25998-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "13"
                },
                {
                    "book": "Numbers",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Incomplete Repentance",
            "url": "http:\/\/sermonindex.net\/SID23517",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 13:17-33",
            "topic": "Repentance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23517-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Reigning in Life - Part 2",
            "url": "http:\/\/sermonindex.net\/SID11010",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 5:17-21, Numbers 13-14",
            "topic": "Victory",
            "description": "\"This is something I long to be,\" says Alan Martin, \"filled with the Spirit, led by the Spirit, dwelling in the Spirit, so that my wife, my children, my friends and all who know me see the incredible power of God in display daily.\"  Are we receiving this abundant provision of grace?  Are we just tasting of Christ or feast, just visiting or living in Him?",
            "download": "http:\/\/sermonindex.net\/SID11010-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "13"
                },
                {
                    "book": "Romans",
                    "chapter": "5"
                }
            ]
        }
    ]
}