{
    "name": "Numbers 16",
    "book": "Numbers",
    "chapter": 16,
    "sermons": [
        {
            "title": "How Satan Destroys a Church - Part 3 (STRANGE FIRE)",
            "url": "http:\/\/sermonindex.net\/SID17294",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 4:12, Numbers 16",
            "topic": "Spiritual Warfare",
            "description": "Satan will seek to destroy the church by attacking leadership standards found in Scripture and tempting men and women to make their authority the guide of their actions.  It is vitally important for leaders to be under the control of the Holy Spirit.",
            "download": "http:\/\/sermonindex.net\/SID17294-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "16"
                },
                {
                    "book": "1 Timothy",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Dangers Of Irreverence Before God",
            "url": "http:\/\/sermonindex.net\/SID26006",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy 2:10-22, Numbers 16",
            "topic": "Irreverence",
            "description": "This sermon explores the danger of irreverence towards God in our associations and in ministry. There will always be people among us who desire to go back to \"Egypt.\" To them it is the land flowing with milk and honey. We must avoid their irreverant and profane words. We must avoid them and their influence. That is, we must \"purge ourselves of these\" in order to be pure and useful to God. In fact, Paul references the rebellion of Korah in 2 Timothy 2:19ff. as an example of God's estimate of this type of sin and rebellion.",
            "download": "http:\/\/sermonindex.net\/SID26006-download",
            "preacher_name": "Robert Wurtz II",
            "preacher_image": "",
            "preacher_description": "Robert Wurtz II ( - )\r\nListen to freely downloadable audio sermons by the speaker Robert Wurtz II in mp3 format.  For almost 20 years I have served as a author and teacher of advanced biblical studies. My interests are the New Covenant, apologetics and classical revival. Native of the Kansas City, Mo area and reside now in Independence, MO with wife Anna.\r\nHe is the author of many books including the newest Televangelicalism. In this insightful and thought provoking book, Robert Wurtz II traces the history of Christian evangelism from the book of Acts to modern times. The contrast between pre-1900 and post-1900 evangelism is so sharp, that the book is divided into two sections: Part 1, the pre-Billy Sunday era and Part 2, the post-Billy Sunday evangelistic era. This book is a must-read for anyone that has concerns about issues such as \"the sinner's prayer\" or shallow concepts of conversion.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                },
                {
                    "book": "Numbers",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Understanding Spiritual Authority (Part 1): What is Aaron That You Murmur Against Him?",
            "url": "http:\/\/sermonindex.net\/SID11914",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 16:1-11",
            "topic": "Spiritual Authority",
            "description": "October 23, 2005 - Aaron was grafted into the body to supply a lack. The failure to acknowledge Aaron was a failure to bend the knee and acknowledge God. The inability to acknowledge ministry leaders in the place where God has placed them in the body is rebellion against God. Many times we form in our mind a perceived deficiency toward that person based on our own opinion. How can we say Jesus is Lord and not acknowledge His authority.",
            "download": "http:\/\/sermonindex.net\/SID11914-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "16"
                }
            ]
        }
    ]
}