{
    "name": "Numbers 20",
    "book": "Numbers",
    "chapter": 20,
    "sermons": [
        {
            "title": "Desert Survival Series Pt 30- Moses The Servant of God",
            "url": "http:\/\/sermonindex.net\/SID20043",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 20:7-12",
            "topic": "Desert Survival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20043-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Excluded From The Land Of Promise",
            "url": "http:\/\/sermonindex.net\/SID3766",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 20:10-12",
            "topic": "Land Of Promise",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3766-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The King's Highway",
            "url": "http:\/\/sermonindex.net\/SID14046",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 20:17, Psalm 1",
            "topic": "Holiness",
            "description": "Keith Daniel gives a unction-filled message, expounding the \"King's Highway\" - the path God led Moses and the Israelites on as they passed through the heathen nations enroute to their Land of Promise. Keith warns of the consequences to those who divert from this highway of God's righteousness and purity to go down to visit the devil's territories.",
            "download": "http:\/\/sermonindex.net\/SID14046-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "1"
                },
                {
                    "book": "Numbers",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The King's Highway by Keith Daniel",
            "url": "http:\/\/sermonindex.net\/SID14207",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 20:17, Psalm 1",
            "topic": "Podcast",
            "description": "Keith Daniel gives a unction-filled message, expounding the \"King's Highway\" - the path God led Moses and the Israelites on as they passed through the heathen nations enroute to their Land of Promise. Keith warns of the consequences to those who divert from this highway of God's righteousness and purity to go down to visit the devil's territories.",
            "download": "http:\/\/sermonindex.net\/SID14207-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "1"
                },
                {
                    "book": "Numbers",
                    "chapter": "20"
                }
            ]
        }
    ]
}