{
    "name": "Numbers 21",
    "book": "Numbers",
    "chapter": 21,
    "sermons": [
        {
            "title": "(Through The Bible) Numbers 21-28",
            "url": "http:\/\/sermonindex.net\/SID6325",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 21-28",
            "topic": "",
            "description": "The people spoke against God and Moses and complained of why they got took out of Egypt. There are people who are chronically complaining and there are people that are chronically complaining. But Gods will is for us to be thankful in all things. Manna was angels food “he fed them with angels food” it is a great provision of the Lord. And God in judgment because of their complaining send fiery serpents to kill the people. There was a confession and repentance of the sin by the people. Moses pray for us and ask God to help us was the plea of the people. God told Moses to get a serpent and put it on the brass pole. So that if anyone looked to the snake on the pole and they would be healed and not die. And it’s the same with the gospel that if people just look upon the cross of Christ believing then they would be saved. The brass is always a symbol of judgment and the serpent was always a symbol of sin. People afterwards took the brass serpent and began to worship it instead of the living God. People seek after idols that remind people of Gods presence that indicates that we have lost His actual presence. So this speaks of spiritual degradation. Hezekiah broke it to pieces and said it was a piece of brass. It is sad when people start to worship a church instead of the living God the church represents.",
            "download": "http:\/\/sermonindex.net\/SID6325-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Man's Ruin and God's Remedy",
            "url": "http:\/\/sermonindex.net\/SID11502",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 21:8",
            "topic": "",
            "description": "MAN'S RUIN AND GOD'S REMEDY. DELIVERED ON SABBATH MORNING, NOVEMBER 20TH, 1859, BY THE REV. C. H. SPURGEON, AT THE MUSIC HALL, ROYAL SURREY GARDENS. “And the Lord said unto Moses, Make thee a fiery serpent, and set it upon a pole: and it shall come to pass that every one that is bitten, when he looketh upon it, shall live.” — Numbers 21:8. I DO not propose this morning to explain again the mystery of the brazen serpent. As many of you well remember, not long ago I preached upon that subject, and endeavored to expound it in all its lengths and breadths. I have a somewhat similar object at the present time, the details may indeed be different, but after all the moral will be the same. Man has very many wants, and he should be grateful whenever the least of them is supplied. But he has one want which overtops every other: it is the want of bread. Give him raiment, house him well, decorate and adorn him, yet if you give him not bread, his body faints, he dies of hunger. Hence it is that while the earth when it is tilled is made to bring forth many things that minister unto the comfort and luxury of men, yet man is wise enough to understand that since bread is his chief want, he must be most careful concerning corn. He therefore sows broad acres with it, and he cultivates more of this, which is the grandest necessary, than he doth of anything else in his husbandry. I feel that this is the only excuse I can offer you for coming back again constantly...",
            "download": "http:\/\/sermonindex.net\/SID11502-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Numbers 21",
            "url": "http:\/\/sermonindex.net\/SID7903",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 21",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7903-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "21"
                }
            ]
        }
    ]
}