{
    "name": "Numbers 32",
    "book": "Numbers",
    "chapter": 32,
    "sermons": [
        {
            "title": "Be Sure",
            "url": "http:\/\/api.sermonindex.net\/SID23869",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 32-23 ",
            "topic": "Salvation",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23869-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Be Sure, Your Sin Will Find You Out",
            "url": "http:\/\/api.sermonindex.net\/SID16893",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 32:16-23",
            "topic": "Sin",
            "description": "March 16, 2008 - The whole moral law calls us to be separate from the thinking of the world. If you settle in a certain comfort zone and begin to focus on self, to the exclusion of those who haven't come into your inheritance, this is the sin that WILL find you out. We can be sure that there will be a great personal cost to those who pursue self interest while there are others who still don't know the Lord. We are not called to live for ourselves. We are called to follow our Savior.",
            "download": "http:\/\/api.sermonindex.net\/SID16893-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Walking Through the Valley of Weeping",
            "url": "http:\/\/api.sermonindex.net\/SID1436",
            "size": "7305216",
            "format": "mp3",
            "scripture": "Numbers 32:20-23, John 15:12-17, 1 Corinthians 11:22-30",
            "topic": "Weeping",
            "description": "Be ready to write down the many other scriptures Pastor Conlon goes through in this message about what it really means to be part of the Body of Christ, and follow the example of Christ, denying ourselves and taking up our cross. The heart of Christ is to minister to and serve others, and he wants us to share his heart. The devil is trying to destroy the Body, going after the weak and the young. We are to watch for our brothers and sisters, and if we see them in a battle, we must be willing to fight for them. To go into the secret closet and war against this thing on their behalf, to love not just in word, but in deed. Selfishness has disastrous consequences. Take heed.",
            "download": "http:\/\/api.sermonindex.net\/SID1436-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "11"
                },
                {
                    "book": "John",
                    "chapter": "15"
                },
                {
                    "book": "Numbers",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Wholly Following the Lord",
            "url": "http:\/\/api.sermonindex.net\/SID6751",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 32:11-12",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6751-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "32"
                }
            ]
        }
    ]
}