{
    "name": "Jonah 2",
    "book": "Jonah",
    "chapter": 2,
    "sermons": [
        {
            "title": "Jonah #3: Work Beneath the Surface",
            "url": "http:\/\/sermonindex.net\/SID11411",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 2, Psalm 106:4",
            "topic": "",
            "description": "Ed Miller shows how God putting Jonah in the same shoes as the heathen for him to see they both needed the undeserved mercy of God.  God delivered Jonah FROM the storm and BY the storm to show Himself as the God who delivers.",
            "download": "http:\/\/sermonindex.net\/SID11411-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        },
        {
            "title": "Surrendered Saints on Dry Land",
            "url": "http:\/\/sermonindex.net\/SID16292",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 2:1-10",
            "topic": "Mercy Of God",
            "description": "November 25, 2007 - This message is about the mercy of God. The voice of God is crying out to all His people who are in a spiritual slumber because of self seeking, soft religion. God in His mercy will prepare a trial that will lead us into a type of the sufferings of Christ. This crisis will cause us to be awakened to prayer, and in this time God will throw overboard everything that hinders us from His power. The moment we surrender and yield our life to God's purposes, His mercy will begin to flow in us and through us. The Holy Spirit will give us the courage to stand in the midst of adversity, and speak life into others around us who are perishing.",
            "download": "http:\/\/sermonindex.net\/SID16292-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Deeper Death",
            "url": "http:\/\/sermonindex.net\/SID13543",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13543-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "2"
                }
            ]
        }
    ]
}