{
    "name": "Jonah 4",
    "book": "Jonah",
    "chapter": 4,
    "audio_sermons": [
        {
            "title": "A Worm's Eye View of Missions",
            "url": "http:\/\/sermonindex.net\/SID13511",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 4",
            "topic": "Missions",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13511-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Angry With God",
            "url": "http:\/\/sermonindex.net\/SID4741",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 4:1-11",
            "topic": "Anger",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4741-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Jonah #5: Jonah's Attitude",
            "url": "http:\/\/sermonindex.net\/SID11413",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 4",
            "topic": "",
            "description": "Ed Miller concludes the series by revealing the real issue is not about results, theology or reputation but about pleasing God's heart.  Leaning to his own understanding brought about depression, but God came along and used a gourd to work in His man the final change.  Study your joy; what makes you so happy?  Is it how to satisfy the heart of God?",
            "download": "http:\/\/sermonindex.net\/SID11413-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "4"
                }
            ]
        }
    ]
}