{
    "name": "Revelation 10",
    "book": "Revelation",
    "chapter": 10,
    "audio_sermons": [
        {
            "title": "(Revelation - Part 15): The Mighty Angel and The Little Book",
            "url": "http:\/\/sermonindex.net\/SID2164",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10",
            "topic": "Book Of Revelation",
            "description": "God does not forget His promises; Everybody ought to read Church history and the biographies of the saints; While grace is still operative there will be no end to the human race; God is going to judge a world that is ill prepared for judgment; You might get away with just about anything here, but there is a place where you won’t get away with anything.",
            "download": "http:\/\/sermonindex.net\/SID2164-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(Revelation - Part 16): The Sweet and Bitter Book",
            "url": "http:\/\/sermonindex.net\/SID2165",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10:8-11",
            "topic": "Book Of Revelation",
            "description": "God’s Word is bitter to the flesh: people who live by it come to trouble in the world; We ought not pity people who suffer from the results of sin—our suffering is our own fault; If we were in Heaven truth would be universally sweet, but since we are not, it is very harsh and bitter to us so we compromise it; Christians often want to use the cross to save us from the cross—thinking that if we behave ourselves like good Christians, we’ll avoid trouble the rest of our lives; The book is very sweet while you chew it, so long as you don’t swallow it; A revival in a church is when a good percentage of the people decide to swallow the book.",
            "download": "http:\/\/sermonindex.net\/SID2165-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(Revelation) No Trumpets Sounding",
            "url": "http:\/\/sermonindex.net\/SID7060",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7060-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(Through The Bible) Revelation 10-12",
            "url": "http:\/\/sermonindex.net\/SID6643",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10-12",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6643-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(revelation) Revelation 10:7-11:15",
            "url": "http:\/\/sermonindex.net\/SID9109",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10:7-11:15",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9109-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "A Trained People",
            "url": "http:\/\/sermonindex.net\/SID11115",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 4:10, Revelation 10:9, Matthew 24:12, 13",
            "topic": "",
            "description": "The sermon takes a while to get rolling, covering a lot of disparate topics, but Dr. Thompson soon settles upon the two witnesses (from Revelation 11), discussing in depth about who he feels they will be, and what role they will play in God’s plan. (1 hour 18 minutes).",
            "download": "http:\/\/sermonindex.net\/SID11115-download",
            "preacher_name": "Robert B. Thompson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "4"
                },
                {
                    "book": "Revelation",
                    "chapter": "10"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "The Little Book",
            "url": "http:\/\/sermonindex.net\/SID24826",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10",
            "topic": "Revelation",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24826-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        }
    ]
}