{
    "name": "Revelation 16",
    "book": "Revelation",
    "chapter": 16,
    "sermons": [
        {
            "title": "(Revelation) The Wrath Of God",
            "url": "http:\/\/api.sermonindex.net\/SID7070",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16",
            "topic": "Wrath Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7070-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "(Through The Bible) Revelation 16",
            "url": "http:\/\/api.sermonindex.net\/SID6645",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6645-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "(revelation) Revelation 16:16-18:20",
            "url": "http:\/\/api.sermonindex.net\/SID9114",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16:16-18:20",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9114-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "FOUR WATCHWORDS FOR TIMES OF DIVINE JUDGMENT",
            "url": "http:\/\/api.sermonindex.net\/SID21108",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16:7",
            "topic": "Radio Show",
            "description": "God chastens and disciplines because he loves; and afterwards He wants to do ever so much more good to us. The testimony by Basilea Schlink can help you when you find yourself in a similar situation. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/api.sermonindex.net\/SID21108-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Holiness — Revelation 16:15",
            "url": "http:\/\/api.sermonindex.net\/SID22992",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16:15",
            "topic": "Holiness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22992-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Time Of Armagedon",
            "url": "http:\/\/api.sermonindex.net\/SID12963",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12963-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        }
    ]
}