{
    "name": "Revelation 6",
    "book": "Revelation",
    "chapter": 6,
    "sermons": [
        {
            "title": "(Revelation - Part 10): The Four Horsemen of the Apocalypse",
            "url": "http:\/\/sermonindex.net\/SID2159",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:1-8",
            "topic": "Book Of Revelation",
            "description": "The vain hope of peace on Earth; Patience: the power to wait; The rider on the white horse rules by duplicity; The rider on the red horse brings war; Our pampered opulence will be our downfall; Pray for leaders.",
            "download": "http:\/\/sermonindex.net\/SID2159-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Revelation - Part 11): The Souls Under the Alter - Who They Are",
            "url": "http:\/\/sermonindex.net\/SID2160",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:9-17",
            "topic": "Book Of Revelation",
            "description": "The altar of martyred souls; The fallacy of soul-sleep; Four states of a ransomed man: lost on earth, saved on earth, waiting in heaven, glorified in heaven; The men who thought they could control things will someday cry out for the rocks to fall on them; Who shall be able to stand? He who has forsaken the world.",
            "download": "http:\/\/sermonindex.net\/SID2160-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Revelation) The Seals In Heaven The Sorrows On Earth",
            "url": "http:\/\/sermonindex.net\/SID7053",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:1-8",
            "topic": "Seals",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7053-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Revelation) The Sorrows In Earth",
            "url": "http:\/\/sermonindex.net\/SID7054",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:9-17",
            "topic": "Sorrow",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7054-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(revelation) Revelation 6:1-17",
            "url": "http:\/\/sermonindex.net\/SID9106",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:1-17",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9106-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Church History - Session 6 (Prophecy in Daniel and Revelation Fullfilled)",
            "url": "http:\/\/sermonindex.net\/SID1367",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6-7",
            "topic": "",
            "description": "Parkyns begins with a review of the book of Revelation, then explaining the fulfillment of the six seals and likewise with chapter 7.  He then has a question and answers session about fulfilled prophecy in Church history, using Daniel, Revelation, Thessalonians and other references.",
            "download": "http:\/\/sermonindex.net\/SID1367-download",
            "preacher_name": "Edgar F. Parkyns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Now Do You Believe God?",
            "url": "http:\/\/sermonindex.net\/SID13627",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:1, Revelation 6:12-17",
            "topic": "Believe",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13627-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                },
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Opening of the Seals",
            "url": "http:\/\/sermonindex.net\/SID23530",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:3-28, Revelation 6",
            "topic": "End Times",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23530-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Preparing For A Coming World Leader",
            "url": "http:\/\/sermonindex.net\/SID25053",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:1-2",
            "topic": "Antichrist",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25053-download",
            "preacher_name": "Edgar Reich",
            "preacher_image": "",
            "preacher_description": "Edgar Reich ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Edgar Reich in mp3 format. The former business man is Reverend Edgar Reich. He has been called by the Lord to teach and preach in Revival. He is a devoted Christian teacher, leading adult Bible study groups at his Church, his former business and his community. God has called him into fulltime Christian Ministry to preach and teach in Revival. \r\n\r\nHe became a Reverend under the leadership of Rev. Dr. R. L. Curry in July 2008.  The Lord has had brother Edgar start Revival Canada USA which is a ministry believing God for revival in North America. \"God has promised to bring a Nation wide Revival to the United States of America and Canada prior to the return of the Lord Jesus Christ. Fires of Revival will break out all over the United States and Canada in many cities and spread from African American Churches to White Churches.\"",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Revelation 6 & 7",
            "url": "http:\/\/sermonindex.net\/SID24340",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6",
            "topic": "Revelation",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24340-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Revelation Overview Pt. 3",
            "url": "http:\/\/sermonindex.net\/SID8739",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6-11",
            "topic": "Revelation",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8739-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Apocalypse - Revelation 6a (The First Five Seals)",
            "url": "http:\/\/sermonindex.net\/SID24804",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6",
            "topic": "Apocalypse Study",
            "description": "It is the beginning of The Day of the Lord with its accompanying worldwide devastation. The world seems to be coming apart at the seams. Of course, Jesus had already laid all of this out in the Olivet Discourse, some sixty-five years prior to the Revelation. But the real story as all this unfolds is the way God’s people will shine through it all!",
            "download": "http:\/\/sermonindex.net\/SID24804-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Apocalypse - Revelation 6b (The Sixth Seal)",
            "url": "http:\/\/sermonindex.net\/SID24806",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6",
            "topic": "Apocalypse Study",
            "description": "While calamities pile up on earth from the first four seals, suddenly a meteor shower pounds the planet, its devastating effects being felt worldwide. This is the long-awaited beginning to The Day of the Lord. As terrifying as the physical effects are to earth-dwellers, there is something even more ominous: the face of God",
            "download": "http:\/\/sermonindex.net\/SID24806-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Apocalypse - The Rapture and the Revelation",
            "url": "http:\/\/sermonindex.net\/SID24803",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6, 1 Thessalonians 4",
            "topic": "Apocalypse Study",
            "description": "The vast majority of evangelicals hold a pre-tribulation, pre-millennial perspective of the Second Coming. This dispensational understanding has largely shaped the minds of modern believers (i.e. The Left Behind series) regarding the End Times. Before proceeding into the momentous events described in Revelation 6, Pastor Steve felt that an objective examination of the main theories regarding the Second Coming of Christ was necessary. His personal conclusions about the future are thought provoking and possibly even fascinating.",
            "download": "http:\/\/sermonindex.net\/SID24803-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Great Day of Their Wrath",
            "url": "http:\/\/sermonindex.net\/SID7174",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:17,Romans 2:5,1 Thessalonians 1:9",
            "topic": "",
            "description": "An evangelistic warning to flee from the wrath of God to come and to turn to Jesus Christ who alone can deliver guilty, hell-deserving sinners from divine wrath; based on Revelation 6:17.",
            "download": "http:\/\/sermonindex.net\/SID7174-download",
            "preacher_name": "Al Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                },
                {
                    "book": "Romans",
                    "chapter": "2"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Persecuted Church in the End Times",
            "url": "http:\/\/sermonindex.net\/SID26369",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 6:9",
            "topic": "Persecuted Church",
            "description": "Brother David shares a stirring message on the current persecution of the Church of Jesus Christ. He clearly shows from Scripture there will be a world-wide persecution of Christians in the end-times. That this world-wide persecution will be one of the great signs of the soon coming of the Lord Jesus Christ. He shares even for America that persecution is increasing and potentially coming very soon.",
            "download": "http:\/\/sermonindex.net\/SID26369-download",
            "preacher_name": "David R. Barnhart",
            "preacher_image": "",
            "preacher_description": "David R. Barnhart ( - )\r\nListen to freely downloadable audio sermons by the speaker David R. Barnhart in mp3 format. David R. Barnhart is the founder of Abiding Word Ministries. Pastor Barnhart was pastor of Peace Lutheran Church from 2002 - 2005, and has come out of retirement from full time Pastoral ministry in order to serve as our interim pastor until the search for a new pastor is completed. Pastor Barnhart celebrated the 50th anniversary of his ordination as a Pastor in March, 2014. Ordained by the Lutheran Church in America in 1964, he pastored churches in that denomination for 20 years. In 1984, Pastor Barnhart withdrew from the Lutheran Church in America and united with the Association of Free Lutheran Congregations (AFLC). \r\nHe and his wife, Mary, established Abiding Word Ministries that same  year. Abiding Word Ministries exists to promote revival and reformation throughout the Church. Pastor Barnhart publishes a newsletter called The Vine and Branches which is mailed to approximately 7500 homes throughout the United States and Canada. Abiding Word Ministry counsels pastors, congregations and laity who desire to take their stand against false teachings and unbiblical practices within their church bodies. He is the author of several articles and books, including Living in the Times of the Signs and  Contending for the Faith, The Church's Desperate Need for Revival, and Israel, Land of Promise and Prophecy.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Voice of the Holy Spirit",
            "url": "http:\/\/sermonindex.net\/SID2204",
            "size": "0",
            "format": "mp3",
            "scripture": "John 16:7-11,Revelation 6-7,Revelation 22:17",
            "topic": "Holy Spirit",
            "description": "Though this world is a lost world, it is not forsaken. Throughout the Bible, we are called to come to God and the most distinguishable voice we hear is that of the Holy Spirit. What does He say? Why is He called “the Comforter?” And what does it mean to be filled with the Holy Ghost?",
            "download": "http:\/\/sermonindex.net\/SID2204-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "22"
                },
                {
                    "book": "Revelation",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "16"
                }
            ]
        }
    ]
}