{
    "name": "Revelation 7",
    "book": "Revelation",
    "chapter": 7,
    "sermons": [
        {
            "title": "(Revelation - Part 12): Who Are The 144,000",
            "url": "http:\/\/sermonindex.net\/SID2161",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:1-8",
            "topic": "Book Of Revelation",
            "description": "The four corners of the earth; The characteristics of angels; Materialism; Believing in belief in the supernatural rather than believing in the supernatural; We own nothing; Difference in degrees in heavenly life; Who are the 144,000? Christian cultists; Our religion isn’t costing us very much.",
            "download": "http:\/\/sermonindex.net\/SID2161-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Revelation - Part 13): When the Seven Trumpets Sound",
            "url": "http:\/\/sermonindex.net\/SID2162",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:9-17",
            "topic": "Book Of Revelation",
            "description": "The outcome of all things will be determined by the prayers of the saints; God speaks in many ways but sinning men are not listening; Too much vain preaching causes truth to be treated callously; Will we hear the trumpet if we cannot hear the still small voice? You’ve heard so much and done so little.",
            "download": "http:\/\/sermonindex.net\/SID2162-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Revelation) God Allowing Persecution On Earth",
            "url": "http:\/\/sermonindex.net\/SID7055",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:1-8",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7055-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Revelation) The Witnesses Sealed On Earth",
            "url": "http:\/\/sermonindex.net\/SID7056",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:9-17",
            "topic": "Witnesses",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7056-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Through The Bible) Revelation 7-9",
            "url": "http:\/\/sermonindex.net\/SID6642",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7-9",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6642-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(revelation) Revelation 7:1-10",
            "url": "http:\/\/sermonindex.net\/SID9107",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:1-10",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9107-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(revelation) Revelation 7:9-10:7",
            "url": "http:\/\/sermonindex.net\/SID9108",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:9-10:7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9108-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Manifesting Christ Through Union",
            "url": "http:\/\/sermonindex.net\/SID11420",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:15-17",
            "topic": "",
            "description": "Ed Miller shows how service earth is illustrated by the heavenly service of those who are beyond sin.  \"He's the giver; I'm the receiver.  I serve the Lord by allowing the Lord to serve me,\" he teaches.  Is your Christian service more a picture of being barren and sad or fruitful and glad?  Listen to brother Ed as he answers how glad service is the byproduct of loving union with Jesus.  (Preached at 2003 Christian Family Conference, held in Richmond, Virginia)",
            "download": "http:\/\/sermonindex.net\/SID11420-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Serving The Lord: Serving By Receiving",
            "url": "http:\/\/sermonindex.net\/SID11430",
            "size": "0",
            "format": "mp3",
            "scripture": "Colossians 2:6, Revelation 7:13-17",
            "topic": "",
            "description": "\"Service is a wonderful thing,\" teaches Ed Miller, \"but it's not Him.\"  What kind of service is pleasing to the Lord?  Brother Ed lays out the blueprint for Christian service by asking the question, \"How does heaven begin and how does it continue?\"  The answer suggests the miracle power of God and having an open heart to receive.",
            "download": "http:\/\/sermonindex.net\/SID11430-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "2"
                },
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Strong Delusions",
            "url": "http:\/\/sermonindex.net\/SID23542",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:15-17",
            "topic": "Delusion",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23542-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Apocalypse - Revelation 7",
            "url": "http:\/\/sermonindex.net\/SID24807",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7",
            "topic": "Apocalypse Study",
            "description": "Although it is not an “action” chapter, Revelation 7 is important for another reason: it forces the reader to decide which school of thought he will subscribe to in the theological understanding of the rest of the book. There are two groups of people described here and much debate regarding who makes up those groups. Put your thinking cap on for this one because you will have to determine who the believers are who will go through the Tribulation period",
            "download": "http:\/\/sermonindex.net\/SID24807-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Power of the Blood",
            "url": "http:\/\/sermonindex.net\/SID26067",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:26, Revelation 7:14",
            "topic": "Blood Of Christ",
            "description": "The life is in the blood. Blood is so complex that even the scientists struggle to fully understand it. For example when you're cut, your body immediately reacts and sends the white blood cells to fight the infection. The dead white blood cells are then expelled as puss. In the same way the Blood of Christ cleanses us from all unrighteousness to counter any poison of sin that enters. The blood is like petrol that allows your body to function. The other members of the body remains in its place, but the blood is present right through your body. The blood also carries oxygen throughout your body. It also gets rid of impurities and acts like a refuse remover. We speak so glibly about the Blood of Christ, little realising what it does. It brings us life and that's why the devil hates it.",
            "download": "http:\/\/sermonindex.net\/SID26067-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                },
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        }
    ]
}