{
    "name": "John 9",
    "book": "John",
    "chapter": 9,
    "audio_sermons": [
        {
            "title": "(John - Part 37): The Simple Faith of the Blind Man",
            "url": "http:\/\/sermonindex.net\/SID2124",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:38-41",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2124-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(John) 12 - The Light Refused",
            "url": "http:\/\/sermonindex.net\/SID15719",
            "size": "0",
            "format": "mp3",
            "scripture": "John 8:37-59, John 9",
            "topic": "John",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15719-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                },
                {
                    "book": "John",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(John) The Childness Of The Critics",
            "url": "http:\/\/sermonindex.net\/SID6863",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:13-41",
            "topic": "Criticism",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6863-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(John) The Gracious Gaze",
            "url": "http:\/\/sermonindex.net\/SID6862",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:1-12",
            "topic": "Graciousness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6862-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Sabbath Miracles) 04 - Withered Hand Blind",
            "url": "http:\/\/sermonindex.net\/SID15006",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:6-11, John 9",
            "topic": "",
            "description": "The withered hand is hand shriveled, cut off, unusable and paralyzed; that is how we are trying to obey God's commandments in our power.  We need a perpetual miracle as we look into Jesus' face and He works a mighty miracle by the power of God for every obedience.  The man born blind shows that Sabbath vision is when you see Jesus bigger and bigger and fellowship with Him outside the camp.",
            "download": "http:\/\/sermonindex.net\/SID15006-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Through The Bible) John 9-10",
            "url": "http:\/\/sermonindex.net\/SID6542",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9-10",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6542-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Bristol Conference 1962 - Part 1",
            "url": "http:\/\/sermonindex.net\/SID7691",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:34-40, 1 John 10:1-6",
            "topic": "Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7691-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                },
                {
                    "book": "1 John",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Divine Eye Wash",
            "url": "http:\/\/sermonindex.net\/SID14474",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14474-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Don't Miss Your Miracle",
            "url": "http:\/\/sermonindex.net\/SID9598",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5, John 9:7",
            "topic": "Miracles",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9598-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                },
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "John 9",
            "url": "http:\/\/sermonindex.net\/SID26950",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9",
            "topic": "John",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26950-download",
            "preacher_name": "Damian Kyle",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Pressures Of Christianity 01 The Blind Man Of John 9:",
            "url": "http:\/\/sermonindex.net\/SID10242",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10242-download",
            "preacher_name": "Harry Deutchman",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "SING UNTO THE LORD",
            "url": "http:\/\/sermonindex.net\/SID22841",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:24",
            "topic": "Radio Show",
            "description": "God, as an almighty, omnipotent and loving Father, is worthy and deserving of our praise. This meditation is about praise, the highest calling of man.",
            "download": "http:\/\/sermonindex.net\/SID22841-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Speak for Yourself. A Challenge!",
            "url": "http:\/\/sermonindex.net\/SID11512",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:21",
            "topic": "",
            "description": "DELIVERED BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “He is of age; ask him: he shall speak for himself.”-John 9:21 THOSE of you, dear friends, who were present this morning will remember that our subject was “Jesus Christ himself.” We dwelt upon his blessed person. Our faith is fixed on him; our affections are drawn to him; our hopes all bend toward him. Though everything he said or did is precious, yet Jesus himself stands first in our estimation. To know him, to believe him, to love him, is the very essence of our Christianity. Tonight we change our theme. There is a “himself” in our text this evening- a “himself” ‘tis true of a much humbler order. How stand we each one for himself? Our individuality and the personal responsibilities which fall upon ourselves in reference to Christ must not be lost sight of. If, for instance, a spiritual miracle has been wrought upon us, if we are obliged to confess-nay, if we are delighted to confess-that he has opened our eyes, then we are bound, especially those of us who are of ripe understanding, who may be said to be of full age, we are bound to bear our own personal testimony to him. The allegation and the appeal may alike apply to each one of us, “He is of age; ask him: he shall speak for himself.” Jesus Christ himself bore our sins, as we heard this morning. He gave himself for us, he served us, not by proxy, but by personal consecration; not by alms doled out pitifully, but by his life surrendered...",
            "download": "http:\/\/sermonindex.net\/SID11512-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Spur",
            "url": "http:\/\/sermonindex.net\/SID11507",
            "size": "0",
            "format": "mp3",
            "scripture": "John 9:4",
            "topic": "",
            "description": "DELIVERED ON LORD'S-DAY MORNING, JULY 31ST, 1870, BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “I must work the works of him that sent me, while it is day: the night cometh, when no man can work.” — John 9:4. IF this ninth chapter of John is intended to be a continuation of the history contained in the eighth, as we think it is, it brings before us a very extraordinary fact. You will observe in the eighth chapter that our Lord was about to be stoned by the Jews; he therefore withdrew himself from the circle of his infuriated foes, and passed through the crowd, not I think in a hurried manner, but in a calm and dignified way, as one not at all disconcerted, but wholly self-possessed. His disciples, who had seen his danger, gathered round him while he quietly retreated. The group wended their way with firm footsteps till they reached the outside of the temple. At the gate there sat a man well known to have been blind from his birth; our Savior was so little flurried by the danger which had threatened him, that he paused and fixed his eye upon the poor beggar, attentively surveying him. He stayed his onward progress to work the miracle of this man's healing. If it be so that the two chapters make up but one narrative, and I think it is, though we are not absolutely sure, then we have before us a most memorable instance of the marvellous calmness of our Savior while under danger...",
            "download": "http:\/\/sermonindex.net\/SID11507-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        }
    ]
}