{
    "name": "Psalm 100",
    "book": "Psalm",
    "chapter": 100,
    "audio_sermons": [
        {
            "title": "Don't Forget",
            "url": "http:\/\/sermonindex.net\/SID3656",
            "size": "646656",
            "format": "mp3",
            "scripture": "Psalm 100:2",
            "topic": "Classic Recordings",
            "description": "Don't forget. Recorded by VTM 1910. An address by the late General Booth founder of the Salvation Army. \r\n\r\n[b]Audio Transcription:[\/b]\r\n[i]NOTE: it is very hard to hear the audio I recommend highly you read this transcription and listen along at the same time![\/i]\r\n\r\nI am glad you are enjoying yourself. The salvation business is a friend of happiness. Making heaven on earth is our business. Serve the Lord with gladness is one of our favorite mottos. So I am pleased that you are pleased! But amidst all your joys don't forget the sons and daughters of misery. Do you ever visit them?  Come away and let us make a call or two. Here is a home, six in family, they eat and drink and sleep and sick and die in the same chamber. Here is a drunkard hovel, void of furniture, wife a skeleton, children in rags; father now sleeping, the victims of his neglect. Here are the unemployed, wandering about, seeking work and finding none. Yonder are the wretched criminals cradled in crime passing in and out of the prisons all the time. There are the Daughter of shame deceived and wronged and ruined.  Traveling down the dark and blind to an early grave. There are the children, fighting in the gutter, going hungry to school. Growing up to fill their parents places.  Brought it all on themselves, you say?  Perhaps so.  But that does not excuse our assisting them. You don?t demand a certificate of virtue before you drag some drowning creature out of the water.  Nor the assurance in a man of faded grace before you deliver him from the burning building.  But what shall we do?  Content ourselves by singing a hymn? Offering a prayer? Or giving a little good advice?  NO!  Ten thousand times no!  We will forgive them.  Feed them! Reclaim them.  Employ them!Perhaps we shall fail with many.   Quite likely.  But our business is to help them all the same.  And that in the most practical, economical and Christlike manner.  So let us hasten to the rescue for the sake of our own peace, the poor wretches themselves, ____ (dean?) of these children, and the danger(Savior?) of us all.  But you must help with the means.  And there is nothing like the present.  Who in this company will lend a hand by taking up the gauntlet?",
            "download": "http:\/\/sermonindex.net\/SID3656-download",
            "preacher_name": "William Booth",
            "preacher_image": "",
            "preacher_description": "William Booth (1829 - 1912)\r\nListen to freely downloadable audio sermons by the speaker William Booth in mp3 format. Was a British Methodist preacher who founded The Salvation Army and became its first General (1878–1912). The Christian movement with a quasi-military structure and government founded in 1865 has spread from London, England to many parts of the world and is known for being one of the largest distributors of humanitarian aid. Though Booth became a prominent Methodist evangelist, he was unhappy that the annual conference of the denomination kept assigning him to a pastorate, the duties of which he had to neglect to respond to the frequent requests that he do evangelistic campaigns. At the Liverpool conference in 1861, after having spent three years at Gateshead, his request to be freed for evangelism full-time was refused yet again, and Booth resigned from the ministry of the Methodist New Connexion.\r\n\r\nThe name The Salvation Army developed from an incident in May 1878. William Booth was dictating a letter to his secretary George Scott Railton and said, \"We are a volunteer army.\" Bramwell Booth heard his father and said, \"Volunteer, I'm no volunteer, I'm a regular!\" Railton was instructed to cross out the word \"volunteer\" and substitute the word \"salvation\". The Salvation Army was modelled after the military, with its own flag (or colours) and its own music, often with Christian words to popular and folkloric tunes sung in the pubs. Booth and the other soldiers in \"God's Army\" would wear the Army's own uniform, 'putting on the armour,' for meetings and ministry work. He became the \"General\" and his other ministers were given appropriate ranks as \"officers\". Other members became \"soldiers\".",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "100"
                }
            ]
        },
        {
            "title": "The Humility Of Jesus Christ",
            "url": "http:\/\/sermonindex.net\/SID18419",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 100:13",
            "topic": "Humility",
            "description": "Bill McLeod shares a powerful message on the humility of Jesus Christ and the ascending of satan in pride.  He shows the greatness of God and how powerful it is that He came in flesh in Jesus to save humanity. The challenge is issued against pride and choosing the way of humility of Christ as a disciple.",
            "download": "http:\/\/sermonindex.net\/SID18419-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "100"
                }
            ]
        }
    ]
}