{
    "name": "Psalm 130",
    "book": "Psalm",
    "chapter": 130,
    "audio_sermons": [
        {
            "title": "Psalm 130",
            "url": "http:\/\/sermonindex.net\/SID8033",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130",
            "topic": "Psalms",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8033-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "THE KINGDOM OF HEAVEN IS AT HAND",
            "url": "http:\/\/sermonindex.net\/SID22850",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130:3",
            "topic": "Radio Show",
            "description": "God is at work to build the Kingdom of Heaven in our midst. But perhaps you’re one of those people who don’t think much about heaven. This meditation takes another look at heaven and shares how each one of us can become a part of the Kingdom which begins right now.",
            "download": "http:\/\/sermonindex.net\/SID22850-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "Understanding God's Forgiveness",
            "url": "http:\/\/sermonindex.net\/SID24077",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 1:9, Psalm 130:4",
            "topic": "Forgiveness",
            "description": "What makes God great is not that He is all powerful, but that he forgives our sins. 1John 1:9, Psalm 130:4, Isiah 43:25, Acts 13:38, Ephesians 1:7",
            "download": "http:\/\/sermonindex.net\/SID24077-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                },
                {
                    "book": "Psalm",
                    "chapter": "130"
                }
            ]
        }
    ]
}