{
    "name": "Psalm 145",
    "book": "Psalm",
    "chapter": 145,
    "audio_sermons": [
        {
            "title": "11. What are God’s works of providence?",
            "url": "http:\/\/sermonindex.net\/SID22365",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 145:17, Psalm 104:24",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22365-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "145"
                },
                {
                    "book": "Psalm",
                    "chapter": "104"
                }
            ]
        },
        {
            "title": "The Open Hand of God",
            "url": "http:\/\/sermonindex.net\/SID1038",
            "size": "6436864",
            "format": "mp3",
            "scripture": "Psalm 145:16,Psalm 22:24-26",
            "topic": "Trials",
            "description": "Unless we endure trials, we will never learn of the delivering power of God. God is always faithful to his people in times of crises. He teaches his children to trust him and serve him. He draws his children to satisfy them with himself. He opened his hand to all at the cross of Calvary, and he deals gently with his people. He is what every soul is longing for. He satisfies completely.",
            "download": "http:\/\/sermonindex.net\/SID1038-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "22"
                },
                {
                    "book": "Psalm",
                    "chapter": "145"
                }
            ]
        },
        {
            "title": "The Providence Of God-01 ",
            "url": "http:\/\/sermonindex.net\/SID12770",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 145:10",
            "topic": "Providence Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12770-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "145"
                }
            ]
        }
    ]
}