{
    "name": "Psalm 16",
    "book": "Psalm",
    "chapter": 16,
    "audio_sermons": [
        {
            "title": "A Whole New World is Coming",
            "url": "http:\/\/sermonindex.net\/SID2833",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 16:11; Jude 24-25,2 Peter 3:7-14",
            "topic": "End Of The World",
            "description": "This message is about how things will change for the better when Jesus suddenly stops time and eternity begins. This message is meant to bring peace and security to the believer's heart. No matter how bad things will be on earth when the Lord comes, look up, this is not your world. God wants you to know who you are in Christ, and that he loves you and yes, you can make it.",
            "download": "http:\/\/sermonindex.net\/SID2833-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "2 Peter",
                    "chapter": "3"
                },
                {
                    "book": "Psalm",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Psalm 16 The Resurrection",
            "url": "http:\/\/sermonindex.net\/SID12576",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 16",
            "topic": "Resurrection",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12576-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Messianic Psalms - Psalm 16",
            "url": "http:\/\/sermonindex.net\/SID10474",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 16",
            "topic": "Psalms",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10474-download",
            "preacher_name": "Chip Brogden",
            "preacher_image": "",
            "preacher_description": "Chip Brogden ( - )\r\nListen to freely downloadable audio sermons by the speaker Chip Brogden in mp3 format.  Author, teacher, and former pastor, Chip and his wife Karla came out of the church in 1999 to serve those who are following Jesus outside of Organized Religion. Today, The School of Christ reaches many with a simple, consistent, and Christ-centered message\r\nSince 1997, the School of Christ has reached more than 145 nations with a simple, consistent, and Christ-centered message. Our mission is to bring healing to those hurt by religion, to provide for the spiritual growth and maturity of all believers, and to ensure the continuity of a Christ-Centered Faith.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "16"
                }
            ]
        }
    ]
}