{
    "name": "Psalm 41",
    "book": "Psalm",
    "chapter": 41,
    "audio_sermons": [
        {
            "title": "Anatomy Of Betrayal",
            "url": "http:\/\/sermonindex.net\/SID27154",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 41:1-13, John 13:12-20",
            "topic": "Betrayal",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27154-download",
            "preacher_name": "William Shishko",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "41"
                },
                {
                    "book": "John",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "One of You...!",
            "url": "http:\/\/sermonindex.net\/SID17099",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 14:18, Psalm 41:9",
            "topic": "Betrayal",
            "description": "The Lord in the Upper Room, in speaking to a group of 'preachers' says \"one of you shall betray me.\" In this Christ was making a personal application of Psalm 41:9 \"Yea, mine own familiar friend, in whom I trusted, which did eat of my bread, hath lifted up his heel against me.\" This was a great exposure, not only of the traitor Judas but of... 1. The Saints Sensitive Heart (they all said \"is it I?\") 2. The Social Gospel (all the teaching and example of Christ is not enough to save the soul and sin is not in the fact that Judas did not follow protocol but that his heart was not right) 3. The Sinner's Hypocrisy (Judas has become a proverb for treachery and betrayal, but Christ exposes the heart).",
            "download": "http:\/\/sermonindex.net\/SID17099-download",
            "preacher_name": "Aaron Dunlop",
            "preacher_image": "",
            "preacher_description": "Aaron Dunlop ( - )\r\nListen to freely downloadable audio sermons by the speaker Aaron Dunlop in mp3 format. Mr. Dunlop who is originally from Northern Ireland, graduated from the Geneva Reformed Seminary, SC. and is currently pioneering a Free Presbyterian Church in Victoria, British Columbia.\r\nReformed in Doctrine, believing in the divine authority and verbal inspiration of the Bible, and the great fundamental doctrines of grace it contains. The Scriptures alone are the supreme authority in matters of faith and practice. Separatist in Practice, believing and practicing the doctrine of Biblical separatism. In accordance with this, the Free Presbyterian Church has no association with the modern Ecumenical or Charismatic movements, nor will it fellowship with any church which has departed from the fundamental doctrines of the Word of God.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "41"
                },
                {
                    "book": "Mark",
                    "chapter": "14"
                }
            ]
        }
    ]
}