{
    "name": "Psalm 42",
    "book": "Psalm",
    "chapter": 42,
    "audio_sermons": [
        {
            "title": "(Spiritual Dangers) Danger of Losing Your Passion for Christ",
            "url": "http:\/\/sermonindex.net\/SID14494",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 42",
            "topic": "Lukewarmness",
            "description": "Five of the many possible ways to lose your passion for Christ: 1. When sin is left unchecked and unconfessed in your life. 2. When your spiritual output exceeds your intake. (You need daily time alone seeking God.) 3. When you study of God's Word is done exclusive to the application. (Do you articulate better than you live it?). 4. When you allow the spirit of the world to invade your life and home. (This world will be dim in a heart that is hungry for God.). 5. When you give place to the Devil.",
            "download": "http:\/\/sermonindex.net\/SID14494-download",
            "preacher_name": "Don Currin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "42"
                }
            ]
        },
        {
            "title": "A Very Present Help",
            "url": "http:\/\/sermonindex.net\/SID15295",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 42, 2 Chronicles 32",
            "topic": "Protection",
            "description": "God is a very present help! Lessons are drawn from numerous Bible characters. We can be delivered from the enemy. We shall not give in to hopelessness. Take issue with your free time. It is an absolute thrill to walk with the God of heaven. Be still and know that God is God.",
            "download": "http:\/\/sermonindex.net\/SID15295-download",
            "preacher_name": "Dean Stump",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "42"
                }
            ]
        },
        {
            "title": "The Best Sermon You'll Ever Preach",
            "url": "http:\/\/sermonindex.net\/SID24072",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 42",
            "topic": "Christian Life",
            "description": "As David writes this psalm, he speaks a powerful word to his soul. Psalm 42",
            "download": "http:\/\/sermonindex.net\/SID24072-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "42"
                }
            ]
        }
    ]
}