{
    "name": "Psalm 5",
    "book": "Psalm",
    "chapter": 5,
    "audio_sermons": [
        {
            "title": "A Source of Joy that Can Not Be Overcome",
            "url": "http:\/\/sermonindex.net\/SID13228",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 5:11-12",
            "topic": "Joy",
            "description": "July 30, 2006 – We are living in a time when superficial joy will dissipate. Christians who have a wrong focus on Jesus will never experience true joy. God has a prescribed order in the way we should seek Him and serve Him. Our seeking God has to be divinely lead and divinely influenced. When we begin to abide in Christ our lives will be put in divine order. The joy comes when we find the abiding life of Christ flowing in us and through us.",
            "download": "http:\/\/sermonindex.net\/SID13228-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Psalm 5",
            "url": "http:\/\/sermonindex.net\/SID8031",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 5",
            "topic": "Psalms",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8031-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "5"
                }
            ]
        }
    ]
}