{
    "name": "Psalm 6",
    "book": "Psalm",
    "chapter": 6,
    "audio_sermons": [
        {
            "title": "Hindrances to Prevailing Prayer",
            "url": "http:\/\/sermonindex.net\/SID4203",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 6:1-10,Romans 8:26",
            "topic": "Prevailing Prayer",
            "description": "There are many reasons Christians do not pray as they should, and this is one of the gentlest rebukes Pastor Wilkerson has given on this subject. He lovingly explains about the warfare we have to fight our way through to pray, and reveals even if we have neglected to pray as we should, God still wants us to come to him, and he will by the Holy Ghost teach us how to pray as we should. For that alone is how we learn. So stop beating yourself up and get alone with the Holy Spirit and ask him to teach you to pray.",
            "download": "http:\/\/sermonindex.net\/SID4203-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Psalm",
                    "chapter": "6"
                }
            ]
        }
    ]
}