{
    "name": "Psalm 66",
    "book": "Psalm",
    "chapter": 66,
    "audio_sermons": [
        {
            "title": "2006 Heart-Cry - Question Answer Panel",
            "url": "http:\/\/sermonindex.net\/SID13988",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 66:18",
            "topic": "Question Answer",
            "description": "A time of Question and Answer at the Heart-Cry conference run by Paul Washer. Some good questions given and some good biblical answers delivered. It is worthwhile to listen in to some of these godly men answering from their years of experience.",
            "download": "http:\/\/sermonindex.net\/SID13988-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "66"
                }
            ]
        },
        {
            "title": "Don't Die in Your Wilderness",
            "url": "http:\/\/sermonindex.net\/SID4177",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 69:1-3, Psalm 66:10-12",
            "topic": "Wilderness",
            "description": "Using many more scriptures, Pastor Wilkerson illustrates how believers in the Bible suffered afflictions, and how God brought them out. The scriptures testify there will be suffering involved in serving God,  and our faith is refined when we go through the fire and come out still believing God. And he is glorified. God will not fail you, he will not turn you over to the enemy. Israel couldn't believe or accept the love God had for them, causing an entire generation to perish in the wilderness. Understand that not only does God love his children, he delights in them as well. Even in our hardships and trials, God delights in us.",
            "download": "http:\/\/sermonindex.net\/SID4177-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "66"
                },
                {
                    "book": "Psalm",
                    "chapter": "69"
                }
            ]
        },
        {
            "title": "His Testimony And Conversion",
            "url": "http:\/\/sermonindex.net\/SID0560",
            "size": "9607680",
            "format": "mp3",
            "scripture": "Psalm 66:8-20",
            "topic": "Testimony",
            "description": "A very powerful testimony of conversion not by a man but by God who wrought a wonderful work of regeneration in mr. campbells soul. He recieved the baptism with the Holy Spirit and was used powerfully in the revival of 1921. Then he went through a barren wilderness for 17 years in the ministry. But again God revived his heart and he experienced the outpouring of the Holy Spirit in the famous Hebrides Revival. The summation of this testimony is very powerful where he asks the listener if God could do this for him why not us? are we willing to 'go through with God' at any cost?",
            "download": "http:\/\/sermonindex.net\/SID0560-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "66"
                }
            ]
        }
    ]
}