{
    "name": "Psalm 74",
    "book": "Psalm",
    "chapter": 74,
    "audio_sermons": [
        {
            "title": "Casting Fire Into the Sanctuary",
            "url": "http:\/\/sermonindex.net\/SID17237",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74:1-8",
            "topic": "Sanctuary",
            "description": "June 15, 2008 - There are demonic voices and powers of darkness that attempt to turn us away from the power we have in Christ. These voices will say you can't go any farther with God. This message reminds us that it is the LORD who sets the boundaries in the Earth and the truth is that it is the devil who could only go as far as the bloodline of Jesus Christ. It is time to rise up in faith and tell whatever voice is telling us \"we can't\", that God can! God desires to stretch forth His hand and heal us so we can be agents of healing to the unsaved.",
            "download": "http:\/\/sermonindex.net\/SID17237-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "God's Hatchet",
            "url": "http:\/\/sermonindex.net\/SID15398",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74",
            "topic": "Defence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15398-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "Oh God, How Long Shall the Enemy Reproach",
            "url": "http:\/\/sermonindex.net\/SID1042",
            "size": "7501824",
            "format": "mp3",
            "scripture": "Psalm 74:10",
            "topic": "Reproach",
            "description": "This message is very much for those who may feel that the \"enemy\" is attacking them on all sides. It especially deals with those who are walking about as though \"crushed\" by the enemy because of past hurts, etc.. It also deals with those who have had to leave certain churches because of false teaching. We need to stop blaming and focusing on the false, (though it is OK to recognize the problem) and instead focus on Christ and His faithfulness. He will see us through.",
            "download": "http:\/\/sermonindex.net\/SID1042-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "The Adversary In The Church by Milton Green",
            "url": "http:\/\/sermonindex.net\/SID16648",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "Podcast",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/sermonindex.net\/SID16648-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "1"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Psalm",
                    "chapter": "74"
                }
            ]
        }
    ]
}