{
    "name": "Judges 1",
    "book": "Judges",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Through The Bible) Judges 1-7",
            "url": "http:\/\/api.sermonindex.net\/SID6337",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 1-7",
            "topic": "",
            "description": "The book of Judges takes up the next period of Israel’s history after Joshua. There were 12 judges that were in a sort of leadership over Israel, they were the beginnings of what would be a king for Israel. Samuel was the last judge that anointed the king Saul. When they had times which was blessed from war they would start to fall into apostasy and worship other Gods and idols. They turned their backs on God and then come back to God and then go back. They had a failure of consistency with honoring and following God. The command of God was to utterly drive out all the inhabitants of the promised land. But Israel tried to rationally think out ways to comprise Gods will. God has ordered something we need to follow even if it does not seem to be for our best interest. It often times seems we can think of better ways to do things then God, sometimes Gods timing and plans are different then ours and doesn’t make sense with us. God always knows what He is talking about and knows why. God in all things works for the good of those that belong to Him.",
            "download": "http:\/\/api.sermonindex.net\/SID6337-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Iron Chariots",
            "url": "http:\/\/api.sermonindex.net\/SID0251",
            "size": "7360000",
            "format": "mp3",
            "scripture": "Judges 1:19, Joshua 17:18",
            "topic": "Prophetic Word",
            "description": "This is a prophetic message about what God has planned for North America in particular.  In the 1st Chapter of Isaiah Wilkerson shows what this country has becomeÂ…  A nation of slaves.",
            "download": "http:\/\/api.sermonindex.net\/SID0251-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "17"
                },
                {
                    "book": "Judges",
                    "chapter": "1"
                }
            ]
        }
    ]
}