{
    "name": "Judges 1",
    "book": "Judges",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Through The Bible) Judges 1-7",
            "url": "https:\/\/sermonindex.info\/SID6337",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 1-7",
            "topic": "",
            "description": "The book of Judges takes up the next period of Israel’s history after Joshua. There were 12 judges that were in a sort of leadership over Israel, they were the beginnings of what would be a king for Israel. Samuel was the last judge that anointed the king Saul. When they had times which was blessed from war they would start to fall into apostasy and worship other Gods and idols. They turned their backs on God and then come back to God and then go back. They had a failure of consistency with honoring and following God. The command of God was to utterly drive out all the inhabitants of the promised land. But Israel tried to rationally think out ways to comprise Gods will. God has ordered something we need to follow even if it does not seem to be for our best interest. It often times seems we can think of better ways to do things then God, sometimes Gods timing and plans are different then ours and doesn’t make sense with us. God always knows what He is talking about and knows why. God in all things works for the good of those that belong to Him.",
            "download": "https:\/\/sermonindex.info\/SID6337-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Iron Chariots",
            "url": "https:\/\/sermonindex.info\/SID0251",
            "size": "7360000",
            "format": "mp3",
            "scripture": "Judges 1:19, Joshua 17:18",
            "topic": "Prophetic Word",
            "description": "This is a prophetic message about what God has planned for North America in particular.  In the 1st Chapter of Isaiah Wilkerson shows what this country has becomeÂ…  A nation of slaves.",
            "download": "https:\/\/sermonindex.info\/SID0251-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "17"
                },
                {
                    "book": "Judges",
                    "chapter": "1"
                }
            ]
        }
    ]
}