{
    "name": "Judges 15",
    "book": "Judges",
    "chapter": 15,
    "audio_sermons": [
        {
            "title": "(Through The Bible) Judges 15-16",
            "url": "http:\/\/sermonindex.net\/SID6339",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 15-16",
            "topic": "",
            "description": "The story of Samson begins in chapter 13 of judges. Samson judged Israel for 20 years. The problem with Samson was him going down into the camp of the enemy. If we go into situations that are not suitable then we are asking to be defiled and brought into sin. Samson carried the gates of the city 20 miles when they tried to ambush them. You can play with fire but ultimately you will be burned. If you think you are getting by with your passions and desires watch out because it will catch up with you. Women were the failing point of Samson he went into the enemies camp to see a women which was wrong and immoral but the anointed of God did not leave him. Delilah was a deceiver and it was obvious to Samson that she was wanting him to be caught by the philistines. Samson is guilty of an comprise which is always dangerous, he should have said it is none of your business. But he slowly gets closer to the truth to finally talking about his hair. There are times when people have made a special commitment to God. And we make our determination we are really going to live our life for God. Then we compromise when we receive an invitation and are not totally honest.. we need to be honest for the reason why.",
            "download": "http:\/\/sermonindex.net\/SID6339-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Samson #2 - First warfare",
            "url": "http:\/\/sermonindex.net\/SID24152",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 14:1-20, Judges 15:1-8",
            "topic": "Samson",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24152-download",
            "preacher_name": "Andrew Foster",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "14"
                },
                {
                    "book": "Judges",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Samson #3 - A lonely struggle",
            "url": "http:\/\/sermonindex.net\/SID24153",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 15:9-20",
            "topic": "Samson",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24153-download",
            "preacher_name": "Andrew Foster",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "15"
                }
            ]
        }
    ]
}