{
    "name": "Judges 17",
    "book": "Judges",
    "chapter": 17,
    "sermons": [
        {
            "title": "(Through The Bible) Judges 17-21",
            "url": "https:\/\/sermonindex.info\/SID6340",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 17-21",
            "topic": "",
            "description": "This chapter tells us of the moral condition of Israel when it was back at Joshua. This part of the book of Judges goes back to some of the moral decay that goes on during the time of the judges. The moral corruptness that existed with the people of God when they were not fully committed the Lord. Everyone was doing what was right in their own eyes. This is happening in our day in society if it feels right do it. This is a chaotic and anarchy time in Israel where nobody was really following God or the Law of God. Thus it is always a mark of spiritual detoriation when we start to rely on images and idols of God. It does not mean we have forsaken God but rather it is something that shows how our relationship with the living God is waning. The Levite is becoming a professional religionist now for the 10 shekels and a shirt. Paul speaks of the error in the New Testament that godliness is a means of gain. He said this was an evil doctrine and from such depart, Micah feel into this error believing that God would do him good.",
            "download": "https:\/\/sermonindex.info\/SID6340-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Ten Shekels and a Shirt",
            "url": "https:\/\/sermonindex.info\/SID0290",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 17",
            "topic": "Humanism",
            "description": "Paris Reidhead preaches what could be called one of the most influential sermons of the 20th century. The real point of this sermon is an indictment of individuals and organizations practising humanism behind a mask of Christianity! \"This sermon should be preached on a regular basis in every church in America!\"",
            "download": "https:\/\/sermonindex.info\/SID0290-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Ten Shekels and a Shirt by Paris Reidhead",
            "url": "https:\/\/sermonindex.info\/SID14749",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 17",
            "topic": "Podcast",
            "description": "Paris Reidhead preaches what could be called one of the most influntial sermons of the 20th century. The real point of this sermon is an indictment of individuals and organizations practising humanism behind a mask of Christianity! \"This sermon should be preached on a regular basis in every church in America!\"",
            "download": "https:\/\/sermonindex.info\/SID14749-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "17"
                }
            ]
        }
    ]
}