{
    "name": "Judges 4",
    "book": "Judges",
    "chapter": 4,
    "sermons": [
        {
            "title": "The Insignificant Person Is Important To God",
            "url": "http:\/\/api.sermonindex.net\/SID3943",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 4: 29, Judges 4:11-24",
            "topic": "",
            "description": "It doesn’t matter where you go or how far you drift from the Lord – God will go after you. And when your heart turns to the Lord - you will find Him right next to you. Its in those times when you feel so insignificant that God will reveal your importance to Him.",
            "download": "http:\/\/api.sermonindex.net\/SID3943-download",
            "preacher_name": "Neil Rhodes",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "4"
                },
                {
                    "book": "Judges",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "When Heaven Decides to Fight",
            "url": "http:\/\/api.sermonindex.net\/SID11923",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 4:1-3",
            "topic": "Spiritual Warfare",
            "description": "July 10, 2005 - When we finally say enough against the enemy the Lord will come to our defense and fight our enemies. We must begin to understand that God will answer the cry of His people. There is a season when God Almighty will arise to defend the rights of His own name. We are living in a time when God will fight for every soul who longs to be set free and follow after Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID11923-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "4"
                }
            ]
        }
    ]
}