{
    "name": "2 Samuel 1",
    "book": "2 Samuel",
    "chapter": 1,
    "sermons": [
        {
            "title": "(2 Samuel) Free From Bitterness",
            "url": "http:\/\/sermonindex.net\/SID10692",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 1",
            "topic": "",
            "description": "David was in Ziklag, a city in Philistia, when an Amalekite comes from the battle between Israel and the Philistines, he tells David that Saul and his sons are dead on the field of battle and that Israel has retreated from before them, David enquires how he knows Saul is dead and the Amalekite tells him that while he was in the battle he saw Saul fall upon his own sword and call him over to him and ask that he would kill him, so the Amalekite stands over Saul and kills him, this was a lie to gain favour with David.  But he showed David the crown and bracelet that he had taken from Saul after his death, David was very grieved to hear the news and wrote a lamentation about Saul and Jonathan, this shows how David was free from the bitterness that would have ensnared his heart had he dwelt upon how Saul had wronged him. But David asks the Amalekite why he was not afraid to kill the anointed king of Israel and when the he didn't answer David had him killed for boasting over the dead.",
            "download": "http:\/\/sermonindex.net\/SID10692-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) 2 Samuel 1-7",
            "url": "http:\/\/sermonindex.net\/SID6347",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 1-7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6347-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Enemies in Ministry",
            "url": "http:\/\/sermonindex.net\/SID6840",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 1",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6840-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Mounting With Wings",
            "url": "http:\/\/sermonindex.net\/SID20530",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:29-31, 2 Samuel 1:23",
            "topic": "Freedom",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20530-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "1"
                }
            ]
        }
    ]
}