{
    "name": "2 Samuel 11",
    "book": "2 Samuel",
    "chapter": 11,
    "sermons": [
        {
            "title": "(2 Samuel) A Not-So-Sudden Fall",
            "url": "http:\/\/api.sermonindex.net\/SID10702",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 11:1-5",
            "topic": "",
            "description": "This is one of the saddest chapters in the whole of the Old Testament.  David again sent his army out to do battle without going with them himself, and while they were away David took a strole one afternoon on the balcony of his palace.  He probably had no idea thet Bathsheba would be washing herself at that time and yet when he saw her he was transfixed, he had for years indulged in this forbidden passion in marrying more than one wife and that had laid the groundwork for what was about to take place.  He asked his servants who this woman was only to be told that not only was she the daughter and granddaughter of some of Davids closest advisers, but was also married to one of the mighty men in Davids army.  So he knew that her husband was away and thought he could get away with adultery, so they had a 'one night stand' but Bathsheba became pregnant.",
            "download": "http:\/\/api.sermonindex.net\/SID10702-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(2 Samuel) Caught in the Trap of Sin",
            "url": "http:\/\/api.sermonindex.net\/SID10703",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 11:6-27",
            "topic": "",
            "description": "Bathsheba was now pregnant by an adulterous relationship with David, and David knew it so he endeavoured to hide his sin by calling Bathsheba's husband Uriah back from the war.  David asked Uriah how the battle was going and told him to go home and relax with his wife, but Uriah was a man of great integrity and refused to go home to be comfortable with his wife while Israel was at war.  So David sent him back to the front with a note for Joab his commander to place Uriah in the heat of the battle and withdraw from him, sentencing Uriah to death.  Joab obeyed the command of David and Uriah was killed in battle, David later took Bathsheba to be his wife in order to cover up what he had done but this displeased the Lord.  David had ignored the warnings of the Lord and temptation had turned to lust, lust to adultery, adultery to deception and finally into murder, this is how our sin if unchecked can uncontollably accumulate until it utterly blinds us and only the Lord can save us.",
            "download": "http:\/\/api.sermonindex.net\/SID10703-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "11"
                }
            ]
        }
    ]
}