{
    "name": "2 Samuel 13",
    "book": "2 Samuel",
    "chapter": 13,
    "audio_sermons": [
        {
            "title": "(2 Samuel) Amnon, Tamar, and Absalom",
            "url": "http:\/\/sermonindex.net\/SID10705",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 13",
            "topic": "",
            "description": "After the incident with David and the wife of Urriah, Davids family life beamce very disfunctional, thre of Davids children were Amnon, his eldest and the next in line to the throne, Tamar, who some say was Davids only daughter, and Absalom who was brother to Tamar.  Amnon was used to getting everything he wanted, and he wanted Tamar his sister, so much that he became lovesick over her.  So Amnon was advised of a plan to get alone with Tamar, he pretended to be sick and asked the king to send his sister Tamar to serve him whilst he was ill, David of course sent her.  But when she arrived Amnon took her into the bedroom demanded everyone leave and then raped her, giving in totally to his lust.  Tamar was devestated by this as after he had done this wicked act he wanted nothing more to do with her.  Tamar left and went to the house of Absalom her brother who found out what had happened.  David too found out but didn't chastise his son Amnon.  From that day on Absalom hated Amnon, and waited 2 whole years before inviting him to a feast and having hiom killed for what he had done.",
            "download": "http:\/\/sermonindex.net\/SID10705-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "13"
                }
            ]
        }
    ]
}