{
    "name": "2 Samuel 14",
    "book": "2 Samuel",
    "chapter": 14,
    "sermons": [
        {
            "title": "(2 Samuel) Bringing Back the Banished",
            "url": "http:\/\/sermonindex.net\/SID10706",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 14:1-17",
            "topic": "",
            "description": "Absalom the son of David was in exhile, by his own choice and also by the decision of his father.  But Joab, David's chief general was suspicious of Absalom and wanted him back in Jerusalem so he could keepa close eye on him.  Joab got a woman to come before David and pretend to be a poor widow and tell him a story that was almost exactly the sameas the situation the king was in with Absalom.  So after hearing the story David deicdes  to pardon the womans son who was in the place of Absalom, at this the woman confronts David as to why he has suspended justice for her son but not for his own.  In this is a great lesson that we should be forgiving of those who have personally wronged us.  But the justice of the Lord towards mankind was not suspended for the sake of reconcilliation as our punishment was laid upon the shoulder of the Lord Jesus when He was on the cross, thus justice was satisfied and not suspended.",
            "download": "http:\/\/sermonindex.net\/SID10706-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "14"
                }
            ]
        }
    ]
}