{
    "name": "2 Samuel 16",
    "book": "2 Samuel",
    "chapter": 16,
    "audio_sermons": [
        {
            "title": "(2 Samuel) Counselors and Comfort",
            "url": "http:\/\/sermonindex.net\/SID10709",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 16:15-17:29",
            "topic": "",
            "description": "David send Hushai the Archite to spy on his son Absalom who had set himself up as king in David's place.  Absalom in the meatime is asking advise from Ahithophel who was the wisest man in Israel at the time, Ahithophel advises Abslaom to burn his bridges with his father the king by systematically raping 10 of the kings concubines whom David had left behind, but not only this but to do it on the roof of the palace so everyone knew what he was doing.  Absalom followed this advice.  Ahithophel, who hated David due to the fact that he was Bathsehba's grandfather, then asked Absalom if he could lead a band of men immediately and go after David and kill him, this was a brilliant plan and had it not been for the intervention of the Lord would surely have meant the end of David.  Amazingly though Absaom asked for a second oppinion from Hushai the Archite, he appealed to Absalom's vanity and advised him to amass a great army and lead them out to battle, thus buying the king time, Absalom agreed with Hushai's plan and Ahithophel knowing it would lead to ruin returned home and hanged himself as he knew David would succeed and come after him.",
            "download": "http:\/\/sermonindex.net\/SID10709-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "(2 Samuel) Trusting in Adversity",
            "url": "http:\/\/sermonindex.net\/SID10708",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 16:1-14",
            "topic": "",
            "description": "David is on the run again in his life but this time from his own son Absalom.  A servant of Mepibosheth, called Ziba comes to David with vital provisions for him, but the servant lies to David and tells him the Mephiboseth has betrayed him in order to get a reward off David.  The if this wasn't bad enough for David to be fleeing from his own son and to hear, wrongfully, that one of his most trusted friends has betrayed him a distant relation of Saul comes to him called Shimei, and starts cursing David and saying all this has come upono him because of what he did to the Saul when he was still alive.  Davids men who are with him ask for permission to kill Shimei but David is merciful towards him saying, that Absalom is what they should be concerned with and not the misguided insults of some distant relation of Saul, thus David again showed great mercy to the house of Saul and triumphed wonderfully in the face of adversity",
            "download": "http:\/\/sermonindex.net\/SID10708-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "16"
                }
            ]
        }
    ]
}