{
    "name": "2 Samuel 19",
    "book": "2 Samuel",
    "chapter": 19,
    "sermons": [
        {
            "title": "(2 Samuel) Bringing Back the King",
            "url": "http:\/\/api.sermonindex.net\/SID10711",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 19:9-43",
            "topic": "",
            "description": "With Absalom now dead David has every right to return to his throne and impose his rule upon the people of Israel again, but he did not, in a way that is akin to how the Lord Jesus enters our hearts and becomes King there, David would not return until he was invited back. So he turned the hearts of the people back to him as if they were one person and it was only at this that David returned to the throne.  The first person to meet him at his return was the repentant Shimei who had cursed David and throne rocks at him when he was fleeing from Jerusalem. But now Shimei begged Davids forgiveness for what he had done, and David mercifully granted him a pardon.  The Mephibosheth came to David and told him of how Ziba had tricked him and lied to David about him, David told Mephibosheth that he copuld divide the land with Ziba but Mephibosheth only wanted to be with his king he wasn't interested in the land. But at the end of this chapter the seeds were sown for a great dispute between Judah and Israel.",
            "download": "http:\/\/api.sermonindex.net\/SID10711-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "The Holy Spirit - Part 5",
            "url": "http:\/\/api.sermonindex.net\/SID1117",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 5:1,2 Samuel 19:10",
            "topic": "Holy Spirit",
            "description": "This message was delivered on 05\/01\/1960.",
            "download": "http:\/\/api.sermonindex.net\/SID1117-download",
            "speaker_name": "T. Austin Sparks",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "19"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "5"
                }
            ]
        }
    ]
}