{
    "name": "2 Samuel 2",
    "book": "2 Samuel",
    "chapter": 2,
    "audio_sermons": [
        {
            "title": "(2 Samuel) More Anointing, More War",
            "url": "http:\/\/sermonindex.net\/SID10693",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 2-3:1",
            "topic": "",
            "description": "David enquires of the Lord as to what he should do, so the Lord tells David to go up to Hebron, when David got there he was anointed king over the tribe of Judah, and he blessed the people of Jabesh Gilead for retreiving the body of Saul and his sons.  But the people of Israel anointed Ishbosheth, one of Sauls sons, king over Israel, Abner, commander of Sauls army, then led the army of Israel against Davids men who were led by Joab, Joab won the fight and the army of Israel had to flee.  Asahel, who was very quick, chased after Abner as they retreated, but after several warning to stop Abner killed himand carried on retreating.  The army of Israel gathered for one last stand and Abner cried to Joab to end the fighting, Joab agreed and they all left peacably, but this agreement only meant that the war between the house of Saul and the house of David went on for a long time instead of being ended quickly.",
            "download": "http:\/\/sermonindex.net\/SID10693-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "2"
                }
            ]
        }
    ]
}