{
    "name": "2 Samuel 21",
    "book": "2 Samuel",
    "chapter": 21,
    "sermons": [
        {
            "title": "(2 Samuel) Settling an Old Debt",
            "url": "https:\/\/sermonindex.info\/SID10713",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21:1-14",
            "topic": "",
            "description": "There was a famine, probably caused by drought, in the land of Israel, David enquired of the Lord as to why, and the Lord revealed to him that it was a judgement because of Saul's massacre of the Gibeonites 40 years previously.  In the days of Joshua Israel had made a covenant with the Gibeonites not to wipe them out as they were going through Canaan, and the Lord expected Israel to keep this promise.  So David met with the Gibeonites and asked them how this could be put right, the Gibeonites asked for 7 men from the house of Saul that they might execute them.  David agreed and delivered to them 7 men whom the Gibeonites hung together to show they were accursed of God.  But the mother of 2 of the men would not allow their bodies to be desecrated by being eaten by the wild animals, so she kept a vigil over them until the rains came and she knew that their deaths had not been in vain.",
            "download": "https:\/\/sermonindex.info\/SID10713-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(2 Samuel) The Grateful Retrospect",
            "url": "https:\/\/sermonindex.info\/SID10714",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21:15-22:51",
            "topic": "",
            "description": "David now in his latter years could no longer go out to battle in the way he once could, but the lord blessed the slayer of Goliath by raising up 4 more 'giant killers' after him.  Chapter 22 is a psalm of David written at the end of his life much like Psalm 18, here we can see Davids heart overflowing with adoration and praise to God, he exaults the Lord with magestic title after magestic title, my Rock, my Fortress, my Deliverer... He priases God for His protection and how He would not allow David to be distressed and called all of creation to he him, for he knew that He delighted in him.  Even though he had sinned greatly in his life, David knew that the Lord had put away and forgiven his sin, and that before the Lord he was righteous because of God's great mercy.",
            "download": "https:\/\/sermonindex.info\/SID10714-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Spiritual Famine",
            "url": "https:\/\/sermonindex.info\/SID5397",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21, 1 Peter 2:24",
            "topic": "Spiritual Famine",
            "description": "\"Our experience in Christ is supposed to be a land that flows with milk and honey,\" says Roy Hession.  Hession illustrates God's ways in revival by looking at the famine that took place in David's reign and seeing the resolution, ultimately bringing our sins to Calvary and realizing that Christ has been made a curse for us by hanging upon the tree.",
            "download": "https:\/\/sermonindex.info\/SID5397-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        }
    ]
}