{
    "name": "2 Samuel 21",
    "book": "2 Samuel",
    "chapter": 21,
    "sermons": [
        {
            "title": "(2 Samuel) Settling an Old Debt",
            "url": "http:\/\/api.sermonindex.net\/SID10713",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21:1-14",
            "topic": "",
            "description": "There was a famine, probably caused by drought, in the land of Israel, David enquired of the Lord as to why, and the Lord revealed to him that it was a judgement because of Saul's massacre of the Gibeonites 40 years previously.  In the days of Joshua Israel had made a covenant with the Gibeonites not to wipe them out as they were going through Canaan, and the Lord expected Israel to keep this promise.  So David met with the Gibeonites and asked them how this could be put right, the Gibeonites asked for 7 men from the house of Saul that they might execute them.  David agreed and delivered to them 7 men whom the Gibeonites hung together to show they were accursed of God.  But the mother of 2 of the men would not allow their bodies to be desecrated by being eaten by the wild animals, so she kept a vigil over them until the rains came and she knew that their deaths had not been in vain.",
            "download": "http:\/\/api.sermonindex.net\/SID10713-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(2 Samuel) The Grateful Retrospect",
            "url": "http:\/\/api.sermonindex.net\/SID10714",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21:15-22:51",
            "topic": "",
            "description": "David now in his latter years could no longer go out to battle in the way he once could, but the lord blessed the slayer of Goliath by raising up 4 more 'giant killers' after him.  Chapter 22 is a psalm of David written at the end of his life much like Psalm 18, here we can see Davids heart overflowing with adoration and praise to God, he exaults the Lord with magestic title after magestic title, my Rock, my Fortress, my Deliverer... He priases God for His protection and how He would not allow David to be distressed and called all of creation to he him, for he knew that He delighted in him.  Even though he had sinned greatly in his life, David knew that the Lord had put away and forgiven his sin, and that before the Lord he was righteous because of God's great mercy.",
            "download": "http:\/\/api.sermonindex.net\/SID10714-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Spiritual Famine",
            "url": "http:\/\/api.sermonindex.net\/SID5397",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21, 1 Peter 2:24",
            "topic": "Spiritual Famine",
            "description": "\"Our experience in Christ is supposed to be a land that flows with milk and honey,\" says Roy Hession.  Hession illustrates God's ways in revival by looking at the famine that took place in David's reign and seeing the resolution, ultimately bringing our sins to Calvary and realizing that Christ has been made a curse for us by hanging upon the tree.",
            "download": "http:\/\/api.sermonindex.net\/SID5397-download",
            "speaker_name": "Roy Hession",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        }
    ]
}