{
    "name": "2 Samuel 23",
    "book": "2 Samuel",
    "chapter": 23,
    "audio_sermons": [
        {
            "title": "(2 Samuel) The Sweet Psalmist and the Mighty Men",
            "url": "http:\/\/sermonindex.net\/SID10715",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 23:1-24:9",
            "topic": "",
            "description": "David was the sweet psalmist of Israel and instructs in the passage how a leader must be just and live in the fear of the Lord.  He reflected on how the Lord had blessed him so abundantly throughout his life, and shows how close David was to the Lord, how the Lord delighted in him and how he delighted in the Lord.  To David God was the Goal not a Way to the goal as He so often is today.  David also had around him his mighty men who had first joined him in the cave of Adullam when they were weak afraid and in debt, but now the they were mighty through God, as they had learned to love the Lord and had gone out and won great victories.  In chapter 24 Satan tempted David to number all of Israel in order to see how strong he was in the natural but this was a thing which the Lord had expressly forbidden.",
            "download": "http:\/\/sermonindex.net\/SID10715-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "A Soldier that Stands",
            "url": "http:\/\/sermonindex.net\/SID3616",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 23:10,12",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3616-download",
            "preacher_name": "Lester Roloff",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Your First Mission is Your Family - Don't Let Go Of Them!",
            "url": "http:\/\/sermonindex.net\/SID3804",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 23:5, Malachi 2:14-16",
            "topic": "Godly Home",
            "description": "This sermon is over 1 hour and a half, but well worth the listen. Keith Daniel retells many powerful stories about Gods keeping power against the hateful sin of divorce amongst Christians. This is a must hear sermon for any Christian families, what a powerful amount of testimony to overcome the devil.",
            "download": "http:\/\/sermonindex.net\/SID3804-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "23"
                },
                {
                    "book": "Malachi",
                    "chapter": "2"
                }
            ]
        }
    ]
}