{
    "name": "2 Samuel 24",
    "book": "2 Samuel",
    "chapter": 24,
    "sermons": [
        {
            "title": "(2 Samuel) In God's Hands",
            "url": "http:\/\/api.sermonindex.net\/SID10716",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 24:10-25",
            "topic": "",
            "description": "After he had counted the people David's heart convicted him of this sin, so he repented before the Lord , the Lord then sent Gad the prophet to him with a choice, David was going to be judged for his sin but he had a choice what that judgement was to be, famine, war or plague.  It was highly likely that the famine and the war would not have touched David directly so he chose the punishment of the plague.  Famine and war would also have meant that he would have to rely on man for help but he chose to fall into the hands of the Lord as His mercy is great.  In the plague which lasted 3 days 70,000 people died but thatnks to the mercy of God the plague was stopped when the Angel of the Lord was at the threshing floor of  Araunah the Jebusite.  David bought the threshing floor and errected an altar on it as the Lord commanded, this was the same land where Abraham offered Isaac, Solomon built the temple and the Lord Jesus bled and died for us.",
            "download": "http:\/\/api.sermonindex.net\/SID10716-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "The Cost That Counts",
            "url": "http:\/\/api.sermonindex.net\/SID20632",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 24:24",
            "topic": "Cost",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20632-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "24"
                }
            ]
        }
    ]
}