{
    "name": "2 Samuel 3",
    "book": "2 Samuel",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "(2 Samuel) Believing and Living",
            "url": "http:\/\/sermonindex.net\/SID10694",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 3",
            "topic": "",
            "description": "David took many wives to himself over the course of his life, and yet this was wrong in the eyes of God and is reflected in the trouble that came to him from his family.  Ishbosheth, the pretender to the throne, accuses Abner, his military commander, of taking Sauls concubine for himself, this enrages Abner and he deicdes to no longer support Ishbosheth but defect to Davids side.  When Abner comes to him David asks for Michal, his first wife, to be returned to him, so Abner went and took Michal from where she was and brought her back to David.  Abner then went aroung Israel declaring that everyone should recognise David as being the rightful king and there was peace, but only for a short time.  Joab, Davids military commander, returns from a campaign to hear that Abner, who had killed Joabs brother Asahel on the field of battle, has made peace with David.  So he requests to see Abner and when he came Joab killed him, because of his brother, but when David heard about this he was greatly saddened and condemned Joab and all his house for this.",
            "download": "http:\/\/sermonindex.net\/SID10694-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Divine Justice",
            "url": "http:\/\/sermonindex.net\/SID9207",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 3:27-39",
            "topic": "Divine Justice",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9207-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Only By Integrity Is There Deliverance",
            "url": "http:\/\/sermonindex.net\/SID3931",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 3:1-5,  Psalm 41:10-13",
            "topic": "",
            "description": "When you think of the word integrity you actually are thinking of being upright in heart and mind , being honest and sincere. When up-rightness is lacking in the home integrity is undermined . Allowing compromise into your life will rob your integrity. It doesn’t matter how attractive compromise looks it will always oppress you depress you.",
            "download": "http:\/\/sermonindex.net\/SID3931-download",
            "preacher_name": "Neil Rhodes",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "41"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "3"
                }
            ]
        }
    ]
}