{
    "name": "2 Samuel 4",
    "book": "2 Samuel",
    "chapter": 4,
    "sermons": [
        {
            "title": "(2 Samuel) How to Love an Enemy",
            "url": "http:\/\/sermonindex.net\/SID10695",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 4",
            "topic": "",
            "description": "When Ishbosheth hears that Abner is dead he gets very afraid and panics, and rightly so as two assasins come to his house and kill him whilst he is still in bed. They took his head and went to David to show him how they had kiled his 'enemy' and sought a reward from him.  But David was sickened by what they had done and because of the evil in their hearts, so he rebuked them for killin Ishbosheth, calling Saul 'David's enemy' and claiming they had carried out the will of the Lord. But David did not consider Saul his enemy so he commanded that the two assains should be killed, as a statement that no one should attack the house of Saul anymore.  David then went and took the head of Ishbosheth and buried it with Abner.  This showed how David was a man after the heart of the Lord as he forgave his enemies and even loved them.",
            "download": "http:\/\/sermonindex.net\/SID10695-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "4"
                }
            ]
        }
    ]
}