{
    "name": "2 Samuel 6",
    "book": "2 Samuel",
    "chapter": 6,
    "audio_sermons": [
        {
            "title": "(2 Samuel) Doing Things God's Way",
            "url": "http:\/\/sermonindex.net\/SID10697",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6",
            "topic": "",
            "description": "David, now established as king over Israel, decides to bring the Ark of the Covenant to Jerusalem.  So they get together a large group of worshippers and put the Ark on a brand new cart pulled by oxen and head for Jerusalem.  On the way the cattle stumble and the Ark almost falls to the ground, but is stopped by the hand of Uzzah who is escorting the cart.  The Lord is furious and strikes Uzzah dead on the spot.  David sends the Ark to the house of Obededom and the Lord blesses the house.  David seeks the Lord on how He wants the Ark to be brought back Jerusalem and the Lord instructs him the correct way.  So David brought the Ark back no leaving anything to chance and dances before the Lord with all his might.  But he is despised by his wife Michal for wearing a linen ephod and dancing and she rebukes him when he returns home for this the Lord caused her to be barren for the rest of her life.",
            "download": "http:\/\/sermonindex.net\/SID10697-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(The Path Of The Ark #5) Touching Christ Through Revelation",
            "url": "http:\/\/sermonindex.net\/SID15377",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6, 1 Chronicles 13, 15-16",
            "topic": "",
            "description": "The death of Uzzah triggered a spiritual crisis for David and the nation.  The Ark's stay at the house of Obed-Edom with blessing sparked hope in David that God can be pleased when he sought Him by revelation of Scripture.  The second parade that escorted the Ark to Jerusalem was by a transformed David dressed no longer as a king but a humble priest 'outside the camp'.",
            "download": "http:\/\/sermonindex.net\/SID15377-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                },
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "A Marriage Gone Sour",
            "url": "http:\/\/sermonindex.net\/SID9208",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6:20-23",
            "topic": "Marriage",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9208-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "God's Work To Be Done God's Way",
            "url": "http:\/\/sermonindex.net\/SID0117",
            "size": "5087232",
            "format": "mp3",
            "scripture": "2 Samuel 6",
            "topic": "The Lord's Work",
            "description": "It is good to want to work for God. David found out how important it is to do God's work in God's way. From 2 Samuel 6. Although God may honor the world's efforts, his people must only do things the way he has required -- David learned this when he tried to move the ark as the Philistines had, costing Uzzah his life. The Church must never employ the world's methods, for God will only bless the obedience of his people.",
            "download": "http:\/\/sermonindex.net\/SID0117-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Steadying The Ark Of God",
            "url": "http:\/\/sermonindex.net\/SID16621",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6",
            "topic": "Ark Of God",
            "description": "Vance Havner shares about how the people of our day have desired to steady the ark, but what we need is to get back to God's ways and His principles. Church needs to get back to God. We have been so anxious to be relevant we have lost our reverence towards God.",
            "download": "http:\/\/sermonindex.net\/SID16621-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Steadying The Ark Of God by Vance Havner",
            "url": "http:\/\/sermonindex.net\/SID16647",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6",
            "topic": "Podcast",
            "description": "Vance Havner shares about how the people of our day have desired to steady the ark, but what we need is to get back to God's ways and His principles. Church needs to get back to God. We have been so anxious to be relevant we have lost our reverence towards God.",
            "download": "http:\/\/sermonindex.net\/SID16647-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Glorious Uncovered King of Israel",
            "url": "http:\/\/sermonindex.net\/SID13925",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6:14-23, Luke 1:27, Luke 1:32",
            "topic": "Servanthood",
            "description": "May 14, 2006 – Jesus Christ filled with compassion moved to bring the worship od God into the central core of humanity. There has to be an inner cry of every christian that desires to honor the Lord with their life. Jesus Christ will come and unveil Himself to the heart of a servant. Those who will serve with the lowest of the low.",
            "download": "http:\/\/sermonindex.net\/SID13925-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "When Mercy Kills an Outstretched Hand",
            "url": "http:\/\/sermonindex.net\/SID1039",
            "size": "7323648",
            "format": "mp3",
            "scripture": "John 10:12, 2 Samuel 6:1-11",
            "topic": "Presence of God",
            "description": "This is a very powerful message about the fear of the Lord and the lack of respect in the Church for His presence. This message can be summed up in a single quote from Pastor Conlon, \"Lose everything in your life but don't lose the presence of God.\"",
            "download": "http:\/\/sermonindex.net\/SID1039-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Who's Touching the Ark?",
            "url": "http:\/\/sermonindex.net\/SID0217",
            "size": "5645312",
            "format": "mp3",
            "scripture": "2 Samuel 6:1-6",
            "topic": "Ark Of God",
            "description": "Brother Len speaks on absolute obediance and how it is necessary to walking in God's will; that without this obediance we begin to dry up spiritually. Secondly, he discusses man's dealing with holy things of God, namely the ark of God. The application he preaches on is how we try to dress the gospel up to modernize it. He points out that the man who tried to steady the ark was not blaspheming God, he was not smashing it, or in any way intentionally rebelling against the Lord; but for all this, he was still disobediant and killed on the spot. \"A lady called me from the border of Mexico today...she was weeping, she said, '...oh, we do want to be such great soulwinners'...I said to her, my dear look, the first commandment is not, \"thou shalt be a soulwinner,\" the first commandment is, \"thou shalt love the Lord thy God...\"",
            "download": "http:\/\/sermonindex.net\/SID0217-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        }
    ]
}