{
    "name": "2 Samuel 7",
    "book": "2 Samuel",
    "chapter": 7,
    "sermons": [
        {
            "title": "(2 Samuel) A Tale of Two Houses",
            "url": "https:\/\/sermonindex.info\/SID10698",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 7",
            "topic": "",
            "description": "David wanted to bless the Lord by building a house for Him, so he consulted the prophet Nathan who agreed, but Nathan was then told by the Lord to tell David that He did not him to build Him a house, the Lord later revealed to David that it was because he was a man of war.  David loved the Lord so much that he wanted to give more to the Lord than the Lord asked of him, the Lord told David that he would be the father of the men who would build His house, the first would Solomon who built the temple in Jerusalem, but the second Son of David would build a house for God that would last forever, and this is of course the Lord Jesus, Who is at this time building His church.  David humbled himself and blessed the Lord for his promises.  He accepted the promises of the Lord and asked only that the Lord would carry out His promises to build His house with his descendants.",
            "download": "https:\/\/sermonindex.info\/SID10698-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "A Personal Promise",
            "url": "https:\/\/sermonindex.info\/SID27577",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 7:18-22",
            "topic": "Promise",
            "description": "In this message, Pastor Cymbala looks at 2 Samuel 7 - David's prayer of thanksgiving and God's prophetic promise to him. We pray that you will be encouraged with this teaching. 2 Sam. 7:18-22, 25 & 28 (GNB).",
            "download": "https:\/\/sermonindex.info\/SID27577-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Speechless",
            "url": "https:\/\/sermonindex.info\/SID9209",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 7:18-20",
            "topic": "Speech",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9209-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "7"
                }
            ]
        }
    ]
}