{
    "name": "2 Samuel 8",
    "book": "2 Samuel",
    "chapter": 8,
    "sermons": [
        {
            "title": "(2 Samuel) David's Triumph",
            "url": "http:\/\/api.sermonindex.net\/SID10699",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 8",
            "topic": "",
            "description": "David wrought great victories against the enemy nations around him, as he was a man afte Gods own heart he was at peace with the people of God and at war with the enemies of God, unlike Saul before him.  He defeated the Philistines who were an old and stubborn enemy, just as Satan is an old and stubborn enemy of ours, but the Lord will win the resounding victory.  He defeated Moab with great severity as much severity as we are, through Christ, to defeat the sin that is in our lives.  He also defeated the Syrian alliance who had come against him and so Christ shall one day utterly defeat the alliance of sin, the flesh and the devil.  We can learn from this passage of scripture that David defeated his enemies that were all around him just as the Lord desires to defeat all the enemies that surround us.",
            "download": "http:\/\/api.sermonindex.net\/SID10699-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(Through The Bible) 2 Samuel 8-16",
            "url": "http:\/\/api.sermonindex.net\/SID6348",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 8-16",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6348-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Defeated Father",
            "url": "http:\/\/api.sermonindex.net\/SID11043",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 8-13",
            "topic": "Father",
            "description": "Emanuel Esh examines principles from the life of King David, how externally he had many victories but suffered various defeats in his home life--a loss of discernment and authority.  Esh drives home the importance of parents (particularly the father) drawing clear boundaries and being firm and consistent.  In a society where children often rule the home, this is a sober warning of the consequences of parental neglect in the lives of children in years to come--when it may be too late.",
            "download": "http:\/\/api.sermonindex.net\/SID11043-download",
            "speaker_name": "Emanuel Esh",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "8"
                }
            ]
        }
    ]
}