{
    "name": "2 Samuel 9",
    "book": "2 Samuel",
    "chapter": 9,
    "sermons": [
        {
            "title": "(2 Samuel) The Kindness of God",
            "url": "http:\/\/api.sermonindex.net\/SID10700",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 9",
            "topic": "",
            "description": "David asks if there is anyone left frm the house of Saulthat he might show to them the kindness of God, so he calls a servant of Saul to him and aks if there is anyone, the servant informs him of Mephibosheth who was the son of Jonathan, David's close friend, but the servant also informs David that Mephibosheth is lame in both his feet thus posing no threat to David's rule over Israel.  David send for Mephibosheth anyway, and he must have been terrified that David would kill him as he had been in hiding for years, but David did indeed show to him the kindness of God as he gave him back all Saul's land, said that he would not kill him, and told him that from that day on he would be welcome to eat at the table of the king.  This of course is a wonderful picture of our relationship to the Lord Jesus who has forgiven us, given us back more than we lost in Adam and invites us always to dine at His table, with Him.  What a God we serve.",
            "download": "http:\/\/api.sermonindex.net\/SID10700-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Lame Feet Under the King's Table - Mephibosheth",
            "url": "http:\/\/api.sermonindex.net\/",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 9:1-13",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Sit Down And Eat",
            "url": "http:\/\/api.sermonindex.net\/SID24232",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 9:1-11",
            "topic": "Kindness",
            "description": "King David was looking for someone to show kindness to. Even more, Jesus wants to show us His kindness and blessing. What do you need from Jesus today?",
            "download": "http:\/\/api.sermonindex.net\/SID24232-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Reproach of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID15081",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 13:12-15, 2 Samuel 9:6, Luke 4:18",
            "topic": "Reproach",
            "description": "March 11, 2007 - This message is for Christians that have positioned themselves in the center of two different kingdoms. The Kingdom of God and the kingdom of the world, Coming to the house of the Lord with a seemingly holy devotion for God and leaving the House of the Lord and having the same devotion for the things of the world. This is the reason why there is such a powerless testimony and the church is becoming a non issue in this society. We cannot be devoted to the Lord and be devoted to the things that offend His holy name. God is calling His church to come outside the camp and come out of mixture and compromise to serve the Lord wholeheartedly. In every generation there has to be somebody that is willing to stand in the middle of the marketplace and bear the reproach of Jesus Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID15081-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "4"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "9"
                },
                {
                    "book": "Hebrews",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Who is the Head of Your Table?",
            "url": "http:\/\/api.sermonindex.net\/SID22323",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 9:1-13",
            "topic": "Lordship",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22323-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "9"
                }
            ]
        }
    ]
}