[
    {
        "title": "DonÂ´t flee from difficulties",
        "url": "http:\/\/api.sermonindex.net\/SID14373",
        "size": "0",
        "format": "mp3",
        "scripture": "Genesis 16:7-13",
        "topic": "Difficulties",
        "description": "The angel of the Lord appeared to Hagar. This is the first time we read of the angel of the Lord in the Old Testament. In the Old Testament specifically the angel of the Lord is referred to as having a divine nature. He is holy as God is holy. It is believed that He is the Lord Jesus revealing Himself to man. He has always been. When the Pharisees accused Jesus, He said, \"Abraham rejoiced to see my day\", and, \"before Abraham was, I am\". Sarah took the matter of her barrenness into her own hands and handed her handmaid to her husband as wife. It's a cursed thing for people not to be able to wait upon God. When Hagar saw that she conceived she despised her mistress, and Sarah suffered. She blamed Abraham and Hagar for her suffering which she brought upon herself. But Abraham told her that it's her slave and it was her idea, so she should do what she thinks best. So Sarah made life impossibly difficult for Hagar. Hagar was also haughty, obstinate and irritated.",
        "download": "http:\/\/api.sermonindex.net\/SID14373-download",
        "speaker_name": "Erlo Stegen",
        "_scripture": [
            {
                "book": "Genesis",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "Pouring Oil On Your Pillow",
        "url": "http:\/\/api.sermonindex.net\/SID4322",
        "size": "0",
        "format": "mp3",
        "scripture": "Genesis 28",
        "topic": "Difficulties",
        "description": "Gen. 28 For believers who are in a dark and difficult place in their life, this is often where they receive the greatest revelation of who God is. For how can he show his children his ability to deliver them if they never have need of deliverance? God is not indifferent. He hasn't forgotten you. He knows what you are facing.  Great encouragement.",
        "download": "http:\/\/api.sermonindex.net\/SID4322-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "Genesis",
                "chapter": "28"
            }
        ]
    },
    {
        "title": "Preparing To Sing in a Difficult Time",
        "url": "http:\/\/api.sermonindex.net\/SID5310",
        "size": "0",
        "format": "mp3",
        "scripture": "Matthew 26:26-27",
        "topic": "Difficulties",
        "description": "This messages is a challenge to all professing Believers to get serious in their walk with God. This is not a time to play games with God. Difficult times are ahead, and if we do not submit to God and resist the devil now, we will be unable to do so in the future.",
        "download": "http:\/\/api.sermonindex.net\/SID5310-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "Matthew",
                "chapter": "26"
            }
        ]
    },
    {
        "title": "The Most Difficult Journey of All",
        "url": "http:\/\/api.sermonindex.net\/SID17258",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 15:11-19",
        "topic": "Difficulties",
        "description": "June 22, 2008 - What is it that causes so many young people to leave the house of God today? It is the older brother syndrome, when service in the house of God becomes hard labor from an angry joyless heart. It is the Father that meets His children with love and mercy. God almighty will bring His sons and daughter back home and we need to be prepared to celebrate their home coming.",
        "download": "http:\/\/api.sermonindex.net\/SID17258-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "15"
            }
        ]
    }
]