[
    {
        "title": "(Daniel) Israel's Time of Trouble",
        "url": "http:\/\/api.sermonindex.net\/SID10752",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 12, Revelation 12:13-17",
        "topic": "Jacobs Trouble",
        "description": "The time known as 'Jacobs trouble' will be the worst persecution that has ever befallen the jewish people, which is saying a lot considering they have been the target of satanic persecution all along, and we know the reason for this is due to the fact that the jews are so wrapped up in God's eternal plan.In the midst of this time of persecution there will be a great opportunity to spread the gospel though.  The prophecy laid out here will have it's fulfillment in the end times, it will be a period of 3 and a half years and will be so intense that it will cause the people of Israel to cry out to their Messiah and He will return and defend them from the last onslaught.  Interestingly Pastor Guzik says that 'running to and fro and knowledge shall increase' speaks of the huge explosion in understanding of Biblical prophecy that has occured in the past 100 years.",
        "download": "http:\/\/api.sermonindex.net\/SID10752-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Revelation",
                "chapter": "12"
            },
            {
                "book": "Daniel",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "The time of Jacob's Trouble",
        "url": "http:\/\/api.sermonindex.net\/SID10895",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 6",
        "topic": "Jacobs Trouble",
        "description": "A comprehensive overview of a soon-coming event. Drawing on the prophetic scriptures, Art brings to the church a framework of understanding of what it will take for present-day Jacob to become the Israel of God.",
        "download": "http:\/\/api.sermonindex.net\/SID10895-download",
        "speaker_name": "Art Katz",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "6"
            }
        ]
    }
]