[
    {
        "title": "Confessions of a Pharisee",
        "url": "http:\/\/api.sermonindex.net\/SID14657",
        "size": "0",
        "format": "mp3",
        "scripture": "James 2:8-9",
        "topic": "Pharisaism",
        "description": "Alan Martin shares his heart with the work that God has been doing in showing area's of pharisaism. There are many hard teachings and doctrines in the Bible yet under all of these things the mercy and love of God are paramount. At times we can \"choke\" and \"judge\" others without mercy. May God give us the mercy and love of Christ in our Christian walks. A very searching sermon. Do we REALLY fulfill the royal law?  God is after the Pharisee in us, and it is His great mercy to do so to set us free.  The danger in being separated to God is to really think you know and judge others critically and keep others away at a distance because they're not as easy to get along with.",
        "download": "http:\/\/api.sermonindex.net\/SID14657-download",
        "speaker_name": "Alan Martin",
        "_scripture": [
            {
                "book": "James",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Pharisees of Our Day",
        "url": "http:\/\/api.sermonindex.net\/SID5775",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 14:1-6",
        "topic": "Pharisaism",
        "description": "In the 38-minute message entitled, “Pharisees of Our Day,” Pastor A. W. Tozer poses a solemn question: “Can it be so that a man can be orthodox, sound in his creed… loyal to the church of his fathers, and still be blind, cruel, and bigoted—and wicked?” Is a common sinner the real enemy, or is it the self-righteous religionist, who cares not at all for the lost? In Luke 14:1-6, Jesus saved a man who the religious leaders would not and could not heal. “Brothers and sisters, shall it be religion or shall it be Christ?”",
        "download": "http:\/\/api.sermonindex.net\/SID5775-download",
        "speaker_name": "A.W. Tozer",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "14"
            }
        ]
    },
    {
        "title": "The Danger Of Pharisaism",
        "url": "http:\/\/api.sermonindex.net\/SID4073",
        "size": "7978496",
        "format": "mp3",
        "scripture": "Acts 1:1, Matthew 23:3, Luke 12:45",
        "topic": "Pharisaism",
        "description": "Brother Zac looks at the very dangerous imbalance of holiness preaching taken to a extreme. This message serves as a gentle warning in love to many who have strong convictions that go past what God calls and leads. We need zealous strong individuals that display the compassion of God but a unyielding desire for truth. The true body of Christ should fulfill the same function as Jesus did while on earth--exposing unreality and religious hypocrisy.  As Zac has studied many groups in Christendom that majored on holiness, all of their mistakes could be summed up in one thing: pharisaism.  Many precious principles are put forth that we may ask the question: \"Am I really presenting Christ correctly?\"",
        "download": "http:\/\/api.sermonindex.net\/SID4073-download",
        "speaker_name": "Zac Poonen",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "12"
            },
            {
                "book": "Matthew",
                "chapter": "23"
            },
            {
                "book": "Acts",
                "chapter": "1"
            }
        ]
    }
]