[
    {
        "title": "(The Church Needs To Know) 8. The Church Will be Confronted",
        "url": "http:\/\/api.sermonindex.net\/SID24992",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Prophetic Word",
        "description": "When we look at the state of the Church today, I am sure that many Christians are saddened by what they see. In many ways, there is little difference between the behaviour of 21st century believers and what went on with the people of Israel during the time of Jeremiah and the other Old Testament prophets. It seems that, once again, God’s people are being led to run after things that do not profit them.",
        "download": "http:\/\/api.sermonindex.net\/SID24992-download",
        "speaker_name": "Miki Hardy",
        "_scripture": []
    },
    {
        "title": "A Call For Prophetic Evangelistic Preaching",
        "url": "http:\/\/api.sermonindex.net\/SID12241",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 1:18-20",
        "topic": "Prophetic Word",
        "description": "Alan Redpath the late pastor of moody church gave a powerful heart rending message on repentance to his local church that had a great reputation and also to the larger body of Christ in his day. This message is needed to be heard by many in this day also.",
        "download": "http:\/\/api.sermonindex.net\/SID12241-download",
        "speaker_name": "Alan Redpath",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "A Final Warning to the Indulgent Church",
        "url": "http:\/\/api.sermonindex.net\/SID19580",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Chronicles 11:15-19",
        "topic": "Prophetic Word",
        "description": "January 17, 2010 - That which satisfies the deepest longings of our heart is the living waters of Christ. Each of us is invited to drink and pass this cup of salvation. The question is, “What do we do with this cup of salvation”? This message points to examples in history where people were given a great opportunity to serve God but became self indulgent. The self indulgent church has nothing in his heart for his brother. It gravitates to the things of the world and its possessions, instead of living for Christ. There is a final warning to the self indulgent church to turn away from their sins and become charitable to the poor. There is a time when a sentence is written against those who were supposed to be a testimony in the earth. Recognizing and honoring truth is not enough, we must embrace it and walk it out! In one minute everything can change and only those who have the compassion of God for humanity will stand!",
        "download": "http:\/\/api.sermonindex.net\/SID19580-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "1 Chronicles",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "A Message for America and Its Cultural Religion",
        "url": "http:\/\/api.sermonindex.net\/SID19327",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 14:1-9 ",
        "topic": "Prophetic Word",
        "description": "September 6, 2009 - America has made a tragic mistake by allowing the worship of Baalism into the House of The Lord. The god of prosperity has become the god of this age. How this must break the heart of God! The Lord doesn’t judge with any delight in His heart but He looks down on what was supposed to be His heritage and says I can't let this go on any longer! He absolutely will not let His people pursue a path that will lead to hell. God is calling His church to return to Him and allow Him to take away all the iniquity in us that would keep His life from flowing through His Body. When we get right with God the storms will come but His church will stand with His Glory upon us. The testimony of the true church of Christ will not be shaken!",
        "download": "http:\/\/api.sermonindex.net\/SID19327-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "14"
            }
        ]
    },
    {
        "title": "Iron Chariots",
        "url": "http:\/\/api.sermonindex.net\/SID0251",
        "size": "7360000",
        "format": "mp3",
        "scripture": "Judges 1:19, Joshua 17:18",
        "topic": "Prophetic Word",
        "description": "This is a prophetic message about what God has planned for North America in particular.  In the 1st Chapter of Isaiah Wilkerson shows what this country has becomeÂ…  A nation of slaves.",
        "download": "http:\/\/api.sermonindex.net\/SID0251-download",
        "speaker_name": "David Wilkerson",
        "_scripture": [
            {
                "book": "Joshua",
                "chapter": "17"
            },
            {
                "book": "Judges",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Repentance Is Our Only Hope (compilation)",
        "url": "http:\/\/api.sermonindex.net\/SID22629",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Prophetic Word",
        "description": "This is a powerful 15 minute clip of the burden that David Wilkerson had towards the body of Christ in North America. He pleaded the word of God to this generation with words of comfort and also words of warning from the Lord. Oh may we heed this voice even today!",
        "download": "http:\/\/api.sermonindex.net\/SID22629-download",
        "speaker_name": "David Wilkerson",
        "_scripture": []
    },
    {
        "title": "The Prophetic Word",
        "url": "http:\/\/api.sermonindex.net\/SID3101",
        "size": "19047343",
        "format": "mp3",
        "scripture": "",
        "topic": "Prophetic Word",
        "description": "With the general debasing of language and the preached word in particular, Art examines the meaning of the preached word as an ‘event’ that actually effects something in the purposes of God.",
        "download": "http:\/\/api.sermonindex.net\/SID3101-download",
        "speaker_name": "Art Katz",
        "_scripture": []
    },
    {
        "title": "When The Arrow Is Beyond You",
        "url": "http:\/\/api.sermonindex.net\/SID25120",
        "size": "0",
        "format": "mp3",
        "scripture": "Galatians 3:2-3, Isaiah 55:8",
        "topic": "Prophetic Word",
        "description": "Carter Conlon shares a powerful prophetic message to the Church of Jesus Christ in North America. God is calling for those who are weak and are willing to Trust Him fully. God is calling believers to realize they do the work of the Church in the arm of the flesh. Brother Carter gives a clear call for the Church to get back to the place of prayer in the prayer meeting. God is waiting for us to be directed by Him again in everything.",
        "download": "http:\/\/api.sermonindex.net\/SID25120-download",
        "speaker_name": "Carter Conlon",
        "_scripture": [
            {
                "book": "Galatians",
                "chapter": "3"
            },
            {
                "book": "Isaiah",
                "chapter": "55"
            }
        ]
    }
]