{
    "name": "Ephesus 3",
    "book": "Ephesus",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "The Churches Of Revelation",
            "url": "http:\/\/sermonindex.net\/SID24212",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesus 3",
            "topic": "Christ Centered",
            "description": "In this sombre prophetic message we look at the departing of many from the heart of Christ.Jesus warned the Ephesians that if they did not repent He would remove the candlestick from the midst.Alas today there are assemblies that resemble the tin man from the movie the wizard of Oz.They function,move,skip and dance along a golden road and yet they have no heart.The glory of God has departed and they have been found naked and  at home in their nakedness.It is my prayer that many would hear this message and encourage others to listen as i truly believe it to be applicable to this hour.",
            "download": "http:\/\/sermonindex.net\/SID24212-download",
            "preacher_name": "Scott Hynds",
            "preacher_image": "",
            "preacher_description": "Scott Hynds (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Scott Hynds in mp3 format. Through a man of God, witnesses and the inner witness of Gods Spirit, he heard the call to the ministry of preaching the gospel around the world. As John Wesley said \"the world is my parish\" and Scott believes this vision has been passed on to him. In the providence of Almighty God Scott had the great Joy of working in the Roman Catholic community with the elderly. He made sure that these old men and women received the Gospel of the Lord Jesus Christ. He found this experience overwhelming through the love of his master and rejoices in that Christ can set you free from any bondage including deep hatred.\r\nScott recently returned home to Northern Ireland after a few years in Australia as an itinerant Evangelist and Pastor.The Lord has led Scott to plant a church in his home town of Portadown and Pillar Christian Church belongs to the Assemblies of God in Ireland.",
            "_scripture": [
                {
                    "book": "Ephesus",
                    "chapter": "3"
                }
            ]
        }
    ]
}