{
    "name": "Exodus 11",
    "book": "Exodus",
    "chapter": 11,
    "audio_sermons": [
        {
            "title": "(Exodus) Exodus 11:1-10",
            "url": "http:\/\/sermonindex.net\/SID10545",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 11:1-10",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10545-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Exodus) Exodus 11:10",
            "url": "http:\/\/sermonindex.net\/SID10546",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 11:10",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10546-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Through The Bible) Exodus 11-12",
            "url": "http:\/\/sermonindex.net\/SID6296",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 11-12",
            "topic": "",
            "description": "The Lord gave the Israelites favor in the site of the Egyptian people. Even the servants pleaded with Pharaoh to let Moses and the people go. People started to respect Moses and knew that his God was real. At Midnight the plague of the firstborn happened. It was from the least to the greatest and even the cattle. Life really begins with Jesus Christ. God says start counting here this is where things are really going to begin to start. The blood of the lamb in Egypt on the doorposts is a type of Christ. It is not be trodden underfoot thus the blood was to be on the side posts and the upper part of the door but not on the threshold (bottom part). The Passover was to be eaten in hast and was to eat and eat till you could not eat anymore. They needed all the strength and energy that they could store up. They had to eat it also as they were prepared to go. They ate on the ground with pillows in more of a relaxed setting rather then western formal ways to eat.",
            "download": "http:\/\/sermonindex.net\/SID6296-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "11"
                }
            ]
        }
    ]
}