{
    "name": "Exodus 17",
    "book": "Exodus",
    "chapter": 17,
    "sermons": [
        {
            "title": "(Exodus) Exodus 17:1-7",
            "url": "https:\/\/sermonindex.info\/SID10789",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:1-7",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10789-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "(Exodus) Exodus 17:8-12",
            "url": "https:\/\/sermonindex.info\/SID11565",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:8-12",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11565-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "A WAY OUT OF TROUBLE",
            "url": "https:\/\/sermonindex.info\/SID21111",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:11",
            "topic": "Radio Show",
            "description": "Do our lives bear witness to God even when we are in trouble? For most of us the opposite is probably true. We succumb to our problems and let them get the better of us! Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "https:\/\/sermonindex.info\/SID21111-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Desert Survival Series Pt 25- Moses The Servant of God",
            "url": "https:\/\/sermonindex.info\/SID20036",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:1-7",
            "topic": "Desert Survival",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20036-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "God At War With Flesh",
            "url": "https:\/\/sermonindex.info\/SID17542",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:6, Ephesians 1, Romans 8:14",
            "topic": "Flesh",
            "description": "Major Thomas uses quite a few Scripture to lead us to the realization that we have power over our flesh through Christ.   He wonderfully illustrates this with Moses and the “smitten rock” and Esau as being he devil incarnate.",
            "download": "https:\/\/sermonindex.info\/SID17542-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                },
                {
                    "book": "Ephesians",
                    "chapter": "1"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "God's Answer to the cry of Unbelief",
            "url": "https:\/\/sermonindex.info\/SID0768",
            "size": "11107840",
            "format": "mp3",
            "scripture": "Exodus 17:5-14",
            "topic": "Unbelief",
            "description": "The answer to our cry of unbelief is getting the rod of God into our hands, which Campbell explains is our need of the supernatural and heaven's anointing.  Are we men of vision, on the top of the hill like Moses, above the world and its ways?  \"The hand that holds the rod must be a clean hand,\" as well as empty and outstretched, Campbell teaches, if we will be rid of unreality in our Christian experience and be a transmitter of God's presence to others.",
            "download": "https:\/\/sermonindex.info\/SID0768-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Is The Lord Among Us, or Not",
            "url": "https:\/\/sermonindex.info\/SID20569",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:1-7",
            "topic": "Presence Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20569-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Is the Lord among us",
            "url": "https:\/\/sermonindex.info\/SID0769",
            "size": "14688768",
            "format": "mp3",
            "scripture": "Exodus 17:5-16",
            "topic": "Consecration",
            "description": "\"We all have our Amalek,\" Campbell says, but how do we react to hell's engagement?  Starting with a personal testimony seeing first hand the warfare of the devil in a crowded farmhouse packed with sinners seeking salvation, he segues into the vital necessity of character before God--clean hands and a pure heart.  Campbell repeatedly warns against the overemphasis of man in modern evangelism, hymns and even one's own consecration, pleading for God to be all in all.",
            "download": "https:\/\/sermonindex.info\/SID0769-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Jehovah-Nissi",
            "url": "https:\/\/sermonindex.info\/SID4479",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 17:8-16,Malachi 3:1-4,Numbers 14",
            "topic": "Names Of God",
            "description": "When Amalek fought Israel, God promised to have war with the generations of Amalek forever. This represented the forces of the devil against the purposes of God. The devil doesn't want you to enter into the rest of God. When you listen to the lies of the enemy and let him cause your faith to waver, you will remain in the wilderness, just as Israel did.",
            "download": "https:\/\/sermonindex.info\/SID4479-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "14"
                },
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Where Do I Stand With God",
            "url": "https:\/\/sermonindex.info\/SID1747",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 33:11, Exodus 17-23",
            "topic": "Struggling",
            "description": "God does not yell at us when we are struggling. It is His desire to see us \"strengthened in the inner man\" that we might walk \"in the Light\" as He is in the Light. This message is a rebuke to those who viciously thunder condemning messages to those struggling with sin. If listened to out of context, and with a wrong spirit, one might think Brother Wilkerson is saying that \"it doesn't matter if you sin.\"  He is not. Brother Wilkerson emphasizes the importance of delivering the FULL counsel of God - that although there is great \"severity\" if one does not surrender their life to Jesus, the Lord is also full of forgiveness and loving-kindness.  \"By lovingkindness and truth iniquity is atoned for, And by the fear of the LORD one keeps away from evil.\" Proverbs 16:6",
            "download": "https:\/\/sermonindex.info\/SID1747-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                },
                {
                    "book": "Exodus",
                    "chapter": "33"
                }
            ]
        }
    ]
}