{
    "name": "Exodus 21",
    "book": "Exodus",
    "chapter": 21,
    "sermons": [
        {
            "title": "(Exodus) Exodus 21:1-11",
            "url": "http:\/\/api.sermonindex.net\/SID11580",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:1-11",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11580-download",
            "speaker_name": "J. Vernon McGee",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(Exodus) Exodus 21:12-25",
            "url": "http:\/\/api.sermonindex.net\/SID11581",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:12-25",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11581-download",
            "speaker_name": "J. Vernon McGee",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(God and Man) Entering God's sabbath rest",
            "url": "http:\/\/api.sermonindex.net\/SID7230",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:1-6, 31:12-17, Hebrews 4:9",
            "topic": "Sabbath",
            "description": "What does it mean to rest from my works?  Brother Zac shares a lot of personal testimony of how the Lord brought him from a life of unrest and pleasing others to a life of rest in Him.",
            "download": "http:\/\/api.sermonindex.net\/SID7230-download",
            "speaker_name": "Zac Poonen",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Through The Bible) Exodus 21-22",
            "url": "http:\/\/api.sermonindex.net\/SID6300",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21-22",
            "topic": "",
            "description": "The Judges were people that took care of nominal judgments so moses wouldn’t be too busy answering small questions all day long. God gives guidelines for those who would be judges. The word for judges are elohim, for they are acting in the place of God, bringing Gods judgment on man and therefore acting in the place of God. When Jesus declared before Abraham was I am, then they are about to stone him, then he said did not the scriptures say you are God’s? It does not mean they are actually God’s but rather placed in a place of authority because God has called them to it. Elohim is not used exclusively for the God that created the heavens and the earth. Elohim really terms to the master passion and captivation of their life. The Mormons have built a whole doctrine of mans progression to God off these words of Jesus which obviously twist scriptures. In the end you will be able to go to a planet and start your own planet and others who didn’t make it to that high calling will be angels and other servants for the planet. Bringham Young brought this back one step and said Adam was a good Mormon, and became a God and that Adam is our God and the only God with what he has to do. This whole system is taken from one little verse has been made and came out of that one verse of scripture.",
            "download": "http:\/\/api.sermonindex.net\/SID6300-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        }
    ]
}