{
    "name": "Exodus 21",
    "book": "Exodus",
    "chapter": 21,
    "sermons": [
        {
            "title": "(Exodus) Exodus 21:1-11",
            "url": "http:\/\/sermonindex.net\/SID11580",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:1-11",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11580-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(Exodus) Exodus 21:12-25",
            "url": "http:\/\/sermonindex.net\/SID11581",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:12-25",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11581-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(God and Man) Entering God's sabbath rest",
            "url": "http:\/\/sermonindex.net\/SID7230",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:1-6, 31:12-17, Hebrews 4:9",
            "topic": "Sabbath",
            "description": "What does it mean to rest from my works?  Brother Zac shares a lot of personal testimony of how the Lord brought him from a life of unrest and pleasing others to a life of rest in Him.",
            "download": "http:\/\/sermonindex.net\/SID7230-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Through The Bible) Exodus 21-22",
            "url": "http:\/\/sermonindex.net\/SID6300",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21-22",
            "topic": "",
            "description": "The Judges were people that took care of nominal judgments so moses wouldn’t be too busy answering small questions all day long. God gives guidelines for those who would be judges. The word for judges are elohim, for they are acting in the place of God, bringing Gods judgment on man and therefore acting in the place of God. When Jesus declared before Abraham was I am, then they are about to stone him, then he said did not the scriptures say you are God’s? It does not mean they are actually God’s but rather placed in a place of authority because God has called them to it. Elohim is not used exclusively for the God that created the heavens and the earth. Elohim really terms to the master passion and captivation of their life. The Mormons have built a whole doctrine of mans progression to God off these words of Jesus which obviously twist scriptures. In the end you will be able to go to a planet and start your own planet and others who didn’t make it to that high calling will be angels and other servants for the planet. Bringham Young brought this back one step and said Adam was a good Mormon, and became a God and that Adam is our God and the only God with what he has to do. This whole system is taken from one little verse has been made and came out of that one verse of scripture.",
            "download": "http:\/\/sermonindex.net\/SID6300-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                }
            ]
        }
    ]
}