{
    "name": "Exodus 26",
    "book": "Exodus",
    "chapter": 26,
    "sermons": [
        {
            "title": "(Exodus) Exodus 26:1-14",
            "url": "http:\/\/sermonindex.net\/SID11597",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 26:1-14",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11597-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "(Exodus) Exodus 26:15-37",
            "url": "http:\/\/sermonindex.net\/SID11598",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 26:15-37",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11598-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "(Through The Bible) Exodus 26-29",
            "url": "http:\/\/sermonindex.net\/SID6302",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 26-29",
            "topic": "",
            "description": "In the tabernacle the furnishings of the tabernacle is to discussed. And also for the other parts of the temple, the loaves, altar, tables, etc. Now the Tabernacle itself is to be contrasted and it is thought to be more of a tent rather then a stone building. There are 2 large curtains of linen made and there are many cerebrum that are weaven into this fabric. These curtains are to be a picture of heaven, and there were golden rings put into the curtain so it could be hanged through a large pole over the top of the tabernacle. The tabernacle is a portable building and is to be moved when they moved. All the parts inside of the tabernacle where made to be moved. It was called the place of meeting, the place where the people are to meet God. Somewhere along the line we have gotten the wrong concept, the church is not Gods house. It is a place of meeting but it is not were God is restricted to. We are the church and its not the building.",
            "download": "http:\/\/sermonindex.net\/SID6302-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "26"
                }
            ]
        }
    ]
}