{
    "name": "Exodus 35",
    "book": "Exodus",
    "chapter": 35,
    "sermons": [
        {
            "title": "(Exodus) Exodus 35:1-35",
            "url": "http:\/\/api.sermonindex.net\/SID11628",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 35:1-35",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11628-download",
            "speaker_name": "J. Vernon McGee",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "35"
                }
            ]
        },
        {
            "title": "(Through The Bible) Exodus 35-40",
            "url": "http:\/\/api.sermonindex.net\/SID6305",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 35-40",
            "topic": "",
            "description": "One of the strongest traditions with the Jewish people still is the Sabbath day. It is Gods plan for us to rest and do nothing; we would be more healthily mentally physically, etc. We need to learn to relax more and not feel guilty about it. It is a gift for us to observe it, it is not just a spiritual commandment but it will help us physically. We should give to God out of a willing heart not of a reluctant heart. God does not want anything from you from money, time, and service. We force many people to serve in the church but it is better for God to just lead people into service in different parts of the church. In some churches they put pressure to give you more then you want to. We need to be willing to serve or give our money for it to be a gift. We cannot complain to God from our giving it must be done cheerfully. Never out of constraint or pressure, Calvary Chapel never pressures people to do it. This is the kind of giving and service God will honor. As many was were willing hearted came brought there gold and ornaments to God in exodus and this “willing” is the secret of giving. It cheapens God to beg people to support you.",
            "download": "http:\/\/api.sermonindex.net\/SID6305-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "35"
                }
            ]
        }
    ]
}