{
    "name": "Matthew 14",
    "book": "Matthew",
    "chapter": 14,
    "sermons": [
        {
            "title": "(John - Part 26): Jesus Walking on Water",
            "url": "https:\/\/sermonindex.info\/SID2113",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:22-33",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID2113-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "(Nicaragua) Do You Really Believe in Miracles?",
            "url": "https:\/\/sermonindex.info\/SID14607",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:22-33",
            "topic": "Miracles",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14607-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "(Through The Bible) Matthew 14-15",
            "url": "https:\/\/sermonindex.info\/SID6504",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14-15",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6504-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Beginning to Sink",
            "url": "https:\/\/sermonindex.info\/SID12253",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14",
            "topic": "Struggle",
            "description": "Mr Redpath confirms the difference between a joyous christian experience(in Christ), and the life of the unhappy Christian(still holding to self). But through it all, Jesus waits for us to say,\"Lord save me!\" Mr Redpath also speaks of his own struggles with God giving us great insight into the mercies, patience, of love of God. Are you a Galatians 2:20 saint, or a crossless christian?",
            "download": "https:\/\/sermonindex.info\/SID12253-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Christian Growth The Life of Brokenness",
            "url": "https:\/\/sermonindex.info\/SID7834",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:18, James 4:6, Judges 7:18-19, Matthew 14:19",
            "topic": "Brokenness",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7834-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "James",
                    "chapter": "4"
                },
                {
                    "book": "Judges",
                    "chapter": "7"
                },
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Do You Really Believe in Miracles",
            "url": "https:\/\/sermonindex.info\/SID13881",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:22-33",
            "topic": "Miracles",
            "description": "December 4, 2005. We have got to believe more than ever that Jesus is at work in our lives doing miracles. If we only see Jesus as a healer or only acknowledge Him for His power and might – we will fear Him but we wont necessarily understand His heart of compassion. We are good at giving people encouraging words , but what happens when it comes to ourselves? Do we have a heart that is hardened with doubt and unbelief?",
            "download": "https:\/\/sermonindex.info\/SID13881-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Knowing The Voice Of Jesus In Your Storm",
            "url": "https:\/\/sermonindex.info\/SID2776",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:22-33",
            "topic": "Storm Of Life",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID2776-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "One of the Master's Choice Sayings",
            "url": "https:\/\/sermonindex.info\/SID14352",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:16",
            "topic": "",
            "description": "“But Jesus said unto them, They need not depart.” — Matthew 14:16. OF course the Master was right, but he appeared to speak unreasonably. It seemed self-evident that the people very much needed to depart. They had been all day long hearing the preacher, the most of them had not broken their fast, and they were ready to faint for hunger. The only chance of their being fed was to let them break up into small parties, and forage for themselves among the surrounding villages. But our Lord declared that there was no necessity for them to go away from him, even though they were hungry, and famished, and in a desert place. Now, if there was no necessity for hungry hearers to go away, much less will it ever be needful for loving disciples to depart from him. If these, who were hearers only, - and the bulk of them were nothing more, a congregation collected by curiosity, and held together by the charm of his eloquence, and by the renown of his miracles, - if these needed not to depart, much leas need they depart who are his own friends and companions, his chosen and beloved. If the crowds needed not through hunger to depart bodily, much less need any of the saints depart spiritually from their Lord. There is no necessity that our communion with Christ should ever be suspended...",
            "download": "https:\/\/sermonindex.info\/SID14352-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "The Key That Locks The Door of Blessing",
            "url": "https:\/\/sermonindex.info\/SID25565",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 14:30, Matthew 17:20",
            "topic": "Blessing",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25565-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "14"
                },
                {
                    "book": "Matthew",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "The Life Of Brokenness ",
            "url": "https:\/\/sermonindex.info\/SID12763",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:18, Matthew 14:19",
            "topic": "Brokenness",
            "description": "William MacDonald ministers on the subject of brokenness. God has great purposes for broken people and cannot resist the humble. Broken things are honoured by the Word of God. God's ways are not mens ways. This is a challenging message on this vital subject for Christian living.",
            "download": "https:\/\/sermonindex.info\/SID12763-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        }
    ]
}