{
    "name": "Matthew 15",
    "book": "Matthew",
    "chapter": 15,
    "sermons": [
        {
            "title": "A CLEAN HEART",
            "url": "http:\/\/api.sermonindex.net\/SID8325",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:9-12",
            "topic": "",
            "description": "The heart is unclean because of the sin nature, believers need to be consecrated by faith, so that they are able to have the Holy Spirit abide in them at all times. O'Neill discusses the teaching of Jesus on how things that come into the body do not cause one to be unclean, but the things in the  person's heart that are unclean causes it.",
            "download": "http:\/\/api.sermonindex.net\/SID8325-download",
            "speaker_name": "Ernest ONeill",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Faith Victorious",
            "url": "http:\/\/api.sermonindex.net\/SID14350",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:21-28",
            "topic": "",
            "description": "Then Jesus went thence, and departed into the coasts of Tyre and Sidon. And, behold, a woman of Canaan came out of the same coasts, and cried unto him, saying, Have mercy on me, O Lord, thou Son of David, my daughter is grievously vexed with a devil. But he answered her not a word. And his disciples came and besought him, saying, Send her away; for she crieth after us. But he answered and said, I am not sent but unto the lost sheep of the house of Israel. Then came she and worshipped him, saying, Lord, help me. But he answered and said, It is not meet to take the children's bread, and to cast it to dogs. And she said, Truth, Lord: yet the dogs eat of the crumbs which fall from their masters' table. Then Jesus answered and said unto her, O woman great is thy faith: be it unto thee even as thou wilt. And her daughter was made whole from that very hour.' - Matthew 15:21-28. WE learn from this chapter, dear friends, that our Master was tired of battling with hypocrites and formalists, and therefore withdrew himself from them. They had come to him with their foolish charges that his disciples did not observe the traditions of the elders, and they made a great fuss about meats, and drinks, and washing of hands, and all sorts of trifles...",
            "download": "http:\/\/api.sermonindex.net\/SID14350-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Make A Difference",
            "url": "http:\/\/api.sermonindex.net\/SID24053",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:32-38",
            "topic": "Serving",
            "description": "God wants to use us - even if we have seemingly little to offer. He will also make provision when we seek to bless those around us. Matthew 15:32-38",
            "download": "http:\/\/api.sermonindex.net\/SID24053-download",
            "speaker_name": "Jim Cymbala",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Matthew 15:1",
            "url": "http:\/\/api.sermonindex.net\/SID7818",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:1",
            "topic": "Pharisees",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7818-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Religious But Lost - Professing Christians in Hell",
            "url": "http:\/\/api.sermonindex.net\/SID19994",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:8; 1 John 5:13",
            "topic": "False Conversion",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19994-download",
            "speaker_name": "John Musser",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Dispensation of the Gospel - Lesson 4",
            "url": "http:\/\/api.sermonindex.net\/SID7096",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:9-10",
            "topic": "",
            "description": "At the root of all spiritual declension (backsliding) is an inaccurate and unworthy conception of the character of God and an over estimate of man. Matthew 15:9,10 is a reference to Isaiah 29:13, which tells of a time when the leaders in Israel were teaching the fear of the LORD by the precept of men. In our times, like in the days of Israel, something has been lost in the Body of Christ and it is the reverence for a Holy God. Many do not fear Him. They have a Satanic pride and arrogance birthed from a Gospel of Humanism. Men worship a ‘God’ of their own making; a God who they feel is a means to their own end.",
            "download": "http:\/\/api.sermonindex.net\/SID7096-download",
            "speaker_name": "Robert Wurtz II",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Secret And Strength Of Revival Praying",
            "url": "http:\/\/api.sermonindex.net\/SID14491",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:21-28",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID14491-download",
            "speaker_name": "Ian Paisley",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The True Blessedness of the Child of God",
            "url": "http:\/\/api.sermonindex.net\/SID19827",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 16:6, Matthew 15:24",
            "topic": "Child Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19827-download",
            "speaker_name": "Philip Rudolph",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "16"
                },
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Weeding of the Garden",
            "url": "http:\/\/api.sermonindex.net\/SID13278",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:18",
            "topic": "",
            "description": "JESUS CHRIST had spoken certain truths which were highly objectionable to the Pharisees. Some of his loving disciples were in great fright, and they came to him and said, “Knowest thou not that the Pharisees are offended?” Now, our Savior, instead of making any apology for having offended the Pharisees, took it as a matter of course, and replied in a sentence which is well worthy to be called a proverb, — “Every plant, which my heavenly Father hath not planted, shall be rooted up.” Now we have oftentimes, as Mathew Henry very tritely remarks, a number of good and affectionate but very weak hearers. They are always afraid that we shall offend other hearers. Hence, if the truth be spoken in a plain and pointed manner, and seems to come close home to the conscience, they think that surely it ought not to have been spoken, because So-and-so, and So-and-so, and So-and so took offense at it. Truly, my brethren, we are not all slow to answer in this matter. If we never offended, it would be proof positive that we did not preach the gospel. They who can please man will find it quite another thing to have pleased God. Do you suppose that men will love those who faithfully rebuke them? If you make the sinner's heart to groan...",
            "download": "http:\/\/api.sermonindex.net\/SID13278-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        }
    ]
}