{
    "name": "Matthew 15",
    "book": "Matthew",
    "chapter": 15,
    "audio_sermons": [
        {
            "title": "A CLEAN HEART",
            "url": "http:\/\/sermonindex.net\/SID8325",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:9-12",
            "topic": "",
            "description": "The heart is unclean because of the sin nature, believers need to be consecrated by faith, so that they are able to have the Holy Spirit abide in them at all times. O'Neill discusses the teaching of Jesus on how things that come into the body do not cause one to be unclean, but the things in the  person's heart that are unclean causes it.",
            "download": "http:\/\/sermonindex.net\/SID8325-download",
            "preacher_name": "Ernest O'Neill",
            "preacher_image": "",
            "preacher_description": "Ernest O'Neill ( - )\r\nListen to freely downloadable audio sermons by the speaker Ernest O'Neill in mp3 format. Ernest W. O'Neill was born in Belfast, Northern Ireland in 1934 and educated at Queen's University, where he received a degree in English Literature - Stranmillis Training College, where he obtained a teaching diploma - and Edgehill Theological Seminary, where he received a degree in theology. After teaching English at Methodist College, he was ordained to the Methodist ministry in Ireland in 1960 and served churches there and in London, England before moving to the United States in 1963.\r\nErnest O'Neill pastored Methodist churches in Minneapolis for three years and taught English in a Christian Brothers' School for four years. He preached in Bethany Presbyterian Church at the University of Minnesota for four years. Then in 1970, he founded Campus Church in Minneapolis, an independent, non-denominational body, to demonstrate the intellectual validity and spiritual reality of Jesus Christ on a secular campus.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Faith Victorious",
            "url": "http:\/\/sermonindex.net\/SID14350",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:21-28",
            "topic": "",
            "description": "Then Jesus went thence, and departed into the coasts of Tyre and Sidon. And, behold, a woman of Canaan came out of the same coasts, and cried unto him, saying, Have mercy on me, O Lord, thou Son of David, my daughter is grievously vexed with a devil. But he answered her not a word. And his disciples came and besought him, saying, Send her away; for she crieth after us. But he answered and said, I am not sent but unto the lost sheep of the house of Israel. Then came she and worshipped him, saying, Lord, help me. But he answered and said, It is not meet to take the children's bread, and to cast it to dogs. And she said, Truth, Lord: yet the dogs eat of the crumbs which fall from their masters' table. Then Jesus answered and said unto her, O woman great is thy faith: be it unto thee even as thou wilt. And her daughter was made whole from that very hour.' - Matthew 15:21-28. WE learn from this chapter, dear friends, that our Master was tired of battling with hypocrites and formalists, and therefore withdrew himself from them. They had come to him with their foolish charges that his disciples did not observe the traditions of the elders, and they made a great fuss about meats, and drinks, and washing of hands, and all sorts of trifles...",
            "download": "http:\/\/sermonindex.net\/SID14350-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Make A Difference",
            "url": "http:\/\/sermonindex.net\/SID24053",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:32-38",
            "topic": "Serving",
            "description": "God wants to use us - even if we have seemingly little to offer. He will also make provision when we seek to bless those around us. Matthew 15:32-38",
            "download": "http:\/\/sermonindex.net\/SID24053-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Matthew 15:1",
            "url": "http:\/\/sermonindex.net\/SID7818",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:1",
            "topic": "Pharisees",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7818-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Religious But Lost - Professing Christians in Hell",
            "url": "http:\/\/sermonindex.net\/SID19994",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:8; 1 John 5:13",
            "topic": "False Conversion",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19994-download",
            "preacher_name": "John Musser",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Dispensation of the Gospel - Lesson 4",
            "url": "http:\/\/sermonindex.net\/SID7096",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:9-10",
            "topic": "",
            "description": "At the root of all spiritual declension (backsliding) is an inaccurate and unworthy conception of the character of God and an over estimate of man. Matthew 15:9,10 is a reference to Isaiah 29:13, which tells of a time when the leaders in Israel were teaching the fear of the LORD by the precept of men. In our times, like in the days of Israel, something has been lost in the Body of Christ and it is the reverence for a Holy God. Many do not fear Him. They have a Satanic pride and arrogance birthed from a Gospel of Humanism. Men worship a ‘God’ of their own making; a God who they feel is a means to their own end.",
            "download": "http:\/\/sermonindex.net\/SID7096-download",
            "preacher_name": "Robert Wurtz II",
            "preacher_image": "",
            "preacher_description": "Robert Wurtz II ( - )\r\nListen to freely downloadable audio sermons by the speaker Robert Wurtz II in mp3 format.  For almost 20 years I have served as a author and teacher of advanced biblical studies. My interests are the New Covenant, apologetics and classical revival. Native of the Kansas City, Mo area and reside now in Independence, MO with wife Anna.\r\nHe is the author of many books including the newest Televangelicalism. In this insightful and thought provoking book, Robert Wurtz II traces the history of Christian evangelism from the book of Acts to modern times. The contrast between pre-1900 and post-1900 evangelism is so sharp, that the book is divided into two sections: Part 1, the pre-Billy Sunday era and Part 2, the post-Billy Sunday evangelistic era. This book is a must-read for anyone that has concerns about issues such as \"the sinner's prayer\" or shallow concepts of conversion.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Secret And Strength Of Revival Praying",
            "url": "http:\/\/sermonindex.net\/SID14491",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:21-28",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14491-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The True Blessedness of the Child of God",
            "url": "http:\/\/sermonindex.net\/SID19827",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 16:6, Matthew 15:24",
            "topic": "Child Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19827-download",
            "preacher_name": "Philip Rudolph",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "16"
                },
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Weeding of the Garden",
            "url": "http:\/\/sermonindex.net\/SID13278",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 15:18",
            "topic": "",
            "description": "JESUS CHRIST had spoken certain truths which were highly objectionable to the Pharisees. Some of his loving disciples were in great fright, and they came to him and said, “Knowest thou not that the Pharisees are offended?” Now, our Savior, instead of making any apology for having offended the Pharisees, took it as a matter of course, and replied in a sentence which is well worthy to be called a proverb, — “Every plant, which my heavenly Father hath not planted, shall be rooted up.” Now we have oftentimes, as Mathew Henry very tritely remarks, a number of good and affectionate but very weak hearers. They are always afraid that we shall offend other hearers. Hence, if the truth be spoken in a plain and pointed manner, and seems to come close home to the conscience, they think that surely it ought not to have been spoken, because So-and-so, and So-and-so, and So-and so took offense at it. Truly, my brethren, we are not all slow to answer in this matter. If we never offended, it would be proof positive that we did not preach the gospel. They who can please man will find it quite another thing to have pleased God. Do you suppose that men will love those who faithfully rebuke them? If you make the sinner's heart to groan...",
            "download": "http:\/\/sermonindex.net\/SID13278-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "15"
                }
            ]
        }
    ]
}