{
    "name": "Matthew 20",
    "book": "Matthew",
    "chapter": 20,
    "sermons": [
        {
            "title": "(Through The Bible) Matthew 20-22",
            "url": "http:\/\/sermonindex.net\/SID6508",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 20-22",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6508-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "(basics) 19. Some More On Dead Works",
            "url": "http:\/\/sermonindex.net\/SID8129",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 28:15-68, Matthew 19:27, Matthew 20:1-15",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8129-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "28"
                },
                {
                    "book": "Matthew",
                    "chapter": "19"
                },
                {
                    "book": "Matthew",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "COME FOLLOW ME!",
            "url": "http:\/\/sermonindex.net\/SID21395",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 20:26",
            "topic": "Radio Show",
            "description": "God can only work when our hearts are open and when we don’t stand in His way! Yes, whoever wants God to do great things in his life must first be willing to go in a new direction. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21395-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Gifts",
            "url": "http:\/\/sermonindex.net\/SID5003",
            "size": "0",
            "format": "mp3",
            "scripture": "John 3:16, Matthew 20:28, Acts 20:35",
            "topic": "Gifts",
            "description": "Length: 40 minutes, 54 seconds. Evident in this message, entitled “Gifts,” is A. W. Tozer’s mastery of homiletics. From John 3:16, Matthew 20:28, Acts 20:35, he asks us to note four truths: 1) the father gave his Son, 2) the Son gave his life, 3) they did so in order that we might be ransomed, and 4) it is more blessed to give than to receive. Dr. Tozer then considers who we might want to thank some day for the gifts that they gave to Jesus. The wise men gave gold (lasting treasure), frankincense (worship), and myrrh (bitter sacrifice); Mary gave her mortal body; Joseph gave his faith; the shepherds gave their reverent wonder; Lazarus and his sisters, Mary and Martha, gave the welcome of their home; the women following Jesus gave a seamless, linen robe; and Joseph of Arimathaea gave his own, new grave. These are the gifts that they gave to Jesus. What might we give him that we might not be outdone in giving?",
            "download": "http:\/\/sermonindex.net\/SID5003-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "20"
                },
                {
                    "book": "Matthew",
                    "chapter": "20"
                },
                {
                    "book": "John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "God Meets The Need But Not The Greed ~ Matthew 20v1-16",
            "url": "http:\/\/sermonindex.net\/SID27958",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 20:1-16",
            "topic": "Greed",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27958-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Humility VS Pride",
            "url": "http:\/\/sermonindex.net\/SID17079",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 20:16, Psalm 75:5-7",
            "topic": "Pride",
            "description": "Brother Gehard shares on the diferences between humility and pride. God lifts up the humble person. He will be highly respected by his fellow man as he is with God. Humility is the opposite of self-centred pride. If you are humble, you consider yourself the servant of others. You do not feel or act superior to others and you are not a respecter of persons.",
            "download": "http:\/\/sermonindex.net\/SID17079-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "75"
                },
                {
                    "book": "Matthew",
                    "chapter": "20"
                }
            ]
        }
    ]
}