{
    "name": "Hosea 11",
    "book": "Hosea",
    "chapter": 11,
    "sermons": [
        {
            "title": "Hosea #7 Ch. 11-12 Hosea",
            "url": "http:\/\/sermonindex.net\/SID12114",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 11-12",
            "topic": "Hosea",
            "description": "Here in Hosea we find the troubled heart of the Lord for His people Israel, the Lord's love for humanity is one of the greatest mysteries, it is shown in God's fatherly attributes toward us, yet these attributes are not common in the Old Testament and so this revelation must have been astonishing to Hosea at the time.  The prophet began to discover that at the very heart of the almighty Creator was love and that God is love.  The Lord shows how His heart was torn for His people as He did not want to judge them but His holiness demanded it.  So judgement had to be prescribed upon the nation as they had commited idolatry in Bethel (the house of God) and this was a forshadowing of the abomination of desolation. We know that ultimately the Lord's love and justice met when His wrath was poured upon our Lord Jesus on the cross of Calvary.  How only His precious blood could atone for the wrong of not just Israel but for all of us.",
            "download": "http:\/\/sermonindex.net\/SID12114-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Awful Consequences of Backsliding",
            "url": "http:\/\/sermonindex.net\/SID4184",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 11:7, Jeremiah 5:6",
            "topic": "Backsliding",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4184-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "5"
                },
                {
                    "book": "Hosea",
                    "chapter": "11"
                }
            ]
        }
    ]
}