{
    "name": "Hosea 13",
    "book": "Hosea",
    "chapter": 13,
    "sermons": [
        {
            "title": "(Hosea) True Wisdom Turns Us Back to God",
            "url": "http:\/\/api.sermonindex.net\/SID11033",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 13-14",
            "topic": "",
            "description": "Israel had been greatly blessed by the Lord and yet as is the way with fallen man at times when the Lord is blessing us most our heart is far from Him, they had engaged in Baal worship and had even gone far enough as to worship Molech, which involved child sacrifice.  They had sent the Lord a message with their actions by showing they would only turn to Him when times where bad, so the Lord promised judgement so they would cry out to Him to save them once more.  The Lord makes great promises of deliverence to Israel even going so far as to say He will conquer death but if they would not turn to Him then they would go into exhile. The book of Hosea ends though not with judgement but with a great proclamation of the grace of God and that how if we would turn to Him with our whole hearts then He will shower us with His great mercies.",
            "download": "http:\/\/api.sermonindex.net\/SID11033-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Hosea #8 Ch. 13-14 Hosea",
            "url": "http:\/\/api.sermonindex.net\/SID12115",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 13-14",
            "topic": "Hosea",
            "description": "Israel was rooted in idolatry in that they had been worshipping golden calves in Bathel.  The Lord reminded Israel that He had brought them out of Egypt and out of bondage, and from this reminded them that He alone was their Saviour.  He shows them that He is their only Hope but they have stubbornly rejected Him and so their Saviour would be their Judge. Hosea beseeches the people to return to the Lord and repent. The Lord states that He will restore them to Him after they have repented, and the Lord would wonderfully take them back to Himself.  The prophecy of Hosea finishes with the ultimate repentence of Israel and turning back to the Lord and the Lord's acceptance of them which will herald the Second Coming.",
            "download": "http:\/\/api.sermonindex.net\/SID12115-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Los Angeles Conference #4",
            "url": "http:\/\/api.sermonindex.net\/SID0408",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 8:4,Hosea 13:10,Acts 13:21",
            "topic": "Conference",
            "description": "This message was delivered on 03\/01\/1962.",
            "download": "http:\/\/api.sermonindex.net\/SID0408-download",
            "speaker_name": "T. Austin Sparks",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "13"
                },
                {
                    "book": "Hosea",
                    "chapter": "13"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "8"
                }
            ]
        }
    ]
}