{
    "name": "Hosea 14",
    "book": "Hosea",
    "chapter": 14,
    "audio_sermons": [
        {
            "title": "A Message for America and Its Cultural Religion",
            "url": "http:\/\/sermonindex.net\/SID19327",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 14:1-9 ",
            "topic": "Prophetic Word",
            "description": "September 6, 2009 - America has made a tragic mistake by allowing the worship of Baalism into the House of The Lord. The god of prosperity has become the god of this age. How this must break the heart of God! The Lord doesn’t judge with any delight in His heart but He looks down on what was supposed to be His heritage and says I can't let this go on any longer! He absolutely will not let His people pursue a path that will lead to hell. God is calling His church to return to Him and allow Him to take away all the iniquity in us that would keep His life from flowing through His Body. When we get right with God the storms will come but His church will stand with His Glory upon us. The testimony of the true church of Christ will not be shaken!",
            "download": "http:\/\/sermonindex.net\/SID19327-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Prospect To Penitents",
            "url": "http:\/\/sermonindex.net\/SID4610",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 14:4-7",
            "topic": "Penitence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4610-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Walk in GodÂ´s way",
            "url": "http:\/\/sermonindex.net\/SID13353",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 3:5-6, Hosea 14:8-9",
            "topic": "God's Way",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13353-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "14"
                },
                {
                    "book": "Proverbs",
                    "chapter": "3"
                }
            ]
        }
    ]
}