{
    "name": "Hosea 3",
    "book": "Hosea",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "Christ and His Harlot Church",
            "url": "http:\/\/sermonindex.net\/SID1900",
            "size": "6037504",
            "format": "mp3",
            "scripture": "Hosea 1:2-3, Hosea 3:1-3",
            "topic": "Harlot Church",
            "description": "Taken from the book of Hosea, Wilkerson fishes for those who have backslidden.  This is a message about the grace of God and his waiting and wanting you back into his loving arms.",
            "download": "http:\/\/sermonindex.net\/SID1900-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "3"
                },
                {
                    "book": "Hosea",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Hosea #3 Ch. 4-5 Israel's Willful Ignorance",
            "url": "http:\/\/sermonindex.net\/SID12110",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 3",
            "topic": "Ignorance",
            "description": "In Hosea 4 the Lord lays the charges of Israels sin and open rebellion out for all to see, they included, idolatry (covetousness), lying stealing and adultery to name but a few because of this sin and Israels unrepentent attitude toward the Lord the Lord would set them aside for judgement and He laid the blame at the feet of the priests who had not instructed the people in the ways of the Lord and hence the Lord rejected the priesthood. Chapter 5 deals with the punishment for their crimes Hosea prophesied the Israel would fall and later on Judah would fall too, this is exactly what happened even though Judah were given 100 years longer than Israel.  The Lord passed judgement on Israel.  The final verse in chapter 5 is of particular note as it refers to Christs first coming as it mentions the Lord going and the returning (to Heaven) and returning again until Israel acknowledges their sin of rejecting their Messiah and then He will return to them.",
            "download": "http:\/\/sermonindex.net\/SID12110-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Unfailing Love",
            "url": "http:\/\/sermonindex.net\/SID9130",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 3:1",
            "topic": "Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9130-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "3"
                }
            ]
        }
    ]
}