{
    "name": "Hosea 4",
    "book": "Hosea",
    "chapter": 4,
    "sermons": [
        {
            "title": "(Hosea) Come, Let Us Return to the Lord",
            "url": "http:\/\/api.sermonindex.net\/SID11030",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4-6",
            "topic": "Repentance",
            "description": "Israel had sinned greatly against the Lord, they had forsaken the knowledge of God and thus truth and mercy had been lost from them, they thought they knew God and had becom familiar with him but they were wrong and had forgotten His laws and abandonded His ways and no longer submitted to Him.  The priest, whose charge it was to instruct the people in the ways of the ways of the Lord, had neglected their duty and no longer taught the people, for this God held them accountable.  The people of Israel had pushed God away so much that He would no longer warn them of their errors and He acctually departed from them in order to leave them their own devices. God's desire was that Israel would return to Him, and so Hosea wanted to lead the people in repentance towards the Lord for he knew that if the people would seek Him then He would be found of them.",
            "download": "http:\/\/api.sermonindex.net\/SID11030-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "American Church Buffet\t",
            "url": "http:\/\/api.sermonindex.net\/SID25030",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:17",
            "topic": "American Church",
            "description": "When somebody is searching for a church today, they usually ask the following questions to the church secretary or Pastor: Do you have a youth program? How many ball fields do you have? Do you have a fitness center and does it have basketball courts? Do you have a contemporary music program at your church and a good worship band? Do you have recovery groups for the divorced and drug-dependent? Do you have yoga classes? Do you have Zumba dance classes? In other words, a typical American family looking for a typical American church today approaches it like they do a buffet line in a restaurant with a smorgasbord of choices. In essence, they are saying, “Before I join your church let me see a menu and look over it to see if you can service my family the way I want you to.”",
            "download": "http:\/\/api.sermonindex.net\/SID25030-download",
            "speaker_name": "E.A. Johnston",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Forsaking God",
            "url": "http:\/\/api.sermonindex.net\/SID10227",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:6",
            "topic": "Rebellion",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10227-download",
            "speaker_name": "B.H. Clendennen",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "God's Controversy with the Backslidden Church",
            "url": "http:\/\/api.sermonindex.net\/SID4249",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:1-2",
            "topic": "Backsliding",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4249-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Hosea #4 Ch. 6 A Cake Not Turned",
            "url": "http:\/\/api.sermonindex.net\/SID12111",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4",
            "topic": "Repentance",
            "description": "The first 3 verses of chapter 6 is the prayer of repentence from Israel toward the Lord, where they will remember Him whom they pierced turn back to the Lord who is their Salvation.  Israel will realise that their years of affliction have been disciplinary in nature in order to bring them back into the loving arms of the Lord.  There will be a time of great tribulation for the nation of Israel that will culminate in the second advent of the Lord Jesus.  The rest of the chapter gets back into the teritory of God's charges against Israel, these include exploitation, injustice and the most abominable sexual sins, it is again more evidence of adulterous attitude of Israel toward the Lord, but also shows how we are toward Him aswell in running after our 'idols'.",
            "download": "http:\/\/api.sermonindex.net\/SID12111-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "What is Conscience",
            "url": "http:\/\/api.sermonindex.net\/SID0187",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:14, John 8, Romans 2:15",
            "topic": "Revival Theology",
            "description": "Brother Orr searches and explains exhaustively on what exactly the conscience is, what it does, and what can happen to it by ignoring it. \"But somebody else said to me,'Your conscience teaches right from wrong.' Does it? Always? The Scripture doesn't teach that. The Scripture speaks of a pure conscience, it often speaks of a rotten conscience.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0187-download",
            "speaker_name": "J. Edwin Orr",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "2"
                },
                {
                    "book": "John",
                    "chapter": "8"
                },
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        }
    ]
}