{
    "name": "Hosea 4",
    "book": "Hosea",
    "chapter": 4,
    "sermons": [
        {
            "title": "(Hosea) Come, Let Us Return to the Lord",
            "url": "http:\/\/sermonindex.net\/SID11030",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4-6",
            "topic": "Repentance",
            "description": "Israel had sinned greatly against the Lord, they had forsaken the knowledge of God and thus truth and mercy had been lost from them, they thought they knew God and had becom familiar with him but they were wrong and had forgotten His laws and abandonded His ways and no longer submitted to Him.  The priest, whose charge it was to instruct the people in the ways of the ways of the Lord, had neglected their duty and no longer taught the people, for this God held them accountable.  The people of Israel had pushed God away so much that He would no longer warn them of their errors and He acctually departed from them in order to leave them their own devices. God's desire was that Israel would return to Him, and so Hosea wanted to lead the people in repentance towards the Lord for he knew that if the people would seek Him then He would be found of them.",
            "download": "http:\/\/sermonindex.net\/SID11030-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "American Church Buffet\t",
            "url": "http:\/\/sermonindex.net\/SID25030",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:17",
            "topic": "American Church",
            "description": "When somebody is searching for a church today, they usually ask the following questions to the church secretary or Pastor: Do you have a youth program? How many ball fields do you have? Do you have a fitness center and does it have basketball courts? Do you have a contemporary music program at your church and a good worship band? Do you have recovery groups for the divorced and drug-dependent? Do you have yoga classes? Do you have Zumba dance classes? In other words, a typical American family looking for a typical American church today approaches it like they do a buffet line in a restaurant with a smorgasbord of choices. In essence, they are saying, “Before I join your church let me see a menu and look over it to see if you can service my family the way I want you to.”",
            "download": "http:\/\/sermonindex.net\/SID25030-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Forsaking God",
            "url": "http:\/\/sermonindex.net\/SID10227",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:6",
            "topic": "Rebellion",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10227-download",
            "preacher_name": "B.H. Clendennen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "God's Controversy with the Backslidden Church",
            "url": "http:\/\/sermonindex.net\/SID4249",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:1-2",
            "topic": "Backsliding",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4249-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Hosea #4 Ch. 6 A Cake Not Turned",
            "url": "http:\/\/sermonindex.net\/SID12111",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4",
            "topic": "Repentance",
            "description": "The first 3 verses of chapter 6 is the prayer of repentence from Israel toward the Lord, where they will remember Him whom they pierced turn back to the Lord who is their Salvation.  Israel will realise that their years of affliction have been disciplinary in nature in order to bring them back into the loving arms of the Lord.  There will be a time of great tribulation for the nation of Israel that will culminate in the second advent of the Lord Jesus.  The rest of the chapter gets back into the teritory of God's charges against Israel, these include exploitation, injustice and the most abominable sexual sins, it is again more evidence of adulterous attitude of Israel toward the Lord, but also shows how we are toward Him aswell in running after our 'idols'.",
            "download": "http:\/\/sermonindex.net\/SID12111-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "What is Conscience",
            "url": "http:\/\/sermonindex.net\/SID0187",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 4:14, John 8, Romans 2:15",
            "topic": "Revival Theology",
            "description": "Brother Orr searches and explains exhaustively on what exactly the conscience is, what it does, and what can happen to it by ignoring it. \"But somebody else said to me,'Your conscience teaches right from wrong.' Does it? Always? The Scripture doesn't teach that. The Scripture speaks of a pure conscience, it often speaks of a rotten conscience.\"",
            "download": "http:\/\/sermonindex.net\/SID0187-download",
            "preacher_name": "J. Edwin Orr",
            "preacher_image": "\/images\/j_edwin_orr.gif",
            "preacher_description": "J. Edwin Orr (1912 - 1987)\r\nListen to freely downloadable audio sermons by the speaker J. Edwin Orr in mp3 format. Brother Orr shared in an experience of revival in his youth as he traveled by faith and saw many powerful workings of God. After years of seeing personal revival and experiences in his ministry he studied the theme of historical revival to equip and teach the Church.\r\n\r\nHe published many books on the topic of subject of revival: \"Can God?\" \"Full Surrender\" and many others. He ministered cross-denoninationally in baptist, pentecostal, calvary chapel and in many other movements. He was also influential in the Campus Crusade for Christ organization.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "2"
                },
                {
                    "book": "John",
                    "chapter": "8"
                },
                {
                    "book": "Hosea",
                    "chapter": "4"
                }
            ]
        }
    ]
}