{
    "name": "Hosea 7",
    "book": "Hosea",
    "chapter": 7,
    "sermons": [
        {
            "title": "(Hosea) Reaping the Whirlwind",
            "url": "http:\/\/api.sermonindex.net\/SID11031",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 7-9",
            "topic": "",
            "description": "The Lord pronounced judgement against the nation of Isral and against it's capital city Samaria.  Hosea likened the nation to an unturned pancake, burnt on one side towards the world and undone or unprepared toward the Lord, hence they were good for nothing neither hot nor cold like the church of Laodicea in Revelation 3.  By this time in their history Israel had become established in their sin and had set up their own ungodly rulers.  Even though they continued to sacrifice to the Lord the Lord no longer accepted the sacrifices as they were given from an unrepentant heart. The southern nation of Judah now tursted in their fortified cities but these cities could not save them from the judgement of God.  These prophecies were given at a time of great material prosperity in the nation of Israel when the people must have thought that the Lord was blessing them but didn't care that their hearts were foul towards Him.",
            "download": "http:\/\/api.sermonindex.net\/SID11031-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Hosea #5 Ch. 7-8 Jesus Christ On Every Page",
            "url": "http:\/\/api.sermonindex.net\/SID12112",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 7-8",
            "topic": "",
            "description": "God sees, knows and remebers everything and this is a profoud attribute of our Lord, it is one of the most terrifying things for the unbeliever that God's eye is always upon their hearts, and ours, He is the one thats sets the standards.  Israel in Hosea time, like our society today, believed that right and wrong were relative concepts thatcould be correct for one person but not necessarily for another, this is of course is utterly wrong God is absolute and He defines right and wrong.  Several of the kings of Israel were assasinated and hence surrounding the ruler there were many men with blood on their hands, Israel had put it's faith in the neighbouring nations and not in the Lord.  Because they had cast god away He would cast them away.  They had replaced the service of God with a dead religion and so thought they could atone for their own sins and because of this God would not even accept their sacrifices to Him.",
            "download": "http:\/\/api.sermonindex.net\/SID12112-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "7"
                }
            ]
        }
    ]
}