{
    "name": "Proverbs 11",
    "book": "Proverbs",
    "chapter": 11,
    "sermons": [
        {
            "title": "(Through The Bible) Proverbs 11-15",
            "url": "https:\/\/sermonindex.info\/SID6427",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 11-15",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6427-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Are You A Soul Winner",
            "url": "https:\/\/sermonindex.info\/SID4135",
            "size": "72630272",
            "format": "mp3",
            "scripture": "Proverbs 11:30, 2 Corinthians 5:17-21",
            "topic": "Soul Winning",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4135-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                },
                {
                    "book": "Proverbs",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Evangelism Series - Part 1",
            "url": "https:\/\/sermonindex.info\/SID2467",
            "size": "10736128",
            "format": "mp3",
            "scripture": "Proverbs 11:30,John 4:34-35",
            "topic": "Evangelism",
            "description": "To pursue God's heart is to find a new value system for seeking wisdom rather than riches or your works. And scripture says \"He that winneth souls is wise\". When you are in love with Christ, it draws people to you. The joy it brings will make people around you sit up and take notice. And the joy of the Lord is your strength. Soul winning is the heart of Christ in you reaching out to the lost around you. Without intimate time alone with God you cannot be a soul winner.  You have to get close to God and be led by his Spirit.",
            "download": "https:\/\/sermonindex.info\/SID2467-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "4"
                },
                {
                    "book": "Proverbs",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Helps In Soul-Winning",
            "url": "https:\/\/sermonindex.info\/SID4131",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 11:30, Matthew 4:19",
            "topic": "Soul Winning",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4131-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "11"
                },
                {
                    "book": "Matthew",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Proverbs - Chapter 11",
            "url": "https:\/\/sermonindex.info\/SID5999",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 11",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID5999-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "11"
                }
            ]
        }
    ]
}