{
    "name": "Proverbs 14",
    "book": "Proverbs",
    "chapter": 14,
    "sermons": [
        {
            "title": "America's Only Hope",
            "url": "http:\/\/api.sermonindex.net\/SID26198",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34",
            "topic": "Righteousness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26198-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "National Religious Apostasy (4)",
            "url": "http:\/\/api.sermonindex.net\/SID16050",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Jeremiah 25:3-6, Jeremiah 2:10-13",
            "topic": "Apostasy",
            "description": "\"Righteousness exalts a nation; but sin is a reproach to any people.\" Proverbs 14:34. As a nation we have in large scale rejected the true and living God and have abandoned our godly heritage and the special light that came through mighty preachers in the past and formerly pious church denominations and have gone headlong into decadent humanism, deceptive liberalism, demonic occultism and a weak, man-centered, flesh-pleasing, fad-conforming evangelicalism. By doing so we have incurred a dreadful accountability as a nation before God. As a nation we must repent and plead for God to have mercy upon us.",
            "download": "http:\/\/api.sermonindex.net\/SID16050-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "25"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Our Nation’s Sexual Sins (3)",
            "url": "http:\/\/api.sermonindex.net\/SID16049",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Romans 1:18-32, Leviticus 18:1-30",
            "topic": "Sexual Sin",
            "description": "Our Nation is in serious spiritual need but in God's word, the Bible, we find answers to our moral and social problems as a nation. Sadly these days, our Nation is marked not only by an unrestrained and unashamed abandonment to sensuality but also by the putrid sin of sexual perversion. What is called sexual orientation and an alternative lifestyle today, God has always called an abomination, which he visits with severe judgment but from which he offers salvation.  In this message from God's Word to our Nation, we hear God's rebuke and denunciation for our nation's aggravated moral sins and a call to repentance and prayer. There is cleansing in the blood of Christ for all of our sexual sins. 1 Corinthians 6:9-11",
            "download": "http:\/\/api.sermonindex.net\/SID16049-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "18"
                },
                {
                    "book": "Romans",
                    "chapter": "1"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Protection From Backslidding",
            "url": "http:\/\/api.sermonindex.net\/SID4043",
            "size": "13910016",
            "format": "mp3",
            "scripture": "Proverbs 14:12-14",
            "topic": "Backslidding",
            "description": "In this message Keith Daniel lays out truth for Christians to get back to a vital reality with God. He states 3 ways that we will backslide and puts an emphasis on this truth for as a warning against backslidding: \"If you enter your day without soaking yourself in the word of GOD you WILL backslide.\"",
            "download": "http:\/\/api.sermonindex.net\/SID4043-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Proverbs - Chapter 14",
            "url": "http:\/\/api.sermonindex.net\/SID6002",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6002-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "THE TRANSFORMING POWER OF JESUS",
            "url": "http:\/\/api.sermonindex.net\/SID22836",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34",
            "topic": "Radio Show",
            "description": "God lives and works today! Is that hard for you to believe when you look at the world situation? Do you care about the world you live in? You can actually help to change the world’s situation today if you have faith! This meditation will explain how.",
            "download": "http:\/\/api.sermonindex.net\/SID22836-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        }
    ]
}