{
    "name": "Proverbs 16",
    "book": "Proverbs",
    "chapter": 16,
    "sermons": [
        {
            "title": "(Through The Bible) Proverbs 16-20",
            "url": "http:\/\/api.sermonindex.net\/SID6428",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 16-20",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6428-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Proverbs - Chapter 16",
            "url": "http:\/\/api.sermonindex.net\/SID6004",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 16",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6004-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Purity In A Wicked Age",
            "url": "http:\/\/api.sermonindex.net\/SID15641",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 16:6",
            "topic": "Pure Heart",
            "description": "David Wilkerson contends for purity in the midst of a wicked, perverse age where the world is encroaching the Church of the living God. There is a need to maintain purity in these days so that the Lamb of God will be glorified in the lives of Christians and the Gospel would have a testimony in this wicked age.",
            "download": "http:\/\/api.sermonindex.net\/SID15641-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Purity In A Wicked Age by David Wilkerson",
            "url": "http:\/\/api.sermonindex.net\/SID22184",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 16:6",
            "topic": "Classics Podcast",
            "description": "David Wilkerson contends for purity in the midst of a wicked, perverse age where the world is encroaching the Church of the living God. There is a need to maintain purity in these days so that the Lamb of God will be glorified in the lives of Christians and the Gospel would have a testimony in this wicked age.",
            "download": "http:\/\/api.sermonindex.net\/SID22184-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Trust in God - True Wisdom",
            "url": "http:\/\/api.sermonindex.net\/SID11519",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 16:20",
            "topic": "",
            "description": "A SERMON DELIVERED ON SUNDAY MORNING,\r\nMAY 12TH, 1861, BY REV. C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “He that handleth a matter wisely shall find good: and whoso trusteth in the Lord, happy is he.” — Proverbs 16:20. WISDOM is man's true path — that which enables him to accomplish best the end of his being, and which, therefore, gives to him the richest enjoyment, and the fullest play for all his powers. Wisdom is the compass by which man is to steer across the trackless waste of life. Without wisdom man is as the wild asses' colt; he runs hither and thither, wasting strength which might be profitably employed. Without wisdom, man may be compared to a soil untilled, which may yield some fair flowers, but can never field a harvest which shall repay the labor of the reaper, or even the toil of the gleaner. Give man wisdom, wisdom in the true sense of the term, and he rises to all the dignity that manhood can possibly know; he becomes a fit companion for the angels, and between him and God there is no creature; he standeth next to the Eternal One, because Christ has espoused his nature, and so has linked humanity with divinity. But where shall this wisdom be found? Many have dreamed that they discovered it, but they have not possessed it. Where shall we find it? ‘Twere worth while to pierce the bowels of the earth, to scale the heights of heaven, to traverse the deserts, to plough the sea, to fly through the illimitable fields of ether ...",
            "download": "http:\/\/api.sermonindex.net\/SID11519-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "16"
                }
            ]
        }
    ]
}