{
    "name": "Proverbs 4",
    "book": "Proverbs",
    "chapter": 4,
    "sermons": [
        {
            "title": "'Eyes Right'",
            "url": "https:\/\/sermonindex.info\/SID14343",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 4:25",
            "topic": "",
            "description": "“Let thine eyes look right on, and let thine eyelids look straight before thee.” Proverbs 4:25. THESE words occur in a passage wherein the wise man exhorts us to take care of all parts of our nature, which he indicates by members of the body. “Keep thy heart,” says he, “with all diligence; for out of it are the issues of life. Put away from thee a froward mouth, and perverse lips put far from thee. Let thine eyes look right on, and let thine eyelids look straight before thee. Ponder the path of thy feet, and let all thy ways be established. Turn not to the right hand nor to the left: remove thy foot from evil.” It is clear that every part of our nature needs to be carefully watched, lest in any way it should become the cause of sin. Any one member or faculty is readily able to defile all the rest, and therefore every part must be guarded with care. We have selected for our meditation the verse which deals with the eye. These windows of light need to be watched in their incomings, lest that which we take into our soul should be darkness rather than light; and they need to be watched in their outgoings, lest the glances of the eye should be full of iniquity, or should suggest foolish thoughts. Hence the wise man advises, “Let thine eyes look right on, and let thine eyelids look straight before thee.”",
            "download": "https:\/\/sermonindex.info\/SID14343-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Proverbs - Chapter 4",
            "url": "https:\/\/sermonindex.info\/SID5992",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 4",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID5992-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Responsibility",
            "url": "https:\/\/sermonindex.info\/SID14107",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 6:1-4, Proverbs 4:1-4",
            "topic": "Fatherhood",
            "description": "Drawing both from scripture and his own experience as a Christian father, Paul Washer plainly expounds the responsibilities of fathers to their own sons and daughters. Building on the foundational principle of Godly character and example, he gives practical explanations of what it means to not provoke to anger; to instruct and train; to discipline and encourage; and to recognise a child’s God-given abilities. Fathers must invest in their children, he exhorts;  “Don’t give them things, give them you”. (49 minutes)",
            "download": "https:\/\/sermonindex.info\/SID14107-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                },
                {
                    "book": "Proverbs",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Watch your heart - the wellspring of life",
            "url": "https:\/\/sermonindex.info\/SID14336",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 4:20 - 27",
            "topic": "",
            "description": "Why is it that people forsake the way of God?  They don't keep His word in their hearts and Satan deceives them.  If God speaks to you, write it down for this is life to a man's whole body.  It is wonderful if a person loves God.  Lukewarm Christians are a nuisance in the Church.  God's words are life and many die because they do not pay attention to God's word.  This is something that we must do continually.  The heart includes feelings, love and desire etc.  People put fences around their livestock.  In the same way, we need to put boundaries around our feelings and desires.  You can't go after everything your eyes sees.  Like Job, you have to make a covenant with your eyes and keep your eyes fixed on the goal or by sunset of the same day, you will already be derailed spiritually.  You'll mess around with young children if you do not guard your heart.",
            "download": "https:\/\/sermonindex.info\/SID14336-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "4"
                }
            ]
        }
    ]
}