{
    "name": "Proverbs 5",
    "book": "Proverbs",
    "chapter": 5,
    "sermons": [
        {
            "title": "(Godly Home) Part 25 - Joining the Next Generation",
            "url": "http:\/\/sermonindex.net\/SID7430",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 5:18-19, Genesis 1:18-22, Malachi 2:15",
            "topic": "Godly Home Series",
            "description": "Denny Kenaston gives five crucial reasons why parents must get involved with their children's choice of a marriage partner: false Christians, high divorce rate, powerful emotions, compatibility issues, and the rewards of a happy marriage.  Brother Denny also shares from the first marriage in the Garden of Eden why both physical and emotional virginity are so vital to safeguard, as well as some practical advice to some \"touchy issues\" such as sensuous clothes, flirting and \"the dating game\".",
            "download": "http:\/\/sermonindex.net\/SID7430-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "2"
                },
                {
                    "book": "Genesis",
                    "chapter": "1"
                },
                {
                    "book": "Proverbs",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Acharit: The Final End",
            "url": "http:\/\/sermonindex.net\/SID14227",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 5",
            "topic": "Immorality",
            "description": "Using an emphasis on the Hebrew word Aharit, Michael Brown delivers a piercing call to holiness from the word of God which disturbs the conscience and convicts the heart. God speaks an uncompromisingly strong, life-saving call to hold on for the final result of sin is personal destruction and ruin, which singles out the individual personally and reminds them that they must cling to Jesus or fall away.",
            "download": "http:\/\/sermonindex.net\/SID14227-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Are You Backsliding? (Part 2)",
            "url": "http:\/\/sermonindex.net\/SID14232",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 5",
            "topic": "Backsliding",
            "description": "This is the first hour of a two hour message given at the Brownsville Revival, which probes the hearts of those at the Revival and gives a desperate call not to be satisfied with manifestations of God’s presence, but to press on for personal, corporate and national transformation. Michael Brown gives a blunt and convicting message, encouraging the listeners to search their hearts and repent.",
            "download": "http:\/\/sermonindex.net\/SID14232-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Proverbs - Chapter 5",
            "url": "http:\/\/sermonindex.net\/SID5993",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 5",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5993-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "When Liars Stand Before Gods Throne",
            "url": "http:\/\/sermonindex.net\/SID1768",
            "size": "7077376",
            "format": "mp3",
            "scripture": "Acts 20:26-30, Proverbs 5:11-14",
            "topic": "Liars",
            "description": "This is an EXCELLENT message. A great challenge for all leaders, especially, but it should definitly be heard by all! This message deals with the dangers of not delivering the FULL counsel of God.",
            "download": "http:\/\/sermonindex.net\/SID1768-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "5"
                },
                {
                    "book": "Acts",
                    "chapter": "20"
                }
            ]
        }
    ]
}