{
    "name": "Proverbs 7",
    "book": "Proverbs",
    "chapter": 7,
    "audio_sermons": [
        {
            "title": "Proverbs - Chapter 7",
            "url": "http:\/\/sermonindex.net\/SID5995",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5995-download",
            "preacher_name": "Proverbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Witness of Truth",
            "url": "http:\/\/sermonindex.net\/SID16283",
            "size": "0",
            "format": "mp3",
            "scripture": "John 18:37-38, Proverbs 7:15",
            "topic": "Truth",
            "description": "Its one thing to tell people about God its another thing to be a living witness of His truth. Truth is an effective witness when our speech and actions are one. Truth has a confidence in God that believes He is in control and He works all circumstances for our good. When Truth stands before the unsaved and God begins to reveal Himself through our lives, the truth that is in us will force a man to search his heart. The man or woman that is a witness to truth shows a dying world that there us a Living God that bears witness to Himself through our lives.",
            "download": "http:\/\/sermonindex.net\/SID16283-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "7"
                },
                {
                    "book": "John",
                    "chapter": "18"
                }
            ]
        }
    ]
}