{
    "name": "Song of Solomon 1",
    "book": "Song of Solomon",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Through The Bible) Song of Solomon",
            "url": "https:\/\/sermonindex.info\/SID6433",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon 1",
            "topic": "Through The Bible",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6433-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Outline of Song Of Solomon - First 5 Revelations",
            "url": "https:\/\/sermonindex.info\/SID11429",
            "size": "0",
            "format": "mp3",
            "scripture": "Song_of_Solomon 1",
            "topic": "",
            "description": "This book is not about getting people to seek the Lord; it starts with people who are already passionately pursuing Him.  As the Bridegroom opens the eyes of the bride, she sees five things: who He is as Lord, who she is as dark, how she became over involved in men's work, following the true flock, and finding a tremendous liberty with the groom.  Ed Miller shows each revelation how it pertains to our growth in our union with Christ.",
            "download": "https:\/\/sermonindex.info\/SID11429-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Revival Series 2",
            "url": "https:\/\/sermonindex.info\/SID0783",
            "size": "9793024",
            "format": "mp3",
            "scripture": "Song of Solomon 1:6, Jude 20",
            "topic": "Revival",
            "description": "To be effective for others, we must tend our own spiritual lives first.. The chief means of building ourselves up in the most holy faith is praying in the Holy Spirit.",
            "download": "https:\/\/sermonindex.info\/SID0783-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Jude",
                    "chapter": "20"
                },
                {
                    "book": "Song of Solomon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Song Of Solomon #1 - Four General Observations About Song Of Solomon",
            "url": "https:\/\/sermonindex.info\/SID11395",
            "size": "0",
            "format": "mp3",
            "scripture": "Song_of_Solomon 1, Malachi 3:1",
            "topic": "",
            "description": "Ed Miller opens the series focusing upon the main themes of the book: a love story in two worlds, the climax of the redemptive experience on the earth, the many comings and goings of the Groom, and the progress of the bride with the Groom.  The heartbeat of Ed's message is your love affair with Jesus, entering into a real experience now of fresh comings of your Bridegroom!  (This series of messages delivered at Del-Mar-Va Men's Retreat in March, 2004).",
            "download": "https:\/\/sermonindex.info\/SID11395-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "Song of Solomon",
                    "chapter": "1"
                }
            ]
        }
    ]
}