{
    "name": "Song of Solomon 2",
    "book": "Song of Solomon",
    "chapter": 2,
    "audio_sermons": [
        {
            "title": "A Song Among the Lilies",
            "url": "http:\/\/sermonindex.net\/SID11517",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon 2:18",
            "topic": "",
            "description": "DELIVERED ON LORD'S-DAY MORNING, AUGUST 30TH, 1874, BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “My beloved is mine, and I am his: he feedeth among the lilies.” — Song of Solomon 2:16. LAST Sabbath, in our morning's sermon, we began at the beginning and described the turning point in which the sinner sets his face towards his God, and for the first time gives practical evidence of spiritual life in his soul. He bestirs himself, he goes to his Father's house, and speedily is pressed to his Father's bosom, forgiven, accepted, and rejoiced over. This morning we are going far beyond that stage, to a position which I may call the very crown and summit of the spiritual life. We would conduct you from the door-step to the innermost chamber, from the outer court to the Holy of Holies, and we pray the Holy Spirit to enable each one of us who have entered in by Christ Jesus, the door, to pass boldly into the secret place of the tabernacles of the Host High, and sing with joyful heart the words of our text, “My beloved is mine, and I am his.”  “For he is mine and I am his, The God whom I adore; My Father, Savior, Comforter, Now and for evermore.” The passage describes a high state of grace, and it is worthy of note that the description is full of Christ. This is instructive, for this is not an exceptional case, it is only one fulfillment of a general rule. Our estimate of Christ is the best gauge of our spiritual condition...",
            "download": "http:\/\/sermonindex.net\/SID11517-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Beware of the Angry Watchmen",
            "url": "http:\/\/sermonindex.net\/SID16289",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon 2:1-10, James 1:14, Song of Solomon 5:6-7",
            "topic": "Watchmen",
            "description": "October 28, 2007 - There is a false revival on the rise. It is the rise of the angry watchman who will cast stones at those who have gone astray from the Lord. This false revival consists of ministers who have led people away from the truth through legalism and a misguided prosperity gospel. They will forbid and command prodigals not to come into the presence of God until you work your way back into His favor through human effort and religion. We must not remove the veil from the bride of Christ. We have a righteousness that can not be taken away from us because Jesus is our veil.",
            "download": "http:\/\/sermonindex.net\/SID16289-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "2"
                },
                {
                    "book": "Song of Solomon",
                    "chapter": "5"
                },
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Man Who Missed Christ",
            "url": "http:\/\/sermonindex.net\/SID15410",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon 2:10; 1 Kings 11:4-14",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15410-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "2"
                }
            ]
        }
    ]
}