{
    "name": "Luke 1",
    "book": "Luke",
    "chapter": 1,
    "audio_sermons": [
        {
            "title": "(Luke) 02 - Zacharias",
            "url": "http:\/\/sermonindex.net\/SID15102",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1, Malachi 4:5-6",
            "topic": "Zacharias",
            "description": "What were the first words God spoke after His silence of 400 years? Zacharias the priest was the first to hear the Word of the Lord, yet despite his righteousness, he chose to be in unbelief. Ed Miller begins his study in Chapter 1 with contrasting Zacharias' unbelief with Mary's faith. With gentleness, he reminds all believers how easily we can fall into unbelief regardless of how close we walk with Him.",
            "download": "http:\/\/sermonindex.net\/SID15102-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Luke) 03 - Unbelief-Faith",
            "url": "http:\/\/sermonindex.net\/SID15103",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "",
            "description": "Ed Miller continues his study of unbelief vs. faith by re-emphasizing some key points. . With certainty, we will all experience moments of unbelief. Yet, be assured that God's will is not hindered by our unbelief, but it can rob us of the blessing. But, in hope, we can always turn to Him that continues to form simple, childlike faith in us as we follow our Saviour, our Teacher and the Hope of all mankind.",
            "download": "http:\/\/sermonindex.net\/SID15103-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Luke) 04 - Unbelief-Faith Of Mary",
            "url": "http:\/\/sermonindex.net\/SID15104",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "",
            "description": "In contrast to Zacharias' unbelief, he now presents Mary's faith and shows her to be a perfect model of the Church. She responds to the angel's pronouncement with child-like faith, with complete and total surrender and is a picture of humility. She is trusting that God the Father will form Christ in her. In the same way, His Church is to surrender and believe that He, by the power of the Holy Spirit, will produce the same miracle of forming the Christian life in us.",
            "download": "http:\/\/sermonindex.net\/SID15104-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Luke) 06 - Songs Of Mary & Zacharias",
            "url": "http:\/\/sermonindex.net\/SID15106",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "",
            "description": "Ed closes out chapter one pointing out Luke's strong emphasis on the Holy Spirit.  John the Baptizer pictures ministry, beginning with the Holy Spirit and being a forerunner for Jesus to follow after.  Mary is a picture of the Church and missions--bringing Christ to the world.  Elizabeth illustrates fellowship and Zacharias the restoration the Lord works after a time of unbelief.",
            "download": "http:\/\/sermonindex.net\/SID15106-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Luke)01 - Introduction",
            "url": "http:\/\/sermonindex.net\/SID15099",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:1-4, Acts 1:1",
            "topic": "",
            "description": "In the first part of his introduction, Ed Miller presents Luke in the context of the Bible. As the only Gentile author, Luke offers a unique perspective and Ed begins by outlining six main themes. He begins with Jesus' own pronouncement of Himself as the Son of Man, continues with His compassion for the downtrodden and through His relationship with women and children, He is presented as an impartial God who is truly the Saviour of all mankind.",
            "download": "http:\/\/sermonindex.net\/SID15099-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "Acts",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) Luke 1",
            "url": "http:\/\/sermonindex.net\/SID6522",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "Luke",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6522-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "44. What doth the preface to the ten commandments teach us?",
            "url": "http:\/\/sermonindex.net\/SID22398",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:74-75, 1 Peter 1:14-19",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22398-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Belfast Conference 1964-02 Luke 1;8",
            "url": "http:\/\/sermonindex.net\/",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:8",
            "topic": "Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/-download",
            "preacher_name": "Fred Condick",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Binding The Strongman",
            "url": "http:\/\/sermonindex.net\/SID4194",
            "size": "0",
            "format": "mp3",
            "scripture": "John 12:31, Luke 1:74-75",
            "topic": "Binding The Strongman",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4194-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "John",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Christ As Our King",
            "url": "http:\/\/sermonindex.net\/SID27524",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:31-33, John 18:33-37",
            "topic": "Christ",
            "description": "In his kingly office, the Lord Jesus subdues sinners and sets up his throne in their hearts.",
            "download": "http:\/\/sermonindex.net\/SID27524-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "John",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Christ Came To Make Men Holy",
            "url": "http:\/\/sermonindex.net\/SID20764",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:63-66",
            "topic": "Holiness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20764-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Church History - The Apostolic Church (33-100)",
            "url": "http:\/\/sermonindex.net\/SID6805",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:1-4, Ephesians 2:20",
            "topic": "",
            "description": "Christianity is more a religion based on factual eventsrather than philosophical supposition.  The death and ressurection of the Lord Jesus, the centre point of christianity, were factual events and these are the basis for our faith.  An ancient secular roman historian called Talus confirms the darkness that covered the earth following the death of the Lord Jesus, because he was alive at the time.  F.F. Bruce said that 'Anyone who propagates the idea that Jesus was a myth is neither a historian nor unbiased.' The distice features of the apostolic church were 1: the prescence of the foundational apostles 2:The unprecidented problems and victories of the church 3:The speed with which the Gospel spread 4:The transition of christianity from a branch of judaism to a seperate religion.",
            "download": "http:\/\/sermonindex.net\/SID6805-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "Ephesians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Jesus & The Holy Spirit",
            "url": "http:\/\/sermonindex.net\/SID8736",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "Holy Spirit",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8736-download",
            "preacher_name": "Don McClure",
            "preacher_image": "\/images\/don_mcclure.gif",
            "preacher_description": "Don McClure (1903 - )\r\nListen to freely downloadable audio sermons by the speaker Don McClure in mp3 format. I came to Christ at a Billy Graham Los Angeles Crusade in the 1960's. While completing my Bachelor of Science degree in Business Administration at Cal Poly Pomona, I sensed the call of God on my life to follow Jesus Christ completely and possibly forget business and prepare for the ministry.. Soon after that I met Alan Redpath who invited me and my wife Jean to England, where we attended Capernwray Bible School. Upon returning to the United States, I continued my studies at Talbot Seminary in La Mirada, California.\r\nEarly in my ministry, I served for four years as an assistant pastor to Chuck Smith at Calvary Chapel of Costa Mesa, California. Next Jean and I moved to Lake Arrowhead where we planted and pastored Calvary Chapel of Lake Arrowhead. During those years I founded Calvary Chapel Bible College in nearby Twin Peaks at the Calvary Chapel Conference Center (The college is now located in Murrieta Hot Springs). Sensing the Lord's direction to move on, we then pioneered and pastored another Calvary Chapel in Redlands, California, for eleven years. In 1991, we again, still having that pioneering heart, moved to San Jose with the heart to plant a number of churches in the Bay Area. There are now eight fellowships that have grown out of Calvary Chapel of San Jose. In September 2002, we responded to a request from Chuck Smith to return to Calvary Chapel of Costa Mesa to serve as an assistant. And, in 2004 we took to the leadership of Calvary Chapel of Laguna Beach to help guide it through a difficult time. That work being completed, we have now responded to a long time desire to step out and serve the churches and schools and missionaries that we love so much around the world. Which brings us now to Calvary Way Ministries.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Let God Be In You",
            "url": "http:\/\/sermonindex.net\/SID0280",
            "size": "5108736",
            "format": "mp3",
            "scripture": "Galatians 4, Luke 1:30",
            "topic": "Christ In Us",
            "description": "In the “fullness of time” God acts.  God knows everything about each one of us.  In this lesson we learn how we should deal with this and how to know we are “letting” God be in us.",
            "download": "http:\/\/sermonindex.net\/SID0280-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Living Without Fear",
            "url": "http:\/\/sermonindex.net\/SID15589",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:68-75",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15589-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Luke - Part 1",
            "url": "http:\/\/sermonindex.net\/SID2272",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1-5",
            "topic": "Luke",
            "description": "Zac mines the riches from Luke's Gospel, homing in the particular emphases such as being filled with the Holy Spirit and building the body of Christ.  The wise men, shepherds, Simeon and Anna  pictured the remnant of those who were ready when Christ came.  From Jesus' early life and ministry we learn such useful examples as getting to know God's word, having a passion for the Father's business, and getting alone with Him.",
            "download": "http:\/\/sermonindex.net\/SID2272-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Luke 1",
            "url": "http:\/\/sermonindex.net\/SID21832",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21832-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Mary´s treasure",
            "url": "http:\/\/sermonindex.net\/SID14310",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:26-45",
            "topic": "Mary",
            "description": "Mary was very young when Gabriel appeared to her and told her that she would give birth to the Messiah. This was a great experience for Mary and she wanted to share it with her friend, Elizabeth. Elizabeth was upright and served the Lord faithfully. Although Elizabeth was much older than Mary they could share deep spiritual things with one another. In spiritual matters, age does not matter; only one's spiritual state is important. It is a blessing when one's friend walks with God. Then people are united because of the things of God and can bear one another's burdens. However, be careful not to unite with others in evil, like Ananias and Sapphira (Acts 5). Although Mary was only a teenager, she delighted herself in the things of God. She was full of joy because God has finally sent the promised Messiah Who would bruise the serpent's head and bring forgiveness and true liberty. She hid God's words in her heart. The world and the things of the world lost its value, because heaven filled her heart.",
            "download": "http:\/\/sermonindex.net\/SID14310-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Men Whose Eyes Have Seen The King - Part 5",
            "url": "http:\/\/sermonindex.net\/SID0060",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:35,John 1:12,1 John 3:1-24",
            "topic": "Seeing Jesus",
            "description": "This message was delivered on 08\/01\/1959.",
            "download": "http:\/\/sermonindex.net\/SID0060-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "3"
                },
                {
                    "book": "John",
                    "chapter": "1"
                },
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Mormonism: An Antichristian System Which Blasphemes Christ",
            "url": "http:\/\/sermonindex.net\/SID16130",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:35",
            "topic": "Mormonism",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16130-download",
            "preacher_name": "Stephen Hamilton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Glorious Uncovered King of Israel",
            "url": "http:\/\/sermonindex.net\/SID13925",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6:14-23, Luke 1:27, Luke 1:32",
            "topic": "Servanthood",
            "description": "May 14, 2006 – Jesus Christ filled with compassion moved to bring the worship od God into the central core of humanity. There has to be an inner cry of every christian that desires to honor the Lord with their life. Jesus Christ will come and unveil Himself to the heart of a servant. Those who will serve with the lowest of the low.",
            "download": "http:\/\/sermonindex.net\/SID13925-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Power Of His Resurrection",
            "url": "http:\/\/sermonindex.net\/SID0282",
            "size": "5111296",
            "format": "mp3",
            "scripture": "Luke 1:30 ",
            "topic": "Resurrection",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0282-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "To Whom is the Arm of the Lord Revealed",
            "url": "http:\/\/sermonindex.net\/SID11557",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 17:5, Isaiah 40:10-11, Luke 1",
            "topic": "One True God",
            "description": "A sober address appropriate to all earnest inquirers after God and particularly to Jewish people and intellectuals who have had difficulty finding the one true God.",
            "download": "http:\/\/sermonindex.net\/SID11557-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Walking In the Power of the New Convenant",
            "url": "http:\/\/sermonindex.net\/SID3396",
            "size": "10542592",
            "format": "mp3",
            "scripture": "Luke 1:67-75",
            "topic": "",
            "description": "Wilkerson takes you on a thorough teaching of the New Covenant.  This is not milk and one should not even attempt this sermon without their Bible at ready.  Download this and listen to it several times and there is much to learn.",
            "download": "http:\/\/sermonindex.net\/SID3396-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "What Child Is This? Song Of Virgin Mary",
            "url": "http:\/\/sermonindex.net\/SID4742",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:39-56",
            "topic": "Birth Of Jesus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4742-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "What Child Is This? The Benedictus",
            "url": "http:\/\/sermonindex.net\/SID4744",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:67-69",
            "topic": "Benedictus",
            "description": "J. Glyn Owen speaks on the wonderful words of Zacharias that the Lord has come to redeem the people. The beginning of light is shining in the advent season, John the Baptist is showing the way to our Saviour.  The Benedictus was the song of thanksgiving uttered by Zechariah on the occasion of the circumcision of his son, John the Baptist. The canticle received its name from its first words in Latin (Benedictus Dominus Deus Israel, â€œBlessed be the Lord God of Israelâ€\u009d).",
            "download": "http:\/\/sermonindex.net\/SID4744-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "When Grace Comes",
            "url": "http:\/\/sermonindex.net\/SID26681",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:57-80",
            "topic": "Grace",
            "description": "This matter of the birth of John the Baptist is amazing. Jesus said of him that there were none born of women greater than he. He was filled with the Holy Spirit from his motherâ€™s womb. Even his birth was miraculous. His father Zacharias and mother Elizabeth were well advanced in age, well past child bearing age. But then God revealed Himself to Zacharias that they would bear a son and call him John, meaning the \"grace of God\". The birth of John was prophesied many years before. Isaiah who lived about 740 BC prophesied of his birth and so too Malachi, about 540 BC. One could have a whole sermon on Isaiahâ€™s prophesy and another of Malachiâ€™s. They prophesied how that John would be the forerunner of the Messiah.",
            "download": "http:\/\/sermonindex.net\/SID26681-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Who is he in yonder Stall?",
            "url": "http:\/\/sermonindex.net\/SID15390",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1-2",
            "topic": "Nativity",
            "description": "The message is important in that it provides a stark reminder of the true meaning of the coming of Christ: a baby born to die for the ransom of man's separated soul. There is such love and grace in brother Don's delivery.",
            "download": "http:\/\/sermonindex.net\/SID15390-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "You Will Soon Be Released from the Wilderness",
            "url": "http:\/\/sermonindex.net\/SID11910",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1:21-23",
            "topic": "Wilderness",
            "description": "November 13, 2005 - The wilderness is a place where we begin to realize without the strength and power of God we will not be able to go on. There has to be a determination in our heart to make ell tremble. Those who have learned in their wilderness experience to lean on the Lord will come out infused with His power and authority.",
            "download": "http:\/\/sermonindex.net\/SID11910-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        }
    ]
}