{
    "name": "Luke 16",
    "book": "Luke",
    "chapter": 16,
    "sermons": [
        {
            "title": "(Luke) 41 - Relationship-Chap16",
            "url": "https:\/\/sermonindex.info\/SID15141",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 15:3-7, Matthew 18:12-15, Luke 16",
            "topic": "Relationships",
            "description": "Luke 16 is one of the most 'thorny' chapters of the Bible, but the summary of it is relationship.  Ed points out four keys to help understand the parable of the unjust steward and how it underscores that relationships--with God and real friends--are more important than money.",
            "download": "https:\/\/sermonindex.info\/SID15141-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                },
                {
                    "book": "Luke",
                    "chapter": "15"
                },
                {
                    "book": "Matthew",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "(Through The Bible) Luke 16-17",
            "url": "https:\/\/sermonindex.info\/SID6531",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16-17",
            "topic": "Luke",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6531-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "A Prayer Meeting in Hell",
            "url": "https:\/\/sermonindex.info\/SID11532",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Prayer Meeting",
            "description": "The hopeless state of a lost soul in Hell. This sermon is powerful and true and the preacher bring out the plain truth that there is a hell to shun and a heaven to Gain.. he show also that there is torments in hell and no escape for those who got to hell.",
            "download": "https:\/\/sermonindex.info\/SID11532-download",
            "preacher_name": "Reginald Cranston",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "A Prayer from Hell",
            "url": "https:\/\/sermonindex.info\/SID16227",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Prayer",
            "description": "A simple, passionate gospel message on this sobering text of the Rich man and Lazarus. It speaks of our eternal destination and abode either in heaven or hell. What a sobering reality that there is prayer in hell.",
            "download": "https:\/\/sermonindex.info\/SID16227-download",
            "preacher_name": "Gary Kopfstein",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "A Sermon from Hell",
            "url": "https:\/\/sermonindex.info\/SID21365",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Hell",
            "description": "Scott Ardavanis delivers this message the Masters College chapel service. This message is a very sobering sermon on the doctrine of hell as he shows us the reality of hell in the Scriptures. Oh that this doctrine would change us and make us different Christians in our daily walk with the Lord.",
            "download": "https:\/\/sermonindex.info\/SID21365-download",
            "preacher_name": "Scott Ardavanis",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Escape to the Mountain",
            "url": "https:\/\/sermonindex.info\/SID4199",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 19:12-30,Luke 16:1-8,Psalm 121:1",
            "topic": "Overcoming",
            "description": "All through scripture, throughout the lives of various saints, the call to come up to the mountain to let him reveal his heart to you. Spiritual laziness and prayerlessness will lead to the loss of passion for Christ and the inability to feed the sheep from the treasure of the Word. We can't know the heart of God until we let God lead us to the place of crucifixion of self. Let him preserve you from selfishness, and settling for less than he has for you. We are called to overcome, to rise above the beggardly elements of this world and stand victorious.",
            "download": "https:\/\/sermonindex.info\/SID4199-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "121"
                },
                {
                    "book": "Luke",
                    "chapter": "16"
                },
                {
                    "book": "Genesis",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "God's Bloodhound",
            "url": "https:\/\/sermonindex.info\/SID15644",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Misconceptions",
            "description": "Rolfe Barnard speaks with power and authority against many misconceptions and falsities found in the Church of Jesus Christ. He takes us on a journey to hell with Abraham too see that hell is eternal and everlasting. This sermon will move and impact you for eternity.",
            "download": "https:\/\/sermonindex.info\/SID15644-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "God's Bloodhound by Rolfe Barnard",
            "url": "https:\/\/sermonindex.info\/SID15709",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Podcast",
            "description": "Rolfe Barnard speaks with power and authority against many misconceptions and falsities found in the Church of Jesus Christ. He takes us on a journey to hell with Abraham too see that hell is eternal and everlasting. This sermon will move and impact you for eternity.",
            "download": "https:\/\/sermonindex.info\/SID15709-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Hell",
            "url": "https:\/\/sermonindex.info\/SID20759",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Hell",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20759-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Hell",
            "url": "https:\/\/sermonindex.info\/SID15688",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:23",
            "topic": "Hell",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15688-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Hell: Isn't the God of Christianity an angry Judge?",
            "url": "https:\/\/sermonindex.info\/SID22510",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Hell",
            "description": "The Christian understanding of hell gives us insight into the danger of our own hearts. It also gives us resources to live in peace in the world, and to know the love of God who suffered hell for us.",
            "download": "https:\/\/sermonindex.info\/SID22510-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Luke 16:19",
            "url": "https:\/\/sermonindex.info\/SID7685",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19",
            "topic": "Lazarus",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7685-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Marriage, Mistakes & Money",
            "url": "https:\/\/sermonindex.info\/SID2401",
            "size": "10707968",
            "format": "mp3",
            "scripture": "Luke 16",
            "topic": "Marriage",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID2401-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Pharisees",
            "url": "https:\/\/sermonindex.info\/SID20854",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16",
            "topic": "Pharisees",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20854-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Revival Is Also Being Faithful In The Small Things",
            "url": "https:\/\/sermonindex.info\/SID24894",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:10",
            "topic": "Faithfulness",
            "description": "Brother Alan speaks of how God always works with small things first before large things. And though we agree that larger works of God in revival can happen. We must first be willing to see faithfulness in the small things in our own lives. Personal revival and a sense of the Lord working through our own lives in a manifest way. An timely encouragement for us who pray for revival to seek to be faithful in our own lives daily.",
            "download": "https:\/\/sermonindex.info\/SID24894-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Burning Hell That Jesus Preached",
            "url": "https:\/\/sermonindex.info\/SID27971",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Hell",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27971-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Cry From Hell",
            "url": "https:\/\/sermonindex.info\/SID10942",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:27-28",
            "topic": "Hell",
            "description": "There is a Cry that eminates from the very pit of Hell that can be summed up in 2 words, 'Send!.. lest'. Those that are eternally damned cry that God would Send believers out into the harvest, Lest their own loved ones should join them in the pit. Pastor Legge shows how we need to have a deep compassion for the world around us.a dn also how we need to travail in prayer with almighty God until we prevail. the question remians do we have the 'Ear of faith' to hear the Cry from Hell?\r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "https:\/\/sermonindex.info\/SID10942-download",
            "preacher_name": "David Legge",
            "preacher_image": "",
            "preacher_description": "David Legge ( - )\r\nListen to freely downloadable audio sermons by the speaker David Legge in mp3 format. David Legge is a Christian evangelist, preacher and Bible teacher. He served as Assistant Pastor at Portadown Baptist Church before taking up the Pastorate of the Iron Hall Assembly in Belfast, N. Ireland, where he ministered from 1999-2008. He knows has an internant ministry across the world you can access messages and request him as a speaker at the Preach The Word website.\r\n\"Like Israel, who are a type, I believe, in many respects of God's people today: we have been transferred from bondage, the kingdom of darkness, the kingdom of Satan, and we have been placed into the kingdom of light, the kingdom of God's dear Son... and yet many believing New Testament Christians never cross the Jordan. They settle for less than God intended for them. I have to say that there can even be resentment, or resistance, shown toward anyone who will try to get God's people over the Jordan and into their inheritance.\" - David Legge",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Cry From Hell by David Legge",
            "url": "https:\/\/sermonindex.info\/SID19092",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:27-28  ",
            "topic": "Podcast",
            "description": "There is a Cry that eminates from the very pit of Hell that can be summed up in 2 words, 'Send!.. lest'. Those that are eternally damned cry that God would Send believers out into the harvest, Lest their own loved ones should join them in the pit. Pastor Legge shows how we need to have a deep compassion for the world around us.a dn also how we need to travail in prayer with almighty God until we prevail. the question remians do we have the 'Ear of faith' to hear the Cry from Hell?",
            "download": "https:\/\/sermonindex.info\/SID19092-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Great Change",
            "url": "https:\/\/sermonindex.info\/SID18694",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19â€“31",
            "topic": "Change",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18694-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Rich Man and Lazarus",
            "url": "https:\/\/sermonindex.info\/SID0309",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Lazarus",
            "description": "There is contrast in this life between the splendor of the rich man and the poverty of Lazarus; there is also the contrast of complete reversal of condition for each man when he dies; God's tender care in the ministry of angels at death; Lazarus was brought into intimate relationship to the saints in heaven; the rich man's torments in hell were so extreme that he desired even a momentary alleviation; the condition of each man after death cannot be changed; the rich man's request that a messenger from the dead be sent to warn his brothers insinuates that God had been unjust in not giving more opportunity for repentance; but messengers from the dead would not bring us to repentance if we will not hearken to the warnings of Scripture.",
            "download": "https:\/\/sermonindex.info\/SID0309-download",
            "preacher_name": "John Murray",
            "preacher_image": "\/images\/john_murray.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Secret Of Devotion",
            "url": "https:\/\/sermonindex.info\/SID7342",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 2:15, Luke 16:13",
            "topic": "Devotion",
            "description": "When Christians find themselves gravitating to the world, it is because they have not yet found a satisfying life in Christ.  Have you experienced the \"expulsive power of a new affection\"?  Brother Zac shares ways to kindle a true hunger for Christ by meditating on how much He suffered for you on the cross, getting into fellowship with those who have a fervent love for Jesus, giving up whatever takes away your hunger for God, and others.",
            "download": "https:\/\/sermonindex.info\/SID7342-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                },
                {
                    "book": "1 John",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Voice of the Lost",
            "url": "https:\/\/sermonindex.info\/SID0243",
            "size": "4251648",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Lost Souls",
            "description": "The Rich Man had the voice of a lost soul finally realizing his irreversible predicament. Even in hell, he tried to reach out to others so they wouldn’t share his unspeakable fate. Dr. Tozer uses the story of Lazarus and the Rich Man to illustrate the Truth that a person’s final destination does not depend on whether he is rich or poor. He says they’re in Heaven or hell simply because that is where they belong.",
            "download": "https:\/\/sermonindex.info\/SID0243-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Word In A Recession",
            "url": "https:\/\/sermonindex.info\/SID18630",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6:24, Luke 16:13, Matthew 6:33",
            "topic": "Recession",
            "description": "Zac Poonen shares during a time of recession that God is allowing this to test and see if we are serving mammon as a God. Why should it disturb us if Mammon is shaking? We should be content that the kingdom of God principles are the same in our day. Brother Zac talks about a Babylonian church system that does not serve Christ. A very important message in our times.",
            "download": "https:\/\/sermonindex.info\/SID18630-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "True Discipleship - Part 4",
            "url": "https:\/\/sermonindex.info\/SID7441",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:1-15",
            "topic": "Discipleship",
            "description": "This six part series on discipleship is a counterpart of the book written by William MacDonald called: \"True Discipleship.\" This sermon series gets to the heart of the biblical definition of discipleship. This is a life-changing series that will challenge you to the core of your being. We need to re-examine our commitment to the Lord Jesus Christ in our day, may God have full-hearted disciples that have counted the cost fully and give all to the great calling of discipleship.",
            "download": "https:\/\/sermonindex.info\/SID7441-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        }
    ]
}