{
    "name": "Luke 17",
    "book": "Luke",
    "chapter": 17,
    "sermons": [
        {
            "title": "(Church of Cain) The Church Of Cain - Part 1",
            "url": "http:\/\/sermonindex.net\/SID13625",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 4, Luke 17:26-30",
            "topic": "Cain",
            "description": "As parents are we producing children of Cain or children of Abel?  Ralph Sexton contrasts Cain and Abel to today, especially in light of Jesus' words that His coming would be at a time like the days of Noah.",
            "download": "http:\/\/sermonindex.net\/SID13625-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Luke) 42 - Encouraging Faith",
            "url": "http:\/\/sermonindex.net\/SID15142",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:1-19",
            "topic": "",
            "description": "Verses 1-10 of Luke 17 serve as a warning of being a stumbling block of discouraging faith in the little ones (Christians) that trust in Jesus.  The important thing about faith is the Object of your faith; faith lays hold of God who does impossible things!  Ed shows from the healing of the ten lepers that the one who returned emphasizes the heart obedience that blesses Christ as contrasted with the nine who only followed the letter of the command.",
            "download": "http:\/\/sermonindex.net\/SID15142-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Abraham and Lot",
            "url": "http:\/\/sermonindex.net\/SID0128",
            "size": "8566112",
            "format": "mp3",
            "scripture": "Luke 17:32, Genesis 6:5",
            "topic": "Worldliness",
            "description": "The Scripture focus of this message is Luke 17:32, with references to Genesis 6:5, and others referring to Abraham and Lot (Gen: 13:12, 18:17 and multiple references out of chapter 19). There is a warning in this message related to the modern church, in that we have access to all that we need today to live in God's will, just as did Lot, his wife, and daughters, who willfully turned away, though they were closely related to Abraham. Brother Len quotes Romans 1 from Phillip's translation. Classic Ravenhill: \"I'm angry with Lot. Wait 'til I see him. I'll tell him off, I'll tell you that.\"",
            "download": "http:\/\/sermonindex.net\/SID0128-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Are You Ready For the Coming of Jesus",
            "url": "http:\/\/sermonindex.net\/SID4284",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:37-51,Luke 17:28-30,1 Thessalonians 4:16-18",
            "topic": "Second Coming",
            "description": "The Lord is concerned over his Bride. He's urging by his Holy Spirit his Bride to be preparing, getting ready to leave, wean yourself from the things of this world now. It's going to be an ordinary day, when people are just going about their buisness as usual when he comes, just as it was in Noah's and Lot's day. You have been made ruler over your house; are you watching for their souls as one who must give account?",
            "download": "http:\/\/sermonindex.net\/SID4284-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "As In The Days Of Noah & Lot",
            "url": "http:\/\/sermonindex.net\/SID3788",
            "size": "12083200",
            "format": "mp3",
            "scripture": "Luke 17:26-28,Genesis 6:3-8,Proverbs 1:20-25",
            "topic": "Noah",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3788-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "1"
                },
                {
                    "book": "Genesis",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Do Not Sell The Gospel\t",
            "url": "http:\/\/sermonindex.net\/SID22631",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:26-33, Luke 18:9-14",
            "topic": "Prosperity Preaching",
            "description": "Paul renounced the pursuit of money as the goal of ministry and so received fewer physical pleasures. And he renounced the pursuit of morality as the way to be justified and so he received more physical persecution. He preached Christ and let the chips fall where they would, whether he received money or beatings. We, too, should not be in the ministry in order to make money or avoid trouble. Regardless of the consequence, let us preach Jesus as the only satisfying treasure and the only sufficient obedience.",
            "download": "http:\/\/sermonindex.net\/SID22631-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Luke",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Dying to Self (Part 1 of 2)",
            "url": "http:\/\/sermonindex.net\/SID4382",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 17:8-16, Luke 12:35-37, Luke 17:7-10",
            "topic": "",
            "description": "In this age of self-seeking and comfortable living, Keith shows that dying to self is not an option in the Christian life - it is the Christian life! A must for every Christian seeking to draw closer to God. Self-Denial is one of the most neglected themes of scriptural teaching in our day but it is crucial for salvation to experience this truth.",
            "download": "http:\/\/sermonindex.net\/SID4382-download",
            "preacher_name": "Keith Green",
            "preacher_image": "\/images\/keith_green.gif",
            "preacher_description": "Keith Green (1953 - 1982)\r\nListen to freely downloadable audio sermons by the speaker Keith Green in mp3 format. Well known for his concerts and musical career. He never charged for his albums. The Lord led him to start a ministry called Last Days Ministries in Lindale, Texas. They produced a periodical magazine that was read by many with a wide-distribution.\r\nKeith Green was influenced and mentored personally by Leonard Ravenhill who lived in the same area. He had a great love for the teachings of Charles Finney, William Booth and others and shared their writings in his ministry with many young people. Keith died in a sudden plane crash, Melody his wife continues to run LDM today.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "17"
                },
                {
                    "book": "Luke",
                    "chapter": "12"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Governed by the Word of God 1 of 2",
            "url": "http:\/\/sermonindex.net\/SID4302",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 9:6-8,Luke 17:21,Isaiah 30:9-14",
            "topic": "Word Of God",
            "description": "Far worse than a nation despising the Word of God is a professing believer who lightly esteems the Word of God and refuses to submit to it, not bothering to read it much. They leave themselves open to deception. Brokenness and trembling at the Word of God will lead to healing. This he will honor and draw near to in any heart.",
            "download": "http:\/\/sermonindex.net\/SID4302-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "30"
                },
                {
                    "book": "Isaiah",
                    "chapter": "9"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Licking Fish",
            "url": "http:\/\/sermonindex.net\/SID3200",
            "size": "7852544",
            "format": "mp3",
            "scripture": "Mark 6:30-38,John 6:6,Luke 17:5-6",
            "topic": "",
            "description": "This message is about walking with the Lord in faith. We need to realize we do not have in ourselves the resources to do what we are commanded to do and have faith in God. He is our Resource. He says doubt not in your heart, don't trust in yourself for the kingdom of God is in you but not of you or about you. This will encourage those who like the disciples need their faith increased.",
            "download": "http:\/\/sermonindex.net\/SID3200-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Looking In Three Directions",
            "url": "http:\/\/sermonindex.net\/SID19263",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:22, Luke 21:26",
            "topic": "End Of The World",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19263-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Luke",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Lord Break Me",
            "url": "http:\/\/sermonindex.net\/SID12521",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:7",
            "topic": "Brokenness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12521-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Men Like Noah",
            "url": "http:\/\/sermonindex.net\/SID20713",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:20-27",
            "topic": "Noah",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20713-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Prophecy Of Jesus",
            "url": "http:\/\/sermonindex.net\/SID20570",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:20-30, Luke 21:25, Genesis 6:5-13",
            "topic": "Jesus Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20570-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Luke",
                    "chapter": "21"
                },
                {
                    "book": "Genesis",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Remember Lot's Wife",
            "url": "http:\/\/sermonindex.net\/SID19172",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:32",
            "topic": "Worldliness",
            "description": "Walid Bitar gives a very powerful message towards us as Christians living as Christians without worldliness. He states that much of the professing Church are living like the heathens in the world. There is a need for us to put away this corruption and live like the new man in these last days!",
            "download": "http:\/\/sermonindex.net\/SID19172-download",
            "preacher_name": "Walid Bitar",
            "preacher_image": "",
            "preacher_description": "Walid Bitar ( - )\r\nListen to freely downloadable audio sermons by the speaker Walid Bitar in mp3 format. Walid Bitar is a HeartCry Missionary \/ Church Planter who lives and serves the Lord in Lebanon. Walid came to the US as a drug addict in the 70's but was brought to Christ by soveriegn grace. After attending Bible College in California, God called him to return to his native land in order to share the Gospel with his people. Walid hands out Bibles and shares the mercy of Christ with whomever will listen.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Remember Lot's Wife by Walid Bitar",
            "url": "http:\/\/sermonindex.net\/SID19173",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:32",
            "topic": "Podcast",
            "description": "Walid Bitar gives a very powerful message towards us as Christians living as Christians without worldliness. He states that much of the professing Church are living like the heathens in the world. There is a need for us to put away this corruption and live like the new man in these last days!",
            "download": "http:\/\/sermonindex.net\/SID19173-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "TRUE GRATITUDE",
            "url": "http:\/\/sermonindex.net\/SID21236",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:15-16",
            "topic": "Radio Show",
            "description": "Have we ever thanked God from the bottom of our hearts? Someone once said, “The way to receive, is to give thanks.” And these words are especially true when it comes to experiencing the reality of God. This meditation can help our hearts to become thankful again. And thankful people are happy and rich. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21236-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Thank You Lord",
            "url": "http:\/\/sermonindex.net\/SID24202",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:11-19, Romans 1:18- 21",
            "topic": "Thankfulness",
            "description": "An ungrateful heart can lead us to away from God. So many times we look to Jesus for help and He comes through. But we should give the Lord thanks for what He has done in our lives. Luke 17:11-19; Romans 1:18- 21; Psalm 100:4",
            "download": "http:\/\/sermonindex.net\/SID24202-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Last Days of the Wicked and the Righteous",
            "url": "http:\/\/sermonindex.net\/SID14624",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:20-37",
            "topic": "Last Days",
            "description": "January 21, 2007 - There is a season coming when everything that is not Christ's will be washed away. Society will not be aware of these times. These are days when the gospel that speaks of the Cross and living righteously for God will be ignored. There will be many who have walked with Jesus and they will fall away from truth. In this generation there has to be a cry in our hearts that says, \"Jesus give me the courage not to go back to what I left behind.\" There is an anointing that will be released in those that have this cry and God will be glorified in and through their lives.",
            "download": "http:\/\/sermonindex.net\/SID14624-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "What Lies Ahead?",
            "url": "http:\/\/sermonindex.net\/SID10215",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:27",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10215-download",
            "preacher_name": "Welcome Detweiler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        }
    ]
}