{
    "name": "Luke 20",
    "book": "Luke",
    "chapter": 20,
    "audio_sermons": [
        {
            "title": "(Luke) 50 - Trinity Revelation-Patience-Image Of God",
            "url": "http:\/\/sermonindex.net\/SID15150",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 20:1-26",
            "topic": "",
            "description": "Ed examines the first 3 of 5 clashes between Jesus and the religious leaders (in chapter 20) from two viewpoints: from the level of earth and from the heart of God.  Bigger than the question of authority is the principle of revelation.  Christ will always be silent to those who do not seriously want to know the truth.  In the parable of the wicked vinedressers, though it pictures the judgment upon unfaithful Israel, more than that it pictures the amazing longsuffering of God.",
            "download": "http:\/\/sermonindex.net\/SID15150-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "(Through The Bible) Luke 20-21",
            "url": "http:\/\/sermonindex.net\/SID6534",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 20-21",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6534-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "20"
                }
            ]
        }
    ]
}