{
    "name": "Luke 6",
    "book": "Luke",
    "chapter": 6,
    "audio_sermons": [
        {
            "title": "(Luke) 20 - The Withered Hand",
            "url": "http:\/\/sermonindex.net\/SID15120",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:6-16",
            "topic": "Healing",
            "description": "The spiritual truth behind the healing of the withered hand is this: When God gives a command, He also gives the enablement to perform that command.  \"It is as I attempt to obey God,\" says brother Ed, \"that I find the resources to obey God.\"  Our two big needs are to see a bigger God and ourselves as helpless Christians.",
            "download": "http:\/\/sermonindex.net\/SID15120-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Sabbath Miracles) 04 - Withered Hand Blind",
            "url": "http:\/\/sermonindex.net\/SID15006",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:6-11, John 9",
            "topic": "",
            "description": "The withered hand is hand shriveled, cut off, unusable and paralyzed; that is how we are trying to obey God's commandments in our power.  We need a perpetual miracle as we look into Jesus' face and He works a mighty miracle by the power of God for every obedience.  The man born blind shows that Sabbath vision is when you see Jesus bigger and bigger and fellowship with Him outside the camp.",
            "download": "http:\/\/sermonindex.net\/SID15006-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "God's Choice",
            "url": "http:\/\/sermonindex.net\/SID27504",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:12-16",
            "topic": "Decisions",
            "description": "In this message, Pastor Cymbala gives insights about how Jesus picked his disciples. You will be encouraged by what you hear. Luke 6:12-16 (NIV)",
            "download": "http:\/\/sermonindex.net\/SID27504-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Judas Factor in Ministry (Time For Renewal Conference)",
            "url": "http:\/\/sermonindex.net\/SID3176",
            "size": "8867328",
            "format": "mp3",
            "scripture": "Matthew 26:21-22, Luke 6:12-16, John 6:64",
            "topic": "Judas",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3176-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "6"
                },
                {
                    "book": "Matthew",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "Key Words: Obedience",
            "url": "http:\/\/sermonindex.net\/SID4559",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:37-49",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4559-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Luke - Part 2",
            "url": "http:\/\/sermonindex.net\/SID2273",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6-14",
            "topic": "Luke",
            "description": "Zac continues bringing out precious truths from Luke's Gospel, such as correct attitudes towards others who do things differently in the Body of Christ, the compasionate heart of ministry, and seeking God for \"bread\" for those who come to you in need.",
            "download": "http:\/\/sermonindex.net\/SID2273-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Six Verses That Describe Our Vision",
            "url": "http:\/\/sermonindex.net\/SID11540",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:36, Mark 9:23, 1 Corinthians 11:31",
            "topic": "Vision",
            "description": "What is the vision of the people that constitute the church?  Brother Zac shares six carefully selected verses of Scripture that God birthed in their hearts in the early days of their fellowship, such as being merciful, not fearing anything but God, believing, receiving grace, giving and judging one's self.",
            "download": "http:\/\/sermonindex.net\/SID11540-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "11"
                },
                {
                    "book": "Mark",
                    "chapter": "9"
                },
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "TO BRING JOY TO THE FATHER",
            "url": "http:\/\/sermonindex.net\/SID21266",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:35",
            "topic": "Radio Show",
            "description": "God is a living, loving Father who wants to be able to rejoice in His children. An earthly father is happy when his children follow in his footsteps and become like him. This is also the great joy of our Heavenly Father! And because He is Love, He wants to imprint upon us the image of His love. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21266-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Devil who followed Jesus",
            "url": "http:\/\/sermonindex.net\/SID1757",
            "size": "8130560",
            "format": "mp3",
            "scripture": "John 6:66-71, Luke 6:12-16",
            "topic": "Judas",
            "description": "This message gives great insight into the story of Judas. There are many who have a false impression of Who Jesus is and what His purpose is. Be prepared to be challenged, especially if you have been using Christ for your own personal agenda.",
            "download": "http:\/\/sermonindex.net\/SID1757-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Difference Mercy Makes",
            "url": "http:\/\/sermonindex.net\/SID13762",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:36-39",
            "topic": "Mercy",
            "description": "Brian speaks frankly and openly about our tendencies to make sinful judgments based upon faulty assumptions that wreak havoc in interpersonal relationships.  Jesus was not prohibiting all judging, but judgment that does not begin with ourselves and thinking of the abundant mercy we've received from God.  This biblically balanced sermon is pointedly practical and interspersed with humor that drives the message close to home.  (Used by permission of Grace Community Church in Ashburn, VA) http:\/\/www.gccashburn.us\/extras\/messagelist",
            "download": "http:\/\/sermonindex.net\/SID13762-download",
            "preacher_name": "Brian Chesemore",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Training Of The Twelve",
            "url": "http:\/\/sermonindex.net\/SID7677",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:12",
            "topic": "Twelve Disciples",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7677-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        }
    ]
}