{
    "name": "Luke 7",
    "book": "Luke",
    "chapter": 7,
    "sermons": [
        {
            "title": "(Luke) 22 - Doubts Of John The Baptist",
            "url": "http:\/\/api.sermonindex.net\/SID15122",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:18-39",
            "topic": "",
            "description": "Some lessons we can learn here is that when we have doubts, send them to Jesus.  We should also never judge the reality by outward appearances.  Though Jesus never visited John in prison, He had a high regard for him, and we can expect in our trials at times not to hear, \"Well done, good and faithful servant,\" down here.  There is a difference between doubting (struggling faith) and disbelieving, and the good news is that God accepts struggling faith as faith.",
            "download": "http:\/\/api.sermonindex.net\/SID15122-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Luke) 23 - Anointing Jesus Feet",
            "url": "http:\/\/api.sermonindex.net\/SID15123",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-50",
            "topic": "",
            "description": "How can we love the Lord Jesus and be freed from a cold heart?  It's by entering into how much we've been forgiven.  Brother Ed shows from the devotion and love of the sinful woman how it is impossible to embarrass the Lord and you don't have to defend yourself of the criticisms of others.",
            "download": "http:\/\/api.sermonindex.net\/SID15123-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Through The Bible) Luke 7-8",
            "url": "http:\/\/api.sermonindex.net\/SID6526",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7-8",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6526-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "A WORTHWHILE GOAL IN LIFE",
            "url": "http:\/\/api.sermonindex.net\/SID24954",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:27",
            "topic": "Radio Show",
            "description": "Are you unhappy because your life doesn’t have the right goal? In His great love for you, God wants to show you a goal that will give your life a deep and wonderful meaning.",
            "download": "http:\/\/api.sermonindex.net\/SID24954-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "A WORTHWHILE GOAL IN LIFE",
            "url": "http:\/\/api.sermonindex.net\/SID22832",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:27",
            "topic": "Radio Show",
            "description": "God lives and works today! Are you unhappy because you sense that your life doesn’t have the right goal? In His great love for you, God wants to show you a goal today that will give your life a deep and wonderful meaning. Listen to the following message!",
            "download": "http:\/\/api.sermonindex.net\/SID22832-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Blind Man's Bluff",
            "url": "http:\/\/api.sermonindex.net\/SID17582",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-50",
            "topic": "Miracles",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17582-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "God's Purpose",
            "url": "http:\/\/api.sermonindex.net\/SID12257",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7",
            "topic": "God's Purpose",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12257-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "HOW TO DRAW DOWN THE GRACE OF GOD",
            "url": "http:\/\/api.sermonindex.net\/SID21221",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:38",
            "topic": "Radio Show",
            "description": "Why do so few people experience God’s reality?  His grace can only flow into our lives under one condition. However, it’s within everyone's reach. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/api.sermonindex.net\/SID21221-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Lost Dimension in Christian Living",
            "url": "http:\/\/api.sermonindex.net\/SID20551",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-50, John 17:1-5",
            "topic": "Worship",
            "description": "The lost dimension is worship. Normally we stand to sing, we kneel to pray, but we prostrate ourselves to worship. Praise is a prelude to true worship. Prayer is preoccupation with our needs. Praise is preoccupation with our blessings. Worship is preoccupation with God Himself.  Many Christians substitute service for worship, remembering the first commandment is to worship the Lord your God with all your heart and with all your mine and all your strength, and to worship Him in spirit and truth and the beauty of holiness; for the Father seeks those who will truly worship Him.",
            "download": "http:\/\/api.sermonindex.net\/SID20551-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                },
                {
                    "book": "John",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Lost and Found: The Prostitute",
            "url": "http:\/\/api.sermonindex.net\/SID12994",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-50",
            "topic": "",
            "description": "C. J. Mahaney shows how a loss of our awareness of our own sinfulness creates a lack of love and affection towards Jesus.  The example of the prostitute weeping at the Lord's feet is held out as an example for us of how to love Him much.  Don't you want to feel like she felt about the Savior?",
            "download": "http:\/\/api.sermonindex.net\/SID12994-download",
            "preacher_name": "C.J. Mahaney",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Casual Receiving of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID15848",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-50",
            "topic": "Christ",
            "description": "When we have a wrong perception of Christ, we will predetermine the level of service we will give to God. We may sit under the preaching with a pretense of wanting to be taught, but in reality we will not be moved from our view. We are living in a generation where some of the body of believers are using the name of Jesus for their own objectives. When we have a proper perspective of Christ we will reverence His presence, and stand in awe of the fact that He comes into our homes and into our heart. We will take out a basin and wash the feet of Jesus with worship, prayer and gratitude. We will embrace His word trusting it to be a higher reality than every situation we are facing.",
            "download": "http:\/\/api.sermonindex.net\/SID15848-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Day Jesus Was Astonished",
            "url": "http:\/\/api.sermonindex.net\/SID3216",
            "size": "8656896",
            "format": "mp3",
            "scripture": "Luke 7,1 Peter 5:6,James 4:7",
            "topic": "",
            "description": "The centurion proves to be a type of a Christian who cares about people. It astonishes our Lord to see this man's faith-a man who was in authority, yet cared this much for a servant.  He had power yet he recognized the power of the Master. He also saw his own unworthiness in comparison to our Lord.",
            "download": "http:\/\/api.sermonindex.net\/SID3216-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                },
                {
                    "book": "1 Peter",
                    "chapter": "5"
                },
                {
                    "book": "James",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "When Tears Come to a Religious Man's House",
            "url": "http:\/\/api.sermonindex.net\/SID14623",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:36-47",
            "topic": "Religion",
            "description": "January 14, 2007 - When Jesus comes to a religious man's home the religious man will not touch the feet of Jesus because the dirt of this world is on them. He doesn't want this dirt on his hands because it offends his religion. The fruit of this religion that does not have the heart of God in it is a cold formality and a skepticism. When was the last time you raised up your hands to God and thanked Him for what He has done in your life and His faithfulness? Tears of gratitude refresh Jesus. These tears come from a genuine work of God and a worship that remembers where He brought us from and that He is the source of my work.",
            "download": "http:\/\/api.sermonindex.net\/SID14623-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Worship -  Beyond Prayer and Praise",
            "url": "http:\/\/api.sermonindex.net\/SID20562",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:44-46",
            "topic": "Worship",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20562-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Worship In The Beauty Of Holiness",
            "url": "http:\/\/api.sermonindex.net\/SID20639",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 7:39-50",
            "topic": "Beauty Of Holiness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20639-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "7"
                }
            ]
        }
    ]
}