{
    "name": "Esther",
    "sermons": [
        {
            "title": "(Through The Bible) Esther",
            "url": "http:\/\/api.sermonindex.net\/SID6369",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6369-download",
            "speaker_name": "Chuck Smith",
            "_scripture": []
        },
        {
            "title": "At the Kings Gate",
            "url": "http:\/\/api.sermonindex.net\/SID3191",
            "size": "9094656",
            "format": "mp3",
            "scripture": "Esther 2-3,Psalms 11:2",
            "topic": "",
            "description": "The King's Gate is a type of salvation, a place of power, a place to be seen and noticed. A public witness. The enemy will come at believers, but when we remember the truth and point him to Jesus, he will lose every time. Mordecai bowed not before Haman, but the rest of the King's servants did. There was no discernment that this was an enemy. Mordecai did not try to hide who or what he was. We are called to declare our testimony of the Lord, given to us when he saved us. Mordecai had witnessed some of the king's servant's turn against him, and plot to kill him, he'd seen evil. So he recognized it. We do not have to bow before our enemy or yield.",
            "download": "http:\/\/api.sermonindex.net\/SID3191-download",
            "speaker_name": "Teresa Conlon",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Esther #1 Ch. 1-2",
            "url": "http:\/\/api.sermonindex.net\/SID12122",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1-2",
            "topic": "Esther",
            "description": "Esther is a facinating book in the Old Testament, it does not mention God in any obvious way but His hadn of prservation over the Jewish people is seen in a very dramatic way.  In a historical sense the events in Esther took place between Ezra chapter 6 & 7.  It starts with king Xeres of Persia in his winter palace preparing for a huge 180 day long feast just prior to him going to war with the Greek empire. During the feat the king commands that the queen be brought beofre him and all his naoble men who are there, the queen however refuses to come for reasons which are unknown, this angers the king greatly as it sets a very bad example to his lords and also to everyone in the empire, so the king decides to find a replacement for the her.  After a search is conducted he choses Esther, a jewess who was the neice of Mordecai one of the kings lords, and a descendant of Kish, king Sauls father.  Mordecai discoveres a plot to kill the king and informs Esther the queen who tells king and the conspirators were killed probably by impaling, but Mordecai received no reward.. yet.",
            "download": "http:\/\/api.sermonindex.net\/SID12122-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther #2 Ch. 3-4",
            "url": "http:\/\/api.sermonindex.net\/SID12123",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 3-4",
            "topic": "Esther",
            "description": "Haman is 'the bad guy' of the story of Esther, interestingly he was the descendent of Agag king of the Amalekites, a man whom king Saul (of whom Mordecai was a descendent) spared against the will of God, it is interesting that if Saul had obeyed the Lord in wipoing out the Amalekites the events of Esther might never have taken place, there is an important lesson here in that our disobedience toward God may have far reaching consequences beyond our own lives.  Haman was promted to be the 'prime minister' of the Persian empire and this everyone had to pay ho9mage to him, which they did, all except Mordecai and Haman was greatly angered by this and sought revenge, not just against Mordecai but against his people, the Jews.  Haman went to the king and lies and asks that all the jews be killed in a holocaust fashion, the king doesn't check the facts but agrees and a decree is sent through all the empire.  Mordecai is greatly troubled by this and mourns and tells his niece Esther, the queen, that she has come to her place of status for sucha time as this.",
            "download": "http:\/\/api.sermonindex.net\/SID12123-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Esther #3 Ch. 5-7",
            "url": "http:\/\/api.sermonindex.net\/SID12124",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 5-7",
            "topic": "Esther",
            "description": "After 3 days of fasting a prayer Esther puts her life on the line and goes and sees the king without his permission, which was a capital offence.  The king shows her mercy and asks what her request is, she asks that she would prepare 2 banquets for the king and Haman.  This was a great honour for Haman, who is overjoyed by it, so they have their banquet and the king asks again what Esthers request is, but again she bides her time.  Haman on his way home sees Mordecai still mouring and is greatly angered that he still does not honour him.  That night the king is unable to sleep and asks for the chronicles to be read to him, in this he discovers that Mordecai has saved his life and not been rewarded yet.  So the king asks Haman what should be done to the man whom the king wishes to honour, Haman thi nking the king means him advises him how and the king commands that Haman honour Mordecai!!  If this wasn't enough for Haman the day after Esther exposes his plot to the king to kill her and all the jews the king flies of into a rage and demands Haman be killed on the very instrument of execution that he had prepared for Mordecai. A problem still remained however the empire had declared that all jews should be killed on a certain day and that day was looming.",
            "download": "http:\/\/api.sermonindex.net\/SID12124-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Esther #4 Ch. 8-10",
            "url": "http:\/\/api.sermonindex.net\/SID12125",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 8-10",
            "topic": "Esther",
            "description": "Haman, enemy of the jews,is now dead but that doesn't mean that the Israelites are safe.  The king could not stop his own edict due to the laws of the Persian empire.  Mordecai was made prime minister of the whole empire and so was given the task of resolving the issue by the king.  He set about this by creating new laws that would protect the jews on the day they were set to be massacred.  So when the day finally came that all the jews should be killed they fought for their lives and were helkped by the authorities.  At this time approximately 76 thousand people were put to death throughout the whole empire spanning from India to north Africa but the jews did not take any of the spoil from their enemies.  At this time Hamans 10 sons were also put to death and their bodies hung up in order to disgrace them, this finally meant the end the Amalekites, whom king Saul had disobediently spared hundreds of years prior.",
            "download": "http:\/\/api.sermonindex.net\/SID12125-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Esther - Prayer Meeting",
            "url": "http:\/\/api.sermonindex.net\/SID0593",
            "size": "16171008",
            "format": "mp3",
            "scripture": "Esther 1:11",
            "topic": "Brokenness",
            "description": "\"One man with God is a majority\" Ravenhill here, from the book of Esther, teaches on brokenness and being a \"marked man for God\". \"Dear Lord, put me in the row and shoot me, that is the quickest way to heaven\" Brother Ravenhill says while rebuking the fear of man. Do we want revival? Do we want the sacrifice that revival entails?",
            "download": "http:\/\/api.sermonindex.net\/SID0593-download",
            "speaker_name": "Leonard Ravenhill",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther 1:1",
            "url": "http:\/\/api.sermonindex.net\/SID7790",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1:1",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7790-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther 4",
            "url": "http:\/\/api.sermonindex.net\/SID7801",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 4",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7801-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Esther 5",
            "url": "http:\/\/api.sermonindex.net\/SID7802",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 5",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7802-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Esther 8:7",
            "url": "http:\/\/api.sermonindex.net\/SID7803",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 8:7",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7803-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Nehemiah, Esther",
            "url": "http:\/\/api.sermonindex.net\/SID2249",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah, Esther",
            "topic": "Esther",
            "description": "Nehemiah teaches us that God is waiting for one man who has a burden for the glory of God.  One who fears God will be fearless towards men and strict about God's standards.  The believers who stayed behind in Babylon in the book of Esther pictures a corrupt Christianity of people who live after the flesh.  Yet God still cares and provides for such people, though He doesn't publicly identify with them as He did with those who live selflessly for Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID2249-download",
            "speaker_name": "Zac Poonen",
            "_scripture": []
        },
        {
            "title": "Rediscoving Christ-Alive",
            "url": "http:\/\/api.sermonindex.net\/SID0506",
            "size": "17545216",
            "format": "mp3",
            "scripture": "Romans 5:10, Esther, Matthew 28",
            "topic": "Resurrection",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID0506-download",
            "speaker_name": "Major Ian Thomas",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Matthew",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "The Downfall of Saddam Hussein",
            "url": "http:\/\/api.sermonindex.net\/SID2800",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 3:12-13",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2800-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Journey From Prayer To Obedience",
            "url": "http:\/\/api.sermonindex.net\/SID3582",
            "size": "10122752",
            "format": "mp3",
            "scripture": "Esther 3:7-13,Esther 4:13-14,Romans 8:9-11",
            "topic": "Obedience",
            "description": "(Preached: Feb. 8th, 2004). In a place of complacency, the enemy rose up to try to destroy God's people. After the captivity in Babylon, many of Israel had grown comfortable and stayed, rather than returning. Mixture in the world gives the enemy room to rise up and rule over you. Esther fasted and prayed, but she then had to get up and go to the king. We, as the Body of Christ, need to remember we are ambassadors of Christ, and there is no time for games. Jesus is coming, and we need to come out from among the world, and seperate ourselves for his purposes. If you are struggling with your flesh, this message will help you, and hopefully motivate you. Esther risked her life to intercede for her people. We need to risk whatever will come into our lives whether persecution, or trouble, to be seperated to God's purposes.",
            "download": "http:\/\/api.sermonindex.net\/SID3582-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Esther",
                    "chapter": "4"
                },
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Story of Esther",
            "url": "http:\/\/api.sermonindex.net\/SID11715",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11715-download",
            "speaker_name": "David Guzik",
            "_scripture": []
        }
    ]
}