{
    "name": "Leviticus",
    "audio_sermons": [
        {
            "title": "(1 Samuel) David on the Decline",
            "url": "http:\/\/sermonindex.net\/SID10650",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21 1-9, Leviticus 24:5-9",
            "topic": "",
            "description": "David is on the run from king Saul, he is afraid, hasnt eaten or slept properly for days, he is confused and had just had to bid farewell to his closest friend Jonathan, but it was here that the Lord would train David to be a king.  David goes to the tabernacle of God at Nob, to Ahimelech the priest, this was th right thing to for David to do to go to the house of the Lord.  But when he is asked what is going on by Ahimelech David lies to him several times in order to protect himself and maybe also Ahimelech from Saul.  David asks the priest for food, and all that is available is the shew bread which was used in the tabernacle to symbolize how the Lord desires to have fellowship with us.  So Ahimelech gives David the shewbread even though it was usually eaten by the priests, this shows that serving a human need is of greater importance than observing priestly traditions.  Does the Edomite, a servant of Saul was there and witnessed what was happening.  Finally David asks for a weapon from Ahimelech and he gioves him Goliaths sword, which David takes, the Lord was probably reminding David that the last time he held that sword he won a great victory as he was in the will of God and didn't need to resort to the flesh to deliver him.",
            "download": "http:\/\/sermonindex.net\/SID10650-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Leviticus",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "(Through The Bible) Leviticus 1-10",
            "url": "http:\/\/sermonindex.net\/SID6318",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 1-10",
            "topic": "",
            "description": "Christ was more then our sin offering but also our sweets savor offerings. There were 3 basic sweet savor offerings, burnt offering, meal offering and the peace offering. There were 2 sin offerings, one the sin offering and 2nd the trespass offering. An offering needs to be our of our own free will. To return to fellowship with God is in our volition. The laying on of the hands is the symbol of the animal taking the place of ourselves and we transfer our sins to it in the old covenant. The blood of goats and rams really never forgave the sins but rather covered them. But with Jesus our sins have been put away not just covered. The purpose of all the sacrifices and the covenant is so that we can have relationship and oneness with God. This fellowship needs obedience to have agreement with God. God created man with the purpose of fellowship and man disobeyed and was alienated from God and God determined to restore that fellowship. The animals only covered the sins for a time and brought partial fellowship with God. But it pointed forward to that time when God would send his own son as a lamb without spot or blemish before God.",
            "download": "http:\/\/sermonindex.net\/SID6318-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) Leviticus 11-15",
            "url": "http:\/\/sermonindex.net\/SID6319",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 11-15",
            "topic": "",
            "description": "If we hearken diligently to the Lord our God then blessed will be our body, flocks, lands etc. That was the promise of God to Jews in the old covenant. God has given us certain spiritual laws and if we obey them we will be blessed. But if we do not listen or obey Gods words then we will be cursed. Joshua was exhortated the mediate on the book of the law day and night and his way was going to be prosperous. It is not just having the law but rather doing the law that will bring the blessing. The Lord is interested in our health and diet. We cannot be eating a lot of junk food and expect God to bless us with a healthy body. God is interested in good nuturion. The foods that God dis-allowed in Leviticus was because they were foods that were unhealthy and unsafe for the people of Israel. God gives a list and parts of the beasts that they could eat. The animals had to pass over the 3 things the Lord said it had to be able to do, had a hoofed foot, chews the cud, etc. There was controversy over the rabbit chewing the cud. But recently it was found out that they actually do chew the cud. In wild rabbit it is dangerous because they carry some fevers such as yellow fever. Pork needs to be cooked very well so we don’t get sick from it so God was just trying to take care of the people of Israel.",
            "download": "http:\/\/sermonindex.net\/SID6319-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Through The Bible) Leviticus 16-20",
            "url": "http:\/\/sermonindex.net\/SID6320",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 16-20",
            "topic": "",
            "description": "God said to the people that they are not to go to the Holy of Holies or they will die. Only Aaron was to go into the Holy of Holies on the Day of Atonement. He has to kill about 35 animals and also bath 5 times in the rituals to offer for his own sins and for the people of Israel. All of this is looking forward to Jesus Christ in symbolism. Jesus Christ did not annually come to offer sacrifices but rather did it once and sat down at the right hand of God. These were all a shadow of things to come but Jesus Christ is the Substance! All the other sacrifices are Shadows of Jesus Christ. The High Priest Aaron took 2 goats one to the Lord and one for the scapegoat. On YumKippur he did this and this was an annual event. He came into the presence of God manifested on the mercy seat. This is the law of God for sin. God forbids any eating of blood because it is the blood that makes the atonement for the soul. Though the Jews observe YumKippur yet how do they have forgiveness of sins? The answer they say is the day of reflection. The hope and purpose is that the good out weighs the evil. Through blood sacrifices there is remission of sin so without these offerings you cannot just act good to be in fellowship with God.",
            "download": "http:\/\/sermonindex.net\/SID6320-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "(Through The Bible) Leviticus 21-24",
            "url": "http:\/\/sermonindex.net\/SID6321",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 21-24",
            "topic": "",
            "description": "The Priest had a 2-fold function, to stand before God for the people. And then stand before the people in the stead of God. If you touched a dead body you could not enter into the tabernacle. The priest could only touch the bodies of the immediate family or else they would be defiled. Also they were not to make baldness on their heads, some people used to make vows by shaving the head. I am the Lord that sanctifies you that is Holy, that was how God revealed Himself to the priests. If any man had a blemish he could not be a priest and approach God, so there were physical disqualifications for approaching God in the Old Covenant. You are not to offer to God any animal that had a blemish, God did not want the cast off’s. I will sacrifice to God something that costs me anything-said David in reference to the threshing floor story. We want to give of our surplus. In giving to God in freewill always, and always the best. Honoring God and showing our love to God giving God the best we have is important indeed.",
            "download": "http:\/\/sermonindex.net\/SID6321-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "(Through The Bible) Leviticus 25-27",
            "url": "http:\/\/sermonindex.net\/SID6322",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 25-27",
            "topic": "",
            "description": "Every seventh year you let what grows up just eat that. God said if you do this in the sixth year leaving the land it will be a triple crop so it will carry over to the 8th year. One day if a person who studies land and agriculture will realize that if you leave the land for 1 year every 7 years it will help the land be more plentiful. Letting the ground rest for 1 year what a concept. Chuck Smith is certain this is a physical law of God and it is true. God sent Israel into Babylon because they would not give the land rest, so God sent them for Babylon for 70 years to let the land rest. Let the land grow wildly so that there are servants and poor people that could eat from the land. Every 50 years it was the year of jubilee, all depts. And mortgages were cancelled and all slaves set free. It is like Pentecost, a special year of jubilee. The various laws of redemption are given in these chapters. We in the new covenant are redeemed in Christ but in the Old Covenant, the slaves in the 7th year was set free. We are less then years away from 6000 years of slavery to sin. There is a 1000 year millennium coming.",
            "download": "http:\/\/sermonindex.net\/SID6322-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "58. What is required in the fourth commandment?",
            "url": "http:\/\/sermonindex.net\/SID22412",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 19:30, Isaiah 56:2-7",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22412-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "19"
                },
                {
                    "book": "Isaiah",
                    "chapter": "56"
                }
            ]
        },
        {
            "title": "60. How is the sabbath to be sanctified?",
            "url": "http:\/\/sermonindex.net\/SID22414",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 23:3, Psalm 92:1-2",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22414-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "23"
                },
                {
                    "book": "Psalm",
                    "chapter": "92"
                }
            ]
        },
        {
            "title": "62. What are the reasons annexed to the fourth commandment?",
            "url": "http:\/\/sermonindex.net\/SID22416",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 31:15-16, Leviticus 23:3",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22416-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "31"
                },
                {
                    "book": "Leviticus",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "74. What is required in the eighth commandment?",
            "url": "http:\/\/sermonindex.net\/SID22428",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Thessalonians 3:10-12, Leviticus 25:35",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22428-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Thessalonians",
                    "chapter": "3"
                },
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "Annointing Of Oil",
            "url": "http:\/\/sermonindex.net\/SID9832",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 14",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9832-download",
            "preacher_name": "Svend Christensen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "False Fire",
            "url": "http:\/\/sermonindex.net\/SID19905",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 9:22-24, Leviticus 10:1-3",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19905-download",
            "preacher_name": "Ronald Glass",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "10"
                },
                {
                    "book": "Leviticus",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Feasts Of Jehovah Passover",
            "url": "http:\/\/sermonindex.net\/SID12971",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 23",
            "topic": "Passover",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12971-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Feasts Of Jehovah Unleavened Bread",
            "url": "http:\/\/sermonindex.net\/SID12972",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 23:4-8",
            "topic": "Jewish Feasts",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12972-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Grain Offering - Leviticus 2",
            "url": "http:\/\/sermonindex.net\/SID12030",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 2",
            "topic": "Offering",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12030-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "If Revival Doesn't Come",
            "url": "http:\/\/sermonindex.net\/SID19906",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 5:19-22, Habakkuk 3:16-19",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19906-download",
            "preacher_name": "Ronald Glass",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "5"
                },
                {
                    "book": "Habakkuk",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Jesus As The Lamb",
            "url": "http:\/\/sermonindex.net\/SID5394",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22, Leviticus 1",
            "topic": "Lamb Of God",
            "description": "\"Where is the lamb for the burnt offering?\" asks Roy Hession.  We may often be more like a lion or a tiger than a submissive lamb of brokenness and Calvary love as the Lord Jesus, but we can be assured that Jesus as our Lamb has been accepted on our behalf.  Revell Hession shares an encouraging message to those who may have gotten out of the way of the Lord. NOTE: The last 20 minutes of audio is poor quality.",
            "download": "http:\/\/sermonindex.net\/SID5394-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                },
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "Leviticus",
            "url": "http:\/\/sermonindex.net\/SID2239",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus",
            "topic": "Leviticus",
            "description": "Leviticus is one of the most difficult books to study and get something for the heart, but Zac labors to get at the heart of God : holiness.  The offerings all provide great insights into not only the death of Jesus Christ but His spotless life.  The book is peppered with warnings against hypocritical imitation, improper judging, and encouragements to be filled with the Holy Spirit.",
            "download": "http:\/\/sermonindex.net\/SID2239-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Leviticus 26",
            "url": "http:\/\/sermonindex.net\/SID24342",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 26",
            "topic": "Leviticus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24342-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 4",
            "url": "http:\/\/sermonindex.net\/SID17547",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32:17, Leviticus 16:3, Ezekiel 16:44",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "http:\/\/sermonindex.net\/SID17547-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                },
                {
                    "book": "Leviticus",
                    "chapter": "16"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Our Nation’s Sexual Sins (3)",
            "url": "http:\/\/sermonindex.net\/SID16049",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Romans 1:18-32, Leviticus 18:1-30",
            "topic": "Sexual Sin",
            "description": "Our Nation is in serious spiritual need but in God's word, the Bible, we find answers to our moral and social problems as a nation. Sadly these days, our Nation is marked not only by an unrestrained and unashamed abandonment to sensuality but also by the putrid sin of sexual perversion. What is called sexual orientation and an alternative lifestyle today, God has always called an abomination, which he visits with severe judgment but from which he offers salvation.  In this message from God's Word to our Nation, we hear God's rebuke and denunciation for our nation's aggravated moral sins and a call to repentance and prayer. There is cleansing in the blood of Christ for all of our sexual sins. 1 Corinthians 6:9-11",
            "download": "http:\/\/sermonindex.net\/SID16049-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "18"
                },
                {
                    "book": "Romans",
                    "chapter": "1"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Passing Under the Rod",
            "url": "http:\/\/sermonindex.net\/SID1235",
            "size": "9798656",
            "format": "mp3",
            "scripture": "Leviticus 27:32, Ezekiel 20:33-40",
            "topic": "Repentance",
            "description": "This is a message that will bring everyone that believes in Pentecost, under the rod. From the \"Call to Repentance\" conference in Tifton, Ga. in 1986. This sermon is from Ezek 20:33-40 and Ezek chapters 8-9, and examines the promise of God's judgment -- and his protection of those who \"sigh and groan over all the abominations being committed in [Zion's] midst.\"",
            "download": "http:\/\/sermonindex.net\/SID1235-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "20"
                },
                {
                    "book": "Leviticus",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "The Beard, its Historical and Biblical Significance",
            "url": "http:\/\/sermonindex.net\/SID13011",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 21:1-6",
            "topic": "",
            "description": "Does the Scripture speak to every area of life? We believe it does. Pastor Weaver expounds the biblical principles concerning male facial hair. Also the historical record of the significance of this visual separation of the sexes and symbol of male headship is fully explored. This is probably something you have never considered. Ask the LORD to open your heart to the truth He has for you in this message.",
            "download": "http:\/\/sermonindex.net\/SID13011-download",
            "preacher_name": "John Weaver",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "The Burnt Offering",
            "url": "http:\/\/sermonindex.net\/SID5422",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22:7-8, Hebrews 11:17-19, Leviticus 1:3-4",
            "topic": "Burnt Offering",
            "description": "Here in Genesis we read of the Lord testing Abrahams faith, which is confirmed in Hebrews 11.  Isaac was to be the burnt offering which would produce a sweet smelling savour to the Lord, we see him here in the place of the lamb that bows his head instead of stiffening his neck.  Pastor Hession shows there are 3 key sayings in these verses, 1: Where is the Lamb? when we are stubborn and self willed where are the lamb like qualities in us that marked the life of our Lord?  2: God will provide Himself a Lamb,  this He did in the form of his Son, the Lord Jesus, Who was the only One Who could offer up a sweet smelling savour to God.  3: He shall be accepted for Him, here is the wonder of His substitution for us that God credits to us the sweet savour that ascended up from Calvary.",
            "download": "http:\/\/sermonindex.net\/SID5422-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "11"
                },
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "The Kinsman Redeemer",
            "url": "http:\/\/sermonindex.net\/SID25566",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 25:25-55",
            "topic": "Redeemer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25566-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "The Quarrel of God's Covenant",
            "url": "http:\/\/sermonindex.net\/SID11927",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 26:25",
            "topic": "God's Covenant",
            "description": "May 29,2005 - God gives a warning to Israel and the same warning can be applied to us today. If you take lightly the Lord’s presence and if you begin to dabble in and out of obedience and disobedience so that you develop a warped sense of what it means to walk with Him – God said He will have a quarrel with us. The scripture says that two cannot walk together unless they agree. God is not required to agree with us but we are required to agree with Him.",
            "download": "http:\/\/sermonindex.net\/SID11927-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "The Solemn Side Of Worship",
            "url": "http:\/\/sermonindex.net\/SID4642",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 10:1-71",
            "topic": "Worship",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4642-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Voice of Jesus Blood",
            "url": "http:\/\/sermonindex.net\/SID0241",
            "size": "4825088",
            "format": "mp3",
            "scripture": "Genesis 9:4,Leviticus 17:11,Deuteronomy 12:23",
            "topic": "Jesus Blood",
            "description": "All life is God’s Life and all Life is in the Blood. When innocent blood is spilled -- like Abel’s -- it cries out to God and God hears its voice. When Jesus came to earth, the sin of man’s spilling of blood ran in His holy veins. But Christ’s Blood cries out to the Father in our behalf because His is the Blood of the ultimate sacrifice for our sins, not the blood of a murdered man.",
            "download": "http:\/\/sermonindex.net\/SID0241-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "12"
                },
                {
                    "book": "Leviticus",
                    "chapter": "17"
                },
                {
                    "book": "Genesis",
                    "chapter": "9"
                }
            ]
        }
    ]
}