{
    "name": "Nahum",
    "sermons": [
        {
            "title": "(Through The Bible) Nahum",
            "url": "http:\/\/api.sermonindex.net\/SID6488",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6488-download",
            "speaker_name": "Chuck Smith",
            "_scripture": []
        },
        {
            "title": "God is Good",
            "url": "http:\/\/api.sermonindex.net\/SID9451",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum 1:7",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9451-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Mercy, Omnipotence, and Justice",
            "url": "http:\/\/api.sermonindex.net\/SID13275",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum 1:3",
            "topic": "",
            "description": "WORKS of art require some education in the beholder, before they can be thoroughly appreciated. We do not expect that the uninstructed should at once perceive the varied excellencies of a painting from some master hand; we do not imagine that the superlative glories of the harmonies of the Princes of Song will enrapture the ears of clownish listeners. There must be something in the man himself, before he can understand the wonders either of nature or of art. Certainly this is true of character. By reason of failures in our character and faults in our life, we are not capable of understanding all the separate beauties, and the united perfection of the character of Christ, or of God, his Father. Were we ourselves as pure as the angels in heaven, were we what our race once was in the garden of Eden, immaculate and perfect, it is quite certain that we should have a far better and nobler idea of the character of God than we can by possibility attain unto in our fallen state. But you cannot fail to notice, that men, through the alienation of their natures, are continually misrepresenting God, because they cannot appreciate his perfection. Does God at one time withhold his hand from wrath?...",
            "download": "http:\/\/api.sermonindex.net\/SID13275-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Nahum, Habakkuk",
            "url": "http:\/\/api.sermonindex.net\/SID2265",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum, Habakkuk",
            "topic": "Habakkuk",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2265-download",
            "speaker_name": "Zac Poonen",
            "_scripture": []
        },
        {
            "title": "Spiritual Authority",
            "url": "http:\/\/api.sermonindex.net\/SID3387",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 50:18,Nahum 1-3",
            "topic": "Spiritual Authority",
            "description": "You can stand up to the devil and say enough! Too many Christians go to church and read their Bibles, but lack the power that only comes through full submission to the Holy Ghost, and the Word of God, to combat the powers of the enemy. You can take back your family for God, take back what the enemy has stolen from you. Pray the Lord of the Harvest will send you forth into the field.  Don't be consenting when you behold the thief destroying and stealing the lives of your loved ones. Stand in the gap, and defy him. He is defeated already. Powerful preaching on an important issue!!",
            "download": "http:\/\/api.sermonindex.net\/SID3387-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        }
    ]
}