{
    "name": "Nahum",
    "sermons": [
        {
            "title": "(Through The Bible) Nahum",
            "url": "http:\/\/api.sermonindex.net\/SID6488",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6488-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "God is Good",
            "url": "http:\/\/api.sermonindex.net\/SID9451",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum 1:7",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9451-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Mercy, Omnipotence, and Justice",
            "url": "http:\/\/api.sermonindex.net\/SID13275",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum 1:3",
            "topic": "",
            "description": "WORKS of art require some education in the beholder, before they can be thoroughly appreciated. We do not expect that the uninstructed should at once perceive the varied excellencies of a painting from some master hand; we do not imagine that the superlative glories of the harmonies of the Princes of Song will enrapture the ears of clownish listeners. There must be something in the man himself, before he can understand the wonders either of nature or of art. Certainly this is true of character. By reason of failures in our character and faults in our life, we are not capable of understanding all the separate beauties, and the united perfection of the character of Christ, or of God, his Father. Were we ourselves as pure as the angels in heaven, were we what our race once was in the garden of Eden, immaculate and perfect, it is quite certain that we should have a far better and nobler idea of the character of God than we can by possibility attain unto in our fallen state. But you cannot fail to notice, that men, through the alienation of their natures, are continually misrepresenting God, because they cannot appreciate his perfection. Does God at one time withhold his hand from wrath?...",
            "download": "http:\/\/api.sermonindex.net\/SID13275-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Nahum, Habakkuk",
            "url": "http:\/\/api.sermonindex.net\/SID2265",
            "size": "0",
            "format": "mp3",
            "scripture": "Nahum, Habakkuk",
            "topic": "Habakkuk",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2265-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Spiritual Authority",
            "url": "http:\/\/api.sermonindex.net\/SID3387",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 50:18,Nahum 1-3",
            "topic": "Spiritual Authority",
            "description": "You can stand up to the devil and say enough! Too many Christians go to church and read their Bibles, but lack the power that only comes through full submission to the Holy Ghost, and the Word of God, to combat the powers of the enemy. You can take back your family for God, take back what the enemy has stolen from you. Pray the Lord of the Harvest will send you forth into the field.  Don't be consenting when you behold the thief destroying and stealing the lives of your loved ones. Stand in the gap, and defy him. He is defeated already. Powerful preaching on an important issue!!",
            "download": "http:\/\/api.sermonindex.net\/SID3387-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        }
    ]
}