{
    "name": "Nehemiah",
    "sermons": [
        {
            "title": "(Daniel) The 70 Weeks of Daniel",
            "url": "https:\/\/sermonindex.info\/SID10750",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9: 20-27, Nehemiah 2:1, Luke 19:37-40",
            "topic": "Seventy Weeks",
            "description": "After Daniels great intercession for the nation of Israel the angel Gabriel appears to him and tells him that he is about to be shown a great prophecy.  This is amazingly characteristic of the abundance with which the Lord gives to His people, Daniel has been asking the Lord to show mercy to the nation of Israel yet the Lord does that and more, He answers Daniel's prayer but goes so much further.  Gabriel reveals to Daniel that there will be a period of 490 years that will concern the Jews and particularly the city of Jerusalem.  The prophecy began to be fulfilled in 445BC at the decree of Cyrus to rebuild the city of Jerusalem.  483 Jewish years (360 days) later was the exact that the Lord Jesus rode into Jerusalem on the donkey, but as predicted the Messiah was executed and the temple destoyed.  So we await the fulfillment of Daniels 70th week, when the Antichrist will confirm a covenant with the jews, his people destroyed the temple and Jerusalem before he even came to the world, many believe he will probably be European.",
            "download": "https:\/\/sermonindex.info\/SID10750-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "19"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                },
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Godly Home) Part 20 - Father is a Watchman",
            "url": "https:\/\/sermonindex.info\/SID7425",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1:3-4, Psalm 101:2-4",
            "topic": "Godly Home Series",
            "description": "\"The father is the Nehemiah of the house\", brother Denny cautions, the one to raise up the wall of biblical standards to protect the family and the gatekeeper to watch for subtle influences that gradual erode the spiritual life of it.  Kenaston blows a bold trumpet of alarm against many harmful and destructive influences of our day, such as television, movies, toys, computer games, books, Internet, Christian \"rock\" music, and children's videos.",
            "download": "https:\/\/sermonindex.info\/SID7425-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "101"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Guidelines) Read the Bible",
            "url": "https:\/\/sermonindex.info\/SID8472",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8:1-3",
            "topic": "",
            "description": "If you want to know the God of the Bible, then read the Bible. Our “ears must be attentive”, even if we must determine to read through a passage many times for it to speak to us. McGee also affirms the value of quality preaching and teaching of the Word of God in Church.",
            "download": "https:\/\/sermonindex.info\/SID8472-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(Through The Bible) Nehemiah 1-7",
            "url": "https:\/\/sermonindex.info\/SID6367",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1-7",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6367-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) Nehemiah 8-13",
            "url": "https:\/\/sermonindex.info\/SID6368",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8-13",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6368-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "A Booth on the Roof",
            "url": "https:\/\/sermonindex.info\/SID15997",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8:1-3",
            "topic": "Renewal",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15997-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "A Call to Anguish",
            "url": "https:\/\/sermonindex.info\/SID3663",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Revival",
            "description": "David Wilkerson speaks about the perversion in America and the sinfulness of the church. He points out how the church today is married to the world. People are seeking places where smooth messages are being preached. Christians no longer want to hear about God's coming wrath and the necessary correction of their lives. This broken and God-fearing man denounces the passivity of God's people. Christians are blind to the lukewarmness and the sinful mixture that has crept in little by little. He warns how the spirit of blindness is the least recognizable thing. He calls believers to leave their passivity: \"You have lost your fight. That's all the devil wants to do is get the fight out of you and kill it. So you won't labor in prayer anymore, you won't weep before God anymore. You can sit and watch television and your family goes to hell. If you are expecting somebody else to win your family or to do this work you are mistaken.\" Through this very deep, challenging and anointed message, God calls believers to a baptism of anguish and to fervently pray for the recovery of a nation.",
            "download": "https:\/\/sermonindex.info\/SID3663-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Call to Those Who Care About the Honor of God",
            "url": "https:\/\/sermonindex.info\/SID19379",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1:1-11",
            "topic": "Honor Of God",
            "description": "October 4, 2009 - There is a spiritual wall that separates those who are truly serving God and those who are bringing carnality into His church. If God is going to be honored in this generation we must begin to rebuild the testimony of Christ in our lives. You may ask yourself how does this happen? How do I begin to rebuild this wall? The first thing we do is apply the truth of God's Word to every area of our life where we are not in agreement with Him. Secondly, we must remove the rubble in our homes that has blocked the door to the prayer closet. Lastly, call our children by example into the work of God. Suddenly there will be a people arise and begin to build according the ways of God and they will do it all for His honor!",
            "download": "https:\/\/sermonindex.info\/SID19379-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Building For Revival",
            "url": "https:\/\/sermonindex.info\/SID19776",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8",
            "topic": "Revival",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19776-download",
            "preacher_name": "Robin Wood",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Building the Walls",
            "url": "https:\/\/sermonindex.info\/SID0362",
            "size": "8870912",
            "format": "mp3",
            "scripture": "Nehemiah 6:1-4",
            "topic": "Prayer Life",
            "description": "Duncan Campbell draws principles from the life of Nehemiah to illustrate the qualities of a man who is diligent in prayer, labor and vision, yet is able to let God do the rest.  He closes with sober call to those who have left the work of God in compromise to let God 'restore the year of the locust'.",
            "download": "https:\/\/sermonindex.info\/SID0362-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Come let us build",
            "url": "https:\/\/sermonindex.info\/SID14340",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17",
            "topic": "Building",
            "description": "A certain lady was worried that she was getting older and remaining single. One day she was very distressed and went to pray outside under a tree for a husband. She worked herself up emotionally and eventually she shouted (some Christians like to pray louder and louder and work themselves up to a crechendo, thinking that by their sheer volume they will be heard of God. They fail to distinguish between the soul and spirit). An owl in the tree was startled by her crying and let out \"whooo\". She replied, \"anybody, Lord\". Don't be obsessed with marriage lest you end up with a washout of a husband. Let God be your first priority.",
            "download": "https:\/\/sermonindex.info\/SID14340-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Conference 1989-01 ~ Nehemiah 1",
            "url": "https:\/\/sermonindex.info\/SID27937",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27937-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Conference 1989-02 ~ Nehemiah 4:1",
            "url": "https:\/\/sermonindex.info\/SID27938",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 4:1",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27938-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Conference 1989-03 ~ Nehemiah 4:10",
            "url": "https:\/\/sermonindex.info\/SID27939",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 4:10",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27939-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Conference 1989-04 ~ Nehemiah 6",
            "url": "https:\/\/sermonindex.info\/SID27940",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 6",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27940-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Delivered by a Cry",
            "url": "https:\/\/sermonindex.info\/SID4176",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 2, Nehemiah 9:24-28, Exodus 3:7-8",
            "topic": "Deliverance",
            "description": "Pastor Wilkerson goes through several chapters and verses in the book of Judges showing how Israel repeatedly turned from God, which gave the enemy opportunity to oppress them, and yet, when they cried out to God, he did not rail on them, he sent them a deliverer. God was angry at their sin, yet when they cried out he delivered. He wanted them to see they needed him. If you are struggling with a besetting sin, this message will show you the way to deliverance!",
            "download": "https:\/\/sermonindex.info\/SID4176-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "3"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "9"
                },
                {
                    "book": "Judges",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Diligence in God´s Work - more lessons from Nehemiah",
            "url": "https:\/\/sermonindex.info\/SID14339",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17- 20",
            "topic": "God's Work",
            "description": "The matter we find here is not directly related to the Christmas story but nevertheless contains and essential part of the Gospel for Jesus came into this world to \"save His people from their sins\" and set them on fire for Him and make them truly diligent in His work. Nehemiah had a cushy job in Persia. His position meant that the King's life was in His hands and he was also an advisor to him. Yet, his concern was for the condition of God's work in Jerusalem. As distant as he was Nehemiah still felt godly zeal for the Lord and His people. We find that he was able to inspire the Lord's people to work so zealously that they completed the rebuilding of the walls in 52 days - humanly impossible but with God, all things are possible. They both defended God's work and built, at the same time, despite all opposition.",
            "download": "https:\/\/sermonindex.info\/SID14339-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Getting Back To the Bible",
            "url": "https:\/\/sermonindex.info\/SID10939",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8:1-18",
            "topic": "",
            "description": "Here in Nehemiah is Biblical account of a revival.  Pastor Legge shows that in all revivals there are 2 key elements: 1) Straight preaching ot the Word of God, 2) Obedience from the people of God.  He shows that during revival we can see 5 five key stages, the first is that the people in the revival read they're Bibles avidly, second they understand what the Word of God is saying to them, third they obey the commandments of the Lord, fourth lost truths are recovered and obeyed both in form and principle.  Finally the people of God will rediscover strength and endurance for the work of God because 'the joy that is the Lord's is their strength.'\r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "https:\/\/sermonindex.info\/SID10939-download",
            "preacher_name": "David Legge",
            "preacher_image": "",
            "preacher_description": "David Legge ( - )\r\nListen to freely downloadable audio sermons by the speaker David Legge in mp3 format. David Legge is a Christian evangelist, preacher and Bible teacher. He served as Assistant Pastor at Portadown Baptist Church before taking up the Pastorate of the Iron Hall Assembly in Belfast, N. Ireland, where he ministered from 1999-2008. He knows has an internant ministry across the world you can access messages and request him as a speaker at the Preach The Word website.\r\n\"Like Israel, who are a type, I believe, in many respects of God's people today: we have been transferred from bondage, the kingdom of darkness, the kingdom of Satan, and we have been placed into the kingdom of light, the kingdom of God's dear Son... and yet many believing New Testament Christians never cross the Jordan. They settle for less than God intended for them. I have to say that there can even be resentment, or resistance, shown toward anyone who will try to get God's people over the Jordan and into their inheritance.\" - David Legge",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Greenwood Hills Conference 1989-01 Nehemiah 1",
            "url": "https:\/\/sermonindex.info\/SID11838",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11838-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Greenwood Hills Conference 1989-02 Nehemiah 4:1",
            "url": "https:\/\/sermonindex.info\/SID11839",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 4:1",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11839-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Greenwood Hills Conference 1989-03 Nehemiah 4:10",
            "url": "https:\/\/sermonindex.info\/SID11840",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 4:10",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11840-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Greenwood Hills Conference 1989-04 Nehemiah 6",
            "url": "https:\/\/sermonindex.info\/SID11841",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 6",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11841-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Nehemiah 9",
            "url": "https:\/\/sermonindex.info\/SID7902",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 9",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7902-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Nehemiah, Esther",
            "url": "https:\/\/sermonindex.info\/SID2249",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah, Esther",
            "topic": "Esther",
            "description": "Nehemiah teaches us that God is waiting for one man who has a burden for the glory of God.  One who fears God will be fearless towards men and strict about God's standards.  The believers who stayed behind in Babylon in the book of Esther pictures a corrupt Christianity of people who live after the flesh.  Yet God still cares and provides for such people, though He doesn't publicly identify with them as He did with those who live selflessly for Christ.",
            "download": "https:\/\/sermonindex.info\/SID2249-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Nothing Can Stop What God is Doing",
            "url": "https:\/\/sermonindex.info\/SID4289",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17-20",
            "topic": "God's Purpose",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4289-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Praising God at the Dung Gate",
            "url": "https:\/\/sermonindex.info\/SID1400",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 12:27-31",
            "topic": "Praising God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1400-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Rubbish",
            "url": "https:\/\/sermonindex.info\/SID5062",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 4:10",
            "topic": "",
            "description": "Now, this, it seems to me, is intended, or at least may justifiably be used, for a type of the work which God's people have to carry on in the name of Jesus, and in the power of his Spirit, in the world. We have to build the wall of the church for God, but we cannot build it, for there is so much rubbish in our way. This is true, first, of the building of the church, which is the Jerusalem of God; and this is equally true of the temple of God, which is to be built in each one of our hearts. Full often we feel discouraged. Though we hear the voice that saith, “But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost, keep yourselves in the love of God,” still we are apt to feel that we cannot build this wall, because there is so much rubbish.",
            "download": "https:\/\/sermonindex.info\/SID5062-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Six Paces and a Shout of Glory",
            "url": "https:\/\/sermonindex.info\/SID11913",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 6:1-4",
            "topic": "Glorifying God",
            "description": "October 30, 2005 - We are ordinary people called by God to do an extraordinary work. The tactic of the enemy is to get you to leave a great work to do a good work. We are inclined to slip out of the place that God has ordained for us and live out our own plans. But as we surrender to His call and we begin to understand that divine life is flowing through you and you know you are exactly where you are supposed to be – you cant go no more than six paces before you stop and give God a shout of glory.",
            "download": "https:\/\/sermonindex.info\/SID11913-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Fruit Of Obedience",
            "url": "https:\/\/sermonindex.info\/SID16624",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8",
            "topic": "",
            "description": "Pastor Pointer speaks on the subject of obedience and the word of God. He shows the need for revival in the Church as there was revival in Nehemiah's day. He speaks of a revival not only of the spirit but of the word and spirit and without both there is a lack.",
            "download": "https:\/\/sermonindex.info\/SID16624-download",
            "preacher_name": "Roy Pointer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The High Cost of Caring",
            "url": "https:\/\/sermonindex.info\/SID13546",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13546-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Incredible Strength of Knowing God's Joy",
            "url": "https:\/\/sermonindex.info\/SID1399",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8:1-3, Nehemiah 8:8-10",
            "topic": "Joy",
            "description": "Another stirring sermon from Pastor Conlon, this time He takes us through many Scriptures including an exposition on the parable of the prodigal son that will greatly encourage and strengthen the listener in the joy of the Lord.",
            "download": "https:\/\/sermonindex.info\/SID1399-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Joy Of The Lord Is Your Strength",
            "url": "https:\/\/sermonindex.info\/SID15487",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 8:8-12",
            "topic": "Joy",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15487-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The order of the grain of mustard seed\t",
            "url": "https:\/\/sermonindex.info\/SID24168",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Moravians",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24168-download",
            "preacher_name": "Kevin Horton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Who Is Guarding The Front Door Of Your Home",
            "url": "https:\/\/sermonindex.info\/SID4333",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 7,Isaiah 44:1-4",
            "topic": "",
            "description": "We must examine ourselves for how we raised our children, and live our lives, for we will stand before a holy God and give account. Parents are responsible for what comes into their homes. Watchmen and guards must be appointed and we must all fast and pray for our homes and families. Pastor Wilkerson uses Nehemiah as an example of a caring watchman who was burdened for Israel when they were rebuilding the walls of the broken down city of Jerusalem.",
            "download": "https:\/\/sermonindex.info\/SID4333-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "7"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "Witnesses Against You",
            "url": "https:\/\/sermonindex.info\/SID14348",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 5:7",
            "topic": "",
            "description": "“I set a great assembly against them.” — Nehemiah 5:7. THE facts are these. At the time when certain of the Jews returned with Nehemiah to Jerusalem, many of them were in very straitened circumstances; and, contrary to the Jewish law, the richer Jews lent them money upon usurious interest, amounting to the hundredth per month, or twelve per cent. per annum. They took from their poorer brethren their lands, or put a heavy mortgage upon them; and in some cases took the men themselves to be slaves for debts which they had unavoidably incurred. Now, as you know, every Jew was a landholder, and his land, if mortgaged for a time, must return free to him in the fiftieth year; and, though a Jew might for a while become a servant to his Jewish brother, yet he must go out free at the end of the seventh year. He could only be bound for a short period of servitude. Nehemiah called to him, therefore, the elders, and nobles, and rulers of Jerusalem, and showed them how wrong they were to hold their poorer brethren in bondage. 'Ye exact usury, every one of his brother,' he says; and he rebukes them sharply for it. When he found that his own words were scarcely powerful enough with them, he gathered together the people, and let them all have a voice, and in the many voices there was power...",
            "download": "https:\/\/sermonindex.info\/SID14348-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "5"
                }
            ]
        }
    ]
}