{
    "name": "Philemon",
    "sermons": [
        {
            "title": "(Through The Bible) Philemon",
            "url": "http:\/\/api.sermonindex.net\/SID6620",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6620-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "77 Guidelines for Gathering",
            "url": "http:\/\/api.sermonindex.net\/SID25422",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon 1:2, Colossians 4:15, Matthew 18:20",
            "topic": "Audio Books",
            "description": "Dear brothers and sisters we are writing these practical guidelines on how to gather as a fellowship under the Headship of Jesus Christ not as rules but rather helpful ways forward for some. Any 2-3 brothers or sisters can meet in this way and start to allow the Lord to mature their gathering. We must have the simplicity of faith that our Gathering is unto Him and not for ourselves. Early Christians met together with a great joy at times because they were gathering with others who have been redeemed by the precious blood of Jesus Christ. So Jesus Christ Himself was the center of their unity. These simple guidelines combine many of the Principles found in the Principles for the Gathering of Believers volume.",
            "download": "http:\/\/api.sermonindex.net\/SID25422-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                },
                {
                    "book": "Colossians",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Charge That to My Account",
            "url": "http:\/\/api.sermonindex.net\/SID0270",
            "size": "2033152",
            "format": "mp3",
            "scripture": "Philemon 1:8-18",
            "topic": "Gospel",
            "description": "\"Paul might have said, . . . 'Onesimus, I'm going to become your surety. I'll undertake to settle your debt. And I'm going to write a letter to Philemon and I want you to take it to him. Don't plead anything for yourself, just hand him the letter in which he will learn that I'm willing to settle everything in a righteous way.'... \"When the Lord Jesus Christ became my surety . . . he went to Calvary's cross, and all my guilt was charged against Him. He settled for everything, and then He cried, 'It is finished.' And on the basis of that finished work, God can freely forgive, and justify completely, every poor sinner who trusts in the Lord Jesus Christ.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0270-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Philemon 3",
            "url": "http:\/\/api.sermonindex.net\/SID8541",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon 3",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8541-download",
            "preacher_name": "Ken Baird",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Running From Church To Find God",
            "url": "http:\/\/api.sermonindex.net\/SID2778",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon 1:19",
            "topic": "Seeking God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2778-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Thanksgiving of Paul for the Saints",
            "url": "http:\/\/api.sermonindex.net\/SID5757",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 1:4, Philemon 1:4, Philippians 1:3-6",
            "topic": "Thanksgiving",
            "description": "\"[Paul's] thankfulness and his perspective about people that he was ministering to,\" David Smithers shares, \"gave him the power to influence and have authority in people's lives.\"  He goes on to share how a heart of gratefulness and thankfulness, not griping and complaining, is what consumed the apostle.  Do we have those same apostolic priorities in our relating to brothers and sisters in Christ's body?",
            "download": "http:\/\/api.sermonindex.net\/SID5757-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "1"
                },
                {
                    "book": "Philemon",
                    "chapter": "1"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Book of Philemon",
            "url": "http:\/\/api.sermonindex.net\/SID24467",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon",
            "topic": "Audio Bible KJV",
            "description": "This shortest of all Paul’s letters was addressed to Philemon (although two other persons are included in the salutation). Paul entreats Philemon, the master of Onesimus, a runaway slave, to receive him back as a brother in Christ (16, 17). This very personal letter reveals not only the concern of the Apostle for a converted slave but also a practical demonstration of brotherhood in Christ, \"where there is neither bond (slave) nor free\". (Gal 3:28)",
            "download": "http:\/\/api.sermonindex.net\/SID24467-download",
            "preacher_name": "Audio Bible NT - KJV",
            "preacher_image": "",
            "preacher_description": "Audio Bible NT KJV ( - )\r\nListen to freely downloadable audio sermons by the Audio Bible NT KJV in mp3 format. Many other things we might give thee warning of (gentle Reader) if we had not exceeded the measure of a Preface already. It remaineth, that we commend thee to God, and to the Spirit of his grace, which is able to build further than we can ask or think. He removeth the scales from our eyes, the vail from our hearts, opening our wits that we may understand his word, enlarging our hearts, yea correcting our affections, that we may love it to the end. Ye are brought unto fountains of living water which ye digged not; do not cast earth into them with the Philistines, neither prefer broken pits before them with the wicked Jews. [Gen 26:15. Jer 2:13.] Others have laboured, and you may enter into their labours; O receive not so great things in vain, O despise not so great salvation! Be not like swine to tread under foot so precious things, neither yet like dogs to tear and abuse holy things. Say not to our Saviour with the Gergesites, Depart out of our coast [Matt 8:34]; neither yet with Esau sell your birthright for a mess of pottage [Heb 12:16]. If light be come into the world, love not darkness more than light; if food, if clothing be offered, go not naked, starve not yourselves. Remember the advice of Nazianzene, \"It is a grievous thing\" (or dangerous) \"to neglect a great fair, and to seek to make markets afterwards:\" also the encouragement of S. Chrysostom, \"It is altogether impossible, that he that is sober\" (and watchful) \"should at any time be neglected:\" [S. Chrysost. in epist. ad Rom. cap. 14. oral. 26.]\r\nLastly, the admonition and menacing of S. Augustine, \"They that despise God's will inviting them, shall feel God's will taking vengeance of them.\" [S. August. ad artic. sibi falso object. Artic. 16.] It is a fearful thing to fall into the hands of the living God; [Heb 10:31] but a blessed thing it is, and will bring us to everlasting blessedness in the end, when God speaketh unto us, to hearken; when he setteth his word before us, to read it; when he stretcheth out his hand and calleth, to answer, Here am I, here we are to do thy will, O God. The Lord work a care and conscience in us to know him and serve him, that we may be acknowledged of him at the appearing of our Lord Jesus Christ, to whom with the holy Ghost, be all praise and thanksgiving. Amen.",
            "_scripture": []
        }
    ]
}