{
    "name": "Song Of Solomon",
    "audio_sermons": [
        {
            "title": "Song of Solomon",
            "url": "http:\/\/sermonindex.net\/SID2256",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon",
            "topic": "Song of Solomon",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2256-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Song of Solomon Prayer as Communion",
            "url": "http:\/\/sermonindex.net\/SID23908",
            "size": "0",
            "format": "mp3",
            "scripture": "Song Of Solomon",
            "topic": "Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23908-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        }
    ]
}