{
    "name": "Ezekiel 12",
    "book": "Ezekiel",
    "chapter": 12,
    "audio_sermons": [
        {
            "title": "The Final Warning Comes in Pictures",
            "url": "http:\/\/sermonindex.net\/SID14867",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 12:1-6",
            "topic": "Warning",
            "description": "February 25, 2007 - God in His mercy will begin to speak to us through pictures. Think of the images the Lord has set before us in recent times. Images of the towers in New York City - symbols of pride and commerce that America trusts in, and in one hour they came crashing down. The Pentagon - the symbol of invincible strength, burned by fire. There are pictures in society in the news papers of people given to self gratification, addicted to drugs, obsessed with wealth, publicity and fame only to be lead to an early grave. Could it be the Lord is putting before us a picture of what we are becoming as a society. Thanks be to God that there are other pictures that God desires to use to show to society. If you are in a dungeon of darkness and despair God is preparing you to be a picture to this society. Pictures are developed in a dark room. God is calling the Church of Jesus Christ to come out of these dark places of despair to be the last picture of His love, mercy and faithfulness.",
            "download": "http:\/\/sermonindex.net\/SID14867-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "12"
                }
            ]
        }
    ]
}