{
    "name": "Ezekiel 22",
    "book": "Ezekiel",
    "chapter": 22,
    "sermons": [
        {
            "title": "(Godly Home) Part 22 - Where are the Men",
            "url": "https:\/\/sermonindex.info\/SID7427",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 22:30, Isaiah 3:1-8",
            "topic": "Godly Home Series",
            "description": "\"The challenge of the hour is for leadership in the home,\" says Denny Kenaston.  Who will rise to the challenge?  Brother Denny sounds a clarion call to the men to rise up from their apathy and respond to the call of God to be godly husbands and fathers.",
            "download": "https:\/\/sermonindex.info\/SID7427-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "3"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "61. What is forbidden in the fourth commandment?",
            "url": "https:\/\/sermonindex.info\/SID22415",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 22:26, Ezekiel 23:38",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22415-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "22"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Hell - Part 2",
            "url": "https:\/\/sermonindex.info\/SID0320",
            "size": "4910592",
            "format": "mp3",
            "scripture": "Ezekiel 22",
            "topic": "Hell",
            "description": "The main text for this message is in Ezekiel 22.  Wilkerson preaches on a message that makes most rather uncomfortable because it is the most hated truth in this world.  But there is no taking away from the biblical fact that hell is real, hell is torture, and hell is for sinners.",
            "download": "https:\/\/sermonindex.info\/SID0320-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "Leadership 1 ",
            "url": "https:\/\/sermonindex.info\/SID23660",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 22",
            "topic": "Leadership",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23660-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "Missionary Commitment by Billy Graham",
            "url": "https:\/\/sermonindex.info\/SID19752",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 22:30-31",
            "topic": "Classics Podcast",
            "description": "Billy Graham exhorts a large gathering of young people to count the count to follow Christ fully in missionary service. This is a prophetic message for our day to consider the true cost of following Christ and serving Him in missions. Oh that God would raise up a radical disciples in and end times radical missions movement in these last days.",
            "download": "https:\/\/sermonindex.info\/SID19752-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "22"
                }
            ]
        }
    ]
}