{
    "name": "Ezekiel 34",
    "book": "Ezekiel",
    "chapter": 34,
    "sermons": [
        {
            "title": "(In The Word) 16 - The Adversary In The Church",
            "url": "https:\/\/sermonindex.info\/SID12626",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "https:\/\/sermonindex.info\/SID12626-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Lamentations",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Dangerous Shepards",
            "url": "https:\/\/sermonindex.info\/SID2466",
            "size": "10522624",
            "format": "mp3",
            "scripture": "Ezekiel 34:1-16,Jeremiah 23:18,John 10",
            "topic": "Shepards",
            "description": "This message is best described as how to identify dangerous, self-seeking shepherds, as the Bible describes in the scriptures. Where is the recognition of the seriousness and soberness of the high calling of being a shepherd to the sheep of God? Too many take it lightly and the sheep are scattered and wounded as a result, and often destroyed.",
            "download": "https:\/\/sermonindex.info\/SID2466-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "10"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "23"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "The Adversary In The Church by Milton Green",
            "url": "https:\/\/sermonindex.info\/SID16648",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "Podcast",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "https:\/\/sermonindex.info\/SID16648-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "1"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        }
    ]
}