{
    "name": "Ezekiel 8",
    "book": "Ezekiel",
    "chapter": 8,
    "sermons": [
        {
            "title": "83. Are all transgressions of the law equally heinous?",
            "url": "https:\/\/sermonindex.info\/SID22437",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8:6, 1 John 5:16",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22437-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                },
                {
                    "book": "1 John",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "No Hiding Place",
            "url": "https:\/\/sermonindex.info\/SID9047",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8:12",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9047-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Glory Of God Departing by Brian Long",
            "url": "https:\/\/sermonindex.info\/SID19435",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8",
            "topic": "Revival Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19435-download",
            "preacher_name": "Revival Conference Wales 2009",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Heaviness of Sin",
            "url": "https:\/\/sermonindex.info\/SID4292",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 38:1-6,Ezekiel 8",
            "topic": "",
            "description": "Two issues, both serious are addressed. If you feel the heaviness of sin it is the mercy of God trying to draw you back to the cross so you can be saved from your sin. There are those who respond with remorse and repentance to this and those we do not because they have made peace with it. If you are sick of your sin, and weary of it, there is hope for God will never refuse a sincere heart. But if you are cold, and have no urgency to pray or read the word of God, no concern for the lost and are taking your sin lightly, you are on very dangerous ground. If you are being entertained by watching the sin of others on television, you are guilty of sin.",
            "download": "https:\/\/sermonindex.info\/SID4292-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "38"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Image of God",
            "url": "https:\/\/sermonindex.info\/SID16288",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8:1-5, Revelation 1:14-15",
            "topic": "Idolatry",
            "description": "October 21, 2007 - When the church of Jesus Christ begins to portray a wrong image of God, it opens the door for uncalled and unfaithful men to take positions as spiritual leaders. The end result of standing before the wrong image of God will lead the people into a theological perspective that is based on human optimism as opposed to sacrifice and truth. The true image of God represents Jesus Christ, the Cross , His sacrifice and all that is Holy. If we are going to know the true image of God, we will be led to a place where we are undone, where everything that we thought we were has to die. We must take joyfully the spoils of all of our religious goods and come before this image of the TRUE and Holy God. It is only in the presence of Jesus Christ that we are turned from image to image by the Glory of God.",
            "download": "https:\/\/sermonindex.info\/SID16288-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Solemn Assembly",
            "url": "https:\/\/sermonindex.info\/SID24774",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8:1-18",
            "topic": "Apostasy",
            "description": "Brother EA gives a powerful urgent plea for repentance in the Church in America. The manifest presence has left the corporate Church gatherings, we need to turn back to the Lord in fasting, praying and weeping. Like in the days of Ezekiel there are so many hidden sins yet they have a sense of worship in that day. This hypocrisy needs to be stopped and for us to pray for revival confessing our need. We need such a solemn assembly in our day.",
            "download": "https:\/\/sermonindex.info\/SID24774-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                }
            ]
        }
    ]
}