{
    "name": "Deuteronomy 17",
    "book": "Deuteronomy",
    "chapter": 17,
    "sermons": [
        {
            "title": "(Through The Bible) Deuteronomy 17-20",
            "url": "http:\/\/sermonindex.net\/SID6330",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 17-20",
            "topic": "",
            "description": "What people give to God should not be castoffs. There should not be given something to God that doesn’t cost us but rather something should be given to God that costs us. Jesus watching the mite that gave out of her lively hood and substance he said she gave more then all! Nations that have been great got corrupted by the inside instead of being conquered from the outside. God ordered that idolatorship worship should result in stoning. That way the nation of Israel was kept pure and towards the One true God so that the nation was persevered. People were to get 2-3 witnesses if something was worshipping an idol and then they were stoned for the punishment. The Nation of Israel was to be an Theocracy which was God who was the King and God ruled over it. God knows what He is talking about, we have to realize that our thinking and our solutions really are not above the rules and punishments that God has put in place. As God has stated it how it should be.",
            "download": "http:\/\/sermonindex.net\/SID6330-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "17"
                }
            ]
        }
    ]
}