{
    "name": "Deuteronomy 20",
    "book": "Deuteronomy",
    "chapter": 20,
    "audio_sermons": [
        {
            "title": "Are the Giants Really Necessary?",
            "url": "http:\/\/sermonindex.net\/SID19296",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 20:1-4, Psalm 24:1",
            "topic": "Victory",
            "description": "August 16, 2009 - What do you do when you find giants occupying the very land that God promised is yours? Have you ever asked yourself, \"if God is with us why do I face such violent opposition?\" Are these obstacles and giants necessary? Obstacles and giants are placed on our path to teach us that we are not God. He is, and in and of yourself there is no strength to defeat these enemies. The Word of God promises that God Himseld will fight for us! Victory comes when we stand against these giants in the power of the Holy Spirit for the glory and honor of God's Name!",
            "download": "http:\/\/sermonindex.net\/SID19296-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "24"
                },
                {
                    "book": "Deuteronomy",
                    "chapter": "20"
                }
            ]
        }
    ]
}