{
    "name": "Deuteronomy 30",
    "book": "Deuteronomy",
    "chapter": 30,
    "audio_sermons": [
        {
            "title": "(Through The Bible) Deuteronomy 30-34",
            "url": "http:\/\/sermonindex.net\/SID6333",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 30-34",
            "topic": "",
            "description": "Prophecy of Jesus that will be fulfilled in His glory, then the angels will go out and gather Gods people from the four corners of the earth. The will return as the messiah to gather the people from the four corners of the earth. This is from Matthew 24:31, that is why many that focus their ministry in the new testament miss from the old testament the context they need to have for these prophecies. Salvation is as close to you as you could imagine. It is not something that we have to achieve by tremendous effort and energy. It is as close to us as confessing and believing, its an easy thing. Anyone can be saved in this very moment by just confessing and believing in Christ. Jesus I believe you rose from the dead. Believing is a matter of choice, you can choose to believe that Jesus rose from the dead.",
            "download": "http:\/\/sermonindex.net\/SID6333-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Deuteronomy 30:6 ",
            "url": "http:\/\/sermonindex.net\/SID19219",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 30:6 ",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19219-download",
            "preacher_name": "Kevin Turner",
            "preacher_image": "",
            "preacher_description": "Kevin Turner ( - )\r\nListen to freely downloadable audio sermons by the speaker Kevin Turner in mp3 format.  Kevin Turner is the founder and president of Strategic World Impact, an organization committed to working in the “hot spots” of the world. For 23 years, Kevin has been working in the world’s most restricted and dangerous areas, witnessing suffering firsthand and encountering life-threatening situations. On more than one occasion, Kevin has been forced to run for his life as shelling and other attacks have taken place.\r\nKevin worked in Bosnia, Croatia and Serbia for four years during their civil war. Southeast Asia is another targeted area for him, as he’s made several trips smuggling Bibles into restricted nations there. He has photographed prison camps for pastors in the jungles, and has established short wave radio projects so tribal people can hear the Gospel. For 11 years, Kevin’s work focused on sharing the Gospel with unreached people groups in Sudan, and also helping the persecuted in Sudan’s neighboring nation, Eritrea.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Its not blind faith",
            "url": "http:\/\/sermonindex.net\/SID8186",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 30:19",
            "topic": "",
            "description": "Mark Cahill presents the solid truth that God is real and the Bible is His truth from history, archaeology, mathematical probability and science.  He labors to prove from the Ten Commandments that every man is guilty before God and needs Jesus Christ.  Do you have Jesus Christ through surrendering your life to Him?",
            "download": "http:\/\/sermonindex.net\/SID8186-download",
            "preacher_name": "Mark Cahill",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Where's The Fire",
            "url": "http:\/\/sermonindex.net\/SID19885",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 30:1-3",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19885-download",
            "preacher_name": "Ronald Glass",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "30"
                }
            ]
        }
    ]
}