{
    "name": "Deuteronomy 34",
    "book": "Deuteronomy",
    "chapter": 34,
    "sermons": [
        {
            "title": "(Depressed Disciples) Permanent Physical Infirmity",
            "url": "https:\/\/sermonindex.info\/SID7318",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 34:7",
            "topic": "Physical Infirmity",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7318-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "Frustrations Can Be Fatal",
            "url": "https:\/\/sermonindex.info\/SID13636",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 34:4-7",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13636-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "Joshua",
            "url": "https:\/\/sermonindex.info\/SID23520",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 34:1-12, Joshua 1:1-13",
            "topic": "Joshua",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23520-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "34"
                },
                {
                    "book": "Joshua",
                    "chapter": "1"
                }
            ]
        }
    ]
}