{
    "name": "Deuteronomy 5",
    "book": "Deuteronomy",
    "chapter": 5,
    "sermons": [
        {
            "title": "(The Role Of Demons In Today's Society) Part 4",
            "url": "https:\/\/sermonindex.info\/SID15283",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 5: 8-10, Lamentations 5-7",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15283-download",
            "preacher_name": "Dean Hochstetler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                },
                {
                    "book": "Lamentations",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(The Role Of Demons In Today's Society) Part 5",
            "url": "https:\/\/sermonindex.info\/SID15284",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 34: 6-7, Numbers 14:18, Deuteronomy 5:7",
            "topic": "Demons",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15284-download",
            "preacher_name": "Dean Hochstetler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                },
                {
                    "book": "Numbers",
                    "chapter": "14"
                },
                {
                    "book": "Exodus",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "(Through The Bible) Deuteronomy 5-8",
            "url": "https:\/\/sermonindex.info\/SID6328",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 5-8",
            "topic": "",
            "description": "The Lord talked to the people face to face. He is the God that brought the people out of the land of bondage. There is a repetition of the ten commandments in these chapters.  O that the people would hear me and obey me, God laments over us wanting to do so many things through us. He loves us so much and wants to demonstrate his love towards us. Our heart needs to be towards Him so that He can do many things through us! One compound unity, and absolute unity is the 2 words that are used in Hebrew for 1. The compound unity one is what God is being referred to saying “God is one Lord” which is part of the SHMA, the heart of Judaism doctrine which refers to the trinity of God. God keeps an book of remembrance of everything that we speak to friends and people, we need to talk about God and Jesus more in our life’s. Keeping the consciousness of God in our daily life. God is an jealous God so we should not tempt God but live towards Him. We should diligently keep the commandments of God and the statutes that it may be well of us. We have to take time to explain things to children because God has given children the power to question and ask questions about God.",
            "download": "https:\/\/sermonindex.info\/SID6328-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Fear of God",
            "url": "https:\/\/sermonindex.info\/SID0200",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 5:22",
            "topic": "Fear Of God",
            "description": "Harold Vaughn preaches about the amazing presence of God.  How the Israelites saw the glory of God, heard His voice, and witnessed numerous miracles that only God could do… and yet after all of these things they feared circumstances more than they feared God.",
            "download": "https:\/\/sermonindex.info\/SID0200-download",
            "preacher_name": "Harold Vaughan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Awesome Voice of God",
            "url": "https:\/\/sermonindex.info\/SID3603",
            "size": "17998848",
            "format": "mp3",
            "scripture": "Deuteronomy 5:22-29",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID3603-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Visiting the Iniquity of the Fathers",
            "url": "https:\/\/sermonindex.info\/SID14048",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 20:5-6, Exodus 34:6-7, Deuteronomy 5:29",
            "topic": "Sin",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14048-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "20"
                },
                {
                    "book": "Exodus",
                    "chapter": "34"
                },
                {
                    "book": "Deuteronomy",
                    "chapter": "5"
                }
            ]
        }
    ]
}