{
    "name": "Leviticus 1",
    "book": "Leviticus",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 1-10",
            "url": "http:\/\/api.sermonindex.net\/SID6318",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 1-10",
            "topic": "",
            "description": "Christ was more then our sin offering but also our sweets savor offerings. There were 3 basic sweet savor offerings, burnt offering, meal offering and the peace offering. There were 2 sin offerings, one the sin offering and 2nd the trespass offering. An offering needs to be our of our own free will. To return to fellowship with God is in our volition. The laying on of the hands is the symbol of the animal taking the place of ourselves and we transfer our sins to it in the old covenant. The blood of goats and rams really never forgave the sins but rather covered them. But with Jesus our sins have been put away not just covered. The purpose of all the sacrifices and the covenant is so that we can have relationship and oneness with God. This fellowship needs obedience to have agreement with God. God created man with the purpose of fellowship and man disobeyed and was alienated from God and God determined to restore that fellowship. The animals only covered the sins for a time and brought partial fellowship with God. But it pointed forward to that time when God would send his own son as a lamb without spot or blemish before God.",
            "download": "http:\/\/api.sermonindex.net\/SID6318-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Jesus As The Lamb",
            "url": "http:\/\/api.sermonindex.net\/SID5394",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22, Leviticus 1",
            "topic": "Lamb Of God",
            "description": "\"Where is the lamb for the burnt offering?\" asks Roy Hession.  We may often be more like a lion or a tiger than a submissive lamb of brokenness and Calvary love as the Lord Jesus, but we can be assured that Jesus as our Lamb has been accepted on our behalf.  Revell Hession shares an encouraging message to those who may have gotten out of the way of the Lord. NOTE: The last 20 minutes of audio is poor quality.",
            "download": "http:\/\/api.sermonindex.net\/SID5394-download",
            "speaker_name": "Roy Hession",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                },
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "The Burnt Offering",
            "url": "http:\/\/api.sermonindex.net\/SID5422",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22:7-8, Hebrews 11:17-19, Leviticus 1:3-4",
            "topic": "Burnt Offering",
            "description": "Here in Genesis we read of the Lord testing Abrahams faith, which is confirmed in Hebrews 11.  Isaac was to be the burnt offering which would produce a sweet smelling savour to the Lord, we see him here in the place of the lamb that bows his head instead of stiffening his neck.  Pastor Hession shows there are 3 key sayings in these verses, 1: Where is the Lamb? when we are stubborn and self willed where are the lamb like qualities in us that marked the life of our Lord?  2: God will provide Himself a Lamb,  this He did in the form of his Son, the Lord Jesus, Who was the only One Who could offer up a sweet smelling savour to God.  3: He shall be accepted for Him, here is the wonder of His substitution for us that God credits to us the sweet savour that ascended up from Calvary.",
            "download": "http:\/\/api.sermonindex.net\/SID5422-download",
            "speaker_name": "Roy Hession",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "11"
                },
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        }
    ]
}