{
    "name": "Leviticus 11",
    "book": "Leviticus",
    "chapter": 11,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 11-15",
            "url": "https:\/\/sermonindex.info\/SID6319",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 11-15",
            "topic": "",
            "description": "If we hearken diligently to the Lord our God then blessed will be our body, flocks, lands etc. That was the promise of God to Jews in the old covenant. God has given us certain spiritual laws and if we obey them we will be blessed. But if we do not listen or obey Gods words then we will be cursed. Joshua was exhortated the mediate on the book of the law day and night and his way was going to be prosperous. It is not just having the law but rather doing the law that will bring the blessing. The Lord is interested in our health and diet. We cannot be eating a lot of junk food and expect God to bless us with a healthy body. God is interested in good nuturion. The foods that God dis-allowed in Leviticus was because they were foods that were unhealthy and unsafe for the people of Israel. God gives a list and parts of the beasts that they could eat. The animals had to pass over the 3 things the Lord said it had to be able to do, had a hoofed foot, chews the cud, etc. There was controversy over the rabbit chewing the cud. But recently it was found out that they actually do chew the cud. In wild rabbit it is dangerous because they carry some fevers such as yellow fever. Pork needs to be cooked very well so we don’t get sick from it so God was just trying to take care of the people of Israel.",
            "download": "https:\/\/sermonindex.info\/SID6319-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "11"
                }
            ]
        }
    ]
}