{
    "name": "Leviticus 16",
    "book": "Leviticus",
    "chapter": 16,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 16-20",
            "url": "http:\/\/sermonindex.net\/SID6320",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 16-20",
            "topic": "",
            "description": "God said to the people that they are not to go to the Holy of Holies or they will die. Only Aaron was to go into the Holy of Holies on the Day of Atonement. He has to kill about 35 animals and also bath 5 times in the rituals to offer for his own sins and for the people of Israel. All of this is looking forward to Jesus Christ in symbolism. Jesus Christ did not annually come to offer sacrifices but rather did it once and sat down at the right hand of God. These were all a shadow of things to come but Jesus Christ is the Substance! All the other sacrifices are Shadows of Jesus Christ. The High Priest Aaron took 2 goats one to the Lord and one for the scapegoat. On YumKippur he did this and this was an annual event. He came into the presence of God manifested on the mercy seat. This is the law of God for sin. God forbids any eating of blood because it is the blood that makes the atonement for the soul. Though the Jews observe YumKippur yet how do they have forgiveness of sins? The answer they say is the day of reflection. The hope and purpose is that the good out weighs the evil. Through blood sacrifices there is remission of sin so without these offerings you cannot just act good to be in fellowship with God.",
            "download": "http:\/\/sermonindex.net\/SID6320-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 4",
            "url": "http:\/\/sermonindex.net\/SID17547",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32:17, Leviticus 16:3, Ezekiel 16:44",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "http:\/\/sermonindex.net\/SID17547-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                },
                {
                    "book": "Leviticus",
                    "chapter": "16"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "16"
                }
            ]
        }
    ]
}