{
    "name": "Leviticus 16",
    "book": "Leviticus",
    "chapter": 16,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 16-20",
            "url": "http:\/\/api.sermonindex.net\/SID6320",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 16-20",
            "topic": "",
            "description": "God said to the people that they are not to go to the Holy of Holies or they will die. Only Aaron was to go into the Holy of Holies on the Day of Atonement. He has to kill about 35 animals and also bath 5 times in the rituals to offer for his own sins and for the people of Israel. All of this is looking forward to Jesus Christ in symbolism. Jesus Christ did not annually come to offer sacrifices but rather did it once and sat down at the right hand of God. These were all a shadow of things to come but Jesus Christ is the Substance! All the other sacrifices are Shadows of Jesus Christ. The High Priest Aaron took 2 goats one to the Lord and one for the scapegoat. On YumKippur he did this and this was an annual event. He came into the presence of God manifested on the mercy seat. This is the law of God for sin. God forbids any eating of blood because it is the blood that makes the atonement for the soul. Though the Jews observe YumKippur yet how do they have forgiveness of sins? The answer they say is the day of reflection. The hope and purpose is that the good out weighs the evil. Through blood sacrifices there is remission of sin so without these offerings you cannot just act good to be in fellowship with God.",
            "download": "http:\/\/api.sermonindex.net\/SID6320-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 4",
            "url": "http:\/\/api.sermonindex.net\/SID17547",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32:17, Leviticus 16:3, Ezekiel 16:44",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "http:\/\/api.sermonindex.net\/SID17547-download",
            "speaker_name": "Major Ian Thomas",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                },
                {
                    "book": "Leviticus",
                    "chapter": "16"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "16"
                }
            ]
        }
    ]
}