{
    "name": "Leviticus 17",
    "book": "Leviticus",
    "chapter": 17,
    "sermons": [
        {
            "title": "The Voice of Jesus Blood",
            "url": "http:\/\/sermonindex.net\/SID0241",
            "size": "4825088",
            "format": "mp3",
            "scripture": "Genesis 9:4,Leviticus 17:11,Deuteronomy 12:23",
            "topic": "Jesus Blood",
            "description": "All life is God’s Life and all Life is in the Blood. When innocent blood is spilled -- like Abel’s -- it cries out to God and God hears its voice. When Jesus came to earth, the sin of man’s spilling of blood ran in His holy veins. But Christ’s Blood cries out to the Father in our behalf because His is the Blood of the ultimate sacrifice for our sins, not the blood of a murdered man.",
            "download": "http:\/\/sermonindex.net\/SID0241-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "12"
                },
                {
                    "book": "Leviticus",
                    "chapter": "17"
                },
                {
                    "book": "Genesis",
                    "chapter": "9"
                }
            ]
        }
    ]
}