{
    "name": "Leviticus 21",
    "book": "Leviticus",
    "chapter": 21,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 21-24",
            "url": "http:\/\/sermonindex.net\/SID6321",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 21-24",
            "topic": "",
            "description": "The Priest had a 2-fold function, to stand before God for the people. And then stand before the people in the stead of God. If you touched a dead body you could not enter into the tabernacle. The priest could only touch the bodies of the immediate family or else they would be defiled. Also they were not to make baldness on their heads, some people used to make vows by shaving the head. I am the Lord that sanctifies you that is Holy, that was how God revealed Himself to the priests. If any man had a blemish he could not be a priest and approach God, so there were physical disqualifications for approaching God in the Old Covenant. You are not to offer to God any animal that had a blemish, God did not want the cast off’s. I will sacrifice to God something that costs me anything-said David in reference to the threshing floor story. We want to give of our surplus. In giving to God in freewill always, and always the best. Honoring God and showing our love to God giving God the best we have is important indeed.",
            "download": "http:\/\/sermonindex.net\/SID6321-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "The Beard, its Historical and Biblical Significance",
            "url": "http:\/\/sermonindex.net\/SID13011",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 21:1-6",
            "topic": "",
            "description": "Does the Scripture speak to every area of life? We believe it does. Pastor Weaver expounds the biblical principles concerning male facial hair. Also the historical record of the significance of this visual separation of the sexes and symbol of male headship is fully explored. This is probably something you have never considered. Ask the LORD to open your heart to the truth He has for you in this message.",
            "download": "http:\/\/sermonindex.net\/SID13011-download",
            "preacher_name": "John Weaver",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "21"
                }
            ]
        }
    ]
}