{
    "name": "Leviticus 24",
    "book": "Leviticus",
    "chapter": 24,
    "sermons": [
        {
            "title": "(1 Samuel) David on the Decline",
            "url": "http:\/\/api.sermonindex.net\/SID10650",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21 1-9, Leviticus 24:5-9",
            "topic": "",
            "description": "David is on the run from king Saul, he is afraid, hasnt eaten or slept properly for days, he is confused and had just had to bid farewell to his closest friend Jonathan, but it was here that the Lord would train David to be a king.  David goes to the tabernacle of God at Nob, to Ahimelech the priest, this was th right thing to for David to do to go to the house of the Lord.  But when he is asked what is going on by Ahimelech David lies to him several times in order to protect himself and maybe also Ahimelech from Saul.  David asks the priest for food, and all that is available is the shew bread which was used in the tabernacle to symbolize how the Lord desires to have fellowship with us.  So Ahimelech gives David the shewbread even though it was usually eaten by the priests, this shows that serving a human need is of greater importance than observing priestly traditions.  Does the Edomite, a servant of Saul was there and witnessed what was happening.  Finally David asks for a weapon from Ahimelech and he gioves him Goliaths sword, which David takes, the Lord was probably reminding David that the last time he held that sword he won a great victory as he was in the will of God and didn't need to resort to the flesh to deliver him.",
            "download": "http:\/\/api.sermonindex.net\/SID10650-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Leviticus",
                    "chapter": "24"
                }
            ]
        }
    ]
}