{
    "name": "Leviticus 25",
    "book": "Leviticus",
    "chapter": 25,
    "sermons": [
        {
            "title": "(Through The Bible) Leviticus 25-27",
            "url": "http:\/\/sermonindex.net\/SID6322",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 25-27",
            "topic": "",
            "description": "Every seventh year you let what grows up just eat that. God said if you do this in the sixth year leaving the land it will be a triple crop so it will carry over to the 8th year. One day if a person who studies land and agriculture will realize that if you leave the land for 1 year every 7 years it will help the land be more plentiful. Letting the ground rest for 1 year what a concept. Chuck Smith is certain this is a physical law of God and it is true. God sent Israel into Babylon because they would not give the land rest, so God sent them for Babylon for 70 years to let the land rest. Let the land grow wildly so that there are servants and poor people that could eat from the land. Every 50 years it was the year of jubilee, all depts. And mortgages were cancelled and all slaves set free. It is like Pentecost, a special year of jubilee. The various laws of redemption are given in these chapters. We in the new covenant are redeemed in Christ but in the Old Covenant, the slaves in the 7th year was set free. We are less then years away from 6000 years of slavery to sin. There is a 1000 year millennium coming.",
            "download": "http:\/\/sermonindex.net\/SID6322-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "74. What is required in the eighth commandment?",
            "url": "http:\/\/sermonindex.net\/SID22428",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Thessalonians 3:10-12, Leviticus 25:35",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22428-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Thessalonians",
                    "chapter": "3"
                },
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "The Kinsman Redeemer",
            "url": "http:\/\/sermonindex.net\/SID25566",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 25:25-55",
            "topic": "Redeemer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25566-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "25"
                }
            ]
        }
    ]
}