{
    "name": "Leviticus 26",
    "book": "Leviticus",
    "chapter": 26,
    "sermons": [
        {
            "title": "Leviticus 26",
            "url": "http:\/\/api.sermonindex.net\/SID24342",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 26",
            "topic": "Leviticus",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24342-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "The Quarrel of God's Covenant",
            "url": "http:\/\/api.sermonindex.net\/SID11927",
            "size": "0",
            "format": "mp3",
            "scripture": "Leviticus 26:25",
            "topic": "God's Covenant",
            "description": "May 29,2005 - God gives a warning to Israel and the same warning can be applied to us today. If you take lightly the Lord’s presence and if you begin to dabble in and out of obedience and disobedience so that you develop a warped sense of what it means to walk with Him – God said He will have a quarrel with us. The scripture says that two cannot walk together unless they agree. God is not required to agree with us but we are required to agree with Him.",
            "download": "http:\/\/api.sermonindex.net\/SID11927-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "26"
                }
            ]
        }
    ]
}