{
    "name": "Malachi 4",
    "book": "Malachi",
    "chapter": 4,
    "sermons": [
        {
            "title": "(Godly Home) Part 10 - The Hearts of the Fathers Must Turn",
            "url": "http:\/\/api.sermonindex.net\/SID7415",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 4:5-6",
            "topic": "Godly Home Series",
            "description": "Denny Kenaston analyzes in detail what the Word of God has to say about the absolute necessity of a father's heart turned towards his children.  The heaviest load falls upon the fathers to represent God to the children, and without that flow of the turned heart in love, time, discipline and teaching, the inevitable result is the curse of disobedience which plagues so much of American society today.",
            "download": "http:\/\/api.sermonindex.net\/SID7415-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Luke) 02 - Zacharias",
            "url": "http:\/\/api.sermonindex.net\/SID15102",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 1, Malachi 4:5-6",
            "topic": "Zacharias",
            "description": "What were the first words God spoke after His silence of 400 years? Zacharias the priest was the first to hear the Word of the Lord, yet despite his righteousness, he chose to be in unbelief. Ed Miller begins his study in Chapter 1 with contrasting Zacharias' unbelief with Mary's faith. With gentleness, he reminds all believers how easily we can fall into unbelief regardless of how close we walk with Him.",
            "download": "http:\/\/api.sermonindex.net\/SID15102-download",
            "speaker_name": "Ed Miller",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Message to Fathers and Children",
            "url": "http:\/\/api.sermonindex.net\/SID4386",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 4:5-6",
            "topic": "Family",
            "description": "In this message brother Daniel shows how in the endtimes in which we live there is be a turmoil between children and parents beyond what has ever been seen before. The spirit of rebellion and strife is being seen and manifested in many youth from godly Christian homes. This message will encourage you parents to pray and keep over your children and to children you will be challanged if your resentment of your parents is sin.",
            "download": "http:\/\/api.sermonindex.net\/SID4386-download",
            "speaker_name": "Keith Daniel",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "4"
                }
            ]
        }
    ]
}