{
    "name": "2 Corinthians 4",
    "book": "2 Corinthians",
    "chapter": 4,
    "sermons": [
        {
            "title": "(Christ) The Incomparable Christ",
            "url": "http:\/\/api.sermonindex.net\/SID16801",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:3-6, John 1:1",
            "topic": "Christ",
            "description": "Brother Denny eloquently preaches on Christ and Who He is (2 Cor. 4:3-6 and John 1:1, 14). All through history His footprints can be traced. If we do not change, we have not seen Him. Oh to behold Him and gaze upon Him, it will bring change into our lives.",
            "download": "http:\/\/api.sermonindex.net\/SID16801-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "1"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Genesis) 2 - The Light of the World",
            "url": "http:\/\/api.sermonindex.net\/SID12413",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:3-5, 2 Corinthians 4:1-6",
            "topic": "Jesus Christ",
            "description": "\"Light be\" is the first time God speaks in the biblical record, the significance which Johnson expounds upon.  The Apostle Paul had thought upon God's work in creation, to which that glorious light of revelation comes to us in the face of Jesus Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID12413-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(basics) 20. Still More On Dead Works",
            "url": "http:\/\/api.sermonindex.net\/SID8130",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:10,  1 Corinthians 4:2",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8130-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "26 Principle 22 - God Uses the Weak By His Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID25371",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:29, Jeremiah 18:6, 2 Corinthians 4:7",
            "topic": "Audio Books",
            "description": "God does not look to find those who are the elites and those who are the most skilled. Rather He looks for the weak383 and foolish who trust in Him. God uses broken pots and vessels,384 He uses imperfect people who trust in a perfect God. Thus all men will know that it is God who has manifested His power and glory through a brother or sister. It is realized then that it was not the work of men385 but the work of God. To bring maximum glory to His Name the Lord is assembling an end times movement of weak, poor, helpless, and despised people who the religious system of our day have written off as unusable for their purposes.",
            "download": "http:\/\/api.sermonindex.net\/SID25371-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "18"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "ALREADY HEAVEN",
            "url": "http:\/\/api.sermonindex.net\/SID21247",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:17",
            "topic": "Radio Show",
            "description": "God’s kingdom is the kingdom of heaven, which, as Jesus said, is already in our midst today. Therefore, the kingdom of heaven should be a joyful reality in our lives. But what does this mean in practical terms? Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/api.sermonindex.net\/SID21247-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Cherishing the Treasure of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID4175",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 13:44-46,2 Corinthians 4:5-6,Romans 11:33",
            "topic": "Cherishing Christ",
            "description": "We have this treasure in earthen vessels; the Spirit of the living God indwelling believers. And that presence will produce in a hungry soul an ever increasing revelation of who Christ is. This is often revealed in us and to us through suffering and trials. We have this great kingdom which cannot be moved, such great victory, and power living in us. Pastor Conlon goes through many other scriptures revealing how the Lord Jesus Christ is our Treasure. The person drawing closer to Him, cannot help being awed by Him, and at the same time painfully aware of their own sinful flesh in comparison. If your heart is toward Christ he knows, and he will not let the enemy overwhelm you as you trust in him. Pursuit of an ever increasing knowledge and intimacy with Christ should be the Christian's number one priority. When we get careless with the word of God and prayer, tragedy can come. The devil is always after the treasure of the presence of Christ in your life. Pastor Conlon warns: There is no greater danger than to become careless with this Book!",
            "download": "http:\/\/api.sermonindex.net\/SID4175-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "11"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Christ The Lord",
            "url": "http:\/\/api.sermonindex.net\/SID1498",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:5",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1498-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Don't Give Up",
            "url": "http:\/\/api.sermonindex.net\/SID24575",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:1",
            "topic": "Discouragement",
            "description": "Sometimes we grow fearful and sometimes we become fatigued. God will give you strength day by day as you call on him and trust in him. He will refresh you today.",
            "download": "http:\/\/api.sermonindex.net\/SID24575-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Dying (Bilingual)",
            "url": "http:\/\/api.sermonindex.net\/SID11639",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:12",
            "topic": "Death To Self",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11639-download",
            "preacher_name": "Jackie Pullinger",
            "preacher_image": "\/images\/jackie_pullinger.gif",
            "preacher_description": "Jackie Pullinger (1944 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jackie Pullinger in mp3 format. Shortly after her experience of being born-again the Lord called her to take a one-way ticket to Hong Kong, China. Her story is chronicled in the book: \"Chasing the Dragon\" which is a best-seller inspirational missionary story. He has founded St Stephen's Society in Hong Kong that helps serve drug addicts and gives them the life-transforming Gospel message.\r\n\r\nHer burden in ministry has been to show the love of Christ to the hurting and helpless. She saw in the message of the Gospel it had to have a response for us also to go and serve others. She teaches and shows this full-surrender is a simple response to receiving God's love in Jesus Christ.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Freedom From This World System",
            "url": "http:\/\/api.sermonindex.net\/SID17138",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:4, Ephesians 6:11, John 16:33",
            "topic": "World System",
            "description": "There is a distinction between “loving the world” and not being “of the world,” that believers must make.  We are not called to hide from the world, but rather we are to be in it while being completely freed from its clutches, and free from its systemic tyranny over our lives.  This sermon shows how, if you use worldly methods to attract people to your fellowships, worldly people are all you will attract.  Brother Zac uses a flurry of scriptures to blow away any notion that it is acceptable to God to still be of this present evil world.",
            "download": "http:\/\/api.sermonindex.net\/SID17138-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Ephesians",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Gideon #3: The Manifestation of The Lord Jesus Christ",
            "url": "http:\/\/api.sermonindex.net\/SID11397",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 7:1-21, 1 Corinthians 1:26-29, 2 Corinthians 4:6-11",
            "topic": "",
            "description": "What does it mean to release the life of God for others?  Gideon's 300 provides vital clues of what makes up God's remnant, the New Testament overcomer.  We are the vessels God uses, but He must break us in order for His glory to shine out of us.",
            "download": "http:\/\/api.sermonindex.net\/SID11397-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                },
                {
                    "book": "Judges",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Growing in the Grace of God #17 - More Characteristics of New Covenant Living Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID11352",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:1",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11352-download",
            "preacher_name": "Bob Hoekstra",
            "preacher_image": "",
            "preacher_description": "Bob Hoekstra ( - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bob Hoekstra in mp3 format. Bob's involvement with the Calvary Chapels began in 1971, when he and his wife Dini visited Calvary Chapel Costa Mesa on a Sunday evening. They were deeply touched by the life-giving teaching of the word of God, the simple worship \"in Spirit and in truth\", and the profound expressions of the love of the Lord among the saints. Upon returning to Dallas, they regularly obtained Pastor Chuck Smith's teaching tapes and eventually became daily listeners of the Word for Today on the radio.\r\n\r\nSince 1993, Bob had been teaching at Calvary Chapel and other church fellowships across the country and overseas (including, Seminars, Pastors' Conferences, Church Services, Leadership Conferences, Retreats, and Schools of Evangelism\/Ministry). He has taught numerous classes at Calvary Chapel Bible College (both at its former location in Twin Peaks, CA and its current location in Murrieta Hot Springs, CA) as well as at the extension campuses of Costa Mesa, Vista, San Diego, El Cajon, and others. Bob's teaching generally highlights such subjects as Counseling God's Way ,Family God's Way ,Growing in the Grace of God ,The Church: How Jesus Builds It ,Contending for the Faith ,Promise Believers ,The Sufficiency of Christ and His Word ,The Psychologizing of the Faith , and related themes.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Growing in the Grace of God #18 - More Characteristics of New Covenant Living Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID11353",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:1",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11353-download",
            "preacher_name": "Bob Hoekstra",
            "preacher_image": "",
            "preacher_description": "Bob Hoekstra ( - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bob Hoekstra in mp3 format. Bob's involvement with the Calvary Chapels began in 1971, when he and his wife Dini visited Calvary Chapel Costa Mesa on a Sunday evening. They were deeply touched by the life-giving teaching of the word of God, the simple worship \"in Spirit and in truth\", and the profound expressions of the love of the Lord among the saints. Upon returning to Dallas, they regularly obtained Pastor Chuck Smith's teaching tapes and eventually became daily listeners of the Word for Today on the radio.\r\n\r\nSince 1993, Bob had been teaching at Calvary Chapel and other church fellowships across the country and overseas (including, Seminars, Pastors' Conferences, Church Services, Leadership Conferences, Retreats, and Schools of Evangelism\/Ministry). He has taught numerous classes at Calvary Chapel Bible College (both at its former location in Twin Peaks, CA and its current location in Murrieta Hot Springs, CA) as well as at the extension campuses of Costa Mesa, Vista, San Diego, El Cajon, and others. Bob's teaching generally highlights such subjects as Counseling God's Way ,Family God's Way ,Growing in the Grace of God ,The Church: How Jesus Builds It ,Contending for the Faith ,Promise Believers ,The Sufficiency of Christ and His Word ,The Psychologizing of the Faith , and related themes.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Into The All Sufficiency Of Christ #3 - Brokenness",
            "url": "http:\/\/api.sermonindex.net\/SID11403",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4-5",
            "topic": "",
            "description": "\"In order for Christ to be manifested,\" teaches Ed Miller, \"the clay pot has to be broken.\"  Four simple principles from the life of Paul makes us not brokenness-centered but Christ-centered.  Brother Ed how Paul could endure the sufferings because he was \"never at home\" but enjoying the presence of the Lord.",
            "download": "http:\/\/api.sermonindex.net\/SID11403-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Meet Your Psychiatrist: He Helps You Live by Faith",
            "url": "http:\/\/api.sermonindex.net\/SID17603",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:1-13",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17603-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Praying The Scriptures - Volume 1",
            "url": "http:\/\/api.sermonindex.net\/SID25903",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:17",
            "topic": "Scripture Praying",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25903-download",
            "preacher_name": "David Ford",
            "preacher_image": "",
            "preacher_description": "David Ford ( - )\r\nListen to freely downloadable audio sermons by the speaker David Ford in mp3 format.  David preaches in city-wide crusades, church-wide conventions, at Christian colleges and universities as well as at many other venues throughout the United States and overseas. In 1983, he traveled with Dr. Stephen Olford throughout the country and had ministered on platforms with him before his Homegoing in 2004 (David was blessed to have him on his Advisory Board).\r\nSpeaking from his heart, David is deeply burdened for true revival in the church and spiritual awakening in America and the world. In God's grace and goodness, many series of meetings extends well beyond scheduled dates because God sovereignly moves in precious revival. To God be the glory!   Globe for Christ International, Inc. believes and knows that prevailing prayer is the key to revival!",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Revelation of Jesus Christ - Part 8 of 10",
            "url": "http:\/\/api.sermonindex.net\/SID0086",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:6,Galatians 1:15",
            "topic": "Jesus Christ",
            "description": "This message was delivered on 04\/01\/1958.",
            "download": "http:\/\/api.sermonindex.net\/SID0086-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "1"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "SUFFERING TURNS TO GLORY",
            "url": "http:\/\/api.sermonindex.net\/SID22819",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:17",
            "topic": "Radio Show",
            "description": "With God, suffering is never the end. This is an exciting truth of Christian discipleship. But what does it really mean, and how can we apply it to our lives? The answer is in this meditation!",
            "download": "http:\/\/api.sermonindex.net\/SID22819-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "SUFFERING TURNS TO GLORY",
            "url": "http:\/\/api.sermonindex.net\/SID24971",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:17",
            "topic": "Radio Show",
            "description": "With God, suffering is never the end. This is an exciting truth of Christian discipleship. But what does it really mean, and how can we apply it to our lives?",
            "download": "http:\/\/api.sermonindex.net\/SID24971-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Gospel Of The Devil! Believe It Not (2)",
            "url": "http:\/\/api.sermonindex.net\/SID14492",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:3",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID14492-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Lordship of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID9581",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:5",
            "topic": "Lordship Of Christ",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9581-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Ministry Of The Church - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID1220",
            "size": "4570112",
            "format": "mp3",
            "scripture": "2 Corinthians 4:1,2 Corinthians 6:1",
            "topic": "Church",
            "description": "This message was delivered on 03\/01\/1967.",
            "download": "http:\/\/api.sermonindex.net\/SID1220-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "6"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Ministry Of The Church - Part 5",
            "url": "http:\/\/api.sermonindex.net\/SID1223",
            "size": "6317568",
            "format": "mp3",
            "scripture": "2 Corinthians 3:18, 2 Corinthians 4:1-6",
            "topic": "Church",
            "description": "This message was delivered on 03\/01\/1967.",
            "download": "http:\/\/api.sermonindex.net\/SID1223-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Ministry Of The Church - Part 6",
            "url": "http:\/\/api.sermonindex.net\/SID1224",
            "size": "6524928",
            "format": "mp3",
            "scripture": "2 Corinthians 4:6",
            "topic": "Church",
            "description": "This message was delivered on 03\/01\/1967.",
            "download": "http:\/\/api.sermonindex.net\/SID1224-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Occult",
            "url": "http:\/\/api.sermonindex.net\/SID18438",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 10:17-20, 2 Corinthians 4:2, Ephesians 5:11",
            "topic": "Occult",
            "description": "Bill Mcleod covers the subject of the occult showing what things are hidden and beyond the bounds of normal human knowledge. Such occult is demonic and opposed to the counsel and spirit of God. We are to have no fellowship with the hidden things of darkness but rather reprove and uncover these things.",
            "download": "http:\/\/api.sermonindex.net\/SID18438-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "5"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Occult by Bill Mcleod",
            "url": "http:\/\/api.sermonindex.net\/SID18784",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 10:17-20, 2 Corinthians 4:2, Ephesians 5:11",
            "topic": "Podcast",
            "description": "Bill Mcleod covers the subject of the occult showing what things are hidden and beyond the bounds of normal human knowledge. Such occult is demonic and opposed to the counsel and spirit of God. We are to have no fellowship with the hidden things of darkness but rather reprove and uncover these things.",
            "download": "http:\/\/api.sermonindex.net\/SID18784-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "5"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Priority of Christ\t- Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID13062",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:3-6, 2 Timothy 3:15-17",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13062-download",
            "preacher_name": "Tom Wells",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "3"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Way To Look At Things",
            "url": "http:\/\/api.sermonindex.net\/SID26283",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 4:16-18",
            "topic": "Discouragement",
            "description": "Are you discouraged? Are you about to give up? Pastor Cymbala examines how Paul handled adversity. We trust you will find this message encouraging as it points to God's faithfulness. He looks at the passage of 2 Corinthians where it says that outward circumstances seem to be against us but internally we have an eternal destination so we should set our hearts there with that hope.",
            "download": "http:\/\/api.sermonindex.net\/SID26283-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        }
    ]
}