{
    "name": "2 Corinthians 8",
    "book": "2 Corinthians",
    "chapter": 8,
    "sermons": [
        {
            "title": "Desert Survival Series Pt 27- Moses The Servant of God",
            "url": "http:\/\/sermonindex.net\/SID20039",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 25:2, 2 Corinthians 8:1-6",
            "topic": "Desert Survival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20039-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "25"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "His Poverty, Our Riches",
            "url": "http:\/\/sermonindex.net\/SID10684",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 8:9",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10684-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Into The All Sufficiency Of Christ #4 - Ministry",
            "url": "http:\/\/sermonindex.net\/SID11404",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 8-9",
            "topic": "",
            "description": "Ed Miller concludes this 4-part series by showing that there can be no ministry that does not flow out of heart poverty.  \"In real ministry, only God is the giver and only the Lord Jesus is the gift.  If all they've touched you, they've touched death.\"  Miller draws out that powerful principle for all Christian service, illustrating that from the Macedonians \"who gave Christ and wrapped it with their money.\"",
            "download": "http:\/\/sermonindex.net\/SID11404-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "8"
                }
            ]
        }
    ]
}