{
    "name": "Esther 1",
    "book": "Esther",
    "chapter": 1,
    "sermons": [
        {
            "title": "Esther #1 Ch. 1-2",
            "url": "http:\/\/api.sermonindex.net\/SID12122",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1-2",
            "topic": "Esther",
            "description": "Esther is a facinating book in the Old Testament, it does not mention God in any obvious way but His hadn of prservation over the Jewish people is seen in a very dramatic way.  In a historical sense the events in Esther took place between Ezra chapter 6 & 7.  It starts with king Xeres of Persia in his winter palace preparing for a huge 180 day long feast just prior to him going to war with the Greek empire. During the feat the king commands that the queen be brought beofre him and all his naoble men who are there, the queen however refuses to come for reasons which are unknown, this angers the king greatly as it sets a very bad example to his lords and also to everyone in the empire, so the king decides to find a replacement for the her.  After a search is conducted he choses Esther, a jewess who was the neice of Mordecai one of the kings lords, and a descendant of Kish, king Sauls father.  Mordecai discoveres a plot to kill the king and informs Esther the queen who tells king and the conspirators were killed probably by impaling, but Mordecai received no reward.. yet.",
            "download": "http:\/\/api.sermonindex.net\/SID12122-download",
            "speaker_name": "Chuck Missler",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther - Prayer Meeting",
            "url": "http:\/\/api.sermonindex.net\/SID0593",
            "size": "16171008",
            "format": "mp3",
            "scripture": "Esther 1:11",
            "topic": "Brokenness",
            "description": "\"One man with God is a majority\" Ravenhill here, from the book of Esther, teaches on brokenness and being a \"marked man for God\". \"Dear Lord, put me in the row and shoot me, that is the quickest way to heaven\" Brother Ravenhill says while rebuking the fear of man. Do we want revival? Do we want the sacrifice that revival entails?",
            "download": "http:\/\/api.sermonindex.net\/SID0593-download",
            "speaker_name": "Leonard Ravenhill",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther 1:1",
            "url": "http:\/\/api.sermonindex.net\/SID7790",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1:1",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7790-download",
            "speaker_name": "William MacDonald",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        }
    ]
}