{
    "name": "Esther 1",
    "book": "Esther",
    "chapter": 1,
    "sermons": [
        {
            "title": "Esther #1 Ch. 1-2",
            "url": "https:\/\/sermonindex.info\/SID12122",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1-2",
            "topic": "Esther",
            "description": "Esther is a facinating book in the Old Testament, it does not mention God in any obvious way but His hadn of prservation over the Jewish people is seen in a very dramatic way.  In a historical sense the events in Esther took place between Ezra chapter 6 & 7.  It starts with king Xeres of Persia in his winter palace preparing for a huge 180 day long feast just prior to him going to war with the Greek empire. During the feat the king commands that the queen be brought beofre him and all his naoble men who are there, the queen however refuses to come for reasons which are unknown, this angers the king greatly as it sets a very bad example to his lords and also to everyone in the empire, so the king decides to find a replacement for the her.  After a search is conducted he choses Esther, a jewess who was the neice of Mordecai one of the kings lords, and a descendant of Kish, king Sauls father.  Mordecai discoveres a plot to kill the king and informs Esther the queen who tells king and the conspirators were killed probably by impaling, but Mordecai received no reward.. yet.",
            "download": "https:\/\/sermonindex.info\/SID12122-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther - Prayer Meeting",
            "url": "https:\/\/sermonindex.info\/SID0593",
            "size": "16171008",
            "format": "mp3",
            "scripture": "Esther 1:11",
            "topic": "Brokenness",
            "description": "\"One man with God is a majority\" Ravenhill here, from the book of Esther, teaches on brokenness and being a \"marked man for God\". \"Dear Lord, put me in the row and shoot me, that is the quickest way to heaven\" Brother Ravenhill says while rebuking the fear of man. Do we want revival? Do we want the sacrifice that revival entails?",
            "download": "https:\/\/sermonindex.info\/SID0593-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Esther 1:1",
            "url": "https:\/\/sermonindex.info\/SID7790",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 1:1",
            "topic": "Esther",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7790-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "1"
                }
            ]
        }
    ]
}