{
    "name": "Esther 3",
    "book": "Esther",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "Esther #2 Ch. 3-4",
            "url": "http:\/\/sermonindex.net\/SID12123",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 3-4",
            "topic": "Esther",
            "description": "Haman is 'the bad guy' of the story of Esther, interestingly he was the descendent of Agag king of the Amalekites, a man whom king Saul (of whom Mordecai was a descendent) spared against the will of God, it is interesting that if Saul had obeyed the Lord in wipoing out the Amalekites the events of Esther might never have taken place, there is an important lesson here in that our disobedience toward God may have far reaching consequences beyond our own lives.  Haman was promted to be the 'prime minister' of the Persian empire and this everyone had to pay ho9mage to him, which they did, all except Mordecai and Haman was greatly angered by this and sought revenge, not just against Mordecai but against his people, the Jews.  Haman went to the king and lies and asks that all the jews be killed in a holocaust fashion, the king doesn't check the facts but agrees and a decree is sent through all the empire.  Mordecai is greatly troubled by this and mourns and tells his niece Esther, the queen, that she has come to her place of status for sucha time as this.",
            "download": "http:\/\/sermonindex.net\/SID12123-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Downfall of Saddam Hussein",
            "url": "http:\/\/sermonindex.net\/SID2800",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 3:12-13",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2800-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Journey From Prayer To Obedience",
            "url": "http:\/\/sermonindex.net\/SID3582",
            "size": "10122752",
            "format": "mp3",
            "scripture": "Esther 3:7-13,Esther 4:13-14,Romans 8:9-11",
            "topic": "Obedience",
            "description": "(Preached: Feb. 8th, 2004). In a place of complacency, the enemy rose up to try to destroy God's people. After the captivity in Babylon, many of Israel had grown comfortable and stayed, rather than returning. Mixture in the world gives the enemy room to rise up and rule over you. Esther fasted and prayed, but she then had to get up and go to the king. We, as the Body of Christ, need to remember we are ambassadors of Christ, and there is no time for games. Jesus is coming, and we need to come out from among the world, and seperate ourselves for his purposes. If you are struggling with your flesh, this message will help you, and hopefully motivate you. Esther risked her life to intercede for her people. We need to risk whatever will come into our lives whether persecution, or trouble, to be seperated to God's purposes.",
            "download": "http:\/\/sermonindex.net\/SID3582-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Esther",
                    "chapter": "4"
                },
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        }
    ]
}