{
    "name": "Esther 4",
    "book": "Esther",
    "chapter": 4,
    "sermons": [
        {
            "title": "Esther 4",
            "url": "http:\/\/sermonindex.net\/SID7801",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 4",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7801-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Journey From Prayer To Obedience",
            "url": "http:\/\/sermonindex.net\/SID3582",
            "size": "10122752",
            "format": "mp3",
            "scripture": "Esther 3:7-13,Esther 4:13-14,Romans 8:9-11",
            "topic": "Obedience",
            "description": "(Preached: Feb. 8th, 2004). In a place of complacency, the enemy rose up to try to destroy God's people. After the captivity in Babylon, many of Israel had grown comfortable and stayed, rather than returning. Mixture in the world gives the enemy room to rise up and rule over you. Esther fasted and prayed, but she then had to get up and go to the king. We, as the Body of Christ, need to remember we are ambassadors of Christ, and there is no time for games. Jesus is coming, and we need to come out from among the world, and seperate ourselves for his purposes. If you are struggling with your flesh, this message will help you, and hopefully motivate you. Esther risked her life to intercede for her people. We need to risk whatever will come into our lives whether persecution, or trouble, to be seperated to God's purposes.",
            "download": "http:\/\/sermonindex.net\/SID3582-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Esther",
                    "chapter": "4"
                },
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        }
    ]
}