{
    "name": "Esther 5",
    "book": "Esther",
    "chapter": 5,
    "sermons": [
        {
            "title": "Esther #3 Ch. 5-7",
            "url": "http:\/\/sermonindex.net\/SID12124",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 5-7",
            "topic": "Esther",
            "description": "After 3 days of fasting a prayer Esther puts her life on the line and goes and sees the king without his permission, which was a capital offence.  The king shows her mercy and asks what her request is, she asks that she would prepare 2 banquets for the king and Haman.  This was a great honour for Haman, who is overjoyed by it, so they have their banquet and the king asks again what Esthers request is, but again she bides her time.  Haman on his way home sees Mordecai still mouring and is greatly angered that he still does not honour him.  That night the king is unable to sleep and asks for the chronicles to be read to him, in this he discovers that Mordecai has saved his life and not been rewarded yet.  So the king asks Haman what should be done to the man whom the king wishes to honour, Haman thi nking the king means him advises him how and the king commands that Haman honour Mordecai!!  If this wasn't enough for Haman the day after Esther exposes his plot to the king to kill her and all the jews the king flies of into a rage and demands Haman be killed on the very instrument of execution that he had prepared for Mordecai. A problem still remained however the empire had declared that all jews should be killed on a certain day and that day was looming.",
            "download": "http:\/\/sermonindex.net\/SID12124-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Esther 5",
            "url": "http:\/\/sermonindex.net\/SID7802",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 5",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7802-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "5"
                }
            ]
        }
    ]
}