{
    "name": "Esther 8",
    "book": "Esther",
    "chapter": 8,
    "sermons": [
        {
            "title": "Esther #4 Ch. 8-10",
            "url": "http:\/\/api.sermonindex.net\/SID12125",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 8-10",
            "topic": "Esther",
            "description": "Haman, enemy of the jews,is now dead but that doesn't mean that the Israelites are safe.  The king could not stop his own edict due to the laws of the Persian empire.  Mordecai was made prime minister of the whole empire and so was given the task of resolving the issue by the king.  He set about this by creating new laws that would protect the jews on the day they were set to be massacred.  So when the day finally came that all the jews should be killed they fought for their lives and were helkped by the authorities.  At this time approximately 76 thousand people were put to death throughout the whole empire spanning from India to north Africa but the jews did not take any of the spoil from their enemies.  At this time Hamans 10 sons were also put to death and their bodies hung up in order to disgrace them, this finally meant the end the Amalekites, whom king Saul had disobediently spared hundreds of years prior.",
            "download": "http:\/\/api.sermonindex.net\/SID12125-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Esther 8:7",
            "url": "http:\/\/api.sermonindex.net\/SID7803",
            "size": "0",
            "format": "mp3",
            "scripture": "Esther 8:7",
            "topic": "Esther",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7803-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Esther",
                    "chapter": "8"
                }
            ]
        }
    ]
}