{
    "name": "1 Corinthian 15",
    "book": "1 Corinthian",
    "chapter": 15,
    "audio_sermons": [
        {
            "title": "(True Disciple Conference) The Greatness of the Gospel",
            "url": "http:\/\/sermonindex.net\/SID16501",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthian 15:1-4",
            "topic": "Gospel",
            "description": "The Apostle is here declaring the gospel to believers, not the lost; those who have already heard and received it. This shows that the gospel is not something learned in five minutes, after which we go on to ‘deeper things’. The gospel of Jesus Christ is the deepest and greatest truth in all scripture – and we still won’t understand its greatness after an eternity of eternities. People are not excited about the gospel these days, because they don’t know it, and they don’t understand the fullness of it. Mr Washer pulls no punches: “If Jesus Christ and his gospel do not excite you, you are going to hell”, he pleads, before going on to explain what he means. He argues the great need for preachers of the true gospel, and explains what it means to receive the gospel, and how we may know that we have received it. What is your motivation for coming to Jesus Christ? Security? Healing? A new Mercedes? Or do you come for salvation? But what about coming to Christ simply because he is worthy? That alone ought to be motivation enough to repent and believe. This potent and searching message ends with a sober warning of the perils of ignoring this gospel. (50 minutes)",
            "download": "http:\/\/sermonindex.net\/SID16501-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Corinthian",
                    "chapter": "15"
                }
            ]
        }
    ]
}