{
    "name": "Zechariah 1",
    "book": "Zechariah",
    "chapter": 1,
    "sermons": [
        {
            "title": "(Through The Bible) Zechariah 1-5",
            "url": "http:\/\/api.sermonindex.net\/SID6491",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 1-5",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6491-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Overcoming the Power of Spiritual Defeat",
            "url": "http:\/\/api.sermonindex.net\/SID11082",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 1:16-21",
            "topic": "Spiritual Defeat",
            "description": "February 5, 2006 – Spiritual defeat is contrary thinking to the word of God. It is the seed of satan that works its way into the mind before it becomes a physical reality, but for the heart that can embrace this: God says“I have turned to you in mercy, I have brought you home to me and my dwelling place in you shall be built”. God has a predetermined design of what He intends to do in and through our lives. This work is started and completed by our Mater Carpenter Jesus Christ and His intentions are to design His church to become carpenters after His own heart. No devil can destroy this divine work.",
            "download": "http:\/\/api.sermonindex.net\/SID11082-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Studies In Zechariah 01 Zechariah 1:",
            "url": "http:\/\/api.sermonindex.net\/SID9712",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 1",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9712-download",
            "preacher_name": "John W. Bramhall",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "1"
                }
            ]
        }
    ]
}