{
    "name": "Zechariah 2",
    "book": "Zechariah",
    "chapter": 2,
    "sermons": [
        {
            "title": "MY BELOVED IS MINE",
            "url": "http:\/\/sermonindex.net\/SID21239",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 2:10",
            "topic": "Radio Show",
            "description": "God isn't a distant, impersonal deity. No, He loves us sinful creatures with all His heart, and He longs to make our lives full and happy. Listen to this testimony of one of the Sisters from the little Land of Canaan. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21239-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Studies In Zechariah 02 Zechariah 2:",
            "url": "http:\/\/sermonindex.net\/SID9713",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9713-download",
            "preacher_name": "John W. Bramhall",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Wall of Fire",
            "url": "http:\/\/sermonindex.net\/SID4330",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 2",
            "topic": "",
            "description": "This is a sobering message from the mid-eighties about the decline of American morals, the backsliding of the church and the negative influence on young people. The Word foretold all of the things that are coming to pass in our society. The enemy has come in like a flood on this generation, but God still has keeping power. God is not about to let the enemy triumph over his people.",
            "download": "http:\/\/sermonindex.net\/SID4330-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "2"
                }
            ]
        }
    ]
}