{
    "name": "Zechariah 6",
    "book": "Zechariah",
    "chapter": 6,
    "sermons": [
        {
            "title": "(Through The Bible) Zechariah 6-10",
            "url": "http:\/\/api.sermonindex.net\/SID6492",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6-10",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6492-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Christ Glorified as the Builder of His Church",
            "url": "http:\/\/api.sermonindex.net\/SID13276",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6:13",
            "topic": "",
            "description": "HEAVEN singeth evermore. Before the throne of God, angels and redeemed saints extol his name. And this world is singing too; sometimes with the loud noise of the rolling thunder, of the boiling sea, of the dashing cataract, and of the lowing cattle; and often with that still, solemn harmony, which floweth from the vast creation, when in its silence it praises God. Such is the song which gushes in silence from the mountain lifting its head to the sky, covering its face sometimes with the wings of mist, and at other times unveiling its snow-white brow before its Maker, and reflecting back his sunshine, gratefully thanking him for the light with which it has been made to glisten, and for the gladness of which it is the solitary spectator, as in its grandeur it looks down upon the laughing valleys. The tune to which heaven and earth are set, is the same. In heaven they sing, “The Lord be exalted; let his name be magnified for ever.” And the earth singeth the same: “Great art thou in thy works, O Lord! and unto thee be glory.” It would seem, therefore, a strange anomaly if the church, the temple of the living God, should be void of song...",
            "download": "http:\/\/api.sermonindex.net\/SID13276-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Studies In Zechariah 06 Zechariah 6:",
            "url": "http:\/\/api.sermonindex.net\/SID9717",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9717-download",
            "preacher_name": "John W. Bramhall",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        }
    ]
}