{
    "name": "Zechariah 6",
    "book": "Zechariah",
    "chapter": 6,
    "sermons": [
        {
            "title": "(Through The Bible) Zechariah 6-10",
            "url": "http:\/\/api.sermonindex.net\/SID6492",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6-10",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6492-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Christ Glorified as the Builder of His Church",
            "url": "http:\/\/api.sermonindex.net\/SID13276",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6:13",
            "topic": "",
            "description": "HEAVEN singeth evermore. Before the throne of God, angels and redeemed saints extol his name. And this world is singing too; sometimes with the loud noise of the rolling thunder, of the boiling sea, of the dashing cataract, and of the lowing cattle; and often with that still, solemn harmony, which floweth from the vast creation, when in its silence it praises God. Such is the song which gushes in silence from the mountain lifting its head to the sky, covering its face sometimes with the wings of mist, and at other times unveiling its snow-white brow before its Maker, and reflecting back his sunshine, gratefully thanking him for the light with which it has been made to glisten, and for the gladness of which it is the solitary spectator, as in its grandeur it looks down upon the laughing valleys. The tune to which heaven and earth are set, is the same. In heaven they sing, “The Lord be exalted; let his name be magnified for ever.” And the earth singeth the same: “Great art thou in thy works, O Lord! and unto thee be glory.” It would seem, therefore, a strange anomaly if the church, the temple of the living God, should be void of song...",
            "download": "http:\/\/api.sermonindex.net\/SID13276-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Studies In Zechariah 06 Zechariah 6:",
            "url": "http:\/\/api.sermonindex.net\/SID9717",
            "size": "0",
            "format": "mp3",
            "scripture": "Zechariah 6",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9717-download",
            "speaker_name": "John W. Bramhall",
            "_scripture": [
                {
                    "book": "Zechariah",
                    "chapter": "6"
                }
            ]
        }
    ]
}