{
    "name": "Joshua 14",
    "book": "Joshua",
    "chapter": 14,
    "sermons": [
        {
            "title": "(2008 USA Tour) Caleb, Give Me This Mountain!",
            "url": "http:\/\/sermonindex.net\/SID18261",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 14:6-14",
            "topic": "Caleb",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18261-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "(Godly Home) Part 23 - Fighting Battles for the Next Generation",
            "url": "http:\/\/sermonindex.net\/SID7428",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 14, Joshua 14:7-9",
            "topic": "Godly Home Series",
            "description": "\"The children will possess what the parents fought for in the Christian life,\" assures Denny Kenaston.  A disciplined and abundant Christian life is something very much worth fighting for for God's glory and the for the sake of the children.  Have we stopped fighting for more land?",
            "download": "http:\/\/sermonindex.net\/SID7428-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "14"
                },
                {
                    "book": "Numbers",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "A Man To Match The Mountains",
            "url": "http:\/\/sermonindex.net\/SID11454",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 14-15",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11454-download",
            "preacher_name": "David Roper",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Running Your Race (Bilingual)",
            "url": "http:\/\/sermonindex.net\/SID11640",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 14:6-12",
            "topic": "Christian Living",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11640-download",
            "preacher_name": "Jackie Pullinger",
            "preacher_image": "\/images\/jackie_pullinger.gif",
            "preacher_description": "Jackie Pullinger (1944 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jackie Pullinger in mp3 format. Shortly after her experience of being born-again the Lord called her to take a one-way ticket to Hong Kong, China. Her story is chronicled in the book: \"Chasing the Dragon\" which is a best-seller inspirational missionary story. He has founded St Stephen's Society in Hong Kong that helps serve drug addicts and gives them the life-transforming Gospel message.\r\n\r\nHer burden in ministry has been to show the love of Christ to the hurting and helpless. She saw in the message of the Gospel it had to have a response for us also to go and serve others. She teaches and shows this full-surrender is a simple response to receiving God's love in Jesus Christ.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "14"
                }
            ]
        }
    ]
}