{
    "name": "Joshua 17",
    "book": "Joshua",
    "chapter": 17,
    "audio_sermons": [
        {
            "title": "(Through The Bible) Joshua 17-24",
            "url": "http:\/\/sermonindex.net\/SID6336",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 17-24",
            "topic": "",
            "description": "Manasseh took part of its inheritance on the other side of the Jordan. They did not fully take over the Canaanites this was their mistake to not come into the full victory that God desired for them. This is a spiritual allegory that we are to come out of the bondage of Egypt which is sin and death and to come into the Land of promise which is the victorious spiritual life in Christ. Gods desire is for us to have all our enemies utterly driven out. We need to enter into the full victory by Christ and if these areas are not fully taken by faith and the promise of God then the devil will use it in our future. Let us not follow after the same example but follow after the spirit. We need to be totally open to God for what He has for us. Its sad to have a concept of God that limits us from God working in our life how He wants to. We cannot but any restraints on what he wants to do in our life and through our life. Why should we come short of the fullness God desires for our life. We need to give all areas of flesh that are not given into the ruler ship of Christ by the Spirit in our life.",
            "download": "http:\/\/sermonindex.net\/SID6336-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Iron Chariots",
            "url": "http:\/\/sermonindex.net\/SID0251",
            "size": "7360000",
            "format": "mp3",
            "scripture": "Judges 1:19, Joshua 17:18",
            "topic": "Prophetic Word",
            "description": "This is a prophetic message about what God has planned for North America in particular.  In the 1st Chapter of Isaiah Wilkerson shows what this country has becomeÂ…  A nation of slaves.",
            "download": "http:\/\/sermonindex.net\/SID0251-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "17"
                },
                {
                    "book": "Judges",
                    "chapter": "1"
                }
            ]
        }
    ]
}