{
    "name": "Joshua 6",
    "book": "Joshua",
    "chapter": 6,
    "sermons": [
        {
            "title": "The Ark of the Covenant: Around Jericho Part III",
            "url": "https:\/\/sermonindex.info\/SID16669",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 6",
            "topic": "Ark Of The Covenant",
            "description": "In this sermon Roy Hession teaches us about the power of acting on faith in God.  When Joshua was given instruction from God by a heavenly host to take down the walls of Jericho with a mighty shout & spare none except for Rahab & her household, it was the Israelite’s faith in God’s plan that made it a success, not the ark by itself.",
            "download": "https:\/\/sermonindex.info\/SID16669-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Truths from Israel's History, Part 3 - Captain of the Lord's Host",
            "url": "https:\/\/sermonindex.info\/SID11441",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 5:13-15, Joshua 6",
            "topic": "",
            "description": "Ed Miller shares vital principles of how to get the second generation from Gilgal to Jericho by looking at Joshua.  Joshua's encounter with the Captain of the Lord's hosts is an illustration that 1) God fights for God, and 2) He has come to take over.  Just as the battle is the Lord's, so too the victory is the Lord's.",
            "download": "https:\/\/sermonindex.info\/SID11441-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "5"
                },
                {
                    "book": "Joshua",
                    "chapter": "6"
                }
            ]
        }
    ]
}