{
    "name": "Joshua 7",
    "book": "Joshua",
    "chapter": 7,
    "sermons": [
        {
            "title": "Achan Was Robbed",
            "url": "http:\/\/sermonindex.net\/SID4193",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7",
            "topic": "Achan",
            "description": "Achan did not fully trust the word of the Lord to provide for his people, which is why he took of the accursed thing. Had he waited, after the fall of Jericho, Israel took the spoil of the land, not just one city. He traded his inheritance for a wedge of gold and a garment and a few pieces of silver. This word of God is quick and powerful and sharp. Don't let Satan rob you as he did Achan. Convicting.",
            "download": "http:\/\/sermonindex.net\/SID4193-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Confession: Giving Glory to God",
            "url": "http:\/\/sermonindex.net\/SID6754",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7:1-21",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6754-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Joshua (part 6): Dealing with the past",
            "url": "http:\/\/sermonindex.net\/SID9564",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9564-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Learning From Losing",
            "url": "http:\/\/sermonindex.net\/SID11453",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11453-download",
            "preacher_name": "David Roper",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Lessons From Losing",
            "url": "http:\/\/sermonindex.net\/SID24057",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7:1-12",
            "topic": "Victory",
            "description": "Joshua learned much when he lost his first battle, and we learn much more when we lose than when things are going well. Lessons from losing prepares us for future victories. Joshua 7:1-12",
            "download": "http:\/\/sermonindex.net\/SID24057-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Truths from Israel's History, Part 4 - Defeat and Victory at Ai",
            "url": "http:\/\/sermonindex.net\/SID11442",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 7,8",
            "topic": "",
            "description": "\"There are many occasions of defeat,\" says Ed Miller, \"but only one cause of defeat.\"  Brother Ed analyzes the root cause of failure at Ai--Israel's first and only defeat in the whole 7-year war to take Canaan.  This first defeat serves as a great warning to safeguard us against spiritual defeat but also a pointer to the first principles to restore us to greater usefulness after a time of failure.",
            "download": "http:\/\/sermonindex.net\/SID11442-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "7"
                }
            ]
        }
    ]
}