{
    "name": "Joshua 8",
    "book": "Joshua",
    "chapter": 8,
    "sermons": [
        {
            "title": "I Will Never Draw Back My Hand",
            "url": "http:\/\/api.sermonindex.net\/SID2774",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 8:16-18, Isaiah 24:4-12, Matthew 9:18-19",
            "topic": "Abraham",
            "description": "God told Abraham everywhere he walked the land would be given him, and his seed. Where ever we walk in the Word of God, when we begin to see the promises of God through the eyes of faith and realize they are for us, personally, things will begin to change. The difference between the kingdom of this world and the kingdom of God are contrasted in this message. An exciting truth!!",
            "download": "http:\/\/api.sermonindex.net\/SID2774-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "9"
                },
                {
                    "book": "Isaiah",
                    "chapter": "24"
                },
                {
                    "book": "Joshua",
                    "chapter": "8"
                }
            ]
        }
    ]
}