{
    "name": "Joshua 9",
    "book": "Joshua",
    "chapter": 9,
    "sermons": [
        {
            "title": "(Through The Bible) Joshua 9-16",
            "url": "http:\/\/api.sermonindex.net\/SID6335",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 9-16",
            "topic": "",
            "description": "The kings of Canaan thought the only hope to stop the armies of Israel was that they should all band their armies together against them in a sort of collation. The gibonites knew their only hope of making a covenant was to do it in disguise. They came to the camp of Israel in disguise to make peace with you, they brought moldy bread and clothes to make a peace treaty. Israel did not inquire of the Lord but rather make the pack with them and were deceived. This was the second mistake of Joshua as an army leader and the people began to murmur against Him. It was a fault of not relying on God. It was his failure to pray also at EI so that the troops were killed. He should have sought the council of God, inquiring not of the Lord. How many times we find ourselves in ungodly situations if we not only sought Gods guidance first. But of course we cry out to God before that but why don’t we first seek God and escape from failing into these situations.",
            "download": "http:\/\/api.sermonindex.net\/SID6335-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Spiritual Warfare and Deception",
            "url": "http:\/\/api.sermonindex.net\/SID24054",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 9:1-18, Matthew 7:15",
            "topic": "Gibeonites",
            "description": "Jim Cymbala gives a wonderful message on the Gibeonites. He clearly shows that Satan wants to deceive us and he warns against  false prophets. Satan uses masks to disguise true intentions. Let's be vigilant, walk close to God and read His word.  A powerful word that will set us free and encourage us to walk in victory with our Lord.",
            "download": "http:\/\/api.sermonindex.net\/SID24054-download",
            "speaker_name": "Jim Cymbala",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "7"
                },
                {
                    "book": "Joshua",
                    "chapter": "9"
                }
            ]
        }
    ]
}