{
    "name": "Lamentations 1",
    "book": "Lamentations",
    "chapter": 1,
    "sermons": [
        {
            "title": "(In The Word) 16 - The Adversary In The Church",
            "url": "http:\/\/api.sermonindex.net\/SID12626",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/api.sermonindex.net\/SID12626-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Lamentations",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Is It Nothing To You?",
            "url": "http:\/\/api.sermonindex.net\/SID9039",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 1:12",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9039-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Adversary In The Church by Milton Green",
            "url": "http:\/\/api.sermonindex.net\/SID16648",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "Podcast",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/api.sermonindex.net\/SID16648-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "1"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        }
    ]
}