{
    "name": "Lamentations 3",
    "book": "Lamentations",
    "chapter": 3,
    "sermons": [
        {
            "title": "84. What doth every sin deserve?",
            "url": "http:\/\/api.sermonindex.net\/SID22438",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 5:6, Lamentations 3:39",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22438-download",
            "speaker_name": "Westminster Shorter Catechism",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "5"
                },
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Great is Thy Faithfulness",
            "url": "http:\/\/api.sermonindex.net\/SID9041",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 3:22-23",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9041-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Memory - The Handmaid of Hope",
            "url": "http:\/\/api.sermonindex.net\/SID11524",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 3:21",
            "topic": "",
            "description": "DELIVERED ON SUNDAY MORNING, OCTOBER 15TH, 1865, BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “This I recall to my mind,therefore have I hope.”-Lamentations 3:21. MEMORY is very often the servant of despondency. Despairing minds call to remembrance every dark foreboding in the past, and every gloomy feature in the present. Memory stands like a handmaiden, clothed in sackcloth, presenting to her master a cup of mingled gall and wormwood. Like Mercury, she hastes, with winged heel, to gather fresh thorns with which to fill the uneasy pillow, and to bind fresh rods with which to scourge the already bleeding heart. There is, however, no necessity for this. Wisdom will transform memory into an angel of comfort. That same recollection which may in its left hand bring so many dark and gloomy omens, may be trained to bear in its right hand a wealth of hopeful signs. She need not wear a crown of iron, she may encircle her brow with a fillet of gold, all spangled with stars. When Christian, according to Bunyan, was locked up in Doubting Castle, memory formed the crab-tree cudgel with which the famous giant beat his captives so terribly. They remembered how they had left the right road, how they had been warned not to do so, and how in rebellion against their better selves, they wandered into By-path Meadow. They remembered all their past misdeeds, their sins, their evil thoughts and evil words, and all these were so many knots in the cudgel...",
            "download": "http:\/\/api.sermonindex.net\/SID11524-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Thank God for the Mercies of Christ (Festival of Thanksgiving)",
            "url": "http:\/\/api.sermonindex.net\/SID7161",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 3:21-25 ",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7161-download",
            "speaker_name": "John Piper",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Lord is my portion",
            "url": "http:\/\/api.sermonindex.net\/SID18695",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 3:24",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18695-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Novelties of Divine Mercy",
            "url": "http:\/\/api.sermonindex.net\/SID11493",
            "size": "0",
            "format": "mp3",
            "scripture": "Lamentations 3:22,23",
            "topic": "",
            "description": "A SERMON PUBLISHED ON THURSDAY, NOVEMBER 11TH, 1909, DELIVERED BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “His compassions... are new every morning: great is thy faithfulness.” —Lamentations 3:22, 23. THE Book of the Lamentations of Jeremiah is very dolorous. When you look upon the dragons, and owls, and pelicans, and bitterns of the wilderness, you have a fit picture of his mournful state. He was full of grief, like a bottle wanting vent. His heart was ready to burst with wormwood and with gall. But the whole current changes when the prophet brings to his remembrance the mercy of God. No sooner does he think of the compassions of the Most High than at once he takes his harp from the willows, and begins to sing as joyously as ever that sweet singer of Israel, David, sang before him; and, truly, if we, too, instead of harping upon our miseries, would but reflect upon our mercies, we should exchange, our mournful dirges for songs of joy. It is true that, God's people are a tried people, but it is equally true that God's grace is equal to their trials. It is quite true that through much tribulation they enter the kingdom; but then they do enter, and the thought of the kingdom that is coming sustains them in their present tribulation. They wade through the waters of woe, often breast-deep; but the billows do not, and shall not, go over them, they shall still be able to sing even in the midst of the tempest.",
            "download": "http:\/\/api.sermonindex.net\/SID11493-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "3"
                }
            ]
        }
    ]
}