{
    "name": "Isaiah 12",
    "book": "Isaiah",
    "chapter": 12,
    "sermons": [
        {
            "title": "(Isaiah) The Words of a Worshipper",
            "url": "http:\/\/api.sermonindex.net\/SID10760",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 12-13",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10760-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "God's Provision",
            "url": "http:\/\/api.sermonindex.net\/SID4355",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 12",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4355-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Is the Water In Your Well Drinkable",
            "url": "http:\/\/api.sermonindex.net\/SID3197",
            "size": "8103936",
            "format": "mp3",
            "scripture": "Isaiah 12:3,2 Kings 3:19",
            "topic": "",
            "description": "Believers have two kinds of water-the sweet water of Christ, and the bitter water of the old nature. We are still commanded to stop up the wells of the enemy and old nature, and by asking the Holy Spirit to show us each one and lead us through the enemy territory in our own minds, to stop up each one. God will give you strength to not make peace with these things he will lead you to each area where the enemy has gained a foothold and sends out streams of lies to hinder you or lead you differently than the Lord wants you to go and take authority over them and stop them up. Wonderful message of deliverance from torment of the mind.",
            "download": "http:\/\/api.sermonindex.net\/SID3197-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "12"
                },
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Isaiah 12",
            "url": "http:\/\/api.sermonindex.net\/SID22898",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 12",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22898-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "12"
                }
            ]
        }
    ]
}