{
    "name": "Isaiah 2",
    "book": "Isaiah",
    "chapter": 2,
    "sermons": [
        {
            "title": "Guide Posts and Warning Signs",
            "url": "http:\/\/api.sermonindex.net\/SID12982",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 2:22, Jeremiah 2:5, 2 Corinthians 10:5",
            "topic": "Testimony",
            "description": "You will be blessed listening as Paul Washer shares from what he calls his \"life verses\". This is a rich sermon full of truth that can be summed up with the message that knowledge of Christ is more important than anything.",
            "download": "http:\/\/api.sermonindex.net\/SID12982-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "10"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Isaiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Isaiah 2v11",
            "url": "http:\/\/api.sermonindex.net\/SID22634",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 2:11",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22634-download",
            "preacher_name": "John Marshall",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Day Before the Day of the Lord",
            "url": "http:\/\/api.sermonindex.net\/SID23951",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 2",
            "topic": "Isaiah",
            "description": "The Day of the Lord is coming and this chapter gives an amazing description of earth life during its final, dying moments. As an example, if 911 was the judgment of God, what was going on in our culture on 9\/10\/01 that brought about this judgment? The day of man is quickly coming to an end; the day of the Lord is upon us.",
            "download": "http:\/\/api.sermonindex.net\/SID23951-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "2"
                }
            ]
        }
    ]
}