{
    "name": "Isaiah 24",
    "book": "Isaiah",
    "chapter": 24,
    "audio_sermons": [
        {
            "title": "(Isaiah) Judgment and Praise in the Great Tribulation",
            "url": "http:\/\/sermonindex.net\/SID10765",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 24-25",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10765-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 24:14 - Part 3",
            "url": "http:\/\/sermonindex.net\/SID9920",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 24:14",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9920-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "I Will Never Draw Back My Hand",
            "url": "http:\/\/sermonindex.net\/SID2774",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 8:16-18, Isaiah 24:4-12, Matthew 9:18-19",
            "topic": "Abraham",
            "description": "God told Abraham everywhere he walked the land would be given him, and his seed. Where ever we walk in the Word of God, when we begin to see the promises of God through the eyes of faith and realize they are for us, personally, things will begin to change. The difference between the kingdom of this world and the kingdom of God are contrasted in this message. An exciting truth!!",
            "download": "http:\/\/sermonindex.net\/SID2774-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "9"
                },
                {
                    "book": "Isaiah",
                    "chapter": "24"
                },
                {
                    "book": "Joshua",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Isaiah’s Apocalypse",
            "url": "http:\/\/sermonindex.net\/SID23955",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 24",
            "topic": "Apocalypse",
            "description": "“The cycle of prophecies which commences here has no other parallel in the Old Testament,” states the Keil & Delitsch commentary. “The earth will shake. It will ‘stagger’ like a ‘drunkard’ and ‘tremble’ like ‘a tent in a storm’—clearly a description of the Tribulation,” adds Wilmington. It is all there in Isaiah’s great vision, nearly 900 years before the Revelation of John.",
            "download": "http:\/\/sermonindex.net\/SID23955-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Overcoming the Spirit of Fear",
            "url": "http:\/\/sermonindex.net\/SID4180",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 24:17-18",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4180-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Resting In Jesus",
            "url": "http:\/\/sermonindex.net\/SID3091",
            "size": "10684416",
            "format": "mp3",
            "scripture": "Isaiah 24:16-21,Jeremiah 30:17,Psalm 125:1-5",
            "topic": "",
            "description": "Isaiah and Jeremiah were prophets who had the true word of the Lord, and warned Israel and Judah of severe judgment that was coming if they did not turn back to God. But even in spite of dreadful knowledge of what was coming, they did not despair of hope. They knew God had mercy and compassion, and would not destroy the righteous with the wicked. There are hard times coming but those who keep their minds stayed on the Lord will have perfect peace. No matter what happens, God is in control and is reigning on his throne.",
            "download": "http:\/\/sermonindex.net\/SID3091-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "30"
                },
                {
                    "book": "Psalms",
                    "chapter": "125"
                }
            ]
        },
        {
            "title": "Voices In The Coming Storm",
            "url": "http:\/\/sermonindex.net\/SID3782",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 24:10",
            "topic": "Storms",
            "description": "Carter starts this message out at Isaiah 24:10 where the word speaks of a hard time that is to come. He uses this verse then different verses\\ with the disciples in boats during storms to show the need of having to learn a lesson of faith. In this message Carter shows how God allows his people to go through hard times so that they later are able to trust the Lord in the situations that they will go through in the future. Paul’s life was also used in a parallel to the disciples to show how God uses trials to mold the people of God. His points are that there is a coming storm that God will allow and it is those people that learn trust in the current trials that they are going through that will be used in this future storm. The people who will be used in the future storm are the man or woman of God that can say {I believe God} when the storm is happening.",
            "download": "http:\/\/sermonindex.net\/SID3782-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "When The Enemy Comes In Like a Flood",
            "url": "http:\/\/sermonindex.net\/SID4332",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:16-21,Isaiah 24:10-11,Malachi 3:13-18",
            "topic": "Apostasy",
            "description": "This world is being flooded with sin and abomination by a devil intent on destroying and carrying away everyone he can, especially those who have a love for Jesus Christ in their heart and have his Spirit inside them. These are they who are crying out to God, who still hunger and thirst after righteousness, inspite of the apostasy in the mainstream church, and a sin-sick world, there are those who still hunger for God. This is a sobering message reflective of today's society, but ends in a joyous certainty of the victory and provision of our Lord for his people.",
            "download": "http:\/\/sermonindex.net\/SID4332-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "Isaiah",
                    "chapter": "24"
                },
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        }
    ]
}