{
    "name": "Isaiah 32",
    "book": "Isaiah",
    "chapter": 32,
    "sermons": [
        {
            "title": "(Godly Home) Part 17 - A Quiet, Ordered Life",
            "url": "http:\/\/api.sermonindex.net\/SID7422",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 23, Isaiah 32:17-18",
            "topic": "Godly Home Series",
            "description": "Brother Denny continues along the guiding, training aspects of raising children by showing how God is primarily a leader not a corrector.  He teaches how your home can become a \"haven of rest and refreshment\" by taking proactive leadership with your children in the good and right way.  Four ways of establishing calm, quiet authority are addressed along with four categories of parenting, good and bad.",
            "download": "http:\/\/api.sermonindex.net\/SID7422-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                },
                {
                    "book": "Psalms",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "(Isaiah) Our Beautiful King",
            "url": "http:\/\/api.sermonindex.net\/SID10770",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32-33",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10770-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Holy Spirit Â– Come Back to Your Church",
            "url": "http:\/\/api.sermonindex.net\/SID13923",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32:15-20",
            "topic": "Holy Spirit",
            "description": "September 22, 2004 - Are you living in the fullness of the Spirit? Do you have a supply of the Holy Spirit to sustain you And to minister to those around you who are nearly insane with fear when the next terrorist bomb kills hundreds of thousands? The Holy Spirit is the administrator of the peace of Christ. We must have an outpouring of the Spirit before the coming judgments- but the Spirit will fall only upon those who pray, who rise up and tremble at His Word, who strip themselves of all confidence in the flesh, who seek a broken spirit and a contrite heart, who ask in faith.\r\nProphetic Message",
            "download": "http:\/\/api.sermonindex.net\/SID13923-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 4",
            "url": "http:\/\/api.sermonindex.net\/SID17547",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 32:17, Leviticus 16:3, Ezekiel 16:44",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "http:\/\/api.sermonindex.net\/SID17547-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "32"
                },
                {
                    "book": "Leviticus",
                    "chapter": "16"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Spiritual Authority",
            "url": "http:\/\/api.sermonindex.net\/SID4323",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 3:1-4,Isaiah 32:17",
            "topic": "",
            "description": "True spiritual authority is only given to the hidden man of the heart, (Christ in you, the hope of glory) who is meek, and submitted to the will of the Father. Submit, forgive yourself for your mistakes. Go to the cross for cleansing. Seek the Lord and he will do the work in you. Excellent message on spiritual warfare. Too many in the church don't have the spiritual authority the Lord said he gave his own over all power of the enemy. Paul warned in the last days people would have an appearance of godliness with no power. You can stand up to the devil and say enough! Enough of the powerlessness in your life. Enough of letting him by with laughing at you. Submit to God, and take back your family for God. Take back what the enemy has stolen.",
            "download": "http:\/\/api.sermonindex.net\/SID4323-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "3"
                },
                {
                    "book": "Isaiah",
                    "chapter": "32"
                }
            ]
        }
    ]
}