{
    "name": "Isaiah 34",
    "book": "Isaiah",
    "chapter": 34,
    "sermons": [
        {
            "title": "(Isaiah) The Highway of Holiness",
            "url": "https:\/\/sermonindex.info\/SID10771",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 34-35",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10771-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 34:4 - Part 3",
            "url": "https:\/\/sermonindex.info\/SID9936",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 34:4",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9936-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "His Eye is On the Sparrow",
            "url": "https:\/\/sermonindex.info\/SID13195",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 34:1, Isaiah 40:17-18",
            "topic": "Provision",
            "description": "July 23, 2006. The focus of God's eye is not on the calamities and wars around us. Jesus shows us how the Father cares for us in hard times by the analogy of the sparrow. The Lord is calling His church to rise up and take courage and trust God. He will begin to fill us with His grace and peace. God in these last days wants to give us an understanding of His love to keep us standing strong and secure .",
            "download": "https:\/\/sermonindex.info\/SID13195-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Isaiah",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "The Lord's Controversy Concerning Zion",
            "url": "https:\/\/sermonindex.info\/SID4215",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 34:8, Romans 2:28-29, Hebrews 12:22",
            "topic": "",
            "description": "Zion represents the overcoming, last days church. Not everybody who says Lord, Lord is going to make it in. Those who have been in the heavenly places with Christ, and are overcoming believers. They are overcoming the flesh, the devil, and the world. They walk in the power of the Spirit and their heart is not here but in heaven with Jesus, and their mind is on heavenly things. God has a controversy when the nations of this world mistreat His Son's Body. Sinners and hypocrites in Zion will be afraid when God begins to move and shake things. They won't be prepared for there is no security unless you are IN CHRIST. Unless your life is hid in Him, and you are dead to this world and it's vain attractions. The enemy is coming in like a flood against God's people, but remember, He sits, as KING of the flood.",
            "download": "https:\/\/sermonindex.info\/SID4215-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "34"
                },
                {
                    "book": "Romans",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "12"
                }
            ]
        }
    ]
}