{
    "name": "Isaiah 40",
    "book": "Isaiah",
    "chapter": 40,
    "sermons": [
        {
            "title": "(1 Peter - Part 18): On Laying Aside Certain Things",
            "url": "http:\/\/api.sermonindex.net\/SID2071",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:1-3,Isaiah 40:6-7",
            "topic": "Laying Aside",
            "description": "“On Laying Aside Certain Things” is part 18 of Pastor A. W. Tozer’s delightful, 34-part series based upon Peter’s first epistle. The message was preached in Chicago, Illinois, on January 24, 1954, and it addresses 1 Peter 2:1-3, as well as 1 Peter 1:23-25 (from Isaiah 40:6-7.) Pastor Tozer treats us to several very astute word studies: “wherefore,” “laying aside,” “guile,” “hypocrisies,” “envies,” and “sincere milk.” Without rebirth, the most promising child, the actress in Hollywood, the president in the White House, and the eugenicists’ theoretical “super man,” all exist beneath the same two, dark clouds: mortality and corruption. Men die and then they rot; thank God for the birth that is incorruptible and never dies! Drawing wisely from Socrates, Pastor Tozer also challenges those liberals who ask, instead of turning from wickedness, “What is wickedness?” The length of the recording is 39 minutes and 5 seconds.",
            "download": "http:\/\/api.sermonindex.net\/SID2071-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 40:12 - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID9945",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:12",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9945-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "26 Principle 22 - God Uses the Weak By His Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID25371",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:29, Jeremiah 18:6, 2 Corinthians 4:7",
            "topic": "Audio Books",
            "description": "God does not look to find those who are the elites and those who are the most skilled. Rather He looks for the weak383 and foolish who trust in Him. God uses broken pots and vessels,384 He uses imperfect people who trust in a perfect God. Thus all men will know that it is God who has manifested His power and glory through a brother or sister. It is realized then that it was not the work of men385 but the work of God. To bring maximum glory to His Name the Lord is assembling an end times movement of weak, poor, helpless, and despised people who the religious system of our day have written off as unusable for their purposes.",
            "download": "http:\/\/api.sermonindex.net\/SID25371-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "18"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "35 Principle 31 - Godly Disciplines for Assemblies",
            "url": "http:\/\/api.sermonindex.net\/SID25380",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6:16-18, Matthew 4:1-11, Isaiah 40:30-31",
            "topic": "Audio Books",
            "description": "One of the hidden jewels of the Church is godly discipline. There has been a great lack of teaching and encouragement in modern evangelicalism towards the godly disciplines of: Fasting, waiting on God, early rising, head coverings, prevailing prayer, systematic Bible reading, Bible memorization, kneeling in prayer, and many other godly traditions in Church history.",
            "download": "http:\/\/api.sermonindex.net\/SID25380-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                },
                {
                    "book": "Matthew",
                    "chapter": "4"
                },
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "A Way Known Only To God",
            "url": "http:\/\/api.sermonindex.net\/SID2910",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 8:1-3,Isaiah 40:27-31,Psalm 78:36-37",
            "topic": "Presence Of God",
            "description": "The Lord wants his people to rejoice in his presence which is only possible if you are walking with him in confidence of your acceptance with him. We don't know the journey God is taking us but he does. God will test and prove his people along this journey as he did Israel in the wilderness to see if we will believe and obey him. He wants us not living on bread (prosperity) promises alone, but by every promise in the Word of God. To not fully trust God is to strip him of all he wants to be and can be to us and bring him down to the level of a dead idol. It's a grievous sin in God's eyes to have unbelief, and the church needs to realize it.",
            "download": "http:\/\/api.sermonindex.net\/SID2910-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "78"
                },
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Deuteronomy",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Divisions In The Church",
            "url": "http:\/\/api.sermonindex.net\/SID3819",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:31, John 20:21",
            "topic": "Divisions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID3819-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "John",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Don’t Let Discouragement Take Your Strength",
            "url": "http:\/\/api.sermonindex.net\/SID19297",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:25-31",
            "topic": "Discouragement",
            "description": "August 23, 2009 - Discouragement can be debilitating. We can get so despondent that we will begin to doubt the existence of God. God will allow seasons of discouragement when; there is something hidden in our heart and He wants to get at it; when we take that which belongs to the Lord and keep it for ourselves; and when we fail to realize there is a divine purpose even in the darkest of times. We must cry out to God and ask Him to take away the perception that coming to Christ is all about us. We are not called to live for ourselves. It is Christ is in us for the betterment of others. When we understand this truth God will transform the valley of trouble into a gateway of hope!",
            "download": "http:\/\/api.sermonindex.net\/SID19297-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Get A Good Look At God",
            "url": "http:\/\/api.sermonindex.net\/SID13515",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:1-17, Isaiah 25-31",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13515-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Isaiah",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "God´s tender mercies",
            "url": "http:\/\/api.sermonindex.net\/SID14307",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:1-2",
            "topic": "Mercy Of God",
            "description": "Jerusalem was in ruins and God's people were utterly vanquished by the enemy. Many were in captivity in Babylon. They realised that they had sinned grievously, and were totally despondent. And then God's Word turned from judgement to mercy. Consider this carefully, for it is applicable to our day too. There are Christians who have been taken captive and live a defeated Christian life, as we read in Rom 7, \"For what I will to do, that I do not practice; but what I hate, that I do\". They realise and acknowledge their utter desperate state, and have grown despondent. God has pity and feels compassion on His people who have lost their way and acknowledge their desperate state and cry unto Him for mercy.",
            "download": "http:\/\/api.sermonindex.net\/SID14307-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "God´s tender mercies part 2 - Preparing the Way",
            "url": "http:\/\/api.sermonindex.net\/SID14308",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:3-5",
            "topic": "Mercy Of God",
            "description": "Last Sunday we looked at the first two verses of Isaiah 40. The message of God's comfort and tender mercy is promised to His people. The continuation and explanation of this grace flows naturally into the next verses. This grace and comfort is through true repentance, as this text shows. When it speaks of the \"voice of Him\" crying in the wilderness it is a direct reference to John the Baptist but is not limited to him, for it is God's own voice that declares this message which brings repentance, faith, and glory (as shown in verse 5). King Herod, in a moment of intoxication and lust promised his lover's daughter (who had eroticially danced at the wine-flowing party) \"up to half his kingdom\". Her mother, with a deep-seated hatred against John the Baptist seized the opportunity to demand his head on a platter. She hated John for openly declaring that it \"was not right for Herod to take his brother's wife\". Nevertheless, the decaptitation of John, did not silence \"the voice of Him\". Even after the death of John this voice continued to cry out; as it does even now.",
            "download": "http:\/\/api.sermonindex.net\/SID14308-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "His Eye is On the Sparrow",
            "url": "http:\/\/api.sermonindex.net\/SID13195",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 34:1, Isaiah 40:17-18",
            "topic": "Provision",
            "description": "July 23, 2006. The focus of God's eye is not on the calamities and wars around us. Jesus shows us how the Father cares for us in hard times by the analogy of the sparrow. The Lord is calling His church to rise up and take courage and trust God. He will begin to fill us with His grace and peace. God in these last days wants to give us an understanding of His love to keep us standing strong and secure .",
            "download": "http:\/\/api.sermonindex.net\/SID13195-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Isaiah",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "How To Pray - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID3512",
            "size": "9698816",
            "format": "mp3",
            "scripture": "Isaiah 40",
            "topic": "Prayer Life",
            "description": "Using Isaiah 40 and a few other passages, Pastor Cymbala addresses three problems we run into in regard to prayer. 1. My problem is so big, it seems bigger than God. 2. God has forgotten about me and my problem. 3. The wait is just too long. I can't carry on anymore. He brings encouragement from the Scriptures and shows how big, how caring, and how faithful our God is.",
            "download": "http:\/\/api.sermonindex.net\/SID3512-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Isaiah 40",
            "url": "http:\/\/api.sermonindex.net\/SID7887",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7887-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Isaiah Chapter 40",
            "url": "http:\/\/api.sermonindex.net\/SID1579",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40",
            "topic": "Isaiah",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1579-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Mounting With Wings",
            "url": "http:\/\/api.sermonindex.net\/SID20530",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:29-31, 2 Samuel 1:23",
            "topic": "Freedom",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20530-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Quiet Time",
            "url": "http:\/\/api.sermonindex.net\/SID7371",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 12:1-8, Daniel 6:10-11, Isaiah 40:28-31",
            "topic": "Quiet Time",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7371-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Daniel",
                    "chapter": "6"
                },
                {
                    "book": "Genesis",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Soar Like the Eagles",
            "url": "http:\/\/api.sermonindex.net\/SID28865",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:31",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28865-download",
            "preacher_name": "+Thaddeus Barnum",
            "preacher_image": "",
            "preacher_description": "Bishop Thaddeus Barnum\r\nListen to freely downloadable audio sermons by the speaker Bishop Thaddeus Barnum in mp3 format. Thad was consecrated in Denver, Colorado by Archbishop Emmanuel Kolini, June 24, 2001. Thad currently serves both as Bishop in Residence at All Saints, Pawleys Island, SC, and as a Chaplain to Clergy.  He has a passion for discipleship and through the ministry of Call 2 Disciple, Erilynne and Thad have given themselves to strengthening the Church in the Scriptures and discipling Christians to maturity in the faith.\r\n\r\nThad has served churches in Connecticut, Pennsylvania and South Carolina and has been married to Erilynne for 35 years. They raised 4 girls and have 11 grandchildren.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Studies In Isaiah - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID7659",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40-46",
            "topic": "Expository",
            "description": "Ironside continues from Part 1, commenting upon selected verses.  Due to his failing eyesight, his wife reads the Scripture.  He warned against teaching that didn't have \"much teeth\"--powerless and colorless preaching where \"the unsaved just enjoy it.\"  Ironside spoke of the glory days of the Salvation Army 60 years prior, when a thousand of them would march through the streets of San Francisco, and being delivered from legality.",
            "download": "http:\/\/api.sermonindex.net\/SID7659-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Incomparable One",
            "url": "http:\/\/api.sermonindex.net\/SID8025",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:18-26",
            "topic": "",
            "description": "Carl Amerding continues his verse by verse expository on the book of Isaiah, discussing man's search for security and how it should be grounded in the One who is entirely secure in Himself.",
            "download": "http:\/\/api.sermonindex.net\/SID8025-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Majesty Of Our God",
            "url": "http:\/\/api.sermonindex.net\/SID20531",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:11, Isaiah 40:18",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20531-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Majesty of God",
            "url": "http:\/\/api.sermonindex.net\/SID20752",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40",
            "topic": "Majesty Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20752-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Power of Gentle Hands",
            "url": "http:\/\/api.sermonindex.net\/SID3185",
            "size": "8143360",
            "format": "mp3",
            "scripture": "Isaiah 40:10-11,Isaiah 53,Psalm 139",
            "topic": "Intimacy",
            "description": "God wants his people drawn close to his heart so he can share it with them. He longs to raise us up and carry us to his bosom to reveal his heart to us. Sometimes people are so used to a heavy, hurtful hand, they have a difficult time trusting God. We have to know the power of his gentleness. David said God's gentleness made him great. It is the gentle touch of God that makes us, strengthens us and lifts up our head. Do you experience his grace but respond to others with abusive words? God wants to deliver the hurting and the hurtful.",
            "download": "http:\/\/api.sermonindex.net\/SID3185-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "139"
                },
                {
                    "book": "Isaiah",
                    "chapter": "53"
                },
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Prayer That Prepares the Way",
            "url": "http:\/\/api.sermonindex.net\/SID19813",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:1-5",
            "topic": "Prayer",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19813-download",
            "preacher_name": "Wesley Duewel",
            "preacher_image": "\/images\/wesley_duewel.gif",
            "preacher_description": "Wesley Duewel (1916 - 2016)\r\nListen to freely downloadable audio sermons by the speaker Wesley Duewel in mp3 format. Dr. Wesley Duewel has given himself to the cause of missions for the past 68 years. Following ministry in India for nearly 25 years, he served as president of One Mission Society (1969-1982). He is now President Emeritus and special assistant to the president for evangelism and intercession. His writings on the Holy Spirit, revival, and soul winning call Godâ€™s people back to prayer, the source of all power and passion for ministry. His hundreds of poems and all of his books express his hunger and passion. His book Touch the World Through Prayer, published in 1986, is now in its 36th printing. Later books, Let God Guide You Daily; Ablaze for God; Mighty Prevailing Prayer; Measure Your Life; Godâ€™s Great Salvation; Revival Fire; Godâ€™s Power Is for You; More God, More Power; and his latest book, Heroes of the Holy Life, are also widely acclaimed. Nearly 2.5 million of his books are now in circulation in 58 languages or national editions around the world. Several international editions are also in process.\r\n\r\nRecognized as an authority on missions, Dr. Duewel served for 16 years on the board of directors of the Evangelical Fellowship of Mission Agencies of which he was president from 1969-1972, 19 years on the North American Board of the World Evangelical Fellowship, 20 years on the board of the National Association of Evangelicals, and a life trustee of Asbury Theological Seminary. During his years in India, Dr. Duewel followed closely the development of postwar independent India. He was prominent in leadership of the North India Christian Literature Society, as well as the Bible Society of India. He helped spearhead the Evangelical Fellowship of India and was serving as its president when he was transferred from India.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "The Secret Of Strength",
            "url": "http:\/\/api.sermonindex.net\/SID8766",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:28-31",
            "topic": "Strength",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8766-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Three Predictions for 2013",
            "url": "http:\/\/api.sermonindex.net\/SID24784",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40:10",
            "topic": "Discouragement",
            "description": "Don't be fearful or discouraged. If we will wait on the Lord, He will help us. Draw close to God and give him everything that troubles you. He will hold you with his righteous hand.",
            "download": "http:\/\/api.sermonindex.net\/SID24784-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "Through The Bible - Isaiah - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID2258",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 40-66",
            "topic": "",
            "description": "The Holy Spirit is one of the main themes of Isaiah 40 - 66, as is in the New Testament.  Zac pulls out various encouragements and warnings, such as a carefulness never to take God's glory, promises for parents, and the heart of the lowly as one the places God lives.",
            "download": "http:\/\/api.sermonindex.net\/SID2258-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                }
            ]
        },
        {
            "title": "To Whom is the Arm of the Lord Revealed",
            "url": "http:\/\/api.sermonindex.net\/SID11557",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 17:5, Isaiah 40:10-11, Luke 1",
            "topic": "One True God",
            "description": "A sober address appropriate to all earnest inquirers after God and particularly to Jewish people and intellectuals who have had difficulty finding the one true God.",
            "download": "http:\/\/api.sermonindex.net\/SID11557-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "1"
                },
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "17"
                }
            ]
        }
    ]
}