{
    "name": "Isaiah 44",
    "book": "Isaiah",
    "chapter": 44,
    "sermons": [
        {
            "title": "(The Power of the Holy Spirit - 2) Rivers of Living Water",
            "url": "http:\/\/sermonindex.net\/SID8273",
            "size": "0",
            "format": "mp3",
            "scripture": "John 7:37-39, Isaiah 44:3",
            "topic": "",
            "description": "Jesus came with something more wonderful than laws--rivers of Living Water!  Can someone else turn off your joy?  Then you need to receive the well of water Jesus promised.  Brother Zac shares how the Holy Spirit is not an optional extra to the Christian life but the key to LIFE in Christ Jesus and being a blessing to other people in many directions.",
            "download": "http:\/\/sermonindex.net\/SID8273-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "7"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 44:8 - Part 3",
            "url": "http:\/\/sermonindex.net\/SID9952",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 44:8",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9952-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "How To Study Revival",
            "url": "http:\/\/sermonindex.net\/SID24528",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 44:3",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24528-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "Isaiah 44: Unbelief, Faithlessness & Revival",
            "url": "http:\/\/sermonindex.net\/SID28129",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 44",
            "topic": "Unbelief",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28129-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "Real Revival",
            "url": "http:\/\/sermonindex.net\/SID3072",
            "size": "9598976",
            "format": "mp3",
            "scripture": "Isaiah 64:1,Isaiah 44:3-4,Isaiah 62:6-7",
            "topic": "Biblical Revival",
            "description": "\"We stand in great danger of being satisfied.\"  Denny Kenaston's heart was burdened to have real revival and to motivate further prayer for it.  He warned against dead orthodoxy (correct doctrine without life) and even enjoying God's blessings so as to not pursue God's best.  The inspiration for the address came from Duncan Campbell's \"When God Stepped Down\", an accounting of the amazing Hebrides revival around 1952.",
            "download": "http:\/\/sermonindex.net\/SID3072-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                },
                {
                    "book": "Isaiah",
                    "chapter": "64"
                }
            ]
        },
        {
            "title": "Real Revival by Denny Kenaston",
            "url": "http:\/\/sermonindex.net\/SID16300",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 64:1, Isaiah 44:3-4, Isaiah 62:6-7",
            "topic": "Podcast",
            "description": "\"We stand in great danger of being satisfied.\" Denny Kenaston's heart was burdened to have real revival and to motivate further prayer for it. He warned against dead orthodoxy (correct doctrine without life) and even enjoying God's blessings so as to not pursue God's best. The inspiration for the address came from Duncan Campbell's \"When God Stepped Down\", an accounting of the amazing Hebrides revival around 1952.",
            "download": "http:\/\/sermonindex.net\/SID16300-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                },
                {
                    "book": "Isaiah",
                    "chapter": "64"
                }
            ]
        },
        {
            "title": "The More Sure Word",
            "url": "http:\/\/sermonindex.net\/SID8764",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 44:6-8",
            "topic": "Word Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8764-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "Who Is Guarding The Front Door Of Your Home",
            "url": "http:\/\/sermonindex.net\/SID4333",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 7,Isaiah 44:1-4",
            "topic": "",
            "description": "We must examine ourselves for how we raised our children, and live our lives, for we will stand before a holy God and give account. Parents are responsible for what comes into their homes. Watchmen and guards must be appointed and we must all fast and pray for our homes and families. Pastor Wilkerson uses Nehemiah as an example of a caring watchman who was burdened for Israel when they were rebuilding the walls of the broken down city of Jerusalem.",
            "download": "http:\/\/sermonindex.net\/SID4333-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "7"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        }
    ]
}