{
    "name": "Isaiah 47",
    "book": "Isaiah",
    "chapter": 47,
    "sermons": [
        {
            "title": "Studies In Isaiah - Part 3",
            "url": "https:\/\/sermonindex.info\/SID7660",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 47-53",
            "topic": "Expository",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7660-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "47"
                }
            ]
        },
        {
            "title": "Studies In Isaiah - Part 4",
            "url": "https:\/\/sermonindex.info\/SID7661",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 47-53",
            "topic": "Expository",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7661-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "47"
                }
            ]
        },
        {
            "title": "The Portion of the Ungodly",
            "url": "https:\/\/sermonindex.info\/SID11501",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 47:14",
            "topic": "",
            "description": "THE PORTION OF THE UNGODLY. A SERMON DELIVERED ON SUNDAY MORNING, APRIL 13TH, 1862, BY REV. C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “Behold, they shall be as stubble; the fire shall burn them; they shall not deliver themselves from the power of the flame: there shall not be a coal to warm at, nor fire to sit before it.”-Isaiah 47:14. THIS text is part of a terrible description of God's judgment upon Babylon and Chaldea. The prophet had clearly written out the indictment of the Lord against that tyrannic people, and having proved their guilt he pronounces their sentence. He accused them of shewing no mercy to the inheritance of the Lord which, in his wrath, he had given into their hands. He charges them with pride and boastfulness, for Chaldea had said in her heart, “I am, and there is none beside me;” and Babylon had boasted, “I shall be a lady for ever; I shall see no sorrow.” He testifies against their over-boldness and presumption; for they were given to pleasures and lived carelessly, expecting no ill. Thus said the prophet, speaking in the name of the Lord, “Thou hast trusted in thy wickedness: thou hast said, None seeth me. Thy wisdom and thy knowledge, it hath perverted thee; and thou hast said in thine heart, I am, and none else beside me.” On account of these iniquities the destruction of Chaldea and Babylon was to be sudden, terrible, and complete. They were to be so utterly destroyed...",
            "download": "https:\/\/sermonindex.info\/SID11501-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "47"
                }
            ]
        }
    ]
}