{
    "name": "Isaiah 5",
    "book": "Isaiah",
    "chapter": 5,
    "sermons": [
        {
            "title": "(Isaiah) A Nation Ripe for Judgment",
            "url": "https:\/\/sermonindex.info\/SID10755",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5-6:7",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10755-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 5:1 - Part 1",
            "url": "https:\/\/sermonindex.info\/SID9892",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5:1",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9892-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(The Word For Today) Isaiah 5:11 - Part 2",
            "url": "https:\/\/sermonindex.info\/SID9893",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5:11",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9893-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "55. What is forbidden in the third commandment?",
            "url": "https:\/\/sermonindex.info\/SID22409",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 2:2, Isaiah 5:12",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22409-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "2"
                },
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Hell Enlarged! Avoid The Three Steps Which Will Take You There!",
            "url": "https:\/\/sermonindex.info\/SID14480",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5:14",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14480-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "How to Prosper in Hard Times",
            "url": "https:\/\/sermonindex.info\/SID4286",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5:21, Psalms 1:3",
            "topic": "Prospering",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4286-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "1"
                },
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Vine Branches",
            "url": "https:\/\/sermonindex.info\/SID5419",
            "size": "0",
            "format": "mp3",
            "scripture": "John 15:1-11, Psalm 80:8, Isaiah 5:2",
            "topic": "True Vine",
            "description": "The Lord is the True Vine, and we are to be the branches, the Vine displays the fruit it produces through it's branches and so should we bear the fruit of the Lord Jesus.  If we do not bear the fruit of the Spirit though we will compensate for it by manifesting the works of the flesh in an attempt to cover over our seperation from the True Vine.  The basic fruit of the Spirit is love it is at the heart of all the other fruits, the basis for the works of the flesh is self. A great truth is revealed in this message that we do not bear fruit by asking for it but by confessing and dealing with our sin then the Lord will help us to bear fruit.",
            "download": "https:\/\/sermonindex.info\/SID5419-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                },
                {
                    "book": "Psalms",
                    "chapter": "80"
                },
                {
                    "book": "John",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "When God Is Exalted In Judgment",
            "url": "https:\/\/sermonindex.info\/SID17202",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 5",
            "topic": "Judgment",
            "description": "May 25, 2008 - God says if you don’t exalt me I will exalt myself. If we judge ourselves by measuring ourselves by the standard of Christ and aligning our heart with the Word of God we will not be judged. God in His mercy will take us by the hand and lead us outside of the mindset of selfishness and self consumption. God is calling us to escape to the mountain of calvary where self dies, and we move out of the realm of \"self\" and a \"me first\" mindset to the giving of ourselves for the Glory of God. God desires to baptize us with His compassion to put others first. Do you want your heart marked with the compassion of Jesus Christ?",
            "download": "https:\/\/sermonindex.info\/SID17202-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                }
            ]
        }
    ]
}