{
    "name": "Isaiah 58",
    "book": "Isaiah",
    "chapter": 58,
    "sermons": [
        {
            "title": "(Godly Home) Part 7 - More Pictures of Promise",
            "url": "http:\/\/api.sermonindex.net\/SID7412",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 127:3-5, Isaiah 58",
            "topic": "Godly Home Series",
            "description": "Kenaston debunks the purposeless attitude, \"I think my children will turn out alright,\" by demonstrating the biblical truth that strong foundations of a Christian life are needed to produce many generations of righteous offspring.  Childraising is to be as purposeful as the Israelite warrior who meticulously prepared his arrows to destroy the enemy.  \"What is success,\" brother Denny asks, \"a big pile of money or a bunch of arrows in your quiver ready to go?\"",
            "download": "http:\/\/api.sermonindex.net\/SID7412-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Psalms",
                    "chapter": "127"
                }
            ]
        },
        {
            "title": "Hatching Snake Eggs",
            "url": "http:\/\/api.sermonindex.net\/SID15863",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 58:1-2",
            "topic": "Repentance",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15863-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                }
            ]
        },
        {
            "title": "Keeper of the Spring",
            "url": "http:\/\/api.sermonindex.net\/SID13630",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 58:11, John 4:4",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13630-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Prove Me Now",
            "url": "http:\/\/api.sermonindex.net\/SID7209",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 3:10, Isaiah 58:1-14",
            "topic": "Trusting God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7209-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Malachi",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Candlestick - Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID2879",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:6, Mark 4:35, Isaiah 58",
            "topic": "Laodicea",
            "description": "Above all things we need to desire an ever increasing revelation of who our Lord Jesus Christ is. The disciples were caught in a storm, but Jesus was in their boat with them. There were other ships caught in the storm as well. But the disciples cried out in fear, not having the confidence, God was in their boat! The still didn't realize who Jesus was. We need to focus on those who need Jesus and are lost in this stormy world in these last days. No matter what storm we face as believers, we have Christ in the ship, so let's get away from the focus on self and focus on those around us who don't know the Savior! Woe to those who are at ease in Zion! (Amos 6:1).",
            "download": "http:\/\/api.sermonindex.net\/SID2879-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Mark",
                    "chapter": "4"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Seven Churches of Revelation",
            "url": "http:\/\/api.sermonindex.net\/SID4490",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 3:14-22, Isaiah 58",
            "topic": "Churches of Revelation",
            "description": "This is a powerful message about the church of Laodicea and much of the Western church of this day.  The message is centered on the verses between Revelation 3:14 to 3:22  Carter also uses verses from Mark chapter 4 to show the disciples fearfulness and lack of concern for others when they were in storm with Jesus in the boat.  The church of Laodicea had the same lack of concern for others with the self-centered life that they were in.  In Isaiah chapter 58, the message speaks of the fast that God has chosen instead of the fasts of pretence that the people of that time were doing.  Like the church of Laodicea, the people of Isaiah’s day were living life for themselves with no concern or grief for the poor or suffering.  With these verses the message went into a parallel with much of the church of today that looks for self-help books, or seminaries, or even counseling without seeking God or God’s word for problems.  Carter encourages married people with problems to look to Ephesians chapter 5 for an answer to problems instead of the counsel of someone who suggests that all your problems are from your third and forth generation.  The message ends with words about revival using the revival of Ezra where it speaks of the people weeping. Revival has a strange mixture of weeping and joy.  In revival the hearts of the people are broken and there is remorse.  The church of Laodicea did not weep for others.",
            "download": "http:\/\/api.sermonindex.net\/SID4490-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Revelation",
                    "chapter": "3"
                }
            ]
        }
    ]
}