{
    "name": "Isaiah 58",
    "book": "Isaiah",
    "chapter": 58,
    "sermons": [
        {
            "title": "(Godly Home) Part 7 - More Pictures of Promise",
            "url": "http:\/\/api.sermonindex.net\/SID7412",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 127:3-5, Isaiah 58",
            "topic": "Godly Home Series",
            "description": "Kenaston debunks the purposeless attitude, \"I think my children will turn out alright,\" by demonstrating the biblical truth that strong foundations of a Christian life are needed to produce many generations of righteous offspring.  Childraising is to be as purposeful as the Israelite warrior who meticulously prepared his arrows to destroy the enemy.  \"What is success,\" brother Denny asks, \"a big pile of money or a bunch of arrows in your quiver ready to go?\"",
            "download": "http:\/\/api.sermonindex.net\/SID7412-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Psalms",
                    "chapter": "127"
                }
            ]
        },
        {
            "title": "Hatching Snake Eggs",
            "url": "http:\/\/api.sermonindex.net\/SID15863",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 58:1-2",
            "topic": "Repentance",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15863-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                }
            ]
        },
        {
            "title": "Keeper of the Spring",
            "url": "http:\/\/api.sermonindex.net\/SID13630",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 58:11, John 4:4",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13630-download",
            "speaker_name": "Ralph Sexton",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Prove Me Now",
            "url": "http:\/\/api.sermonindex.net\/SID7209",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 3:10, Isaiah 58:1-14",
            "topic": "Trusting God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7209-download",
            "speaker_name": "Keith Daniel",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Malachi",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Candlestick - Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID2879",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:6, Mark 4:35, Isaiah 58",
            "topic": "Laodicea",
            "description": "Above all things we need to desire an ever increasing revelation of who our Lord Jesus Christ is. The disciples were caught in a storm, but Jesus was in their boat with them. There were other ships caught in the storm as well. But the disciples cried out in fear, not having the confidence, God was in their boat! The still didn't realize who Jesus was. We need to focus on those who need Jesus and are lost in this stormy world in these last days. No matter what storm we face as believers, we have Christ in the ship, so let's get away from the focus on self and focus on those around us who don't know the Savior! Woe to those who are at ease in Zion! (Amos 6:1).",
            "download": "http:\/\/api.sermonindex.net\/SID2879-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Mark",
                    "chapter": "4"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Seven Churches of Revelation",
            "url": "http:\/\/api.sermonindex.net\/SID4490",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 3:14-22, Isaiah 58",
            "topic": "Churches of Revelation",
            "description": "This is a powerful message about the church of Laodicea and much of the Western church of this day.  The message is centered on the verses between Revelation 3:14 to 3:22  Carter also uses verses from Mark chapter 4 to show the disciples fearfulness and lack of concern for others when they were in storm with Jesus in the boat.  The church of Laodicea had the same lack of concern for others with the self-centered life that they were in.  In Isaiah chapter 58, the message speaks of the fast that God has chosen instead of the fasts of pretence that the people of that time were doing.  Like the church of Laodicea, the people of Isaiah’s day were living life for themselves with no concern or grief for the poor or suffering.  With these verses the message went into a parallel with much of the church of today that looks for self-help books, or seminaries, or even counseling without seeking God or God’s word for problems.  Carter encourages married people with problems to look to Ephesians chapter 5 for an answer to problems instead of the counsel of someone who suggests that all your problems are from your third and forth generation.  The message ends with words about revival using the revival of Ezra where it speaks of the people weeping. Revival has a strange mixture of weeping and joy.  In revival the hearts of the people are broken and there is remorse.  The church of Laodicea did not weep for others.",
            "download": "http:\/\/api.sermonindex.net\/SID4490-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Revelation",
                    "chapter": "3"
                }
            ]
        }
    ]
}