{
    "name": "Isaiah 59",
    "book": "Isaiah",
    "chapter": 59,
    "sermons": [
        {
            "title": "(Godly Home) Part 27 - Households on Fire",
            "url": "https:\/\/sermonindex.info\/SID7432",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 19:26, Isaiah 59:19, Isaiah 61:8-9",
            "topic": "Godly Home Series",
            "description": "Brother Denny makes the connection between revival, the home, and evangelism as he brings \"The Godly Home\" series to a close.  To parents who may feel overwhelmed by the high standards presented in the Word of God, he strongly encourages that with God all things are possible!",
            "download": "https:\/\/sermonindex.info\/SID7432-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "61"
                },
                {
                    "book": "Isaiah",
                    "chapter": "59"
                },
                {
                    "book": "Matthew",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "(Youth Bible School 2007) Holy",
            "url": "https:\/\/sermonindex.info\/SID16421",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:19",
            "topic": "Bible School",
            "description": "We need a clear understanding of the holiness of God. God is holy, and He must be the standard by which we measure our lives. Because of Who God is, He desires us to be a holy people unto Himself, separate and set apart to God.",
            "download": "https:\/\/sermonindex.info\/SID16421-download",
            "preacher_name": "Dean Taylor",
            "preacher_image": "",
            "preacher_description": "Dean Taylor ( Â– Present)\r\nListen to freely downloadable audio sermons by the speaker Dean Taylor in mp3 format. Dean Taylor is the general editor of The Remnant of the Charity church movement. He has written a powerful book on non-resistance: A Change of Allegiance. His teachings on suffering and martyrdom are important for the body of Christ and we must learn again from our forefathers and how they suffered for Christ.\r\n\"Every day IÂ’m more convinced that the only thing worth putting my life into is the simple, child-like acceptance of the teachings of Jesus. I believe that Jesus meant what He said. But even more, I believe that JesusÂ’ plan for humanity is actually a great idea! Sometimes the ways and wisdom of Jesus donÂ’t make sense.\" - Dean Taylor",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "Covering Sin",
            "url": "https:\/\/sermonindex.info\/SID14147",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:2",
            "topic": "Unconfessed Sin",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14147-download",
            "preacher_name": "Ed Mohr",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "DOESN’T GOD HEAR MY PRAYERS?",
            "url": "https:\/\/sermonindex.info\/SID20726",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:1",
            "topic": "Radio Show",
            "description": "Haven’t we all asked ourselves at times, “Doesn’t God hear my prayers?” God seems to keep silent and we see no way out of our problems. Listen to the helpful answer. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "https:\/\/sermonindex.info\/SID20726-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "Persecution, Affliction, And Tribulation",
            "url": "https:\/\/sermonindex.info\/SID4041",
            "size": "15887872",
            "format": "mp3",
            "scripture": "2 Timothy 3:12, Isaiah 59:15",
            "topic": "Persecution",
            "description": "This messsage starts off with Keith Daniel thanking his hosts, Denny Kennesaton and the Charity Fellowship. He went on a 8 week tour of USA in different preaching venues. The actual sermon recording starts at the 28 minute poing. There are alot of profound statements given by Keith Daniel throughout the sermon, namely a prophetic voicing of the next revival of religion and how it will be birthed through persection of a servere degree. This is a great recording to really put in perspective your anguish and trials in the Chrisitan life.",
            "download": "https:\/\/sermonindex.info\/SID4041-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                },
                {
                    "book": "2 Timothy",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Sin in the Camp",
            "url": "https:\/\/sermonindex.info\/SID0766",
            "size": "11425792",
            "format": "mp3",
            "scripture": " Isaiah 59:1-2, John 12:20-24",
            "topic": "Sin",
            "description": "Oh, what a need today of anointed Holy Ghost preaching like this!  Revival cannot come when there is sin in the camp--the church.  Let preachers beware too, for Campbell lifted up his voice like a trumpet as a watchman: \"Preaching truth without the anointing of the Holy Ghost is helping the devil to damn souls.\"  \"Surely, surely our crying need is for a Pentecostal visitation.\"  Mr. Campbell's words sound as distant thunder and are as applicable to our day as it was when preached forty years ago!",
            "download": "https:\/\/sermonindex.info\/SID0766-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "12"
                },
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "The Book Of Jeremiah And Revival by Jimmy Davis",
            "url": "https:\/\/sermonindex.info\/SID22932",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:16",
            "topic": "Refine Conference",
            "description": "Jimmy Davis has spent the last year studying the book of Jeremiah.  He points out that if there is any book of the Bible that is relevant to America today it is the book of Jeremiah  (dealing with moral & spiritual decay).  In Revival we need to not settle for too little too soon.  He pointed out that possibly Isaiah recorded the scripture in Isaiah 59:16 at that time (God was astonished that there was no one to intercede. He also feels that the greatest revival can not stop the judgment.  If there is a watchman that is sounding the alarm Jimmy Davis is sounding the alarm.",
            "download": "https:\/\/sermonindex.info\/SID22932-download",
            "preacher_name": "Refine Conference 2011",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "The Redeemer is Coming to Zion",
            "url": "https:\/\/sermonindex.info\/SID1304",
            "size": "6229504",
            "format": "mp3",
            "scripture": "Isaiah 59:20, Isaiah 59:14-15",
            "topic": "False Teachers",
            "description": "Dating from late 1982 and given to a Canadian gathering, this sermon is a cry against the shallow, me-first \"gospel.\" The true Gospel of repentance and intimacy is presented forcefully: \"some of the greatest men the world has ever seen are going to stand there [the judgment] naked and have nothing.\" The starting point is the text of Isaiah 59 and 60. (The powerful file \"Another Gospel\" is taken from the middle portion of this sermon.)",
            "download": "https:\/\/sermonindex.info\/SID1304-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "When The Enemy Comes In Like a Flood",
            "url": "https:\/\/sermonindex.info\/SID4332",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 59:16-21,Isaiah 24:10-11,Malachi 3:13-18",
            "topic": "Apostasy",
            "description": "This world is being flooded with sin and abomination by a devil intent on destroying and carrying away everyone he can, especially those who have a love for Jesus Christ in their heart and have his Spirit inside them. These are they who are crying out to God, who still hunger and thirst after righteousness, inspite of the apostasy in the mainstream church, and a sin-sick world, there are those who still hunger for God. This is a sobering message reflective of today's society, but ends in a joyous certainty of the victory and provision of our Lord for his people.",
            "download": "https:\/\/sermonindex.info\/SID4332-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "Isaiah",
                    "chapter": "24"
                },
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        }
    ]
}