{
    "name": "Isaiah 62",
    "book": "Isaiah",
    "chapter": 62,
    "audio_sermons": [
        {
            "title": "03 - A Call to pray for North Korea: The Jerusalem of the East",
            "url": "http:\/\/sermonindex.net\/SID24712",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 62:7",
            "topic": "North Korea",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24712-download",
            "preacher_name": "Ben Torrey",
            "preacher_image": "",
            "preacher_description": "Ben Torrey ( - )\r\nListen to freely downloadable audio sermons by the speaker Ben Torrey in mp3 format. Executive director of The Fourth River Project, Inc which is an organization that is preparing for the opening of North Korea. Their intercession and practical preparations are helping the body of Christ to be spiritually prepared to share the Good News of Christ effectively with North Korea.\r\nJesus Abbey is an intentional community and house of intercessory prayer founded by Jane and Archer Torrey, in 1965 by faith in God's provision. Currently Ben Torrey serves as chairman of the Jesus Abbey board of trustees. As he travels to America yearly he serves as the Archdeacon in the Evangelical Apostolic Church of North America which is in the tradition of the Church of the East. All 53 of the recordings below were recorded for the Far East Broadcasting company in 2007.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                }
            ]
        },
        {
            "title": "Isaiah Chapter 62",
            "url": "http:\/\/sermonindex.net\/SID1582",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 62",
            "topic": "Isaiah",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1582-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                }
            ]
        },
        {
            "title": "Real Revival",
            "url": "http:\/\/sermonindex.net\/SID3072",
            "size": "9598976",
            "format": "mp3",
            "scripture": "Isaiah 64:1,Isaiah 44:3-4,Isaiah 62:6-7",
            "topic": "Biblical Revival",
            "description": "\"We stand in great danger of being satisfied.\"  Denny Kenaston's heart was burdened to have real revival and to motivate further prayer for it.  He warned against dead orthodoxy (correct doctrine without life) and even enjoying God's blessings so as to not pursue God's best.  The inspiration for the address came from Duncan Campbell's \"When God Stepped Down\", an accounting of the amazing Hebrides revival around 1952.",
            "download": "http:\/\/sermonindex.net\/SID3072-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                },
                {
                    "book": "Isaiah",
                    "chapter": "64"
                }
            ]
        },
        {
            "title": "Real Revival by Denny Kenaston",
            "url": "http:\/\/sermonindex.net\/SID16300",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 64:1, Isaiah 44:3-4, Isaiah 62:6-7",
            "topic": "Podcast",
            "description": "\"We stand in great danger of being satisfied.\" Denny Kenaston's heart was burdened to have real revival and to motivate further prayer for it. He warned against dead orthodoxy (correct doctrine without life) and even enjoying God's blessings so as to not pursue God's best. The inspiration for the address came from Duncan Campbell's \"When God Stepped Down\", an accounting of the amazing Hebrides revival around 1952.",
            "download": "http:\/\/sermonindex.net\/SID16300-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "62"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                },
                {
                    "book": "Isaiah",
                    "chapter": "64"
                }
            ]
        }
    ]
}