{
    "name": "Isaiah 63",
    "book": "Isaiah",
    "chapter": 63,
    "sermons": [
        {
            "title": "(Through The Bible) Isaiah 63-66",
            "url": "https:\/\/sermonindex.info\/SID6450",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 63-66",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6450-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "63"
                }
            ]
        },
        {
            "title": "First Baptist Church - Part 2",
            "url": "https:\/\/sermonindex.info\/SID14215",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 57:15, Isaiah 63:1",
            "topic": "Revival History",
            "description": "In sharing many testimonies about the power of God in revival, Bill glorifies the Lord as the One who is mighty to save and mighty to revive. Not only is God mighty to save but He is mighty to revive!  Bill shares many vivid testimonies from the time of God's visitation in Saskatoon in 1971.  \"We were positively convinced that prayer was the key.\"",
            "download": "https:\/\/sermonindex.info\/SID14215-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "63"
                },
                {
                    "book": "Isaiah",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "Meeting God Face To Face",
            "url": "https:\/\/sermonindex.info\/SID3672",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 63:1-6",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID3672-download",
            "preacher_name": "Neil Rhodes",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "63"
                }
            ]
        },
        {
            "title": "Revival!",
            "url": "https:\/\/sermonindex.info\/SID19267",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 63:15",
            "topic": "Revival",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19267-download",
            "preacher_name": "Alan Bartley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "63"
                }
            ]
        }
    ]
}