{
    "name": "Hebrews 5",
    "book": "Hebrews",
    "chapter": 5,
    "sermons": [
        {
            "title": "(Deeper Spiritual Life): Deeper Spiritual Life - What is it?",
            "url": "http:\/\/sermonindex.net\/SID1994",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:11-14",
            "topic": "Deeper Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1994-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Fury of Fire) 08 - Close to Being Cursed",
            "url": "http:\/\/sermonindex.net\/SID12182",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5",
            "topic": "Cursed",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12182-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Hebrews - Part 14): High Priest of the Eternal Son",
            "url": "http:\/\/sermonindex.net\/SID2010",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:1-10",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2010-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Through The Bible) Hebrews 5-6",
            "url": "http:\/\/sermonindex.net\/SID6623",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5-6",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6623-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(basics) 24. More Reasons For Failure",
            "url": "http:\/\/sermonindex.net\/SID8134",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy 2:22, Hebrews 5:67, 1 Peter 4:1-2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8134-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "5"
                },
                {
                    "book": "1 Peter",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "23. What offices doth Christ execute as our Redeemer?",
            "url": "http:\/\/sermonindex.net\/SID22377",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 3:22, Hebrews 5:5-6",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22377-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "3"
                },
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Do Not Be Dull of Hearing or Sluggish",
            "url": "http:\/\/sermonindex.net\/SID24027",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:1-6:12",
            "topic": "Drifting",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24027-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Hebrews 5",
            "url": "http:\/\/sermonindex.net\/SID8811",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8811-download",
            "preacher_name": "Don McClure",
            "preacher_image": "\/images\/don_mcclure.gif",
            "preacher_description": "Don McClure (1903 - )\r\nListen to freely downloadable audio sermons by the speaker Don McClure in mp3 format. I came to Christ at a Billy Graham Los Angeles Crusade in the 1960's. While completing my Bachelor of Science degree in Business Administration at Cal Poly Pomona, I sensed the call of God on my life to follow Jesus Christ completely and possibly forget business and prepare for the ministry.. Soon after that I met Alan Redpath who invited me and my wife Jean to England, where we attended Capernwray Bible School. Upon returning to the United States, I continued my studies at Talbot Seminary in La Mirada, California.\r\nEarly in my ministry, I served for four years as an assistant pastor to Chuck Smith at Calvary Chapel of Costa Mesa, California. Next Jean and I moved to Lake Arrowhead where we planted and pastored Calvary Chapel of Lake Arrowhead. During those years I founded Calvary Chapel Bible College in nearby Twin Peaks at the Calvary Chapel Conference Center (The college is now located in Murrieta Hot Springs). Sensing the Lord's direction to move on, we then pioneered and pastored another Calvary Chapel in Redlands, California, for eleven years. In 1991, we again, still having that pioneering heart, moved to San Jose with the heart to plant a number of churches in the Bay Area. There are now eight fellowships that have grown out of Calvary Chapel of San Jose. In September 2002, we responded to a request from Chuck Smith to return to Calvary Chapel of Costa Mesa to serve as an assistant. And, in 2004 we took to the leadership of Calvary Chapel of Laguna Beach to help guide it through a difficult time. That work being completed, we have now responded to a long time desire to step out and serve the churches and schools and missionaries that we love so much around the world. Which brings us now to Calvary Way Ministries.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Hebrews 5;13-16 Missionary Conf.",
            "url": "http:\/\/sermonindex.net\/SID10076",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:13-16",
            "topic": "Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10076-download",
            "preacher_name": "J.M. Davies",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Hebrews Chapter 5",
            "url": "http:\/\/sermonindex.net\/SID10484",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10484-download",
            "preacher_name": "Chip Brogden",
            "preacher_image": "",
            "preacher_description": "Chip Brogden ( - )\r\nListen to freely downloadable audio sermons by the speaker Chip Brogden in mp3 format.  Author, teacher, and former pastor, Chip and his wife Karla came out of the church in 1999 to serve those who are following Jesus outside of Organized Religion. Today, The School of Christ reaches many with a simple, consistent, and Christ-centered message\r\nSince 1997, the School of Christ has reached more than 145 nations with a simple, consistent, and Christ-centered message. Our mission is to bring healing to those hurt by religion, to provide for the spiritual growth and maturity of all believers, and to ensure the continuity of a Christ-Centered Faith.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Preaching a Watered-Down Gospel is Sin",
            "url": "http:\/\/sermonindex.net\/SID16126",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:12-14",
            "topic": "",
            "description": "You have milky churches that demand milky preachers, preach milky sermons to milky Christians who desire to have their bottles refilled with formula each week that they might nurse themselves back to sleep and satisfy their lactose dependency.",
            "download": "http:\/\/sermonindex.net\/SID16126-download",
            "preacher_name": "Jeff Noblit",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Salvation By Christ's Life",
            "url": "http:\/\/sermonindex.net\/SID17550",
            "size": "0",
            "format": "mp3",
            "scripture": "John 13:3, Hebrews 2:9-10, Hebrews 5:8-9",
            "topic": "Salvation",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17550-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "13"
                },
                {
                    "book": "Hebrews",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Tears of the Saviour",
            "url": "http:\/\/sermonindex.net\/SID14476",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14476-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Time To Grow Up",
            "url": "http:\/\/sermonindex.net\/SID19844",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:11-14, Hebrews 6:1",
            "topic": "Christian Growth",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19844-download",
            "preacher_name": "Charlie Orr",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                },
                {
                    "book": "Hebrews",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Victory 101",
            "url": "http:\/\/sermonindex.net\/SID4223",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 5:14,Hebrews 12:1,Galatians 6:7-8",
            "topic": "",
            "description": "How serious are you about VICTORY over sin? Are you tired of falling to temptation? Are you tired of the horrible feeling of failing God over and over again? Have you removed the stepping-stones to sin? Have you burned the plow and the oxen? Or are you telling yourself you can handle certain weights in your life? When you see sin as God sees it you will hate it and be repulsed by it. You will do whatever it takes to keep sin from gaining an advantage over you. In this message we explore an essential key to achieving victory in your life.",
            "download": "http:\/\/sermonindex.net\/SID4223-download",
            "preacher_name": "Robert Wurtz II",
            "preacher_image": "",
            "preacher_description": "Robert Wurtz II ( - )\r\nListen to freely downloadable audio sermons by the speaker Robert Wurtz II in mp3 format.  For almost 20 years I have served as a author and teacher of advanced biblical studies. My interests are the New Covenant, apologetics and classical revival. Native of the Kansas City, Mo area and reside now in Independence, MO with wife Anna.\r\nHe is the author of many books including the newest Televangelicalism. In this insightful and thought provoking book, Robert Wurtz II traces the history of Christian evangelism from the book of Acts to modern times. The contrast between pre-1900 and post-1900 evangelism is so sharp, that the book is divided into two sections: Part 1, the pre-Billy Sunday era and Part 2, the post-Billy Sunday evangelistic era. This book is a must-read for anyone that has concerns about issues such as \"the sinner's prayer\" or shallow concepts of conversion.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                },
                {
                    "book": "Hebrews",
                    "chapter": "12"
                },
                {
                    "book": "Galatians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Why Responsibility",
            "url": "http:\/\/sermonindex.net\/SID8436",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:26-28, Hebrews 5:7-9",
            "topic": "Responsibility",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8436-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "5"
                },
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        }
    ]
}