{
    "name": "Galatians 3",
    "book": "Galatians",
    "chapter": 3,
    "sermons": [
        {
            "title": "(Following The Footsteps Of Christ) The Crucifixion",
            "url": "https:\/\/sermonindex.info\/SID8392",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:12-14",
            "topic": "Crucifixion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8392-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Galatians) Blessed Like Abraham",
            "url": "https:\/\/sermonindex.info\/SID11487",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:1-9",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11487-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Galatians) Redeemed From The Curse Of The Law",
            "url": "https:\/\/sermonindex.info\/SID11488",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:10-29",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11488-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Genesis) - Part 13",
            "url": "https:\/\/sermonindex.info\/SID13392",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 11:31-13:4, Galatians 3:13",
            "topic": "",
            "description": "God is still looking for people like Abraham today who have a responsive heart.  The blessing of Abraham--the baptism in the Holy Spirit--can make us a blessing to every family that we meet.  Abraham's mistakes serve a sober warning to us that missing God's will that it may go well with us have serious and long lasting consequences long after God has forgiven us of the sin.",
            "download": "https:\/\/sermonindex.info\/SID13392-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(The Role Of Demons In Today's Society) Part 1",
            "url": "https:\/\/sermonindex.info\/SID15280",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 38:4, John 4:24, Galatians 3:1",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15280-download",
            "preacher_name": "Dean Hochstetler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Job",
                    "chapter": "38"
                },
                {
                    "book": "John",
                    "chapter": "4"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Through The Bible) Galatians 3",
            "url": "https:\/\/sermonindex.info\/SID6592",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6592-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "17. Into what estate did the fall bring mankind?",
            "url": "https:\/\/sermonindex.info\/SID22371",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 5:12, Galatians 3:10",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22371-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "94. What is baptism?",
            "url": "https:\/\/sermonindex.info\/SID22448",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 28:19, Galatians 3:27",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22448-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "28"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Beatitudes\/Clothed in Christ 1",
            "url": "https:\/\/sermonindex.info\/SID13572",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:1-13, Galatians 3:27",
            "topic": "Beatitudes",
            "description": "Not big shots or children who do big things. But children clothed in Christ , poor in spirit. Everybody he says wants to do something , but nobody wants to be something. And that something is Christ to be clothed in Christ is the father focus not what your doing. Lots today work for God and do so much ministry and so forth but how many are clothed in Christ.",
            "download": "https:\/\/sermonindex.info\/SID13572-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Boiling for Christ",
            "url": "https:\/\/sermonindex.info\/SID12392",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 12:9-13, Romans 7:6, Galatians 3:13",
            "topic": "",
            "description": "The highest privilege in the world is to serve Jesus Christ, but our service can be misguided if we serve our own appetites, people, or the law.  \"All of our serving,\" says John Piper, \"is receiving service from Christ which He bought for us when He died.\"  In other words, serving Jesus is first trusting Jesus to serve me.",
            "download": "https:\/\/sermonindex.info\/SID12392-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "12"
                },
                {
                    "book": "Romans",
                    "chapter": "7"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Christian Freedom: The Logic of Law",
            "url": "https:\/\/sermonindex.info\/SID17587",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:19-29",
            "topic": "Freedom",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID17587-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Fear of Rejection",
            "url": "https:\/\/sermonindex.info\/SID3183",
            "size": "8382976",
            "format": "mp3",
            "scripture": "Psalm 22:1-2, Galatians 3:24, Acts 17:28",
            "topic": "Rejection",
            "description": "When the Holy Spirit convicts you of something needing changing, and guilt and condemnation set in, and aware of your own struggle, you fear the Lord is tired of your failures and has rejected you. Because of past wounds in their lives, some fear God will reject them as people sometimes have. You can determine to live a new life in Christ, secure and have the assurance you so desperately need. When the Word comes and voices arise to condemn you, you can shoot them down (Is. 54:17). God loves you enough to not let you by with sin that will destroy you. Come to him for cleansing, forgiveness, and peace and rest.",
            "download": "https:\/\/sermonindex.info\/SID3183-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "17"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Psalms",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "Galatians 3:13",
            "url": "https:\/\/sermonindex.info\/SID27907",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:13",
            "topic": "Christian Life",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27907-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Galatians Chapter 3 (Part 1)",
            "url": "https:\/\/sermonindex.info\/SID10462",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10462-download",
            "preacher_name": "Chip Brogden",
            "preacher_image": "",
            "preacher_description": "Chip Brogden ( - )\r\nListen to freely downloadable audio sermons by the speaker Chip Brogden in mp3 format.  Author, teacher, and former pastor, Chip and his wife Karla came out of the church in 1999 to serve those who are following Jesus outside of Organized Religion. Today, The School of Christ reaches many with a simple, consistent, and Christ-centered message\r\nSince 1997, the School of Christ has reached more than 145 nations with a simple, consistent, and Christ-centered message. Our mission is to bring healing to those hurt by religion, to provide for the spiritual growth and maturity of all believers, and to ensure the continuity of a Christ-Centered Faith.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Galatians Chapter 3 (Part 2)",
            "url": "https:\/\/sermonindex.info\/SID10463",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10463-download",
            "preacher_name": "Chip Brogden",
            "preacher_image": "",
            "preacher_description": "Chip Brogden ( - )\r\nListen to freely downloadable audio sermons by the speaker Chip Brogden in mp3 format.  Author, teacher, and former pastor, Chip and his wife Karla came out of the church in 1999 to serve those who are following Jesus outside of Organized Religion. Today, The School of Christ reaches many with a simple, consistent, and Christ-centered message\r\nSince 1997, the School of Christ has reached more than 145 nations with a simple, consistent, and Christ-centered message. Our mission is to bring healing to those hurt by religion, to provide for the spiritual growth and maturity of all believers, and to ensure the continuity of a Christ-Centered Faith.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Healing",
            "url": "https:\/\/sermonindex.info\/SID25065",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:7",
            "topic": "Healing",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25065-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Holy Spirit and The Crisis of Pentecost - Part 1",
            "url": "https:\/\/sermonindex.info\/SID0034",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 8:16,Galatians 3:13,1 John 3:1-24",
            "topic": "Pentecost",
            "description": "This message was delivered on 05\/01\/1959.",
            "download": "https:\/\/sermonindex.info\/SID0034-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "3"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Knowing the Inner Man Body Soul and Spirit",
            "url": "https:\/\/sermonindex.info\/SID6701",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:23, Acts 13:38",
            "topic": "Inner Man",
            "description": "God’s Word is our plumb line for everything.  In a society where anything seems to go, he reminds us that is not so.  We are shown here how to line up everything according to the Word of God.",
            "download": "https:\/\/sermonindex.info\/SID6701-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Acts",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 5",
            "url": "https:\/\/sermonindex.info\/SID17548",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:9-10, 2 Peter 1:3-4, Galatians 3:13-14",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "https:\/\/sermonindex.info\/SID17548-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "2 Peter",
                    "chapter": "1"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Redeemed From The Law",
            "url": "https:\/\/sermonindex.info\/SID7655",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:13",
            "topic": "Law",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7655-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Redeemed from the Curse of the Law",
            "url": "https:\/\/sermonindex.info\/SID2871",
            "size": "9825280",
            "format": "mp3",
            "scripture": "James 5:14, Galatians 3:13, Genesis 3:17",
            "topic": "Curse Of The Law",
            "description": "This truth is one of the foundations of our faith in receiving blessing from the Lord. Some have called this truth the believer's Emancipation Proclamation.",
            "download": "https:\/\/sermonindex.info\/SID2871-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "3"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "James",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Religiosity or Spirituality #1 - Hungering for More of God",
            "url": "https:\/\/sermonindex.info\/SID4105",
            "size": "7109632",
            "format": "mp3",
            "scripture": "2 Kings 2, Luke 24:28-29, Galatians 3:13-14",
            "topic": "Religiosity",
            "description": "Zac Poonen found that so many Christians are living a substandard life, but it doesn't have to be this way.  Brother Zac stirs you to go beyond being satisfied with so little, when God has promised rivers of living water to flow out of you to be a blessing to everyone you meet.  \"If you're satisfied with something less than God's highest, then that's all you'll have.\"",
            "download": "https:\/\/sermonindex.info\/SID4105-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Luke",
                    "chapter": "24"
                },
                {
                    "book": "2 Kings",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Bewitching of Saints",
            "url": "https:\/\/sermonindex.info\/SID3666",
            "size": "12723200",
            "format": "mp3",
            "scripture": "Galatians 3:1-3",
            "topic": "",
            "description": "The devil sets a trap for those who are sincere in their faith in God.  Preaching from the book of Galatians, Wilkerson teaches on how it is that Saints can fall into the trap and he also teaches us how it is that we can avoid such snares and pitfalls.",
            "download": "https:\/\/sermonindex.info\/SID3666-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Gift of Righteousness",
            "url": "https:\/\/sermonindex.info\/SID3604",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 5:17-19,Galatians 4:6,Galatians 3:3",
            "topic": "",
            "description": "Preaching from Romans 5, Wilkerson preaches on God’s wonderful gift of righteousness.  This passage of Scripture consumed David for months and he studied it from every angle.  This is absolutely the best sermon on this topic of righteousness that I have heard, separating real righteousness from much of the emotional righteousness that many seem to subscribe to this day. Jesus said you would know the truth and the truth shall set you free. Sanctification is the Spirit of Christ in us making us to become what God in reality sees you to be already, by faith. Making us what we could never be on our own, holy. The gift of righteousness is the Spirit of Christ in you. When you yield to him and let him have control, he makes you what he is. The Lord doesn't want you to come to him in condemnation and guilt. He wants the truth of his righteousness and his love to set you free.",
            "download": "https:\/\/sermonindex.info\/SID3604-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Galatians",
                    "chapter": "4"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Greatest Text in the Bible",
            "url": "https:\/\/sermonindex.info\/SID12974",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 3:21-26, Galatians 2:15-16, Galatians 3:10-13",
            "topic": "",
            "description": "Paul Washer preaches from what he calls the greatest text in the Bible to show God's wonderful plan of redemption. Using many illustrations, he speaks of the sinfulness of man, the holiness of God, the magnitude of of His love for us, and the splendor of redemption. Yet, in his own words, he was still unable to \"preach Christ the way He ought to be preached\". Listen to this powerful message.",
            "download": "https:\/\/sermonindex.info\/SID12974-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "3"
                },
                {
                    "book": "Galatians",
                    "chapter": "2"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Israel of God - Part 2",
            "url": "https:\/\/sermonindex.info\/SID1066",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 53:10-11,Romans 9:6-7,Galatians 3:7",
            "topic": "Israel",
            "description": "This message was delivered on 08\/01\/1956.",
            "download": "https:\/\/sermonindex.info\/SID1066-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "9"
                },
                {
                    "book": "Isaiah",
                    "chapter": "53"
                }
            ]
        },
        {
            "title": "The Israel of God - Part 4",
            "url": "https:\/\/sermonindex.info\/SID1068",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 53:10-11,Romans 9:6-7,Galatians 3:16",
            "topic": "Israel",
            "description": "This message was delivered on 08\/01\/1956.",
            "download": "https:\/\/sermonindex.info\/SID1068-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "9"
                },
                {
                    "book": "Isaiah",
                    "chapter": "53"
                }
            ]
        },
        {
            "title": "The Promise Fulfilled - Spirit, Scripture, Sacrament in Gal. 3",
            "url": "https:\/\/sermonindex.info\/SID28661",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3",
            "topic": "Holy Spirit",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28661-download",
            "preacher_name": "Michael Flowers",
            "preacher_image": "",
            "preacher_description": "Michael Flowers ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael Flowers in mp3 format. Michael serves as the founding Rector (the lead pastor \/ priest) of St. Aidanâ€™s Anglican Church in Kansas City, MO. He received his Masters in Theology from Fuller Theological Seminary, Pasadena, CA. \r\n\r\nFor over 20 years, he served as a pastor in the Vineyard and a network of house churches around the San Francisco Bay Area. While on Sabbatical in KC, he answered his initial calling to become an Anglican priest and planted St. Aidanâ€™s, a member of the Anglican Church of North America. Michael is married to Liz, his beloved.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Unity of Covenant of Grace - Exegesis of Gal. 3:17-22",
            "url": "https:\/\/sermonindex.info\/SID1284",
            "size": "6256640",
            "format": "mp3",
            "scripture": "Galatians 3:17-22",
            "topic": "Covenant",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1284-download",
            "preacher_name": "John Murray",
            "preacher_image": "\/images\/john_murray.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "When The Arrow Is Beyond You",
            "url": "https:\/\/sermonindex.info\/SID25120",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 3:2-3, Isaiah 55:8",
            "topic": "Prophetic Word",
            "description": "Carter Conlon shares a powerful prophetic message to the Church of Jesus Christ in North America. God is calling for those who are weak and are willing to Trust Him fully. God is calling believers to realize they do the work of the Church in the arm of the flesh. Brother Carter gives a clear call for the Church to get back to the place of prayer in the prayer meeting. God is waiting for us to be directed by Him again in everything.",
            "download": "https:\/\/sermonindex.info\/SID25120-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "3"
                },
                {
                    "book": "Isaiah",
                    "chapter": "55"
                }
            ]
        }
    ]
}