{
    "name": "Amos 4",
    "book": "Amos",
    "chapter": 4,
    "sermons": [
        {
            "title": "\t Ivory Houses & Fat Cows: The Excessive Nonsense of the Modern Christian Church",
            "url": "https:\/\/sermonindex.info\/SID24328",
            "size": "0",
            "format": "",
            "scripture": "Amos 3:13-15, Amos 4:1-5",
            "topic": "Sensuality",
            "description": "Israel in the 8th century B.C. was self-satisfied; her churches were full; her people were religious; there was a great deal of activity in her midst; and she believed her material prosperity was evidence of God's favor. But God and His Word had been forgotten, His law forsaken, and His loving grace taken for granted. Instead of the name of the Lord, Israel ran into two towers – their homes and their temples – prosperity and religion – and God promised to destroy both. Once any people begin to amass expensive homes, power over other people, and large incomes, it is easy for them to find their identity in these things. There is a natural tendency for people to consider their security to be in their stuff. They will go to great extremes to protect that which they imagine themselves to have gained by right – and anything that would threaten their power or their status or their revenue – they will act even in immoral ways to maintain what they presume to be rightfully their own.  Are we not falling into the same trap? Why should God not sweep away our western materialistic churches?",
            "download": "https:\/\/sermonindex.info\/SID24328-download",
            "preacher_name": "Joseph LoSardo",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "4"
                },
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Amos) Yet You Have not Returned to Me",
            "url": "https:\/\/sermonindex.info\/SID11037",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 4-6",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11037-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Facing Reprobates with Their Destiny",
            "url": "https:\/\/sermonindex.info\/SID15690",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 4:12,13",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15690-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "God is Inescapable",
            "url": "https:\/\/sermonindex.info\/SID12251",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 4:12",
            "topic": "Character Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12251-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Prepare to Meet Your God",
            "url": "https:\/\/sermonindex.info\/SID18608",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 4:1-13 ",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18608-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "4"
                }
            ]
        }
    ]
}