{
    "name": "Amos 6",
    "book": "Amos",
    "chapter": 6,
    "sermons": [
        {
            "title": "(Spiritual Dangers) The Danger of Complacency",
            "url": "https:\/\/sermonindex.info\/SID14497",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 6",
            "topic": "Complacency",
            "description": "There are people who profess to know Christ yet they live carelessly. They do not deny biblical truth, it is simply neglected in their lives. They have a love of pleasure more than a love for God. 1. What it means to be at ease in Zion. 2. The tragic effects of being at ease. 3. The judgement awaiting those at ease. 4. The importance of stirring oneself out of spiritual complacency. Five tests for music: 1. Can you hear the Word of God clearly over the music? 2. Does the music enlarge my vision of the glory of God? 3. Will what I'm listening to produce the fruit of holiness in my life? 4. Does the music communicate sound biblical doctrine? 5. Does the music tend to sedate the mind and make it insensible to God's truth? Contemporary Christian Music (CCM):  Amusing Grace, how sensual the sound, that entertained a seeker like me. I once was lost, but now I'm amused; was blind but now I'm deceived.",
            "download": "https:\/\/sermonindex.info\/SID14497-download",
            "preacher_name": "Don Currin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "A Warning To Those at Ease",
            "url": "https:\/\/sermonindex.info\/SID19893",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 5:18-27, Amos 6:1",
            "topic": "Revival",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19893-download",
            "preacher_name": "Ronald Glass",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "5"
                },
                {
                    "book": "Amos",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "At Ease in Zion",
            "url": "https:\/\/sermonindex.info\/SID10937",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 6:1",
            "topic": "",
            "description": "'Woe to those that are at ease in Zion!' is the cry that goes out from Amos the prophet of God to the people of God, here in Amos the people of God were even looking for the coming of the Lord, like the church today, and yet Amos says @woah to you!'  Pastor Legge puts forward the frightening but necessary question can we be sure of our salvation and walk with God if we are at ease with a dormant church and a dying world all around us.  Have we forgotten that the Gospel is an offence and a stumbling block and shouldn't be sugar coated in order to administer to people, we are to be about our Fathers business like our Lord, David just before he slew Goliath asked the terrified men around him 'Is there not a cause?' \r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "https:\/\/sermonindex.info\/SID10937-download",
            "preacher_name": "David Legge",
            "preacher_image": "",
            "preacher_description": "David Legge ( - )\r\nListen to freely downloadable audio sermons by the speaker David Legge in mp3 format. David Legge is a Christian evangelist, preacher and Bible teacher. He served as Assistant Pastor at Portadown Baptist Church before taking up the Pastorate of the Iron Hall Assembly in Belfast, N. Ireland, where he ministered from 1999-2008. He knows has an internant ministry across the world you can access messages and request him as a speaker at the Preach The Word website.\r\n\"Like Israel, who are a type, I believe, in many respects of God's people today: we have been transferred from bondage, the kingdom of darkness, the kingdom of Satan, and we have been placed into the kingdom of light, the kingdom of God's dear Son... and yet many believing New Testament Christians never cross the Jordan. They settle for less than God intended for them. I have to say that there can even be resentment, or resistance, shown toward anyone who will try to get God's people over the Jordan and into their inheritance.\" - David Legge",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Ploughing a Rock",
            "url": "https:\/\/sermonindex.info\/SID13283",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 6:12",
            "topic": "",
            "description": "THESE two questions are evidently Oriental proverbial expressions. Proverbs have always been used by the wisest of men. Solomon not only spoke and wrote a great many, but he also made a considerable collection of those uttered by others. We find, in the writings of such notable thinkers as Socrates, and Pliny, and Aristotle, an abundance of short, pithy sentences, many of which can be used as proverbs. Proverbs have great force in them, because they are condensed wisdom. They are generally most convincing; it is hardly ever possible to answer or controvert them. They carry truth home as an arrow has often been known to carry death to the person aimed at, for they strike, they stick, they penetrate, they wound. Our Lord Jesus very frequently made use of proverbs; nor was he singular in so doing. The prophets of old constantly employed them; and here, in our text, we see Amos, — who, from his occupation as a herdsman and gatherer of sycamore fruit, was probably more familiar with their use than some others of the prophets were, — puts together two proverbs which were commonly used to signify that men do not, as a rule, continue to labor in vain, and spend their strength for nought.",
            "download": "https:\/\/sermonindex.info\/SID13283-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Danger Of Complacency Don Currin",
            "url": "https:\/\/sermonindex.info\/SID16260",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 6:1-7",
            "topic": "Revival Conference",
            "description": "Don Currin preaches a sermon on the topic of \"complacency\" that really points to a modern day christianity that does not live in the live and reality of God. This is a sobering warning to the Church of Jesus Christ. This is a wake up call to Church in North America.",
            "download": "https:\/\/sermonindex.info\/SID16260-download",
            "preacher_name": "Revival Conference Canton 2007",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "6"
                }
            ]
        }
    ]
}