{
    "name": "Philemon 1",
    "book": "Philemon",
    "chapter": 1,
    "sermons": [
        {
            "title": "77 Guidelines for Gathering",
            "url": "https:\/\/sermonindex.info\/SID25422",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon 1:2, Colossians 4:15, Matthew 18:20",
            "topic": "Audio Books",
            "description": "Dear brothers and sisters we are writing these practical guidelines on how to gather as a fellowship under the Headship of Jesus Christ not as rules but rather helpful ways forward for some. Any 2-3 brothers or sisters can meet in this way and start to allow the Lord to mature their gathering. We must have the simplicity of faith that our Gathering is unto Him and not for ourselves. Early Christians met together with a great joy at times because they were gathering with others who have been redeemed by the precious blood of Jesus Christ. So Jesus Christ Himself was the center of their unity. These simple guidelines combine many of the Principles found in the Principles for the Gathering of Believers volume.",
            "download": "https:\/\/sermonindex.info\/SID25422-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                },
                {
                    "book": "Colossians",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Charge That to My Account",
            "url": "https:\/\/sermonindex.info\/SID0270",
            "size": "2033152",
            "format": "mp3",
            "scripture": "Philemon 1:8-18",
            "topic": "Gospel",
            "description": "\"Paul might have said, . . . 'Onesimus, I'm going to become your surety. I'll undertake to settle your debt. And I'm going to write a letter to Philemon and I want you to take it to him. Don't plead anything for yourself, just hand him the letter in which he will learn that I'm willing to settle everything in a righteous way.'... \"When the Lord Jesus Christ became my surety . . . he went to Calvary's cross, and all my guilt was charged against Him. He settled for everything, and then He cried, 'It is finished.' And on the basis of that finished work, God can freely forgive, and justify completely, every poor sinner who trusts in the Lord Jesus Christ.\"",
            "download": "https:\/\/sermonindex.info\/SID0270-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Running From Church To Find God",
            "url": "https:\/\/sermonindex.info\/SID2778",
            "size": "0",
            "format": "mp3",
            "scripture": "Philemon 1:19",
            "topic": "Seeking God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID2778-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Thanksgiving of Paul for the Saints",
            "url": "https:\/\/sermonindex.info\/SID5757",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 1:4, Philemon 1:4, Philippians 1:3-6",
            "topic": "Thanksgiving",
            "description": "\"[Paul's] thankfulness and his perspective about people that he was ministering to,\" David Smithers shares, \"gave him the power to influence and have authority in people's lives.\"  He goes on to share how a heart of gratefulness and thankfulness, not griping and complaining, is what consumed the apostle.  Do we have those same apostolic priorities in our relating to brothers and sisters in Christ's body?",
            "download": "https:\/\/sermonindex.info\/SID5757-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "1"
                },
                {
                    "book": "Philemon",
                    "chapter": "1"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                }
            ]
        }
    ]
}