{
    "name": "Albert N. Martin",
    "image": "",
    "description": "",
    "sermons": [
        {
            "title": "God's Word To Our Nation (1)",
            "url": "http:\/\/api.sermonindex.net\/SID16047",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4:34-35, Job 12:23-25, Psalm 9:7",
            "topic": "America",
            "description": "A brief series of four messages addressing the moral condition of our nation in a focused way. The first message deals with the relationship of God to all the nations, including our own. In this introductory message we see: 1. the subjugation of all the nations to the sovereign rule of God. 2. the accountability of the nations to the just judgment of God. 3. the responsibility of the nations to hear the word of God.  4. the solidarity of believers with the nation in which they are found. Subsequent messages address more pointedly our nations’ sins of bloodguiltiness, sexual perversion and religious apostasy.",
            "download": "http:\/\/api.sermonindex.net\/SID16047-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                },
                {
                    "book": "Job",
                    "chapter": "12"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "National Moral Degeneracy (2)",
            "url": "http:\/\/api.sermonindex.net\/SID16048",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 4:10, Genesis 9:5-6, Romans 13:4",
            "topic": "Moral Degeneracy",
            "description": "We have received many blessings from the hand of God as a nation and have much to give Him thanks for; yet as a nation we have not been living as those mindful of God's kindness to us and of our accountability to God. Instead, we have turned away from listening to God and His word into paths of unrighteousness. One of the most aggravated sins of moral degeneracy of our nation is that of the unrequited blood of murdered multitudes. Our nation is stained with an ocean of blood that cries to God for His vengeance. In this opening up of God's Word to our nation, we hear God's rebuke and denunciation for our nation's aggravated sins and a call to repentance and prayer.",
            "download": "http:\/\/api.sermonindex.net\/SID16048-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "13"
                },
                {
                    "book": "Genesis",
                    "chapter": "9"
                },
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "National Religious Apostasy (4)",
            "url": "http:\/\/api.sermonindex.net\/SID16050",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Jeremiah 25:3-6, Jeremiah 2:10-13",
            "topic": "Apostasy",
            "description": "\"Righteousness exalts a nation; but sin is a reproach to any people.\" Proverbs 14:34. As a nation we have in large scale rejected the true and living God and have abandoned our godly heritage and the special light that came through mighty preachers in the past and formerly pious church denominations and have gone headlong into decadent humanism, deceptive liberalism, demonic occultism and a weak, man-centered, flesh-pleasing, fad-conforming evangelicalism. By doing so we have incurred a dreadful accountability as a nation before God. As a nation we must repent and plead for God to have mercy upon us.",
            "download": "http:\/\/api.sermonindex.net\/SID16050-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "25"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Our Nation’s Sexual Sins (3)",
            "url": "http:\/\/api.sermonindex.net\/SID16049",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Romans 1:18-32, Leviticus 18:1-30",
            "topic": "Sexual Sin",
            "description": "Our Nation is in serious spiritual need but in God's word, the Bible, we find answers to our moral and social problems as a nation. Sadly these days, our Nation is marked not only by an unrestrained and unashamed abandonment to sensuality but also by the putrid sin of sexual perversion. What is called sexual orientation and an alternative lifestyle today, God has always called an abomination, which he visits with severe judgment but from which he offers salvation.  In this message from God's Word to our Nation, we hear God's rebuke and denunciation for our nation's aggravated moral sins and a call to repentance and prayer. There is cleansing in the blood of Christ for all of our sexual sins. 1 Corinthians 6:9-11",
            "download": "http:\/\/api.sermonindex.net\/SID16049-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "18"
                },
                {
                    "book": "Romans",
                    "chapter": "1"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "What Is a Christian?",
            "url": "http:\/\/api.sermonindex.net\/SID15073",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 2:10, Revelation 12:17, Revelation 14:12",
            "topic": "Christian",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15073-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "14"
                },
                {
                    "book": "Revelation",
                    "chapter": "12"
                },
                {
                    "book": "Ephesians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "What's Wrong With Preaching Today?",
            "url": "http:\/\/api.sermonindex.net\/SID17255",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 1:5, 1 Thessalonians 2:10-13, Titus 2:7",
            "topic": "Preaching",
            "description": "Originally preached at the Ministers' Conference of the Orthodox Presbyterian Church at Westminster Theological Seminary in September 1967, this message was published in print form soon afterward by the Banner of Truth Trust and owing to its continued relevance has seen several reprints over the 30 years since. 1. The Man: regular systematic devotional habits, personal practical piety or holiness, purity of motivation.  2. The Message: biblical content, doctrinal substance, practical application.  3. The Manner:  urgency, orderliness, directness.",
            "download": "http:\/\/api.sermonindex.net\/SID17255-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Titus",
                    "chapter": "2"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "2"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "1"
                }
            ]
        }
    ]
}