{
    "name": "Andrew Bonar",
    "image": "",
    "description": "Andrew Bonar (1810 - 1892)\r\nListen to freely downloadable audio sermons by the speaker Andrew Bonar in mp3 format. He was a well-known pastor in Scotland with the Free Church. His brother Horatius was another well-known minister who was contemporary with Robert Murray Mchyene and others in those days. They saw a move of revival in their churches where the Spirit brought many immediate conversations in a short period of time. \r\n\r\nHe is best known for his work on compiling the life of the prophet of Dundee: Robert Murray Mchyene: \"Memoir and Remains of Robert Murray McCheyne.\" One cannot read this volume and feel the sobriety of eternity and the fear of the Lord. He also wrote a wonderful volume on Leviticus.",
    "sermons": [
        {
            "title": "The Cup of Wrath",
            "url": "http:\/\/sermonindex.net\/SID16886",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Audio Books",
            "description": "Andrew Alexander Bonar, a minister of the Free Church of Scotland; born Edinburgh May 29, 1810, youngest brother of Horatius Bonar; died Glasgow December 30, 1892. He studied at Edinburgh; was minister at Collace, Perthshire, 1838 – 1856 (both in the Church of Scotland and the Free Church); and of Finnieston Free Church, Glasgow, 1856 till his death. He joined the Free Church in 1843, and was its moderator in 1878. He was identified with evangelical and revival movements and adhered to the doctrine of premillennialism. With Robert Murray McCheyne he visited Palestine in 1839 to inquire into the condition of the Jews there. During the visit of Dwight L. Moody to Britain in 1874 and 1875, Moody was warmly welcomed by Bonar, despite the latter receiving considerable criticism from other Calvinist ministers in the Free Church.",
            "download": "http:\/\/sermonindex.net\/SID16886-download",
            "preacher_name": "Andrew Bonar",
            "preacher_image": "",
            "preacher_description": "Andrew Bonar (1810 - 1892)\r\nListen to freely downloadable audio sermons by the speaker Andrew Bonar in mp3 format. He was a well-known pastor in Scotland with the Free Church. His brother Horatius was another well-known minister who was contemporary with Robert Murray Mchyene and others in those days. They saw a move of revival in their churches where the Spirit brought many immediate conversations in a short period of time. \r\n\r\nHe is best known for his work on compiling the life of the prophet of Dundee: Robert Murray Mchyene: \"Memoir and Remains of Robert Murray McCheyne.\" One cannot read this volume and feel the sobriety of eternity and the fear of the Lord. He also wrote a wonderful volume on Leviticus.",
            "_scripture": []
        }
    ]
}