{
    "name": "C.L. Culpepper",
    "image": "",
    "description": "C.L. Culpepper (1895 - 1986)\r\nListen to freely downloadable audio sermons by the speaker C.L. Culpepper in mp3 format. Was a Southern Baptist missionary to China and experienced part of the Shantung Revival in China during the 1920-1930's. When the Communists took over in China, Dr. and Mrs. Culpepper and their children were transferred to Hong Kong where Dr. Culpepper served as treasurer of the Hong Kong Baptist Mission.\r\nWhen Miss Monsen greeted them at the door, her first words to the Culpeppers was a question, “Brother Culpepper, have you been filled with the Holy Spirit?” The issue of the filling of the Holy Spirit, also referred to by the missionaries as the “baptism in the Holy Spirit,” served as a major theme of the ensuing revival, as the missionaries reported it. Miss Monsen related to the Culpeppers scriptures related to healing, particularly James 5:14-16. Mr. Culpepper said that “the words ‘confess your faults’ particularly pierced [his] heart”. Confession of sin and an emphasis on consecrated holiness is another phenomenon that characterized the revival.",
    "sermons": [
        {
            "title": "The Shantung Revival",
            "url": "http:\/\/api.sermonindex.net\/SID0499",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival History",
            "description": "Here is a detailed account of this revival by Baptist missionary Dr. C.L. Culpepper. This stirring account grabs your attention as Dr. Culpepper relates the fascinating behind-the-scenes account of his own experience as well as the larger picture. This moving and powerful personal account by Southern Baptist missionary C.L. Culpepper of the Shantung Revival in China in the 1920's (one of the most remarkable mass moving of the Holy Spirit in history) continues to move and convict me each time I listen.",
            "download": "http:\/\/api.sermonindex.net\/SID0499-download",
            "speaker_name": "C.L. Culpepper",
            "_scripture": []
        }
    ]
}