{
    "name": "Dr. A.E. Wilder-Smith",
    "image": "",
    "description": "",
    "sermons": [
        {
            "title": "Cause\/Cure of the Drug Epidemic",
            "url": "https:\/\/sermonindex.info\/SID0543",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:11",
            "topic": "Drug Addiction",
            "description": "Dr. Smith here addresses the different kinds of hard drugs and specifically the ones that are labeled as “sorcery” in the King James Version of Galatians.  Smith shows how sorcery is really speaking of drug induced “religious” experience or pharmakeia.  Smith argues that these drug induced stupor’s are a means of compensating for true spirituality, in the sense that they crowd out the senses God has given us in order that we might choose to enter our prayer closets, reduce our sensory input, and hear from God",
            "download": "https:\/\/sermonindex.info\/SID0543-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Digestive System",
            "url": "https:\/\/sermonindex.info\/SID0553",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evolution",
            "description": "While the stomach has the need to digest and break down food into its component nutrients, so also the mind is a digestive system designed to break information down into satisfying informative components.  As food is flavored by salts and spices for our pleasure in just the right amounts, so also our conversation ought to be seasoned by just the right amount of salt.  As Christ told the disciples to not waste a bit of the bread he broke, so also he wastes nothing in our spiritual upbringing.  Jesus was perfectly efficient.  He cares about efficiency in his creation.  Smith explains how the human digestive system is obviously the product of incredibly careful thought and intention.   He also explains how the theory of evolution is quite simply wasteful, and inefficient.  Wilder shows that where the digestive system is hungry for nutrients, so also the mind is hungry for meaning.",
            "download": "https:\/\/sermonindex.info\/SID0553-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Dimension Theory\/Time Theory",
            "url": "https:\/\/sermonindex.info\/SID0544",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 2",
            "topic": "Science",
            "description": "God’s mind is not bound by time.  Neither is his interaction with our reality.  Wilder-Smith uses one of his greatest analogies concerning the impossibility of using the scientific method to perceive or interact with heaven and hell.  The analogy comes in the form of understanding that there is no way to interact with a Black Hole, yet we know that they exist by inference.  So also, we are able to interact with eternal realities by inference.  Through this analogy, Smith reveals the lie concerning our inability to scientifically measure heaven or hell to prove it's existence because you cannot scientifically tamper with a black hole in any way yet scientists believe in them just the same.   The second analogy he explains about dimensionality is that a two dimensional person would be incapable of capturing a three dimensional person, because they would always use their higher dimensionality to give their captors the slip.  So also, Jesus gave death the slip.  Smith explains that this life is about preparation for glorification, as the power that comes with a resurrected body would be too dangerous to place within the hands of immoral people.   So if we suffer with him, so also shall we reign with him.",
            "download": "https:\/\/sermonindex.info\/SID0544-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Environment or Genetics",
            "url": "https:\/\/sermonindex.info\/SID0541",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fatalism",
            "description": "In this discussion Dr. Smith analyzes the mode of genetics where one comes to understand the concept of latent genetics.  He shows how environment will optimize genetics to the fullest extent of the genes latent capacities.  He directly relates this to the environment of the family, emphasizing how an unhealthy environment for a child will hinder his\/her genetic capacity throughout life.  We need to have our hearts plowed and prepared for eternal truths, too much stimulation upon our hearts, newspapers, television, and the like, wears pathways across our heart-soil.  The seed of the word will be cast upon hardened soil if we do not take the time to quietly see our hearts and lives plowed up by the quite time with the Lord.  Another way to till the soil is fellowship with believers.   Our spiritual environment needs to be such that the seed can grow in health.",
            "download": "https:\/\/sermonindex.info\/SID0541-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Evolution or Creation",
            "url": "https:\/\/sermonindex.info\/SID0542",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1",
            "topic": "Evolution",
            "description": "In the debate between creation vs. evolution, the fundamental nail in evolution theories coffin is the field of study known as information science.  All existing life exists as a result of information, organized information.  Statistical analysts understand that information does not arise by chance.  AE Wilder-Smith shows in this discussion how to understand information theory, and how it proves creationism to be the only logical viewpoint.  Matter is not self-organizing; it is merely a medium for information.   Smith discusses the classic debate between Bishop Wilberforce and Aldous Huxley concerning the watch-maker.  He shows the fallacy of Huxley’s argument.  If you are not familiar with this debate it is a rather essential understanding in order to unravel the Gordian-Knot of evolution theory.  Smith argues in this teaching how important creationism understandings are because man is accountable to God upon the basis of God being revealed through nature.",
            "download": "https:\/\/sermonindex.info\/SID0542-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Is Biogenesis Scientific?",
            "url": "https:\/\/sermonindex.info\/SID0545",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Biogenesis",
            "description": "Smith discusses in this truncated message, the value of understanding that DNA is the result of thought, and not randomness.  The sermon cuts off early before he can make his point.",
            "download": "https:\/\/sermonindex.info\/SID0545-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Is Man a Machine?",
            "url": "https:\/\/sermonindex.info\/SID0547",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "In this speaking, we discover the dire necessity to recognize man as a machine.  In spite of the tendency to be repulsed by such an idea, the facts belie this reality.  As scientists have attempted to understand how to make a machine that is capable of replicating itself, they have discovered the astronomical amount of information required to make a machine that is not only self-replicating, but also self-diagnosing.  This type of machine is called a Von Neummann machine, and is incredibly complex to develop and requires millions of individual moving components, as well as the information to drive them.  In this analogy we see that man is an incredibly complex machine, obviously designed, and if he\/she is designed, then they are also designed to operate in a certain fashion.  Smith points out that to use our machines in a way that contradict God’s laws is to operate out of our designed ordinances.  When we, as complex Von Neummann machines operate out of our intended purpose then God no longer seems real or meaningful to us in any way.",
            "download": "https:\/\/sermonindex.info\/SID0547-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Locks & Keys",
            "url": "https:\/\/sermonindex.info\/SID0552",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "Whenever food is consumed, that food has to be broken down into its constituent nutrients.  Each nutrient is “locked” and the human body has to “unlock” the nutrients from the cells it is consuming.   The human body has the array of keys necessary to unlock all of the nutrients it must consume from the food.   How do you possess all of these keys?  You must have them programmed into you ahead of time.  Secondarily, language and the capacity to learn and translate it is also entirely contained within the sperm of men, which is then transferred into our genes and then into our minds.  How much pleasure must it give the creator when we use the machines of our minds for those intentions which he made them for?  Jesus chose to offer himself as a sacrifice for us so that we could offer ourselves as a sacrifice for him.  Should we not set our face toward that as he set his face toward Jerusalem?",
            "download": "https:\/\/sermonindex.info\/SID0552-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Logos in Biology",
            "url": "https:\/\/sermonindex.info\/SID0551",
            "size": "0",
            "format": "mp3",
            "scripture": "John 1:1",
            "topic": "Biology",
            "description": "Wilder-Smith discusses the necessity to recognize the logos of information within matter.  Without the direction put into us from the outside we will all go to pieces.  We also ought to receive the logos from God every day in terms of his direction, for if God implanted all matter with his logos signature, so also he can govern our lives through His word.  We ought then remain devoted to him in our lives and families.",
            "download": "https:\/\/sermonindex.info\/SID0551-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Logos in Language",
            "url": "https:\/\/sermonindex.info\/SID0556",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 3, Galatians 5:22-26",
            "topic": "Logos",
            "description": "In this message, Dr. Smith explains how all of nature contains language.  Animals, plants, humans, every living thing has what he acutely titles, “psycho-space.”  The psycho space being the realm in which each living thing has the capacity for some degree of thought or communication.  He proceeds to explain that the logos of God is communicated fundamentally to man through his character.  We see the logos of God in how Jesus healed Malcus’s ear, and how he endured such contradiction from rebel’s and sinners.  It is within our psycho-space that we must fill our “minds” with this mind of Christ, which is full of love, joy, peace, patience, and the fruit of the Spirit, as we follow the Spirit, the logos of God step-wise begins to conform us into the likeness of the logos of Christ.  Smith also shares a great testimony how an SS Nazi officer was converted to the faith when he shared with him about the strength of Christ character.",
            "download": "https:\/\/sermonindex.info\/SID0556-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "Galatians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Logos in Nature",
            "url": "https:\/\/sermonindex.info\/SID0555",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 4:4",
            "topic": "Logos",
            "description": "Thought, communication, and ideas cannot occur by random chance.  Dr. Smith shows how chance is not capable of producing instrumentation.   He discusses in this sermon how our instrumentation was designed in its origins to enjoy God and take pleasure in Him forever.  If we are not in the place of operating as our instrumentation was designed, we need to ask the Lord as to why we are all out of whack, in hopes that He will correct us.  Smith discusses how happy marriages are often an indication of God’s working in our instrumentation just like the Albatross happily maintains their monogamy for life, and revels in it with dancin",
            "download": "https:\/\/sermonindex.info\/SID0555-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Nature of the New Birth",
            "url": "https:\/\/sermonindex.info\/SID0550",
            "size": "0",
            "format": "mp3",
            "scripture": "John 3:1-17",
            "topic": "New Birth",
            "description": "Smith discusses in this sermon the necessity of a continuous look unto the serpent on the pole in order to perpetuate our new life.  At first we must look upon him who became sin for us, we must also continue to do so for healing from the ailments of sin.   There will never be a time in our lives where we cannot look to Christ for healing and remedy from our sin.  In essence the looking to Christ is the beginning of the new birth, and looking unto him ever after is the perpetuation of the new birth.",
            "download": "https:\/\/sermonindex.info\/SID0550-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Sign of the Prophet Jonah",
            "url": "https:\/\/sermonindex.info\/SID0548",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah",
            "topic": "Jonah",
            "description": "A.E. Discusses how the “Monster” of the deep consumed Jonah.  He analyzes the science of Blue and Pot (Sperm) whales (likely candidates for the job.)  Upon discovering how Jonah’s body would have reacted to the stomach juices of the monster, he preaches on how the signs of death were upon Jonah.   Wilder-Smith says that the marks of death upon a preacher will cause there to be a hearing on the parts of the recipients of the sermons.  The death of the cross must be seen in the preacher before his message will be heard.   We must be crucified for Christ’s sake.  Even the king of Nineveh will listen to that man.",
            "download": "https:\/\/sermonindex.info\/SID0548-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Five Senses",
            "url": "https:\/\/sermonindex.info\/SID0554",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Senses",
            "description": "Dr. Smith explains how Jesus created our senses to work.  By explaining these modes of operation, he ruminates on how a savior was so wise and intelligent in his thoughts.  He shows how God was not just utilitarian in his creation, but that he was also considerate of creating us to enjoy pleasure.  Dr. Smith argues through these understandings of the senses, both sensory as well as extra-sensory, that we come to a deeper understanding of the thoughtfulness of God, and why it is so wrong to believe in the theory of evolution, as it harms a child’s understanding of the care of God.   If by the use of our extra-sensory perception, we perceive that we are far from the Lord, we need to see and evaluate if there is any wicked way in us.",
            "download": "https:\/\/sermonindex.info\/SID0554-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Serpent on a Pole",
            "url": "https:\/\/sermonindex.info\/SID0540",
            "size": "0",
            "format": "mp3",
            "scripture": "John 3:14",
            "topic": "Jesus Christ",
            "description": "In this session Dr.  A.E. Wilder-Smith shares his insights about the serpents in the wilderness with some children.  He emphasizes to them the necessity to always be in a position in life where we can see the “serpent on the pole” meaning…always be ready to look to the cross when the serpent bites.   Dr. Smith’s wife Beate also shares a bit in this about how they raised their children to fall in love with the scriptures.",
            "download": "https:\/\/sermonindex.info\/SID0540-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Turtle God's Handiwork",
            "url": "https:\/\/sermonindex.info\/SID0549",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "Smith here explains that our worship to God is the product of understanding.  When we begin to understand how he made creation, it will cause us to recognize his power, authority and capabilities.  Using the magnetic compass of a sea turtle as an example, Smith discusses how it would not be able to exist were it not that it had been designed to work with its natural compass.  The turtle would not be able to make it to the ocean as a hatchling, neither would it be able to breed by making it back to its home breeding grounds later in life.  It is out of knowledge that God makes us to enjoy the necessities of consumption (food that is).  When we realize that God is a hedonist by nature, and we are going to enjoy him forever, we will worship with a greater knowledge and fervency.",
            "download": "https:\/\/sermonindex.info\/SID0549-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Why Does God Allow Suffering?",
            "url": "https:\/\/sermonindex.info\/SID0546",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 8:18, John 10:34",
            "topic": "Suffering",
            "description": "If one were to walk into a cathedral in Cologne, and he noticed that there were holes in the walls, and that some of the flying buttresses had been detached from their intended place by bombs, nobody would assume that the architect had been a fool for designing the building the way it was in its present condition.  So also we must recognize that, being made as “gods” (John 10:34) we were given the free will to choose our present condition.  God is not to be blamed for the suffering we have chosen, neither is He to be blamed for the wreckage as a result of it.  Just as our Lord was, so also we need to be perfected through sufferings.  Suffering offers mankind the option to change.  We were cast out of eternity into time so that our decision could be corrected, and Jesus came and suffered for us so that we could be reconciled.",
            "download": "https:\/\/sermonindex.info\/SID0546-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "John",
                    "chapter": "10"
                }
            ]
        }
    ]
}