{
    "name": "Duncan Campbell",
    "image": "\/images\/duncan_campbell.gif",
    "description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
    "sermons": [
        {
            "title": "Aaron's Failure",
            "url": "http:\/\/api.sermonindex.net\/SID0558",
            "size": "10954240",
            "format": "mp3",
            "scripture": "Exodus 32:7-10",
            "topic": "Failure",
            "description": "Campbell compares Aaron's golden calf with modern evangelistic models that compromise with the world to make the Gospel more palatable to the world. But separation from the world \"is necessary to the success the church's evangelistic endeavor.\" To rescue the lost from the morass of sin, we must be standing on solid ground ourselves.",
            "download": "http:\/\/api.sermonindex.net\/SID0558-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Action And Obedience",
            "url": "http:\/\/api.sermonindex.net\/SID0360",
            "size": "7775232",
            "format": "mp3",
            "scripture": "Matthew 21:1-7",
            "topic": "Obedience",
            "description": "Duncan Campbell speaks very plainly and directly towards the root causes of what hinder revival, namely not obeying the voice of the Lord and holding on to secret sins.  God desires to 'open the floodgates of glory' but obedience is a fundamental truth for blessing.  Campbell appeals to the simple yielding of oneself to Christ and like the donkey being serviceable for Him to meet the need.",
            "download": "http:\/\/api.sermonindex.net\/SID0360-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "And the Country was Filled with Water",
            "url": "http:\/\/api.sermonindex.net\/SID0559",
            "size": "12909568",
            "format": "mp3",
            "scripture": "2 Kings 3:10-20",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Duncan Campbell preached this strong word on the baptism in the Holy Spirit at a camp meeting in America in the 1960's.  \"You can't work up revival, but you can do the digging\"--a breaking through the dry crust of our hearts and removing the 'stones', anything that would hinder a consecrated life to God.  The sermon is alive with vivid revival accounts, as with its sister sermon, \"Lacking One Thing\".",
            "download": "http:\/\/api.sermonindex.net\/SID0559-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Building the Walls",
            "url": "http:\/\/api.sermonindex.net\/SID0362",
            "size": "8870912",
            "format": "mp3",
            "scripture": "Nehemiah 6:1-4",
            "topic": "Prayer Life",
            "description": "Duncan Campbell draws principles from the life of Nehemiah to illustrate the qualities of a man who is diligent in prayer, labor and vision, yet is able to let God do the rest.  He closes with sober call to those who have left the work of God in compromise to let God 'restore the year of the locust'.",
            "download": "http:\/\/api.sermonindex.net\/SID0362-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Can Two Walk Together Except They Be Agreed",
            "url": "http:\/\/api.sermonindex.net\/SID0767",
            "size": "13587968",
            "format": "mp3",
            "scripture": "Amos 3:3",
            "topic": "Walking With God",
            "description": "\"Is there anything in my life,\" asks Duncan Campbell, \"in disagreement with God?\"  He shares four major principles (like the sister sermon, \"Walking With God\") that we must be in agreement with God for revival.  There is a price to pay for revival--absolute yieldedness to God.  \"Are your souls thirsty that you're prepared for an absolute surrender in every department of your life?\"",
            "download": "http:\/\/api.sermonindex.net\/SID0767-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Dry Valleys Filled With Water",
            "url": "http:\/\/api.sermonindex.net\/SID21947",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Spirit Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21947-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "Duncan Campbell's Testimony",
            "url": "http:\/\/api.sermonindex.net\/SID21948",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Testimony",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21948-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "God Indwelling Us",
            "url": "http:\/\/api.sermonindex.net\/SID21946",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ In Us",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21946-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "God's Answer to the cry of Unbelief",
            "url": "http:\/\/api.sermonindex.net\/SID0768",
            "size": "11107840",
            "format": "mp3",
            "scripture": "Exodus 17:5-14",
            "topic": "Unbelief",
            "description": "The answer to our cry of unbelief is getting the rod of God into our hands, which Campbell explains is our need of the supernatural and heaven's anointing.  Are we men of vision, on the top of the hill like Moses, above the world and its ways?  \"The hand that holds the rod must be a clean hand,\" as well as empty and outstretched, Campbell teaches, if we will be rid of unreality in our Christian experience and be a transmitter of God's presence to others.",
            "download": "http:\/\/api.sermonindex.net\/SID0768-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Heart preparation for revival",
            "url": "http:\/\/api.sermonindex.net\/SID0765",
            "size": "8644608",
            "format": "mp3",
            "scripture": "1 John 1",
            "topic": "Revival",
            "description": "\"Revival begins in His heart, and He operates through my life.\"  God's operation through His people as \"agents of revival\" though must have a gripping desire for reality.  \"A God-sent revival,\" he said, \"must ever be related to holiness and separation.\"  The three conditions of this preparation are getting into the light (heart-searching prayer), acknowledging what the light reveals (repentance), and walking in the light (obedience).  Campbell seriously challenges those who would see revival (not just dream about it) to be unsparingly honest about themselves.",
            "download": "http:\/\/api.sermonindex.net\/SID0765-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "His Testimony And Conversion",
            "url": "http:\/\/api.sermonindex.net\/SID0560",
            "size": "9607680",
            "format": "mp3",
            "scripture": "Psalm 66:8-20",
            "topic": "Testimony",
            "description": "A very powerful testimony of conversion not by a man but by God who wrought a wonderful work of regeneration in mr. campbells soul. He recieved the baptism with the Holy Spirit and was used powerfully in the revival of 1921. Then he went through a barren wilderness for 17 years in the ministry. But again God revived his heart and he experienced the outpouring of the Holy Spirit in the famous Hebrides Revival. The summation of this testimony is very powerful where he asks the listener if God could do this for him why not us? are we willing to 'go through with God' at any cost?",
            "download": "http:\/\/api.sermonindex.net\/SID0560-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "66"
                }
            ]
        },
        {
            "title": "Is the Lord among us",
            "url": "http:\/\/api.sermonindex.net\/SID0769",
            "size": "14688768",
            "format": "mp3",
            "scripture": "Exodus 17:5-16",
            "topic": "Consecration",
            "description": "\"We all have our Amalek,\" Campbell says, but how do we react to hell's engagement?  Starting with a personal testimony seeing first hand the warfare of the devil in a crowded farmhouse packed with sinners seeking salvation, he segues into the vital necessity of character before God--clean hands and a pure heart.  Campbell repeatedly warns against the overemphasis of man in modern evangelism, hymns and even one's own consecration, pleading for God to be all in all.",
            "download": "http:\/\/api.sermonindex.net\/SID0769-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Lacking One Thing",
            "url": "http:\/\/api.sermonindex.net\/SID0357",
            "size": "12529152",
            "format": "mp3",
            "scripture": "2 Kings 3:14-20",
            "topic": "Consecration",
            "description": "Campbell extracts principles for revival from 2 Kings 3 where the lack of water refers to the one thing that would ensure victory: the power of the Holy Ghost.  The three main points were 1) the futility of mere human effort, 2) faith that wins through, and 3) the fulness that met the need.  Brother Duncan powerfully illustrates a spirit of inquiry and an acknowledgement of need in the Arnol revival \"when the farmhouse shook\".  \"The digging may involve a cost,\" he challenged, a self-denial of forgetting oneself \"in a desire to prepare the way for God.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0357-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Lewis Land of Revival (Revival Testimonies)",
            "url": "http:\/\/api.sermonindex.net\/SID0561",
            "size": "10814464",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival History",
            "description": "Here are the testimonies from those who were touched by God in this extraordinary movement on the island of Lewis. There is so much preaching and teaching on revival in our day but hear from eye-witnesses God moving in revival power!",
            "download": "http:\/\/api.sermonindex.net\/SID0561-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "Meeting a Need",
            "url": "http:\/\/api.sermonindex.net\/SID16681",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "God wants to meet our need.  In this sermon, Duncan explains that there is no moral virtue in obedience unless there is recognition of a higher authority that calls for that obedience.  What does that type of obedience look like?  That means you have to hand Jesus the keys to every room in your life.  Do you still hold on to a key?",
            "download": "http:\/\/api.sermonindex.net\/SID16681-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "Principles That Govern Spiritual Awakenings - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID17407",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85",
            "topic": "Spiritual Awakening",
            "description": "An exposition of the \"Revival Psalm\" that emphasizes the sovereignty of God in Revival and in salvation. \"Human faith\" cannot save the soul; faith unto salvation is a gift from God. Revival cannot be produced by human endeavor; only God Himself can do that. The Lord initiates Revival; but man must respond. But Campbell, a Highland Calvinist, warns against extreme doctrines of sovereignty that deny human responsibility.",
            "download": "http:\/\/api.sermonindex.net\/SID17407-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Principles That Govern Spiritual Awakenings - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID17408",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85",
            "topic": "Spiritual Awakening",
            "description": "In the second half of the message, Campbell supplements his exposition of Psalm 85 with several personal accounts of Revival, including the testimony of his seventeen \"wilderness years\" and his restoration.",
            "download": "http:\/\/api.sermonindex.net\/SID17408-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Reality of the Divine in Christian Experience",
            "url": "http:\/\/api.sermonindex.net\/SID0361",
            "size": "8728064",
            "format": "mp3",
            "scripture": "Colossians 2:1-7",
            "topic": "Conversion",
            "description": "What does it really mean to be in Christ?  Duncan Campbell exposes shallow 'conversions' that do not bring about real change and a surrender to the lordship of Christ.  Campbell weaves in some personal testimonies and revival experiences to compliment the topic.  'Are you moving,' Campbell warns, 'under a self-created illusion?'",
            "download": "http:\/\/api.sermonindex.net\/SID0361-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Revival On The Isle Of Lewis",
            "url": "http:\/\/api.sermonindex.net\/SID0355",
            "size": "10981888",
            "format": "mp3",
            "scripture": "Psalm 85:6",
            "topic": "Revival History",
            "description": "Listen to this first-hand account of the Lewis Revival during the early 1950s. Duncan Campbell was God's instrument in this extraordinary awakening. In this tape Campbell recounts point-by-point this three-year movement of the Holy Spirit over the Hebrides Islands. Thousands were converted, conviction overwhelmed villages, outward sin disappeared, and prayer meetings were packed! Your heart will be thrilled as you listen to this tape about this heaven-sent revival in Lewis.",
            "download": "http:\/\/api.sermonindex.net\/SID0355-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revive Us Again",
            "url": "http:\/\/api.sermonindex.net\/SID0119",
            "size": "11918848",
            "format": "mp3",
            "scripture": "Psalms 85, 2 Chronicles 7:14",
            "topic": "Revival",
            "description": "This is not so much a teaching as it is the groanings of a burdened heart to exalt God above man to His rightful place in revival.  Campbell shared several practical \"principles that govern spiritual quickening.\"  The differences between a God-sent revival and the man-centered evangelistic means of his day are truly heart-searching for anyone engaged in work to save men's souls.  Since God's sovereignty does not nullify man's responsibility, Campbell admonished his hearers to be \"agents of revival\" that take God up on \"His covenant engagement\" in prayer and staying close to the heart of the Shepherd.",
            "download": "http:\/\/api.sermonindex.net\/SID0119-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Sin in the Camp",
            "url": "http:\/\/api.sermonindex.net\/SID0766",
            "size": "11425792",
            "format": "mp3",
            "scripture": " Isaiah 59:1-2, John 12:20-24",
            "topic": "Sin",
            "description": "Oh, what a need today of anointed Holy Ghost preaching like this!  Revival cannot come when there is sin in the camp--the church.  Let preachers beware too, for Campbell lifted up his voice like a trumpet as a watchman: \"Preaching truth without the anointing of the Holy Ghost is helping the devil to damn souls.\"  \"Surely, surely our crying need is for a Pentecostal visitation.\"  Mr. Campbell's words sound as distant thunder and are as applicable to our day as it was when preached forty years ago!",
            "download": "http:\/\/api.sermonindex.net\/SID0766-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "12"
                },
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "Testimony",
            "url": "http:\/\/api.sermonindex.net\/SID21949",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Testimony",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21949-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "The Fire of God",
            "url": "http:\/\/api.sermonindex.net\/SID0363",
            "size": "8724480",
            "format": "mp3",
            "scripture": "1 Kings 18:30-33, 2 Chronicles 7:14, John 12:20-24",
            "topic": "Fire Of God",
            "description": "Duncan Campbell looks around at all the darkness and apostacy around and answers the question: \"Why is revival not coming?\"  He cites some examples from the past to point out that the God of Elijah is alive and hears the sincere cry of the heart.  What opens God's ears, Campbell teaches, is a life offered wholly on the altar to where we can say, \"God, you've got the last piece.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0363-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "12"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                },
                {
                    "book": "1 Kings",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "The Gospel of A New Beginning",
            "url": "http:\/\/api.sermonindex.net\/SID22100",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "New Beginning",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22100-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "The Holy Ghost In Revival - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID22108",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22108-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "The Holy Ghost In Revival - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID22109",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22109-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "The Sacrifice That Is Pleasing To God",
            "url": "http:\/\/api.sermonindex.net\/SID0358",
            "size": "10271232",
            "format": "mp3",
            "scripture": "Genesis 32:24-32, Psalms 51:15-17",
            "topic": "Sacrifice",
            "description": "Campbell sets out using the incident of Jacob's breaking during with his wrestling match with God to apply these principles to ourselves for \"the entire reconstruction\" of our lives.  \"Jacob couldn't wrestle anymore; he could only cling.\"  When a life has come through God's breaking process, it is then time alone with God is precious and spiritual vision comes.  Our flesh doesn't like these kind of messages, but there is tremendous spiritual growth possible to the one who submits to God's chastening.",
            "download": "http:\/\/api.sermonindex.net\/SID0358-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "51"
                },
                {
                    "book": "Genesis",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Then the Fire of The Lord Fell",
            "url": "http:\/\/api.sermonindex.net\/SID0501",
            "size": "14865408",
            "format": "mp3",
            "scripture": "1 Kings 18:30-40",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Campbell's main themes are our \"supreme need\" for a Pentecostal revival in the baptism in the Holy Spirit.  \"When the fire falls, the word in the mind becomes the incarnate word in the heart.\"  The prime characteristics that Campbell observed during times of God's visitation were the fear of God, deep conviction of sin, a spiritual atmosphere and a belief in the authority of God's Word.",
            "download": "http:\/\/api.sermonindex.net\/SID0501-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Unrest",
            "url": "http:\/\/api.sermonindex.net\/SID0356",
            "size": "16339968",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "The Lord implants a sense of unrest in His people, so that we will \"follow on to know the Lord.\" This unrest is a hunger to be conformed to the image of the Son of God. No profession of salvation is real without this element of unrest. At 1:12 ff. Campbell assaults the doctrine that we may accept Jesus as Savior without obeying Him as Lord. (Rom. 10:9)",
            "download": "http:\/\/api.sermonindex.net\/SID0356-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "Walking With God",
            "url": "http:\/\/api.sermonindex.net\/SID0557",
            "size": "11158528",
            "format": "mp3",
            "scripture": "Amos 3:1-8",
            "topic": "Walking With God",
            "description": "Campbell remarked, “The reality of the divine Presence is not the dominating feature of much that goes under the name of Christian experience.”  We should be agreed on four things in walking with God: the place we meet, the purpose, the pace and the cost, which is absolute surrender to the will of God.  The place of blessing and price of revival comes through devotion to Jesus, waiting upon God and personal sacrifice.  Is He real?",
            "download": "http:\/\/api.sermonindex.net\/SID0557-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "When God Stepped Down - Part 1 (CD Quality)",
            "url": "http:\/\/api.sermonindex.net\/SID1552",
            "size": "27526656",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival History",
            "description": "Listen to this first-hand account of the Lewis Revival during the early 1950s. Duncan Campbell was God's instrument in this extraordinary awakening. In this tape Campbell recounts point-by-point this three-year movement of the Holy Spirit over the Hebrides Islands. Thousands were converted, conviction overwhelmed villages, outward sin disappeared, and prayer meetings were packed! Your heart will be thrilled as you listen to this tape about this heaven-sent revival in Lewis.",
            "download": "http:\/\/api.sermonindex.net\/SID1552-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "When God Stepped Down - Part 2 (CD Quality)",
            "url": "http:\/\/api.sermonindex.net\/SID1553",
            "size": "28357120",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival History",
            "description": "Listen to this first-hand account of the Lewis Revival during the early 1950s. Duncan Campbell was God's instrument in this extraordinary awakening. In this tape Campbell recounts point-by-point this three-year movement of the Holy Spirit over the Hebrides Islands. Thousands were converted, conviction overwhelmed villages, outward sin disappeared, and prayer meetings were packed! Your heart will be thrilled as you listen to this tape about this heaven-sent revival in Lewis.",
            "download": "http:\/\/api.sermonindex.net\/SID1553-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        },
        {
            "title": "When God Stepped Down from Heaven",
            "url": "http:\/\/api.sermonindex.net\/SID0562",
            "size": "10838528",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival History",
            "description": "Listen to this first-hand account of the Lewis Revival during the early 1950s. Duncan Campbell was God's instrument in this extraordinary awakening. In this tape Campbell recounts point-by-point this three-year movement of the Holy Spirit over the Hebrides Islands. Thousands were converted, conviction overwhelmed villages, outward sin disappeared, and prayer meetings were packed! Your heart will be thrilled as you listen to this tape about this heaven-sent revival in Lewis.",
            "download": "http:\/\/api.sermonindex.net\/SID0562-download",
            "speaker_name": "Duncan Campbell",
            "_scripture": []
        }
    ]
}