{
    "name": "Edward Payson",
    "image": "",
    "description": "Edward Payson (1783 - 1827)\r\nListen to freely downloadable audio sermons by the speaker Edward Payson in mp3 format.  American Congregational preacher, was born on 25 July 1783 at Rindge, New Hampshire, where his father, Seth Payson (1758-1820), was pastor of the Congregational Church. His uncle, Phillips Payson (1736-1801), pastor of a church in Chelsea, Massachusetts, was a physicist and astronomer. Edward Payson graduated at Harvard in 1803, was then principal of a school at Portland, Maine, and in 1807 became junior pastor of the Congregational Church at Portland, where he remained, after 1811, as senior pastor, until his death on 22 October 1827.\r\nThe most complete collection of his sermons, with a memoir by Asa Cummings originally published in 1828, is the Memoir, Select Thoughts and Sermons of the late Rev. Edward Payson (3 vols., Portland, 1846; Philadelphia, 1859). Based on this is the volume, Mementos of Edward Payson (New York, 1873), by the Rev. E. L. Janes of the Methodist Episcopal Church.",
    "sermons": [
        {
            "title": "The Difficulty of Escaping the Damnation of Hell (reading)",
            "url": "http:\/\/api.sermonindex.net\/SID3787",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Audio Books",
            "description": "Read by Howard Douglas King. Edward Payson was an outstanding American preacher of the early Nineteeth Century. From 1807 to 1827, laboring in the pulpit of Second Church in Portland, Maine, he saw extraordinary success in the conversion and edification of souls. He was held in such esteem, that thousands named their sons after him, and prayed that they would grow up to be like him. He preached the same biblical Calvinism that the Puritans preached before him. His written sermons are remarkably easy to read, even today. They are characterized by great vividness and convicting power, and by a captivating eloquence. This sermon is an excellent example of Puritan evangelism. Payson's goal is to convince the sinner that his salvation does not lie -- as he assumes -- within his own power. Armed with a deep knowledge of the deceitful heart of man, he drives the sinner from his refuge of lies, leaving him painfully aware of his ruined and helpless state, knowing that his only hope is in the mercy of a Sovereign God.",
            "download": "http:\/\/api.sermonindex.net\/SID3787-download",
            "preacher_name": "Edward Payson",
            "preacher_image": "",
            "preacher_description": "Edward Payson (1783 - 1827)\r\nListen to freely downloadable audio sermons by the speaker Edward Payson in mp3 format.  American Congregational preacher, was born on 25 July 1783 at Rindge, New Hampshire, where his father, Seth Payson (1758-1820), was pastor of the Congregational Church. His uncle, Phillips Payson (1736-1801), pastor of a church in Chelsea, Massachusetts, was a physicist and astronomer. Edward Payson graduated at Harvard in 1803, was then principal of a school at Portland, Maine, and in 1807 became junior pastor of the Congregational Church at Portland, where he remained, after 1811, as senior pastor, until his death on 22 October 1827.\r\nThe most complete collection of his sermons, with a memoir by Asa Cummings originally published in 1828, is the Memoir, Select Thoughts and Sermons of the late Rev. Edward Payson (3 vols., Portland, 1846; Philadelphia, 1859). Based on this is the volume, Mementos of Edward Payson (New York, 1873), by the Rev. E. L. Janes of the Methodist Episcopal Church.",
            "_scripture": []
        }
    ]
}