{
    "name": "Eli Brayley",
    "image": "",
    "description": "",
    "audio_sermons": [
        {
            "title": "A Good Report",
            "url": "http:\/\/sermonindex.net\/SID13999",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:39-40",
            "topic": "Men Of Faith",
            "description": "This message deals with the vital necessity of faith, examining the heroic standard set by those ancient men and women listed in the eleventh chapter of Hebrews. \"And these all, having obtained a good report through faith, received not the promise: God having provided some better thing for us, that they without us should not be made perfect.\" (Hebrews 11:39-40) Our generation is starving for men and women of this caliber of faith, but who will heed the call?",
            "download": "http:\/\/sermonindex.net\/SID13999-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "A Reprobate Mind",
            "url": "http:\/\/sermonindex.net\/SID12808",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:28",
            "topic": "Street Preaching",
            "description": "Preached Saturday, May 27, 2006, at the Fredericton Farmer's Market. No box, no music... this message caused the most people to stop and listen than I have ever seen yet. It seemed the entire section of the market was attentively listening to God's Word being proclaimed. \"And even as they did not like to retain God in their knowledge, God gave them over to a reprobate mind, to do those things which are not convenient.\" (Romans 1:28)",
            "download": "http:\/\/sermonindex.net\/SID12808-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Fear God",
            "url": "http:\/\/sermonindex.net\/SID26277",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 10:28",
            "topic": "Fearing God",
            "description": "Eli Brayley speaks on fearing God how it is a very crucial foundation to the Scriptures and knowing God. He shares various bible verses from all over the Bible and gives a proper foundation for the topic. He ends to share that in the grace of God and knowing the Lord we have reverence and fear of God but are fully accepted of Him in His Son.",
            "download": "http:\/\/sermonindex.net\/SID26277-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Parable of the Sower",
            "url": "http:\/\/sermonindex.net\/SID12806",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Street Preaching",
            "description": "This sermon was preached the morning of October 29, 2005 at the Fredericton downtown market. It deals with man's heart conditions to receiving the Word of God, and the willingness of a life to bear fruit for the Kingdom of God. What is your heart condition?",
            "download": "http:\/\/sermonindex.net\/SID12806-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Psalm 73",
            "url": "http:\/\/sermonindex.net\/SID16061",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 73",
            "topic": "Temptation",
            "description": "This message examines 1) Asaph's temptation in envying the wicked, 2) how he found relief from this temptation, and 3) the results of being freed from this temptation. In view of the times it is imperative that we as believers maintain a correct understanding from the Lord regarding the ultimate end of the ungodly and the exceeding weight of glory that shall follow the overcomer.",
            "download": "http:\/\/sermonindex.net\/SID16061-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "73"
                }
            ]
        },
        {
            "title": "Redemption, Forgiveness, and the Riches of His Grace",
            "url": "http:\/\/sermonindex.net\/SID22249",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 1:12",
            "topic": "Redemption",
            "description": "This message was preached on March 14, 2010 at All Saints Church in Logan, Utah. Part of a series on Ephesians entitled Grace in the Heavenlies, this message explores the glory of the grace of God in the redemption we have through the blood of Jesus Christ. Christianity does not end with forgiveness, it begins with it, and God is forming a people for Himself who have known His forgiveness and therefore know Him as He really is: the God of unsearchable grace. \"...That we should be to the praise of his glory, who first trusted in Christ.\" (Ephesians 1:12)",
            "download": "http:\/\/sermonindex.net\/SID22249-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Repent Frederiction",
            "url": "http:\/\/sermonindex.net\/SID12805",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Street Preaching",
            "description": "This sermon was birthed from a night of prayer and worship, and was preached on Saturday Nov. 5, 2005 (my 2oth birthday) at the Fredericton market. Hearken unto the Word of God, Fredericton, repent of your idols and of your hatred towards God. Christ has died for this people, will we reject such love as this?",
            "download": "http:\/\/sermonindex.net\/SID12805-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Gospel is the Power of God",
            "url": "http:\/\/sermonindex.net\/SID22253",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16-17",
            "topic": "Gospel",
            "description": "This message was preached August 24, 2008 at Valley Church in Smithfield, Utah. \"For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. For therein is the righteousness of God revealed from faith to faith: as it is written. The just shall live by faith.\" (Romans 1:16-17) The Gospel which saves us is the power of God and the wisdom of God; for no one was saved by their own power, nor their own wisdom, but by the working alone of God's mighty power. The greatest need of man is righteousness with God, but it is also his greatest impossibility. Only through the Gospel is that righteousness secured, not by the strength and will of the flesh, but by the power and wisdom and God.",
            "download": "http:\/\/sermonindex.net\/SID22253-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Pleasure of God in the Gospel of His Son",
            "url": "http:\/\/sermonindex.net\/SID22250",
            "size": "0",
            "format": "mp3",
            "scripture": "Colossians 1:19-22",
            "topic": "Gospel",
            "description": "This message was preached on September 6, 2009, at the Guinavah Campground amphitheater. \"For it pleased the Father that in Him all the fullness should dwell, and by Him to reconcile all things to Himself, by Him, whether things on earth or things in heaven, having made peace through the blood of His cross. And you, who once were alienated and enemies in your mind by wicked works, yet now He has reconciled in the body of His flesh through death, to present you holy, and blameless, and above reproach in His sight.\" (Colossians 1:19-22) Contrary to what we might feel, God does not reluctantly forgive sins but He is pleased and full of joy to reconcile His enemies unto Himself. It pleased the Lord to crush His Son for our sakes, and when we apprehend this wonderful knowledge of God's good pleasure in the gospel, our hearts will be liberated and our lives transformed.",
            "download": "http:\/\/sermonindex.net\/SID22250-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Potter's Power Over the Clay",
            "url": "http:\/\/sermonindex.net\/SID22252",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 9:14-29",
            "topic": "Sovereignty",
            "description": "This message was preached on October 5, 2008 at Valley Church in Smithfield, Utah. \"Hath not the potter power over the clay, of the same lump to make one vessel unto honor, and another unto dishonor?\" Delivered with much \"fear and trembling\", this sermon is an exegesis of Romans 9:14-29 and an examination of the God's sovereign election in salvation. There is so much misunderstanding and confusion that surrounds the issue of election, and my hope is that this message will clear much of that away. The Church must not be ashamed of, or apologize for, God, and one of the greatest hindrances to our coming into the fullness of the stature of Christ is our failure to embrace this essential God glorifying truth: that salvation is all of God and not of man.",
            "download": "http:\/\/sermonindex.net\/SID22252-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Power and Danger of Deception",
            "url": "http:\/\/sermonindex.net\/SID12804",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "This sermon was preached at a church that had been falling into a deceptive doctrine called the \"Third Day\". The problem with the Third Day doctrine was detected when I attended several classes on the subject, learning that the direction of this particular teaching stressed the second coming of the Lord Jesus Christ not in bodily form, but rather in the Church, the body of Christ. I love dearly all those who have so far been teaching this mistaken doctrine. I love dearly the pastor of the church in which this sermon was preached and only pray that by way of this humble and inadequate admonition, men and women within the body of Christ would stir themselves to watching and prayer, becoming vigorous students of the Word of God, quick to discern truth from error, and that the name of the Lord Jesus Christ and His eternal gospel would advance throughout our lifetime.",
            "download": "http:\/\/sermonindex.net\/SID12804-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Wrath Of God",
            "url": "http:\/\/sermonindex.net\/SID22251",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:18",
            "topic": "Wrath Of God",
            "description": "This message was preached on August 30th, 2009, at Valley Church in Smithfield, Utah. \"For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men.\" (Romans 1:18) Foundational to the gospel as well as to the whole Bible, the reality of the wrath of God has almost become a thing of embarrassment for many Christians, but if we do not know God as the God revealed in Scripture - a God of wrath - then we really do not know God at all. God's wrath is as much a divine perfection as His love, and therefore it is something marvelous for us to rejoice in.",
            "download": "http:\/\/sermonindex.net\/SID22251-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Three Men Going to Hell",
            "url": "http:\/\/sermonindex.net\/SID12807",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 7:13-14",
            "topic": "Hell",
            "description": "This message was preached Friday April 21, 2006 in the open air on York and King, and is a warning against three types of people. The clip is about 14 minutes long and contains a lot of heckling and street preaching clashes, making this file an intense audio to hear. The point is: Jesus Christ is the narrow gate by which all men must enter. \"Enter ye in at the strait gate: for wide is the gate, and broad is the way, that leadeth to destruction, and many there be which go in thereat: Because strait is the gate, and narrow is the way, which leadeth unto life, and few there be that find it.\" (Matthew 7:13-14)",
            "download": "http:\/\/sermonindex.net\/SID12807-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "7"
                }
            ]
        }
    ]
}