{
    "name": "Ian Goligher",
    "image": "",
    "description": "",
    "sermons": [
        {
            "title": "Canadian Christian Heritage Under Fire #1 - Christian History of Canada",
            "url": "https:\/\/sermonindex.info\/SID10294",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 11:3",
            "topic": "",
            "description": "This first message in the series Our Christian Heritage Under Fire is a contrast between the Canada at Confereration and our generation. Men and Instutions were unashamedly Christian and sought to build a Canada that would be grounded in the principles of Chrisianity. Humanism is defined and the new neutralism is exposed. Every Christian in Canada should be fully aware of these facts.",
            "download": "https:\/\/sermonindex.info\/SID10294-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Canadian Christian Heritage Under Fire #4 - New Evangelicalism Denounced",
            "url": "https:\/\/sermonindex.info\/SID10297",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 13:24",
            "topic": "",
            "description": "The tares of New Evangelicalism have been sown while churches slept. The father of Neo- Orthodoxy was Karl Barth a Swiss theologian, who having rebounded from outright liberalism became the hope of many Evangelicals. Instead, he was the pied piper who led them to their destruction. In this message you will learn that the existentialism of Neo-Orthodoxy has led to a play-dough religion. While orthodoxy stands rock solid on the truth that is timeless, New Evangelicals have fallen headlong into the sinking sands of subjectivism. Learn how Barthianism ruined so many denominations and promising evangelicals. Learn why Canada's voice for Orthodoxy has been all but silenced. Again we ask, Where are the preachers? This message will tell us why.",
            "download": "https:\/\/sermonindex.info\/SID10297-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Christian Heritage Under Fire #3 - Where are the Preachers?",
            "url": "https:\/\/sermonindex.info\/SID10296",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "This is a look at Bible Schools in Canada from the early 1900s to present day. You will learn that there is a new kind of Bible school today that has a pluralistic agenda. They are also producing a new kind of preacher for the church that is one mile wide but only one inch deep.",
            "download": "https:\/\/sermonindex.info\/SID10296-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Our Canadian Christian Heritage Under Fire #2 - Modernism Wrecking Churches",
            "url": "https:\/\/sermonindex.info\/SID10295",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "Part two of this series examines the vast changes in Canadian live during the 1900s. The modernism that has sucked the gospel life out of so many schools and churches was contested by Dr. T.T. Shields of Toronto. His ministry is compared with the legacy of compromise left by Dr. Billy Graham and his evangelistic organisation. Canadian evangelicalism labours under that compromise to this day. This compromise has produced an anemic, sickly consumer based Christianity that is willing to sell out the gospel for man made success.",
            "download": "https:\/\/sermonindex.info\/SID10295-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Our Canadian Christian Heritage Under Fire #5 - We Need Revival in Canada",
            "url": "https:\/\/sermonindex.info\/SID10298",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 7:14",
            "topic": "Canada",
            "description": "Revival in Saskatoon! The visit of Duncan Campbell to the Prairies and his message that revival would come to Canada. This text is promise to God's people that we must plead for revival in this land.\r\nHere is hope for Gospel lovers in Canada.",
            "download": "https:\/\/sermonindex.info\/SID10298-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Damnation of Riches",
            "url": "https:\/\/sermonindex.info\/SID10293",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 12:15",
            "topic": "",
            "description": "The getting of gain has known no bounds in the desires and actions of men. The mighty dollar is idolized as a god. Hopes and dreams are pinned on things and stuff that will burn up on the eternal day. This sermon takes the words of Christ regarding riches.",
            "download": "https:\/\/sermonindex.info\/SID10293-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Weeping for Souls",
            "url": "https:\/\/sermonindex.info\/SID10292",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 8:11",
            "topic": "",
            "description": "Elisha's weeping in the face of Hazael is an action sermon for us to observe that the man of God feels what he preaches. The gospel message is more than theory or a package to deliver and be gone. Elisha shows us that tears are needed to minister to the souls of men. He is one of many examples of faithful servants of God whose hearts were broken with the urgency to reach perishing souls. In this sermon, a number of Biblical examples are given starting with Elisha. The need for this brokenness is vindicated in the fulfillment of Elisha's prophecy regarding Hazael's reign of terror against Israel. Reasons are also given why God demands brokenness from His servants to deliver His message of grace to deliver souls. The missing element in the modern day evangelical church shows how the church can move from a ministry of power to mere trite conformity to creeds and formalism. This needs to be repented of.",
            "download": "https:\/\/sermonindex.info\/SID10292-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "8"
                }
            ]
        }
    ]
}