{
    "name": "Ken Ham",
    "image": "",
    "description": "",
    "audio_sermons": [
        {
            "title": "Can We Really Trust the Bible?",
            "url": "http:\/\/sermonindex.net\/SID13783",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Bible",
            "description": "Romans says that men are without excuse because God's invisible attributes are seen through his creation.  Ken Ham establishes the necessity for Christians to stand for a six day creation account, and not to succumb to the ways of the world and adopt the \"millions of years\" thesis.  When one does that, he shows that God is no longer a God of love, but rather a cruel, heartless and capricious God.  If one interprets anything in Genesis 1-11 to be allegory, then the very underpinnings of the gospel narrative are also fractured.  One cannot believe that the fall of Adam was allegorical and also believe that the Last Adam took all of an \"allegorical Adam's\" sin upon himself.  This is a very well presented, well thought out, and reasonable argument to establish the importance of a literal creation account.",
            "download": "http:\/\/sermonindex.net\/SID13783-download",
            "preacher_name": "Ken Ham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Creation and the Scoffer!",
            "url": "http:\/\/sermonindex.net\/SID13784",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Scoffing",
            "description": "Brother Ken Ham explains to his audience how Answers In Genesis is on a mission to establish the authority of the Word of God more than they are out to debate evolution vs. creationism.  He shows how important it is to filter all of history through what the scriptures say happened than to reverse that and make the bible accountable to humanistic thought.  He shows how if you cannot believe what the Bible says about Biology, Geology, and Astronomy, what are you going to do when it talks about morality?  He also points out how the Holy Spirit predicted the scoffing view of evolution through 2Peter 3:3-7. Ham also explains how so many things we believe moralistically come from Genesis 1-11.",
            "download": "http:\/\/sermonindex.net\/SID13784-download",
            "preacher_name": "Ken Ham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Genesis and the Origin of Races",
            "url": "http:\/\/sermonindex.net\/SID13782",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Races",
            "description": "As an international Speaker, Ken Ham points out how in America, unlike any other nation on the planet, there is a unique problem with racism.  Specifically he objects to the prejudice and racism of ‘Christians,’ and Americans in general who have adopted petty ideas about it from evolutionary history and cults. He shows through the Bible, and genetics, how we are all in fact just one race, and that is the ‘race,’ of Adam.  He says that people who preach that it is wrong to marry inter-racially are simply not preaching a biblical ideal and need to repent.  He shows how a belief in Evolution promotes racism and prejudice, and how the only form of inter-racial marriage to be concerned about is when a child born of the ‘Last Adam,’ marries a child only born of the ‘First Adam.’",
            "download": "http:\/\/sermonindex.net\/SID13782-download",
            "preacher_name": "Ken Ham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Word \"All\" Makes Noahs Flood Global ",
            "url": "http:\/\/sermonindex.net\/SID19543",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Noahs Flood",
            "description": "The Hebrew word “all” clearly indicates that the flood of Noah was a global, rather than a local flood.  So why do people believe in a local flood?  Because they listen to men more than they do God!",
            "download": "http:\/\/sermonindex.net\/SID19543-download",
            "preacher_name": "Ken Ham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Young Earth -- It's Not the Issue",
            "url": "http:\/\/sermonindex.net\/SID13781",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Creation",
            "description": "Ken Ham rains blow after powerful blow against the root of man-fearing when it comes to interpreting the six-day creation account as being figurative.  He quotes numerous Christian sources from mainstream Christianity to show how they have kowtowed to the world by shoving “millions of years” into the scriptures through eisogesis.   He points out how no Christian ever believed the world was created in more than six days until the seventeen to eighteen hundreds, when the world told Christianity what they were allowed to believe about the word.  However...God gave man dominion over the world…not the word.",
            "download": "http:\/\/sermonindex.net\/SID13781-download",
            "preacher_name": "Ken Ham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}