{
    "name": "Kevin Swanson",
    "image": "",
    "description": "",
    "sermons": [
        {
            "title": "Evangelicals, Repent! (interview w\/ Paul Washer)",
            "url": "https:\/\/sermonindex.info\/SID19689",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Interview",
            "description": "Whatever the Christian 'Gospel' became over the last generation or so within the evangelical church was not substantial enough to salvage the faith. So serious Christians are beginning to define the Gospel using biblical language, and they're bringing back old biblical notions such as the Fear of God, Repentance, and Regeneration. Kevin Swanson interviews Paul Washer on his his recent messages calling a nation to repentance, and starting with 'evangelicals!'",
            "download": "https:\/\/sermonindex.info\/SID19689-download",
            "preacher_name": "Kevin Swanson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Coming Evangelical Collapse",
            "url": "https:\/\/sermonindex.info\/SID18971",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Interview",
            "description": "“The End of Christian America,” headlines the front cover of Newsweek Magazine this week. Christian leaders rush to explain the cause of the failure of Christianity in the west. Any and all concerned are clawing for some substantial handhold, some piece of “relevant” Christianity, some kind of meaningful Christian relationships, or some fragment of an historical faith (whether catholic, protestant, or orthodox). We interview Michael Spencer from internetmonk.com and author of an editorial piece recently published in the Christian Science Monitor, wherein he forecasts a collapse of evangelicalism. No easy answers on this segment of Generations, but some thoughtful remarks that may be the beginning of laying down a more deeply-rooted faith that will transcend the generations.",
            "download": "https:\/\/sermonindex.info\/SID18971-download",
            "preacher_name": "Kevin Swanson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}