{
    "name": "Richard Bennett",
    "image": "",
    "description": "",
    "sermons": [
        {
            "title": "Alignment of New Evangelicals With Apostasy",
            "url": "http:\/\/api.sermonindex.net\/SID3049",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "A clear call to biblical separation from Rome and \"Protestants\" (the harlot daughters of Rome) who teach and practice Roman Catholic doctrine. Richard Bennett is an ex Romanist priest who has become a Calvinist and here demonstrates the advantage he has in rebuking wayward Protestants as they fall into Romish errors regarding salvation (e.g. justification) & worship (e.g. baptism). Focusing on the backsliding of men like Chuck Colson, J.I. Packer, John Stott, Pat Robertson, Bill Bright (Campus Crusade) & others (like the two Jesuits) who signed the Evangelicals and Catholic Together (ECT) documents, he shows how these men are upholding Antichrist (the Papacy) and the teaching of the Council of Trent. Will also help to refute the Romanist heresies (on justification, assurance, baptism, etc.) of the New Perspectives on Paul (NPP) movement as recently proclaimed through the Auburn Avenue Pastors Conference (AAPC), which included Doug Wilson, Steve Schlissel, Steve Wilkins, & John Barach.",
            "download": "http:\/\/api.sermonindex.net\/SID3049-download",
            "speaker_name": "Richard Bennett",
            "_scripture": []
        },
        {
            "title": "Glory of Christ's Priesthood Contrasted With the Immorality of the RC Priesthood",
            "url": "http:\/\/api.sermonindex.net\/SID3050",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "Former Roman Catholic Priest turned Calvinist, Richard Bennett, takes an inside look at the causes for the corruption of the RC priesthood. He carefully demonstrates why this demonic system (1 Tim. 4:1-5) inevitably leads to the sexual scandals that have always plagued Romanism -- including pedophilia, homosexuality, adultery, fornication and more. These sins also flourish at Romanist seminaries & colleges & Bennett exposes this fact from the books of RC writers themselves. This message also contrasts the glory of Christ's Priesthood from Scripture with the parody that is the RC priesthood. Bennett's heartfelt love for the poor, deluded souls still caught in the grips of the Roman ecclesiastical beast can be heard throughout this message.",
            "download": "http:\/\/api.sermonindex.net\/SID3050-download",
            "speaker_name": "Richard Bennett",
            "_scripture": []
        },
        {
            "title": "The Antichrist Unveiled",
            "url": "http:\/\/api.sermonindex.net\/SID3048",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "",
            "description": "Ex-Roman Catholic Priest turned Calvinist, Richard Bennett, proves that the Papacy is the Antichrist. Standing with all the major Reformers, all the Reformed and Puritan confessions (& covenants), the King James Version translators and the best Reformation churches, this lecture upholds the classic Protestant view of prophecy (Historicism), adding insights gained over many years of training, study and practice inside the very belly of the beast. For example, the WCF 25:5 states, \"There is no other head of the church but the Lord Jesus Christ: nor can the Pope of Rome in any sense be the head thereof; but is that antichrist, that man of sin, and son of perdition, that exalteth himself in the church against Christ, and all that is called God.\" Includes an irrefutable refutation of Jesuit-inspired futurism. Much more on this topic, including Wylie's \"The Papacy in the Antichrist.\"",
            "download": "http:\/\/api.sermonindex.net\/SID3048-download",
            "speaker_name": "Richard Bennett",
            "_scripture": []
        }
    ]
}