{
    "name": "Sammy Tippit",
    "image": "",
    "description": "",
    "audio_sermons": [
        {
            "title": "A Vision of Revival",
            "url": "http:\/\/sermonindex.net\/SID16674",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival",
            "description": "\"Holiness drives us to the position of humility and humility takes us to the place where grace can engulf us.\"  Sammy talks about Isaiah's encounter with God and explains that our vision for the world must start upwardly, then move inwardly, and then be expressed outwardly.  He discusses the divinely ordained unity of the ministry of intercession and the ministry of evangelism.  Sammy also explains that evangelism cannot be effective without prayer.",
            "download": "http:\/\/sermonindex.net\/SID16674-download",
            "preacher_name": "Sammy Tippit",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Desperation in Revival",
            "url": "http:\/\/sermonindex.net\/SID16673",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival",
            "description": "Sammy talks about how the church in the United States needs to realize that they are desperate for God.  He tells us that before we will see revival in America, we must realize the depth of our depravity and need, and be hungry and thirsty to see God work.",
            "download": "http:\/\/sermonindex.net\/SID16673-download",
            "preacher_name": "Sammy Tippit",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Revival and the Holiness of God",
            "url": "http:\/\/sermonindex.net\/SID16675",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival",
            "description": "In this sermon, Sammy tells an incredible story about how God brought His Spirit to the Zulu people in Africa.  He also talks about the holiness of God.  He explains that when we encounter the absolute purity and holiness of God, the result is humility of the greatest degree.  Moreover, humility is the first step towards revival.  Are you willing to do what it takes to see revival?",
            "download": "http:\/\/sermonindex.net\/SID16675-download",
            "preacher_name": "Sammy Tippit",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}