{
    "name": "Mark 11",
    "book": "Mark",
    "chapter": 11,
    "sermons": [
        {
            "title": "(Following The Footsteps Of Christ) The Unique Teacher",
            "url": "http:\/\/api.sermonindex.net\/SID8384",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:12-19",
            "topic": "Footsteps Of Christ",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8384-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Forgiving and Being Forgiven",
            "url": "http:\/\/api.sermonindex.net\/SID5421",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:25, Matthew 5:23-25",
            "topic": "Forgiveness",
            "description": "Debt and guilt are the same before God and it is a great debt that we owe Him due to our guilt before Him.  Thus our forgiveness came at the greatest cost to Him the death of His Son, the Lord Jesus.  And it is not without a cost that we are to forgive others as we have been forgiven, to forgive means to forgoe our rights and to suffer the cost.  Pastor Hession shows that at the root of unforgiveness is pride saying 'I wont forgive this person, they have violated my rights!' and also that when we are wronged and forgive then when the person comes and ask forgiveness we will be able to say 'There is nothing to forgive' as it is an old account that has been settled, just as ours was on Calvary.",
            "download": "http:\/\/api.sermonindex.net\/SID5421-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                },
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Have Faith In God",
            "url": "http:\/\/api.sermonindex.net\/SID13610",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:22-26, James 5 ",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13610-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                },
                {
                    "book": "James",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Have Faith in God",
            "url": "http:\/\/api.sermonindex.net\/SID25073",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:22",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25073-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Mark 11",
            "url": "http:\/\/api.sermonindex.net\/SID7973",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7973-download",
            "preacher_name": "W.F. Anderson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Law Of Forgiveness",
            "url": "http:\/\/api.sermonindex.net\/SID13506",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:25-26",
            "topic": "Forgiveness",
            "description": "Chuck Smith shares on the principle of forgiveness in the Bible. He shares that our personal forgiveness is dependent on our forgiving others.  We all have hurts, oughts, problems in life, God knows this and therefore has given us the way to be free from unforgiveness. He speaks of mercy and the need to err on mercy rather then judgment. He ends the message with the declaration that we cannot forgive apart from God helping us.",
            "download": "http:\/\/api.sermonindex.net\/SID13506-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Laws of Prayer",
            "url": "http:\/\/api.sermonindex.net\/SID3547",
            "size": "0",
            "format": "mp3",
            "scripture": "John 16:14, 23,John 15:7,Mark 11:24",
            "topic": "",
            "description": "F. J. Heugel expounds about 4 basic 'laws' of prayer, such as the will of God and the law of faith.  By 'law' he means characteristics or 'the realm of spiritual order' that govern prayer.  '[Even] grace has its mold of operation,' he said.  The practical, straight forward teaching from God's Word is wonderfully illustrated by answered prayers from the likes of George Muller, Watchman Nee and others.  (Part 1: The Laws of Prayer \/ Part 2: The Ministry of Prayer \/ Part 3: Great Prayers of History)",
            "download": "http:\/\/api.sermonindex.net\/SID3547-download",
            "preacher_name": "F.J. Huegel",
            "preacher_image": "\/images\/fj_huegel.gif",
            "preacher_description": "F. J. Huegel (1889 - 1971)\r\nListen to freely downloadable audio sermons by the speaker F. J. Huegel in mp3 format.  Was a chaplain in WWI and a missionary in Mexico. He wrote many books that are worth reading. Huegel's writings on the deeper aspects of Christ's work on Calvary and it's implications for the believer have blessed multitudes of Christians. This biography is written by his son, who states in his preface that he has deliberately tried not to present his father's life through rose colored glasses but rather give a true and accurate account--warts and all. Those who have benefited from Huegel's other writings will welcome this unique chance to get a look at the man behind the books. Highly recommended!\r\nHe is the author of the book: \"Bone of His Bone\": One of the most basic principles for a successful life as a Christian is that the individual must experience full dependency on Jesus--allow Christ to become part of him. In effect he must become Bone of His Bone. Don't miss these freshly edited studies on the indwelling Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "16"
                },
                {
                    "book": "John",
                    "chapter": "15"
                },
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Prayer of Faith",
            "url": "http:\/\/api.sermonindex.net\/SID19875",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:20-26, Romans 10:8",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19875-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                },
                {
                    "book": "Romans",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Time Has Come to Face the Mountain",
            "url": "http:\/\/api.sermonindex.net\/SID19334",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:20-24",
            "topic": "Overcoming",
            "description": "September 20, 2009 - Jesus faced the mountain of entrenched rebellion towards the ways of God. It is a systematic religiousness that made His ways unrecognizable to mankind. The wrath of God is truly revealed when He sees man create a system of religion that robs the sinner of the treasure of His heart. The whole desire of God is that His house would be called a house of prayer, and the doors would be open so the outcasts of humanity could come in and find satisfaction to the deepest desires of their heart. God is calling His church to get out of the board rooms and into the prayer closet and cry out to Him to ignite us with the fire of the Holy Ghost and begin to move in His power one more time. Can we believe God to cleanse the temple one more time and awaken His church?",
            "download": "http:\/\/api.sermonindex.net\/SID19334-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Triumphal Entry: The King Comes for His Kingdom\t",
            "url": "http:\/\/api.sermonindex.net\/SID27685",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:1-11, Zechariah 9:9, Psalm 118:25-26",
            "topic": "Triumphal Entry",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27685-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                },
                {
                    "book": "Zechariah",
                    "chapter": "9"
                },
                {
                    "book": "Psalms",
                    "chapter": "118"
                }
            ]
        },
        {
            "title": "WHAT FAITH CAN ACHIEVE",
            "url": "http:\/\/api.sermonindex.net\/SID24947",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:24",
            "topic": "Radio Show",
            "description": "God is building a kingdom for His children out of a very precious material. It is called faith! The following meditation shares what happened when the Sisters from the little Land of Canaan tried to use this material – faith – to build a chapel.",
            "download": "http:\/\/api.sermonindex.net\/SID24947-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "WHAT FAITH CAN ACHIEVE",
            "url": "http:\/\/api.sermonindex.net\/SID22824",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:24",
            "topic": "Radio Show",
            "description": "God is building a kingdom for His children out of a very precious material. It is called faith! This meditation shares what happened when the Sisters from the little Land of Canaan, tried to use this material – faith – to build a chapel.",
            "download": "http:\/\/api.sermonindex.net\/SID22824-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Walking in Forgiveness",
            "url": "http:\/\/api.sermonindex.net\/SID15875",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6:14-15, Mark 11:25",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15875-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                },
                {
                    "book": "Matthew",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "What Is Faith - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID23377",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:24",
            "topic": "Faith",
            "description": "Faith is not a leap into the dark but a leap into the light. Manley Beasley continues his teaching on faith as a necessary element of the Christian Life. And clears up many wrong teachings on faith. And how to trust Jesus and put your faith in Him for your walk with Him.",
            "download": "http:\/\/api.sermonindex.net\/SID23377-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        }
    ]
}