{
    "name": "Mark 2",
    "book": "Mark",
    "chapter": 2,
    "sermons": [
        {
            "title": "(Through The Bible) Mark 2-3",
            "url": "http:\/\/api.sermonindex.net\/SID6513",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2-3",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6513-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Extraordinary Faith",
            "url": "http:\/\/api.sermonindex.net\/SID27520",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2:1-6",
            "topic": "Faith",
            "description": "Pastor Cymbala presents examples of Jesus performing miracles by honoring the faith of others. After hearing this short teaching, we hope you will be driven to pray for the needs of others. John 4:46-51; Mark 2:1-6",
            "download": "http:\/\/api.sermonindex.net\/SID27520-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "For Whom is the Gospel Meant?",
            "url": "http:\/\/api.sermonindex.net\/SID5412",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 1:15,Romans 5:8,Mark 2:17",
            "topic": "",
            "description": "“They that are whole have no need of the physician, but they that are sick: I came not to call the righteous, but sinners to repentance.” -Mark 2:17. “Christ died for the ungodly.”-Romans 5:6. “God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.”-Romans 5:8. “This is a faithful saying, and worthy of all acceptation, that Christ Jesus came into the world to save sinners.”-1 Timothy 1:15. Out of a very great number I have selected the four texts which I have read just to set forth the truth that the mission of our Lord related to sinners. What did Christ come into the world for? For whom did he come? These are questions of the greatest importance, and they are clearly answered in Scripture.",
            "download": "http:\/\/api.sermonindex.net\/SID5412-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "1"
                },
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Plagued by a Guilty Conscience",
            "url": "http:\/\/api.sermonindex.net\/SID12990",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2:2-12",
            "topic": "Guilty Conscience",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12990-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Plan of God",
            "url": "http:\/\/api.sermonindex.net\/SID12255",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2",
            "topic": "Plan Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12255-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "YOUR REDEEMER IS COMING",
            "url": "http:\/\/api.sermonindex.net\/SID22851",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2:17",
            "topic": "Radio Show",
            "description": "God lives and works today! But perhaps you don't feel that way? Do you experience very little of His power and working in your life? Do you experience very little change in your life from year to year - always the same problems and sins. This meditation will share how you can change the outlook for your whole life.",
            "download": "http:\/\/api.sermonindex.net\/SID22851-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        }
    ]
}