{
    "name": "Mark 6",
    "book": "Mark",
    "chapter": 6,
    "sermons": [
        {
            "title": "(John The Baptist Comes To Town) - Part 3 - Sermon That Cost a Preacher His Head",
            "url": "http:\/\/sermonindex.net\/SID16823",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:14-20",
            "topic": "John The Baptist",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16823-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Through The Bible) Mark 6-7",
            "url": "http:\/\/sermonindex.net\/SID6515",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6-7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6515-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "A Shepherd For The Multitude",
            "url": "http:\/\/sermonindex.net\/SID27536",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:30-44",
            "topic": "Shepherd",
            "description": "The feeding of the 5000 shows that Jesus is the caring shepherd, the feeding shepherd, and the sufficient shepherd.",
            "download": "http:\/\/sermonindex.net\/SID27536-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Beginning Of The End",
            "url": "http:\/\/sermonindex.net\/SID3561",
            "size": "7305660",
            "format": "mp3",
            "scripture": "Mark 6",
            "topic": "Miracle",
            "description": "Redpath preaching to students at Prairie Bible Institute and looks at the 6th chapter of Mark's gospel, specifically at the miricale of the feeding of the 5000. He shows how we try to do so much in our own strength, rather than being totally dependant on God. Have we given all to Jesus?",
            "download": "http:\/\/sermonindex.net\/SID3561-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Beginning Of The End by Alan Redpath",
            "url": "http:\/\/sermonindex.net\/SID19590",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6",
            "topic": "Podcast",
            "description": "Redpath preaching to students at Prairie Bible Institute and looks at the 6th chapter of Mark's gospel, specifically at the miricale of the feeding of the 5000. He shows how we try to do so much in our own strength, rather than being totally dependant on God. Have we given all to Jesus?",
            "download": "http:\/\/sermonindex.net\/SID19590-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Casting Down Unbelief",
            "url": "http:\/\/sermonindex.net\/SID15833",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:1-6",
            "topic": "Unbelief",
            "description": "June 17, 2007 - God is full of grace and mercy but cannot work through unbelief. The grief of God's heart is caused by those who are closest to Him and yet still have a heart full of unbelief. Wherever there is unbelief there is hopelessness and a wilderness. God promises that He will BE GOD TO US, we must trust Him and take Him at His word. God wants a simple determined faith that believes and takes hold of His promises.",
            "download": "http:\/\/sermonindex.net\/SID15833-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Christless Pentecost - Part 1",
            "url": "http:\/\/sermonindex.net\/SID0317",
            "size": "6963200",
            "format": "mp3",
            "scripture": "Mark 6:1-6",
            "topic": "Pentecost",
            "description": "EVERY SPIRIT FILLED CHRISTIAN MUST HEAR THIS MESSAGE.  Wilkerson speaks of how the modern day Charismatic and Pentecostal Church has taken Christ out of Pentecost and replaced it with a variety of other things.  Some of those things will be found shocking but before you reject the message….  LISTEN CLOSELY and let the Holy Spirit speak to your heart.",
            "download": "http:\/\/sermonindex.net\/SID0317-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Christless Pentecost - Part 2",
            "url": "http:\/\/sermonindex.net\/SID0318",
            "size": "4332544",
            "format": "mp3",
            "scripture": "Mark 6:1-6",
            "topic": "Pentecost",
            "description": "EVERY SPIRIT FILLED CHRISTIAN MUST HEAR THIS MESSAGE.  Wilkerson speaks of how the modern day Charismatic and Pentecostal Church has taken Christ out of Pentecost and replaced it with a variety of other things.  Some of those things will be found shocking but before you reject the message….  LISTEN CLOSELY and let the Holy Spirit speak to your heart.",
            "download": "http:\/\/sermonindex.net\/SID0318-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Feeding 5000+",
            "url": "http:\/\/sermonindex.net\/SID1446",
            "size": "4069376",
            "format": "mp3",
            "scripture": "Mark 6:31-44",
            "topic": "Miracles",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1446-download",
            "preacher_name": "Norman Meeten",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "God Has a Plan for Trouble Times",
            "url": "http:\/\/sermonindex.net\/SID11818",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 4:35-40, Mark 6:52",
            "topic": "Dark Days",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11818-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                },
                {
                    "book": "Mark",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Help Wanted: A Carpenter",
            "url": "http:\/\/sermonindex.net\/SID13519",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:3",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13519-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "John and Herod",
            "url": "http:\/\/sermonindex.net\/SID13281",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:20",
            "topic": "",
            "description": "JOHN sought no honor among men. It was his delight to say concerning our Lord Jesus, “He must increase, but I must decrease.” Yet, though John sought no honor of men, he had honor; for it is written, “Herod feared John.” Herod was a great monarch, John was but a poor preacher whose garment and diet were of the coarsest kind; but “Herod feared John.” John was more royal than royal Herod. His character made him the true king, and the nominal king trembled before him. A man is not to be estimated according to his rank, but according to his character. The peerage which God recognises is arranged according to a man's justice and holiness. He is first before God and holy angels who is first in obedience; and he reigns and is made a king and a priest whom God hath sanctified and clothed with the fair white linen of a holy life. Be not covetous of worldly honors, for you will have honor enough even from wicked men if your lives are “holiness unto the Lord.” Let it be written on John's tomb, if he needs an epitaph, “Herod feared John.” Only there is one better testimonial which any minister of the gospel might be glad to receive, and it is this: “John did no miracle, but all things which he spake concerning this man were true.”",
            "download": "http:\/\/sermonindex.net\/SID13281-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Licking Fish",
            "url": "http:\/\/sermonindex.net\/SID3200",
            "size": "7852544",
            "format": "mp3",
            "scripture": "Mark 6:30-38,John 6:6,Luke 17:5-6",
            "topic": "",
            "description": "This message is about walking with the Lord in faith. We need to realize we do not have in ourselves the resources to do what we are commanded to do and have faith in God. He is our Resource. He says doubt not in your heart, don't trust in yourself for the kingdom of God is in you but not of you or about you. This will encourage those who like the disciples need their faith increased.",
            "download": "http:\/\/sermonindex.net\/SID3200-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Obedience of Faith - Illustrated by the Disciples on the Stormy Sea",
            "url": "http:\/\/sermonindex.net\/SID11426",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:32-52, Matthew 13:13-33, John 6:1-21",
            "topic": "",
            "description": "Ed Miller shows how futile it is to try to obey God apart from a miracle.  Miller develops three ways disciples can relate to the Lord Jesus as occurs in the account on the stormy sea: Jesus on the mountain, Jesus on the sea, and Jesus on the boat.  \"God always deals with us as we are and where we are in order to make us what He wants us to be and to bring us to the place that He wants us.\"   (NOTE: Pt. 1: \"Obedience of Grace - Illustrated by Noah\")",
            "download": "http:\/\/sermonindex.net\/SID11426-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                },
                {
                    "book": "Matthew",
                    "chapter": "13"
                },
                {
                    "book": "John",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Sin Of Unbelief",
            "url": "http:\/\/sermonindex.net\/SID8786",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 6:1-31",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8786-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "6"
                }
            ]
        }
    ]
}