{
    "name": "1 John 4",
    "book": "1 John",
    "chapter": 4,
    "audio_sermons": [
        {
            "title": "(Godly Home) Part 9 - The Key to Obedience is Blessings",
            "url": "http:\/\/sermonindex.net\/SID7414",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:19; Malachi 4:6",
            "topic": "Godly Home Series",
            "description": "This teaching has \"the most profound wisdom\" in all child training--love.  Brother Denny uncovers the fallacy that spanking solves all the woes in the family when a close, loving, flowing relationship between parent and child is missing.  Our modern society is all about the quick fix, but there is no substitute for time when it comes to developing a genuine foundation of love in the godly home.",
            "download": "http:\/\/sermonindex.net\/SID7414-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(So Great A Salvation) Temptation and Sin",
            "url": "http:\/\/sermonindex.net\/SID16701",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 3:24, 1 John 4:13",
            "topic": "Temptation",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16701-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "1 John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(So Great A Salvation) Witness of the Spirit",
            "url": "http:\/\/sermonindex.net\/SID16705",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 3:24, 1 John 4:13, 1 John 5:10",
            "topic": "Witness Of The Spirit",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16705-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "5"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "1 John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(The Mission and Ministry of the Holy Spirit) The Holy Spirit and the Antichrist",
            "url": "http:\/\/sermonindex.net\/SID4148",
            "size": "11789824",
            "format": "mp3",
            "scripture": "2 Thessalonians 2:1-12,1 John 4:2-3",
            "topic": "Antichrist",
            "description": "Christians need to be aware that they have an adversary and he is determined to corrupt the Bride of Christ in any way he possibly can. He's after the Bride, not because he wants her for himself, but because he would deny Christ his spotless Bride. The sin that floods this world out of the mouth of the enemy is an attempt to corrupt the Bride, to steal her heart away from Christ, and his truth, and defile that which belongs to Jesus.",
            "download": "http:\/\/sermonindex.net\/SID4148-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "2 Thessalonians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 John 4",
            "url": "http:\/\/sermonindex.net\/SID6635",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6635-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Youth Bible School 2007) A Royal Priesthood",
            "url": "http:\/\/sermonindex.net\/SID16423",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 6:19, 1 Corinthians 3:16, 1 John 4:15",
            "topic": "Bible School",
            "description": "What does it really mean to be priests unto God? What is expected, and what are the blessed privileges? Find out more as Brother Dean shares about this powerful metaphor that should affect every area of our lives.",
            "download": "http:\/\/sermonindex.net\/SID16423-download",
            "preacher_name": "Dean Taylor",
            "preacher_image": "",
            "preacher_description": "Dean Taylor ( Â– Present)\r\nListen to freely downloadable audio sermons by the speaker Dean Taylor in mp3 format. Dean Taylor is the general editor of The Remnant of the Charity church movement. He has written a powerful book on non-resistance: A Change of Allegiance. His teachings on suffering and martyrdom are important for the body of Christ and we must learn again from our forefathers and how they suffered for Christ.\r\n\"Every day IÂ’m more convinced that the only thing worth putting my life into is the simple, child-like acceptance of the teachings of Jesus. I believe that Jesus meant what He said. But even more, I believe that JesusÂ’ plan for humanity is actually a great idea! Sometimes the ways and wisdom of Jesus donÂ’t make sense.\" - Dean Taylor",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "27 Principle 23 - Cults, False Gospels, and Division",
            "url": "http:\/\/sermonindex.net\/SID25372",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:1, Matthew 12:25, 1 Corinthians 11:19",
            "topic": "Audio Books",
            "description": "Religious freedom has its benefits for unhindered preaching of the Gospel. These freedoms have allowed some vibrant godly forms of Christianity to grow and prosper and yet these freedoms have sadly also allowed many of the vilest perversions of Christianity to prosper. One cannot begin to calculate the effects of cults, heretical groups and false gospels that have been allowed to prosper under the banner of religious freedom and expression.",
            "download": "http:\/\/sermonindex.net\/SID25372-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "12"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "A FATHER'S LOVE",
            "url": "http:\/\/sermonindex.net\/SID25472",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16",
            "topic": "Radio Show",
            "description": "God lives and works today! And He reveals Himself to us in many different ways! Today's meditation, by Basilea Schlink: A FATHER'S LOVE tells us about one of the special plans He has thought up - to show us His fatherly love!",
            "download": "http:\/\/sermonindex.net\/SID25472-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "A FATHER’S LOVE",
            "url": "http:\/\/sermonindex.net\/SID21467",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16",
            "topic": "Radio Show",
            "description": "God reveals Himself to us in many different ways!  This meditation tells us about one of the special plans He has thought up - to show us His fatherly love!",
            "download": "http:\/\/sermonindex.net\/SID21467-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "A Psalm of Remembrance",
            "url": "http:\/\/sermonindex.net\/SID1718",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16",
            "topic": "",
            "description": "Delivered on Sabbath Morning, May 22nd, 1859. In this wonderful sermon, Spurgeon enlarges upon the \"love that God hath to us,\" which we have \"known and believed.\" He discourses here on \"knowing\" God's love for you, and \"believing\" in it, a two-fold experience. On knowing God's love for us, Spurgeon says that through seeing it in our lives, feeling it through the intimacy of Christ, and lastly through the witness of the Spirit do we come to know it. Then, there are seasons when \"all strength and hope are gone,\" and we \"behold nothing but the uttermost depths of despair.\" Now this person may not know God's love for him, but he can still believe in it. \"To believe it when you do not feel it, is the noblest,\" Spurgeon says. Then he expands on how God's love to us is undeserved, for there \"was nothing in us that could have caused it,\" there was never \"anything in us by nature that he could love.\" Oh, What an amazing thought to ponder on! Furthermore he says, \"the love of God towards us is free, sovereign, undeserved, and springs entirely from the overflowing love of his own heart, and is not caused by anything in us.\"",
            "download": "http:\/\/sermonindex.net\/SID1718-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Antichrist Unmasked",
            "url": "http:\/\/sermonindex.net\/SID12205",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24, 1 John 4:3",
            "topic": "Antichrist",
            "description": "John Rhys Watkins warns of the workings of antichrist now, as evidenced by the proliferation of false prophets in the Church today.  Many miss the powerful activity of the Antichrist today because they are only looking at the future.",
            "download": "http:\/\/sermonindex.net\/SID12205-download",
            "preacher_name": "John Rhys Watkins",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "As He Is So Are We",
            "url": "http:\/\/sermonindex.net\/SID9582",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:17",
            "topic": "Living Like Christ",
            "description": "Speaking on our standing with Christ, \"the Eternal Contemporary\", Vance Havner shows how our lives should be reflections of the life that Christ lived, and is still living today. A good sermon that gives no room for feel-good, prosperity religion. \"Everybody wants medals today, but nobody wants scars.\" Well worth the listen.",
            "download": "http:\/\/sermonindex.net\/SID9582-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "CHOSEN TO LOVE",
            "url": "http:\/\/sermonindex.net\/SID21470",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:11",
            "topic": "Radio Show",
            "description": "Although God is the almighty Creator, who has no need of anyone, He has chosen man to be His hands and feet.  Yes, He has chosen and called us to bring relief to a world that is hungering for love.  Can there be any greater calling than this - to bring others the love that makes people blessed and happy?  How can we do this? This meditation has some answers!",
            "download": "http:\/\/sermonindex.net\/SID21470-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "CHOSEN TO LOVE",
            "url": "http:\/\/sermonindex.net\/SID25475",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:11",
            "topic": "Radio Show",
            "description": "God lives and works today! Although He is the almighty Creator, who has no need of anyone, He has chosen man to be His hands and feet. Yes, He has chosen and called us to bring relief to a world that is hungering for love. Can there be any greater calling than this - to bring others the love that makes people blessed and happy? How can we do this? Listen to today's meditation by Basilea Schlink called, CHOSEN TO LOVE.",
            "download": "http:\/\/sermonindex.net\/SID25475-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Christ Imparts Life",
            "url": "http:\/\/sermonindex.net\/SID11792",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 3:8, 1 John 4:19",
            "topic": "Life",
            "description": "This calls us to exam ourselves. Is Christ in us or are we just an imitation? Nothing about ourselves that shocks us ever shocks God.  Apart from Christ, God expects nothing from us.",
            "download": "http:\/\/sermonindex.net\/SID11792-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "3"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Exclusivity: How can there be just one true religion?",
            "url": "http:\/\/sermonindex.net\/SID22509",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:1-10",
            "topic": "Exclusivity",
            "description": "Religion poses a danger of creating division or intolerance between groups of people. However, the gospel lead us to three things: humble service, reconciling behavior that is neither patronizing nor self-righteous, and a love toward people who hold different beliefs than we do.",
            "download": "http:\/\/sermonindex.net\/SID22509-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Forget Not His Benefits",
            "url": "http:\/\/sermonindex.net\/SID9594",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:17",
            "topic": "Healing",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9594-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "HIS Infinitude - Part 1",
            "url": "http:\/\/sermonindex.net\/SID0329",
            "size": "2005832",
            "format": "mp3",
            "scripture": "1 John 4:12-16, John 17:20-23, Revelation 5:9-11",
            "topic": "Character Of God",
            "description": "The first in three segments of A. W. Tozer’s message, “HIS Infinitude,” this is a contemplation of the unbounded and infinity, which no thing and no one is but the Trinity, God Almighty. The message is firmly grounded in 1 John 4:12-16, John 17:20-23, and Revelation 5:9-11. Part 1 is 16 minutes and 42 seconds in length.",
            "download": "http:\/\/sermonindex.net\/SID0329-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "5"
                },
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "HIS Infinitude - Part 2",
            "url": "http:\/\/sermonindex.net\/SID0330",
            "size": "1668944",
            "format": "mp3",
            "scripture": "1 John 4:12-16, John 17:20-23, Revelation 5:9-11",
            "topic": "Character Of God",
            "description": "The second of three parts to A. W. Tozer’s message, “HIS Infinitude,” looks at perfection, which no thing and no one has but God. Dr. Tozer boldly asserts that “God takes pleasure in himself, and rejoices in his own perfections,” and the pastor cites the beauties of energy, light, and color as evidence of the joy with which God creates. The message is firmly grounded in 1 John 4:12-16, John 17:20-23, and Revelation 5:9-11. Part 2 is 13 minutes and 54 seconds in length.",
            "download": "http:\/\/sermonindex.net\/SID0330-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "5"
                },
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "HIS Infinitude - Part 3",
            "url": "http:\/\/sermonindex.net\/SID0331",
            "size": "2138816",
            "format": "mp3",
            "scripture": "1 John 4:12-16, John 17:20-23, Revelation 5:9-11",
            "topic": "Character Of God",
            "description": "The conclusion of A. W. Tozer’s message, “HIS Infinitude,” is about God’s enthusiasm, and with much enthusiasm does the pastor preach it. When we behold the ebullient wonder of what God has made, “we ought to stop thinking like a scientist and start thinking like a psalmist. … Let us not think anymore of God as being heavy browed and gloomy! I repeat that when God made the heaven and earth, they sang together and all the sons of God shouted for joy! There wasn’t a funeral at the creation of the world; there was an anthem, and all the creature creations sang! And at the incarnation they sang!” There was singing at the resurrection and we’ll sing at the rapture and the consummation, and the song will be “Worthy is the Lamb!” The message is firmly grounded in 1 John 4:12-16, John 17:20-23, and Revelation 5:9-11. Part 3 is 17 minutes and 49 seconds in length.",
            "download": "http:\/\/sermonindex.net\/SID0331-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "5"
                },
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Herein Is Love",
            "url": "http:\/\/sermonindex.net\/SID10188",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:10",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10188-download",
            "preacher_name": "Welcome Detweiler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Is Christ All You Have",
            "url": "http:\/\/sermonindex.net\/SID20858",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:4",
            "topic": "Christ Alone",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20858-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Love Will Soon Cast Out All Fear ",
            "url": "http:\/\/sermonindex.net\/SID21992",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16-19",
            "topic": "Fear",
            "description": "January 9, 2011 - We live in a time that makes it so easy to be fearful. Day after day we are inundated with statistics that bring fear to our heart. In these last days God will do such a profound work in our hearts that fear will lose its power. You might ask the question how will God keep us from giving into the power of fear? We must understand His love brings incredible hope and power into our hearts. God will bring us to the full understanding that He loves us with a perfect love. His love for the genuine believer will give us an incredible security about the future. God's love covers and empowers us to join Him in His redemptive purposes. By faith, receive the incredible love of God and allow His love to flow through you to those around you.",
            "download": "http:\/\/sermonindex.net\/SID21992-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Ministry From 1 John 4",
            "url": "http:\/\/sermonindex.net\/SID12522",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4",
            "topic": "Ministry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12522-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Perfect Love Casteth Out Fear",
            "url": "http:\/\/sermonindex.net\/SID8294",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16-18, Romans 8:15, 2 Timothy 1:7",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8294-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "1"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Superabounding Love",
            "url": "http:\/\/sermonindex.net\/SID27160",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:8",
            "topic": "Love",
            "description": "We all go through hard times and encounter hurtful, hateful people. Every day on the news there are more reports of global tragedy. Letâ€™s face it; itâ€™s a hard cruel world. But Godâ€™s love covers it all! What this old world needs is a good dose of Godâ€™s love. Godâ€™s love can take it. Godâ€™s love can fix it. And Godâ€™s love can enable you to deal with it; whatever it may be.",
            "download": "http:\/\/sermonindex.net\/SID27160-download",
            "preacher_name": "Lewis Gregory",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "THE GREATEST HAPPINESS",
            "url": "http:\/\/sermonindex.net\/SID22857",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:10",
            "topic": "Radio Show",
            "description": "God is a loving God and through Jesus Christ, He offers us all the wealth of His infinite love. But how can we experience His love? This meditation  shares how one person learned this!",
            "download": "http:\/\/sermonindex.net\/SID22857-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Love of God",
            "url": "http:\/\/sermonindex.net\/SID10899",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:7-21",
            "topic": "Love Of God",
            "description": "A brief study of the love of God as was revealed in the life of Jesus as well as the lives of the apostles by the same Spirit.",
            "download": "http:\/\/sermonindex.net\/SID10899-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Witness of the Spirit - Part 1",
            "url": "http:\/\/sermonindex.net\/SID0607",
            "size": "6836224",
            "format": "mp3",
            "scripture": "1 John 3:24, 1 John 4:13, 1 John 5:10",
            "topic": "Witness Of The Spirit",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0607-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "5"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                },
                {
                    "book": "1 John",
                    "chapter": "3"
                }
            ]
        }
    ]
}