{
    "name": "1 Chronicles 13",
    "book": "1 Chronicles",
    "chapter": 13,
    "audio_sermons": [
        {
            "title": "(The Path Of The Ark #5) Touching Christ Through Revelation",
            "url": "http:\/\/sermonindex.net\/SID15377",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 6, 1 Chronicles 13, 15-16",
            "topic": "",
            "description": "The death of Uzzah triggered a spiritual crisis for David and the nation.  The Ark's stay at the house of Obed-Edom with blessing sparked hope in David that God can be pleased when he sought Him by revelation of Scripture.  The second parade that escorted the Ark to Jerusalem was by a transformed David dressed no longer as a king but a humble priest 'outside the camp'.",
            "download": "http:\/\/sermonindex.net\/SID15377-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "6"
                },
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Doing The Right Thing In The Wrong Way",
            "url": "http:\/\/sermonindex.net\/SID9230",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 13:1-13",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9230-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Don't Take Away The Job From Jesus",
            "url": "http:\/\/sermonindex.net\/SID0373",
            "size": "9176576",
            "format": "mp3",
            "scripture": "1 Chronicles 13:1-12, John 14:6",
            "topic": "God's Way",
            "description": "Hans Royer shares the story of the Ark of God being brought back by David.  He highlights the fact that we sometimes try and coupe with our strength and mind until a disaster then we start to rely on God. God's ways must be sought first. It seems the lessons we learn many times is when we fail. We need to come to God on His terms and not our own.",
            "download": "http:\/\/sermonindex.net\/SID0373-download",
            "preacher_name": "Hans Peter Royer",
            "preacher_image": "\/images\/hans_peter_royer.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                },
                {
                    "book": "John",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Great Decisions Of The Bible",
            "url": "http:\/\/sermonindex.net\/SID9597",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 13",
            "topic": "Decision",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9597-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "When Even Prayer Seems Impossible",
            "url": "http:\/\/sermonindex.net\/SID13194",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 26:36-46, 1 Chronicles 13:1-11",
            "topic": "Impossibilities",
            "description": "Have you ever been in a place where you feel something you have to do is impossible? where you try to accomplish what you think is the will of God only to find that your religious zeal is going against the very revealed word of almighty God. This is where Peter, James and John where when Jesus invited them to go into Gethsemane, just a few hours before they had pledged to the Lord that they would not desert Him even though He Himself had told them they would scatter as sheep without a Shepherd.  The power of the Holy Spirit was not yet given and so Peter was moving in the flesh, he didn't see where the resources for maintaining a close walk with Jesus would come from.  But it is through Christ that all things are made possible to us, all the purposes God would have us to accomplish can be met as long as we realize our own weakness and abject need for Christ to live His life through us and that this can only be done by complete reliance on Him for the resources.",
            "download": "http:\/\/sermonindex.net\/SID13194-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                },
                {
                    "book": "Matthew",
                    "chapter": "26"
                }
            ]
        }
    ]
}