{
    "name": "1 Chronicles 28",
    "book": "1 Chronicles",
    "chapter": 28,
    "sermons": [
        {
            "title": "46. What is required in the first commandment?",
            "url": "https:\/\/sermonindex.info\/SID22400",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 28:9, Deuteronomy 26:17",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22400-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "28"
                },
                {
                    "book": "Deuteronomy",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "48. What are we specially taught by these words before me in the first commandment?",
            "url": "https:\/\/sermonindex.info\/SID22402",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 28:9, Psalm 44:20-21",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22402-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "28"
                },
                {
                    "book": "Psalms",
                    "chapter": "44"
                }
            ]
        },
        {
            "title": "Forever Dwelling in the Presence of God",
            "url": "https:\/\/sermonindex.info\/SID4248",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 23:1-6, 1 Chronicles 28:11-12, 2 Corinthians 3:16",
            "topic": "Presence of God",
            "description": "God has a desire to dwell in the midst of his people and he wants us to desire to dwell in his presence as well. We can only faithfully represent him when we truly know him. If you are not actively, honestly seeking God, then you need to get down to business and ask him for the desire and hunger in your heart for him. He will give it to those who are sincere. And they will reap wonderful rewards of joy and peace in their God. We need to actively seek God, wanting his ways and thoughts over our own to become so intimate with him that we know his heart and share it. Then we will love what he loves and hate what he hates. Thinking as he things, walking together in agreement. This is what God wants with each of his children. For those who want a closer walk with the Lord, this is a must hear.",
            "download": "https:\/\/sermonindex.info\/SID4248-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "1 Chronicles",
                    "chapter": "28"
                },
                {
                    "book": "Psalms",
                    "chapter": "23"
                }
            ]
        }
    ]
}