{
    "name": "1 Chronicles 29",
    "book": "1 Chronicles",
    "chapter": 29,
    "sermons": [
        {
            "title": "107. What doth the conclusion of the Lord’s Prayer teach us?",
            "url": "https:\/\/sermonindex.info\/SID22461",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9:18-19, 1 Chronicles 29:11-13",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22461-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "9"
                },
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                }
            ]
        },
        {
            "title": "The Character, Power and Ambition of Christ",
            "url": "https:\/\/sermonindex.info\/SID5760",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29:1, John 16:13-14, Luke 24:46",
            "topic": "",
            "description": "David Smithers focuses on the primary purpose why we have been created--for God's glory and pleasure, expressed by three primary values: the character of Christ, the power of the Spirit of Christ and the ambition of Christ to evangelize the lost.  Smithers surveys the potential pitfalls that happen to Christians in each area and how to keep one's spiritual life on track in those essential things.",
            "download": "https:\/\/sermonindex.info\/SID5760-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "John",
                    "chapter": "16"
                },
                {
                    "book": "Luke",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "The Greatness of God",
            "url": "https:\/\/sermonindex.info\/SID5024",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29:11",
            "topic": "God's Character",
            "description": "“The Greatness of God” is a moving, philosophical message. The eloquent A. W. Tozer fashions vivid imagery to dramatize how infinitely far above all is God, and issues a warning of profound importance: “The god of the average Evangelical church is too small! He’s not the God of Heaven, and the God of Creation, but he’s a homemade, handmade god you can pull down. He’s a stuffed shirt; he’s a Santa Claus; he’s just an old uncle that we want to keep on his good side so that when the time comes he can make us rich…” 1 Chronicles 29:11 addresses the true JHVH: “Thine, O LORD is the greatness, and the power, and the glory, and the victory, and the majesty: for all that is in the heaven and in the earth is thine; thine is the kingdom, O LORD, and thou art exalted as head above all.” The sermon was preached circa 1959, and is 39 minutes, 14 seconds in length.",
            "download": "https:\/\/sermonindex.info\/SID5024-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                }
            ]
        },
        {
            "title": "The Willingness that Precedes the Glory",
            "url": "https:\/\/sermonindex.info\/SID13958",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29",
            "topic": "Willing",
            "description": "February 13, 2005 - We must come to an understanding that God is faithful. We don’t give to God for what we can get from Him, nor do we give when it is burdensome. We are to offer ourselves willingly as God gives us the release to do so. We must have a balanced understanding to what it means to give to the work of God.",
            "download": "https:\/\/sermonindex.info\/SID13958-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                }
            ]
        },
        {
            "title": "Who",
            "url": "https:\/\/sermonindex.info\/SID0247",
            "size": "5267456",
            "format": "mp3",
            "scripture": "Daniel 4,1 Chronicles 29",
            "topic": "Sovereignty Of God",
            "description": "Who holds supreme religious authority today? Who has the  sovereignty to rule? It resides only in God and numerous proofs of this claim are found in Scripture. Dr. Tozer uses just two passages to prove the point - in I Chronicles 29 and Daniel 4.",
            "download": "https:\/\/sermonindex.info\/SID0247-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Worship",
            "url": "https:\/\/sermonindex.info\/SID5209",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29:11, Psalm 32, Jeremiah 32:40",
            "topic": "",
            "description": "Worship is something we give our life, strengthe and heart to and it satisfies. God created human beings to worship and they will worship something. David is a great example of a true worshipper. His life illustrates the value of worshipping God in spirit and in truth",
            "download": "https:\/\/sermonindex.info\/SID5209-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        }
    ]
}