{
    "name": "Jeremiah 12",
    "book": "Jeremiah",
    "chapter": 12,
    "sermons": [
        {
            "title": "Could We Handle Heavy Persecution?",
            "url": "https:\/\/sermonindex.info\/SID24279",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 12:5",
            "topic": "Persecution",
            "description": "Could Christians today handle any real persecution? Do we avoid trials? Excellent challenge for all that name the name of Christ. There truly is a time of great testing coming to the Church in the west can we start to learn how to suffer in the small tests first?",
            "download": "https:\/\/sermonindex.info\/SID24279-download",
            "preacher_name": "Ed Hicks",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "The Justice of God",
            "url": "https:\/\/sermonindex.info\/SID8408",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 12:1",
            "topic": "Justice Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8408-download",
            "preacher_name": "Michael Durham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Through Jordan",
            "url": "https:\/\/sermonindex.info\/SID3659",
            "size": "610816",
            "format": "mp3",
            "scripture": "Jeremiah 12:5",
            "topic": "Classic Recordings",
            "description": "Through Jordan. Recorded by VTM 1910. An address in verse by the late General Booth founder of the Salvation Army. William Booth preaches on one of his favorite verses from the bible. \"Making heaven on earth is our business.\" Christ is a sure help! Hearing these old voices from the past stir our devotion to Christ in the modern day.",
            "download": "https:\/\/sermonindex.info\/SID3659-download",
            "preacher_name": "William Booth",
            "preacher_image": "",
            "preacher_description": "William Booth (1829 - 1912)\r\nListen to freely downloadable audio sermons by the speaker William Booth in mp3 format. Was a British Methodist preacher who founded The Salvation Army and became its first General (1878–1912). The Christian movement with a quasi-military structure and government founded in 1865 has spread from London, England to many parts of the world and is known for being one of the largest distributors of humanitarian aid. Though Booth became a prominent Methodist evangelist, he was unhappy that the annual conference of the denomination kept assigning him to a pastorate, the duties of which he had to neglect to respond to the frequent requests that he do evangelistic campaigns. At the Liverpool conference in 1861, after having spent three years at Gateshead, his request to be freed for evangelism full-time was refused yet again, and Booth resigned from the ministry of the Methodist New Connexion.\r\n\r\nThe name The Salvation Army developed from an incident in May 1878. William Booth was dictating a letter to his secretary George Scott Railton and said, \"We are a volunteer army.\" Bramwell Booth heard his father and said, \"Volunteer, I'm no volunteer, I'm a regular!\" Railton was instructed to cross out the word \"volunteer\" and substitute the word \"salvation\". The Salvation Army was modelled after the military, with its own flag (or colours) and its own music, often with Christian words to popular and folkloric tunes sung in the pubs. Booth and the other soldiers in \"God's Army\" would wear the Army's own uniform, 'putting on the armour,' for meetings and ministry work. He became the \"General\" and his other ministers were given appropriate ranks as \"officers\". Other members became \"soldiers\".",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "To Whom Shall I Give Warning?",
            "url": "https:\/\/sermonindex.info\/SID13887",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 6:10, Jeremiah 12-14",
            "topic": "",
            "description": "July 31, 2005. There is a polluted gospel the is being preached from pulpits that is contaminating the church of Jesus Christ. It is a gospel of humanistic materialism that is infused with the spirit of covetousness. A covetous gospel that lusts after bigger cars, houses and bigger bank accounts. Everything Jesus taught lashes out against this gospel. The true gospel of Jesus Christ is burdened for the widows, the orphans and the hurting around the world",
            "download": "https:\/\/sermonindex.info\/SID13887-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "6"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Why Did The Wicked Prosper?",
            "url": "https:\/\/sermonindex.info\/SID8752",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 12:1-5",
            "topic": "Wickedness",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8752-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        }
    ]
}