{
    "name": "Jeremiah 13",
    "book": "Jeremiah",
    "chapter": 13,
    "sermons": [
        {
            "title": "Getting Used to the Dark",
            "url": "http:\/\/api.sermonindex.net\/SID0205",
            "size": "3596288",
            "format": "mp3",
            "scripture": "Isaiah 60:2, Jeremiah 13:16",
            "topic": "Apostasy",
            "description": "This sermon shows how many Christians are getting used to the apostasy and declension in Christianity in our day. Havner calls us afresh to see the situation how God sees it and to act as light's in a perverse and wicked generation. \"We're living in the closing chapter of an age dominated by the prince and powers of darkness. And men do love darkness rather than light. I want to warn you tonight the best way I know how. Of a slow and subtle and sinister brainwashing process.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0205-download",
            "speaker_name": "Vance Havner",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "13"
                },
                {
                    "book": "Isaiah",
                    "chapter": "60"
                }
            ]
        },
        {
            "title": "The Incredible Signs That Follow Those Who Believe",
            "url": "http:\/\/api.sermonindex.net\/SID13924",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 13:12, 1 Corinthians 10:11, 2 Timothy 3:16",
            "topic": "Belief",
            "description": "June 11, 2006 – This is a message for those who think they have failed God and made a mess out of their life. God has intertwined His life with His church and it doesn’t matter how far we have fallen we are never out of God's reach. Those who are in Christ will not be overcome by the enemy. The serpent will not take us but rather we will take him up and whatever death the enemy has caused us to swallow it wiil not harm us. God will fill us with His power and His life will overflow with healing through us onto a sin sick world. These are the signs that will follow those who choose to believe.",
            "download": "http:\/\/api.sermonindex.net\/SID13924-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "3"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "10"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "13"
                }
            ]
        }
    ]
}