{
    "name": "Jeremiah 2",
    "book": "Jeremiah",
    "chapter": 2,
    "sermons": [
        {
            "title": "(Revival Forum 89) Leonard Ravenhill",
            "url": "https:\/\/sermonindex.info\/SID9059",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:13, John 17:3",
            "topic": "Revival",
            "description": "This recording from a revival conference called: \"Revival Forum 89\" Ravenhill was the keynote speaker and this recording is an interview where Ravenhill at a old age shares his burning heart for revival. This recording has many vital and important points that the modern day church needs to not only understand but practice. Revival is the only solution for america, for the world.",
            "download": "https:\/\/sermonindex.info\/SID9059-download",
            "preacher_name": "Revival Forum 89",
            "preacher_image": "",
            "preacher_description": "Revival Forum 89 ( - )\r\nListen to freely downloadable audio sermons by the Revival Forum speakers in mp3 format.  What was Revival Forum 89? It was a group of meetings with some of the leading revivalists alive at the time. Men like Leonard Ravenhill, Bill McCloud, Josef Tson, and others. These are men who influenced my life through their preaching and writing and here they were all in one place. They had individual sessions where they talked about revival and were interviewed in order to give their testimony of faith in Christ. And there was a panel discussion where as a group they discussed true revival and the church in America.\r\nThis is a very powerful series of meetings and testimonies of genuine biblical revival. It would do well for many pastors and God's servants to watch these videos and hear the audio sermons of then men from the Past.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "America's Greatest Need",
            "url": "https:\/\/sermonindex.info\/SID15879",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2",
            "topic": "",
            "description": "As we celebrate our country's birthday, many Americans, as grateful as we are to live in this land of freedom and opportunity, are aware that in some critical areas, America seems to have lost her way. In fact, Christians can see some striking parallels between modern America and Israel and Judah before they were taken captive centuries ago. Perhaps no passage of Scripture speaks to our nation more directly than Jeremiah 2. It is a powerful warning  of impending judgement, and a call to national repentance.",
            "download": "https:\/\/sermonindex.info\/SID15879-download",
            "preacher_name": "Russ Sukhia",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Broken Cisterns",
            "url": "https:\/\/sermonindex.info\/SID8757",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:13",
            "topic": "Christian Life",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8757-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Defiling The Inheritance",
            "url": "https:\/\/sermonindex.info\/SID15394",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:7",
            "topic": "Inheritance",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15394-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Guide Posts and Warning Signs",
            "url": "https:\/\/sermonindex.info\/SID12982",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 2:22, Jeremiah 2:5, 2 Corinthians 10:5",
            "topic": "Testimony",
            "description": "You will be blessed listening as Paul Washer shares from what he calls his \"life verses\". This is a rich sermon full of truth that can be summed up with the message that knowledge of Christ is more important than anything.",
            "download": "https:\/\/sermonindex.info\/SID12982-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "10"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Isaiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Jeremiah",
            "url": "https:\/\/sermonindex.info\/SID0354",
            "size": "9936896",
            "format": "mp3",
            "scripture": "Matthew 16:13-16, Jeremiah 2:4-19",
            "topic": "Jeremiah",
            "description": "This is the character correlation between our Lord and the prophet, specifically in their love for the lost expounded with the prophet's weeping. in this message, there's a beautiful and majestic description of what kind of a relationship that Sarah Edwards had with our Lord when she was just 11, way way before she got married to Jonathan.",
            "download": "https:\/\/sermonindex.info\/SID0354-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Matthew",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "National Religious Apostasy (4)",
            "url": "https:\/\/sermonindex.info\/SID16050",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Jeremiah 25:3-6, Jeremiah 2:10-13",
            "topic": "Apostasy",
            "description": "\"Righteousness exalts a nation; but sin is a reproach to any people.\" Proverbs 14:34. As a nation we have in large scale rejected the true and living God and have abandoned our godly heritage and the special light that came through mighty preachers in the past and formerly pious church denominations and have gone headlong into decadent humanism, deceptive liberalism, demonic occultism and a weak, man-centered, flesh-pleasing, fad-conforming evangelicalism. By doing so we have incurred a dreadful accountability as a nation before God. As a nation we must repent and plead for God to have mercy upon us.",
            "download": "https:\/\/sermonindex.info\/SID16050-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "25"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Revival Forum Interview",
            "url": "https:\/\/sermonindex.info\/SID25114",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:13, Psalm 85:6",
            "topic": "Revival",
            "description": "This is a very jarring and powerful interview of Leonard Ravenhill. It occurred at a Life Action event in Canada with a group of pastors. Ravenhill shares his burden for revival in North America and clearly show the problem of lack of prayer, lack of burden for the lost and a loss of the conception of the majesty of God.",
            "download": "https:\/\/sermonindex.info\/SID25114-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "When Revival Bypasses The Established Church",
            "url": "https:\/\/sermonindex.info\/SID25505",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:1-13",
            "topic": "Established Church",
            "description": "Brother EA shares his heart towards revival in the nation of America and the sad state of the formal established denominational churches. He shows how God works outside the box in a New Thing and that God always raises up preachers to minister His truth whether or not they are accepted by the masses. This is an important message to bring many to repentance and to support and proclaim the gospel in its purity and power in our day.",
            "download": "https:\/\/sermonindex.info\/SID25505-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        }
    ]
}