{
    "name": "Jeremiah 25",
    "book": "Jeremiah",
    "chapter": 25,
    "sermons": [
        {
            "title": "(Daniel) Daniel the Intercessor",
            "url": "http:\/\/api.sermonindex.net\/SID10749",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9:1-19, Jeremiah 25:11-13, Jeremiah 29:10",
            "topic": "Intercession",
            "description": "Daniel 9 is one of the most incredible prophecies in the whole of the Bible because of it's accuracy in fulfillment, Daniel in this passge is reading his Bible, specifically Jeremiah, he reads about how the people of Israel will go into captivity for 70 years and realises he is living in the fullfilment of that prophecy, Daniel believed the Bible literally and thus the 70 years he read about in the book of Jeremiah he believed was 70 years in reality.  Daniel is moved by what he reads and begins to intercede for the his people, he prays that the Lord would take this 70 years from the first move into captivity in 605BC and not 597BC.  Daniel was the 'chief of staff' for Babylon and still had time to pray in this incredible way, he set his face to seek the Lord and begn to repent for the sins of Israel and he begged the Lord to turn away His anger from His people and for the sake of His own righteousness restore His people.  The Lord answered Daniel's prayer.",
            "download": "http:\/\/api.sermonindex.net\/SID10749-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "29"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "25"
                },
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "National Religious Apostasy (4)",
            "url": "http:\/\/api.sermonindex.net\/SID16050",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 14:34, Jeremiah 25:3-6, Jeremiah 2:10-13",
            "topic": "Apostasy",
            "description": "\"Righteousness exalts a nation; but sin is a reproach to any people.\" Proverbs 14:34. As a nation we have in large scale rejected the true and living God and have abandoned our godly heritage and the special light that came through mighty preachers in the past and formerly pious church denominations and have gone headlong into decadent humanism, deceptive liberalism, demonic occultism and a weak, man-centered, flesh-pleasing, fad-conforming evangelicalism. By doing so we have incurred a dreadful accountability as a nation before God. As a nation we must repent and plead for God to have mercy upon us.",
            "download": "http:\/\/api.sermonindex.net\/SID16050-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "25"
                },
                {
                    "book": "Proverbs",
                    "chapter": "14"
                }
            ]
        }
    ]
}