{
    "name": "Jeremiah 32",
    "book": "Jeremiah",
    "chapter": 32,
    "sermons": [
        {
            "title": "(Missions Conference Shoals) - Part 1",
            "url": "https:\/\/sermonindex.info\/SID13241",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 31:31-34, Jeremiah 32:38-41",
            "topic": "New Covenant",
            "description": "In this sermon, Paul takes use through some of the New Covenant promises which are found in the Old Testament. While going through verses in Jeremiah, Paul leads us to examine ourselves in light of His Word. Are the laws of God written on our hearts? Are we truly living as God's people?",
            "download": "https:\/\/sermonindex.info\/SID13241-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "Continue In Sin",
            "url": "https:\/\/sermonindex.info\/SID0249",
            "size": "7560000",
            "format": "mp3",
            "scripture": "Romans 6:1-2, Jeremiah 32:39-40, Psalms 89:28-34",
            "topic": "Continuing In Sin",
            "description": "Why do believers continue in sin?  Year after year after year they continue in some sort of sin and they never come into the fullness of the Covenant blessing of God.  Often times it may well just be one area that remains but nonetheless folks continue in that sin.  Wilkerson preaches a very personal message here and he shares his heart and shows his own weakness as an example.  The consequences for a Christian continuing in sin are sobering, but he gave us what we needed to overcome sin, if we want to. For those who are sick of their sin, and hate it, and cry out to God, there is wonderful news. He will empower you, and he wants to put his fear in your heart so you will not turn away from him, and then he can take you into the fullness of the new covenant. Powerful preaching, with a gentle compassion for those who are struggling.",
            "download": "https:\/\/sermonindex.info\/SID0249-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Is Anything Too Hard for the Lord?",
            "url": "https:\/\/sermonindex.info\/SID11523",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 32:26,27",
            "topic": "",
            "description": "DELIVERED ON LORD'S-DAY MORNING, APRIL 22ND, 1888, BY C. H. SPURGEON, AT THE METROPOLITAN TABERNACLE, NEWINGTON. “Then came the word of the Lord unto Jeremiah, saying, Behold, I am the Lord, the God of all flesh: is there anything too hard for me?”-Jeremiah 32:26, 27. THIS method of questioning the person to be instructed is known to teachers as the Socratic method. Socrates was wont, not so much to state a fact, as to ask a question and draw out thoughts from those whom he taught. His method had long before been used by a far greater teacher. Putting questions is Jehovah's frequent method of instruction. When the Lord answered Job out of the whirlwind it was with a series of questions. “Knowest thou the ordinances of heaven? canst thou set the dominion thereof in the earth? Canst thou lift up thy voice to the clouds, that abundance of waters may cover thee? Canst thou send lightnings, that they may go, and say unto thee, Here we are?” and so forth. Questions from the Lord are very often the strongest affirmations. He would have us perceive their absolute certainty. They are put in this particular form because he would have us think over his great thought, and confirm it by our own reflections. The Lord shines upon us in the question, and our answer to it is the reflection of his light. The Infallible One challenges a contradiction, or even a doubt. “Is anything too hard for me?” is the strongest way of saying that nothing can be too hard for him...",
            "download": "https:\/\/sermonindex.info\/SID11523-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "New Life Baptist Church - Part 4",
            "url": "https:\/\/sermonindex.info\/SID13236",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 36:22-28, Jeremiah 31:31-34, Jeremiah 32:37-41",
            "topic": "",
            "description": "By taking us through the prophecies in the Old Testament, we see the riches of the New Covenant promises that are found there. To counter some false teachings, Paul teaches us how it is the great \"I AM\" who is sovereign in a believer's life, who completes the work towards conforming us to the image of His Son. It is not by our own merit or choices, but it is by His divine initiative and His divine fulfillment.",
            "download": "https:\/\/sermonindex.info\/SID13236-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "36"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "31"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "The Redemptive Judgements of God",
            "url": "https:\/\/sermonindex.info\/SID1901",
            "size": "6678528",
            "format": "mp3",
            "scripture": "Jeremiah 32",
            "topic": "",
            "description": "Out of Jeremiah 32, Wilkerson preaches a message on the coming judgments of God.  This is another post 9\/11 sermon and Wilkerson again preaches about the warnings to both the nation and the church.  We are not to be surprised at what is happening nor are we to be alarmed.  Understand the time and understand what it is that we ought to be doing.  But also understand that judgment will first come to the house of God.",
            "download": "https:\/\/sermonindex.info\/SID1901-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Worship",
            "url": "https:\/\/sermonindex.info\/SID5209",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29:11, Psalm 32, Jeremiah 32:40",
            "topic": "",
            "description": "Worship is something we give our life, strengthe and heart to and it satisfies. God created human beings to worship and they will worship something. David is a great example of a true worshipper. His life illustrates the value of worshipping God in spirit and in truth",
            "download": "https:\/\/sermonindex.info\/SID5209-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        }
    ]
}