{
    "name": "Jeremiah 33",
    "book": "Jeremiah",
    "chapter": 33,
    "sermons": [
        {
            "title": "Invitation To Prayer",
            "url": "https:\/\/sermonindex.info\/SID9008",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 33:3",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9008-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "Ministry to the Lord",
            "url": "https:\/\/sermonindex.info\/SID3983",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 33:19-22",
            "topic": "",
            "description": "Never before have we needed men of God in the pulpit as in these days. We've outsinned Sodom and Gomorrah 25 years ago already. God said, if you could break my covenant with the night and day, then my covenant with David can be broken. v15: The first part has been fulfilled in Jesus. In the second part, God promises that He will never lack ministers (Levites) to minister before Him. In spite of all those who are quitting the ministry, God is still raising up His Levitical Priesthood. There are two streams, 2 concurrent types of priesthoods. Ezekiel prophesied that in the last days there'll be two kinds of congregations, preachers and ministers. There will be those who minister unto God. In Ez 40-44, Ezekiel has the vision of a great temple that was to be built. That is not a physical temple, because it stretches over lands and seas and mountains. He is talking about the church of the last days. He sees the church as having no boundaries. And the glory of the Lord is coming down on that house\/temple. But Ezekiel saw a strange, horrifying sight. Despite the glory, a rebellious priesthood came forth. The Levitical priesthood were to guard and cleanse the gates of the tabernacle. Nothing evil was to be allowed into the temple.",
            "download": "https:\/\/sermonindex.info\/SID3983-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "Ministry to the Lord (Kwasizabantu)",
            "url": "https:\/\/sermonindex.info\/SID14301",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 33:19-22",
            "topic": "",
            "description": "Never before have we needed men of God in the pulpit as in these days. We've outsinned Sodom and Gomorrah 25 years ago already. God said, if you could break my covenant with the night and day, then my covenant with David can be broken. v15: The first part has been fulfilled in Jesus. In the second part, God promises that He will never lack ministers (Levites) to minister before Him. In spite of all those who are quitting the ministry, God is still raising up His Levitical Priesthood. There are two streams, 2 concurrent types of priesthoods. Ezekiel prophesied that in the last days there'll be two kinds of congregations, preachers and ministers. There will be those who minister unto God. In Ez 40-44, Ezekiel has the vision of a great temple that was to be built. That is not a physical temple, because it stretches over lands and seas and mountains. He is talking about the church of the last days. He sees the church as having no boundaries. And the glory of the Lord is coming down on that house\/temple. But Ezekiel saw a strange, horrifying sight. Despite the glory, a rebellious priesthood came forth. The Levitical priesthood were to guard and cleanse the gates of the tabernacle. Nothing evil was to be allowed into the temple.",
            "download": "https:\/\/sermonindex.info\/SID14301-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "The Ministry of Prayer",
            "url": "https:\/\/sermonindex.info\/SID3532",
            "size": "0",
            "format": "mp3",
            "scripture": "John 11:41-42,Acts 6:4,Jeremiah 33:3",
            "topic": "",
            "description": "'Is it not true that when we bow the knee to call upon the Lord,' says Heugel, ' our capacity for good is multiplied a hundred thousand times?'  Heugel believes that intercession is the greatest of all ministries, backing up his assertion with Scripture and example, both historical and personal.  He recounted the flame of intercession of the Moravians from which dawned the great movement of worldwide missions and strengthened his position upon great answers to prayer in the lives of Hudson Taylor, C. T. Studd and others.  (Part 1: The Laws of Prayer \/ Part 2: The Ministry of Prayer \/ Part 3: Great Prayers of History)",
            "download": "https:\/\/sermonindex.info\/SID3532-download",
            "preacher_name": "F.J. Huegel",
            "preacher_image": "\/images\/fj_huegel.gif",
            "preacher_description": "F. J. Huegel (1889 - 1971)\r\nListen to freely downloadable audio sermons by the speaker F. J. Huegel in mp3 format.  Was a chaplain in WWI and a missionary in Mexico. He wrote many books that are worth reading. Huegel's writings on the deeper aspects of Christ's work on Calvary and it's implications for the believer have blessed multitudes of Christians. This biography is written by his son, who states in his preface that he has deliberately tried not to present his father's life through rose colored glasses but rather give a true and accurate account--warts and all. Those who have benefited from Huegel's other writings will welcome this unique chance to get a look at the man behind the books. Highly recommended!\r\nHe is the author of the book: \"Bone of His Bone\": One of the most basic principles for a successful life as a Christian is that the individual must experience full dependency on Jesus--allow Christ to become part of him. In effect he must become Bone of His Bone. Don't miss these freshly edited studies on the indwelling Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "11"
                },
                {
                    "book": "Acts",
                    "chapter": "6"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "When the Call to Pray Becomes More Than Just a Cliché",
            "url": "https:\/\/sermonindex.info\/SID18609",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 33",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18609-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "33"
                }
            ]
        }
    ]
}