{
    "name": "Jeremiah 9",
    "book": "Jeremiah",
    "chapter": 9,
    "sermons": [
        {
            "title": "A Baptism of Tears for Israel",
            "url": "http:\/\/api.sermonindex.net\/SID9259",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 9:1, Jeremiah 9:1",
            "topic": "Israel",
            "description": "Michael Brown delivers a piercing and burdening message calling the body of Christ to take the eternal reality of the unsaved seriously and allow God to grieve us for the salvation of the lost. By emphasizing Paul’s burden and heart wrenching desire for Israel, Dr. Brown shares both the closeness and hardness of Israel and reveals the need for a broken heart over all men.",
            "download": "http:\/\/api.sermonindex.net\/SID9259-download",
            "speaker_name": "Michael L. Brown",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "9"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "A Time To Weep",
            "url": "http:\/\/api.sermonindex.net\/SID15802",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 9:1",
            "topic": "",
            "description": "It is no sign of weakness when a man weeps for sin, it shows that he has strength of mind; yes more, that he has strength imparted by God, which enables him to forswear his lusts and overcome his passions, and to turn unto God with full purpose of heart. And there are other tears, too, which are the evidences not of weakness, but of might — the tears of tender sympathy are the children of strong affection, and they are strong like their parents. He that loves much, must weep much. The unfeeling heart, the unloving spirit, may pass from earth's portal to its utmost bound almost without a sigh except for itself; but he that loves, has dug as many wells of tears as he has chosen objects of affection; for by as many as our friends are multiplied, by so many must our griefs be multiplied too, if we have love enough to share in their griefs and to bear their burden for them. It needs a mighty prophet like Jeremiah to weep as mightily as he. May we have more weeping in our churches.",
            "download": "http:\/\/api.sermonindex.net\/SID15802-download",
            "speaker_name": "Jason Robertson",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "How Far Are You Prepared to Trust God",
            "url": "http:\/\/api.sermonindex.net\/SID3665",
            "size": "13730304",
            "format": "mp3",
            "scripture": "Malachi 1:7-8, Proverbs 3:5-6, Jeremiah 9:24",
            "topic": "Trust",
            "description": "Too many misunderstand the freeness of GodÂ’s grace and mistakenly think that the cost of following God is therefore free.  But when you embark on this journey you will find that either you really trust God or you merely say that you trust God.  How far are you willing to go?",
            "download": "http:\/\/api.sermonindex.net\/SID3665-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                },
                {
                    "book": "Proverbs",
                    "chapter": "3"
                },
                {
                    "book": "Malachi",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Jesus Christ My Glory",
            "url": "http:\/\/api.sermonindex.net\/SID8753",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 9:2",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8753-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Knowledge of God",
            "url": "http:\/\/api.sermonindex.net\/SID3104",
            "size": "26664545",
            "format": "mp3",
            "scripture": "Jeremiah 9:24",
            "topic": "Knowledge of God",
            "description": "The true knowledge of God is everything, and God is known primarily in His covenant relationship to Israel and His acts toward her. Art contends that this knowledge is different from any kind of speculative pondering on the character traits of God.",
            "download": "http:\/\/api.sermonindex.net\/SID3104-download",
            "speaker_name": "Art Katz",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Knowledge of God",
            "url": "http:\/\/api.sermonindex.net\/SID16194",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 9:23-24",
            "topic": "Knowledge Of God",
            "description": "Paul Washer begins this conference address by saying that the most frightening thing he knows is to teach a group of people on the attributes of God. As Jeremiah says, it is “Thus saith THE LORD” - not men - regarding what is essential in life; and what is essential is to know and to understand God. It is what we were created for. This is not a question of holding sound doctrine and orthodox truth. I want more than truth, he pleads; I want the REALITY of those truths in my life; deeply rooted, and springing forth into fruit unto the glory of God. This issue is not about doctrine, it is about the person of God; and in order to grow in sanctification, in zeal, in heart-felt emotion and love, we MUST have this personal knowledge of God; it is the source and motivation for all these things. The purpose of all truth is to bring us to the feet of Christ; and from there to the feet of everyone else, as servants; our boasting will then be not in what we know, but rather in what God is.  (26 minutes).",
            "download": "http:\/\/api.sermonindex.net\/SID16194-download",
            "speaker_name": "Paul Washer",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Power Of Weeping",
            "url": "http:\/\/api.sermonindex.net\/SID17327",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 9:1",
            "topic": "",
            "description": "Michael Youssef shares this powerful sermon at the 2007 National Broadcasters Association. There is a deep burden and weeping over the state of America and Evangelism in this message. Oh that we would hear it all with \"ears that can hear\" what the Spirit is saying to the Churches. This is a urgent appeal from the heart of God over the declension and need of a genuine biblical revival in our generation.",
            "download": "http:\/\/api.sermonindex.net\/SID17327-download",
            "speaker_name": "Michael Youssef",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Power Of Weeping by Michael Youssef",
            "url": "http:\/\/api.sermonindex.net\/SID19377",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 9:1",
            "topic": "Podcast",
            "description": "Michael Youssef shares this powerful sermon at the 2007 National Broadcasters Association. There is a deep burden and weeping over the state of America and Evangelism in this message. Oh that we would hear it all with \"ears that can hear\" what the Spirit is saying to the Churches. This is a urgent appeal from the heart of God over the declension and need of a genuine biblical revival in our generation.",
            "download": "http:\/\/api.sermonindex.net\/SID19377-download",
            "speaker_name": "SermonIndex.net Classics Podcast",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "9"
                }
            ]
        }
    ]
}