{
    "name": "Ezra 7",
    "book": "Ezra",
    "chapter": 7,
    "audio_sermons": [
        {
            "title": "Men of Another Sort",
            "url": "http:\/\/sermonindex.net\/SID1025",
            "size": "5605376",
            "format": "mp3",
            "scripture": "Ezra 7:10, Psalm 119:11, Ezra 8:31",
            "topic": "Men Of God",
            "description": "Wilkerson speaks of the great men of the Bible.  Men who had a passion and true zeal for God.  Men that God has given to us as examples.  These men were able to do great exploits and they had the heart of God.  Men who were able to give a message with such an anointing that they would bring a whole nation to their knees in repentance.",
            "download": "http:\/\/sermonindex.net\/SID1025-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ezra",
                    "chapter": "8"
                },
                {
                    "book": "Ezra",
                    "chapter": "7"
                },
                {
                    "book": "Psalms",
                    "chapter": "119"
                }
            ]
        }
    ]
}