{
    "name": "2 Kings 3",
    "book": "2 Kings",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "(2 Kings) How to Prepare for Blessing",
            "url": "http:\/\/sermonindex.net\/SID10730",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 3-4",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10730-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "A Word From The Lord",
            "url": "http:\/\/sermonindex.net\/SID27898",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 3:9-20",
            "topic": "Voice Of God",
            "description": "At a Tuesday Brooklyn Tabernacle prayer meeting, Pastor Cymbala uses a text from the Old Testament as a starting point on hearing God speak. 2 Kings 3: 9-20 (NIV)",
            "download": "http:\/\/sermonindex.net\/SID27898-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "And the Country was Filled with Water",
            "url": "http:\/\/sermonindex.net\/SID0559",
            "size": "12909568",
            "format": "mp3",
            "scripture": "2 Kings 3:10-20",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Duncan Campbell preached this strong word on the baptism in the Holy Spirit at a camp meeting in America in the 1960's.  \"You can't work up revival, but you can do the digging\"--a breaking through the dry crust of our hearts and removing the 'stones', anything that would hinder a consecrated life to God.  The sermon is alive with vivid revival accounts, as with its sister sermon, \"Lacking One Thing\".",
            "download": "http:\/\/sermonindex.net\/SID0559-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Better Late Than Never",
            "url": "http:\/\/sermonindex.net\/SID24071",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 3:9-19",
            "topic": "Consequences",
            "description": "There's a consequence for every decision. Let's explore what happens when we hold off trusting in Jesus. 2Kings 3:9-19",
            "download": "http:\/\/sermonindex.net\/SID24071-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Is the Water In Your Well Drinkable",
            "url": "http:\/\/sermonindex.net\/SID3197",
            "size": "8103936",
            "format": "mp3",
            "scripture": "Isaiah 12:3,2 Kings 3:19",
            "topic": "",
            "description": "Believers have two kinds of water-the sweet water of Christ, and the bitter water of the old nature. We are still commanded to stop up the wells of the enemy and old nature, and by asking the Holy Spirit to show us each one and lead us through the enemy territory in our own minds, to stop up each one. God will give you strength to not make peace with these things he will lead you to each area where the enemy has gained a foothold and sends out streams of lies to hinder you or lead you differently than the Lord wants you to go and take authority over them and stop them up. Wonderful message of deliverance from torment of the mind.",
            "download": "http:\/\/sermonindex.net\/SID3197-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "12"
                },
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Lacking One Thing",
            "url": "http:\/\/sermonindex.net\/SID0357",
            "size": "12529152",
            "format": "mp3",
            "scripture": "2 Kings 3:14-20",
            "topic": "Consecration",
            "description": "Campbell extracts principles for revival from 2 Kings 3 where the lack of water refers to the one thing that would ensure victory: the power of the Holy Ghost.  The three main points were 1) the futility of mere human effort, 2) faith that wins through, and 3) the fulness that met the need.  Brother Duncan powerfully illustrates a spirit of inquiry and an acknowledgement of need in the Arnol revival \"when the farmhouse shook\".  \"The digging may involve a cost,\" he challenged, a self-denial of forgetting oneself \"in a desire to prepare the way for God.\"",
            "download": "http:\/\/sermonindex.net\/SID0357-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Well and Ditches",
            "url": "http:\/\/sermonindex.net\/SID24876",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 3:1-20",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24876-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        }
    ]
}