{
    "name": "2 Kings 5",
    "book": "2 Kings",
    "chapter": 5,
    "audio_sermons": [
        {
            "title": "(2 Kings) Two Lepers and the Blind Men",
            "url": "http:\/\/sermonindex.net\/SID10731",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5-6",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10731-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Through The Bible) 2 Kings 5-8",
            "url": "http:\/\/sermonindex.net\/SID6355",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5-8",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6355-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "A Serious Remonstrance",
            "url": "http:\/\/sermonindex.net\/SID13279",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5:13",
            "topic": "",
            "description": "I am somewhat myself in the position of Elijah, when Naaman, the Syrian, came dashing up with his horses and with his chariot, and stood at the door of the house of the prophet. There are before me in this house, I fear, many who are spiritually diseased. Your motive for coming up to this assembly should be to hear the gospel, and to discover the remedy by which your spiritual disease may be removed. But what, let me ask, are really the thoughts that occupy your minds? I can suppose that you are looking for different things from me. One, perhaps, imagines that something will be said odd and strange that shall provoke a smile: another imagines that I shall labor to make some display of elocution and speak tender words softly, like flakes of featherd snow melting as they fall, and so draw forth the silent, graceful tear. When both of these are alike disappointed, you will probably say to yourselves, “Well, it is only the old story we used to hear when we went to the Sunday-school; it is just what we have listened to Sunday after Sunday, till we turn away surfeited with it. It is, believe in Jesus Christ and live; there is nothing fresh or new to stimulate our intellect; nothing original to whet our curiosity...",
            "download": "http:\/\/sermonindex.net\/SID13279-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Brokenness - Part 1",
            "url": "http:\/\/sermonindex.net\/SID1909",
            "size": "31976448",
            "format": "mp3",
            "scripture": "Isaiah 57:15, Matthew 26:26, 2 Kings 5",
            "topic": "",
            "description": "David Smithers preached \"Brokenness, The Road to Revival\" (Part 1 and 2) to identify, \"What is it that continues to postpone a visitation of the Holy Spirit?\"  Brokenness is a real recognition of our own spiritual poverty and is that which releases the presence and blessings of God.  Smithers forcefully presents some of the roots and routes to a hard heart as well as the steps needed to return to a broken heart.",
            "download": "http:\/\/sermonindex.net\/SID1909-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "57"
                },
                {
                    "book": "Matthew",
                    "chapter": "26"
                },
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Don't Miss Your Miracle",
            "url": "http:\/\/sermonindex.net\/SID9598",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5, John 9:7",
            "topic": "Miracles",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9598-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "9"
                },
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Miracles Of Elisha, Message 4",
            "url": "http:\/\/sermonindex.net\/SID11424",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5:1-8:6",
            "topic": "",
            "description": "Ed Miller examines four characteristics of the message of the man that looks like Jesus: 1) pure grace, 2) dependence upon God's power, 3) light\/revelation, and 4) the absolute certainty of God's purposes.  Brother Ed squeezes out a number of precious truths from the accounts of the cleansing of Naaman the leper, the floating axe head, the opening the eyes of the servant, and the restoration of the widow's inheritance with a particular view of Elisha and what that means for us.",
            "download": "http:\/\/sermonindex.net\/SID11424-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Little Maid",
            "url": "http:\/\/sermonindex.net\/SID8039",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8039-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Wash & Be Clean",
            "url": "http:\/\/sermonindex.net\/SID9223",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5",
            "topic": "Purity",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9223-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Week Of Meetings 1986-05",
            "url": "http:\/\/sermonindex.net\/SID10387",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 5",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10387-download",
            "preacher_name": "Stan Ford",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "5"
                }
            ]
        }
    ]
}