{
    "name": "2 Kings 7",
    "book": "2 Kings",
    "chapter": 7,
    "sermons": [
        {
            "title": "(2 Kings) Outcasts and Kings",
            "url": "http:\/\/api.sermonindex.net\/SID10732",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 7-8",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10732-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Don't Keep It To Yourself",
            "url": "http:\/\/api.sermonindex.net\/SID25681",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 7:3-9",
            "topic": "Christian Life",
            "description": "In the church today, there is very little evangelism. Pastor Cymbala encourages us not to keep the Good News of Jesus Christ to ourselves. 2 Kings 7:3-9",
            "download": "http:\/\/api.sermonindex.net\/SID25681-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "The Key to Unlocking the Provision of God",
            "url": "http:\/\/api.sermonindex.net\/SID19512",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 7:1-10, 2 Kings 6:24-25, 1 Corinthians 1:25",
            "topic": "Provision",
            "description": "December 13, 2009 - God chooses an incredible strategy to release His provision. God will feed His people and then use the people He feeds to feed others. Before God can use us and pour His provision through us He must see a core value in our character. We must have the same compassion that Christ has for us. True compassion is born of the Spirit. The storehouse of God is unlocked when the Holy Spirit stirs us to reach out to the sea of human need all around us.",
            "download": "http:\/\/api.sermonindex.net\/SID19512-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                },
                {
                    "book": "2 Kings",
                    "chapter": "6"
                },
                {
                    "book": "2 Kings",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Tragic Price Of Unbelief",
            "url": "http:\/\/api.sermonindex.net\/SID9224",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 7:1-2",
            "topic": "Unbelief",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9224-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "7"
                }
            ]
        }
    ]
}