{
    "name": "2 Kings 8",
    "book": "2 Kings",
    "chapter": 8,
    "sermons": [
        {
            "title": "Miracles Of Elisha, Message 5",
            "url": "http:\/\/sermonindex.net\/SID11425",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 8,13",
            "topic": "",
            "description": "\"The man and the message,\" says Ed Miller, \"are so close together you can't separate them.\"  God's revelation of Elisha's history ends with a king coming to Elisha for help and the resurrection of a dead man touching his bones.  Miller sums up the whole message of the man that looks like Jesus as, \"Trust the Lord; don't trust in yourself.\"",
            "download": "http:\/\/sermonindex.net\/SID11425-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Weeping for Souls",
            "url": "http:\/\/sermonindex.net\/SID10292",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 8:11",
            "topic": "",
            "description": "Elisha's weeping in the face of Hazael is an action sermon for us to observe that the man of God feels what he preaches. The gospel message is more than theory or a package to deliver and be gone. Elisha shows us that tears are needed to minister to the souls of men. He is one of many examples of faithful servants of God whose hearts were broken with the urgency to reach perishing souls. In this sermon, a number of Biblical examples are given starting with Elisha. The need for this brokenness is vindicated in the fulfillment of Elisha's prophecy regarding Hazael's reign of terror against Israel. Reasons are also given why God demands brokenness from His servants to deliver His message of grace to deliver souls. The missing element in the modern day evangelical church shows how the church can move from a ministry of power to mere trite conformity to creeds and formalism. This needs to be repented of.",
            "download": "http:\/\/sermonindex.net\/SID10292-download",
            "preacher_name": "Ian Goligher",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "8"
                }
            ]
        }
    ]
}