{
    "name": "Absolute Surrender",
    "description": "",
    "sermons": [
        {
            "title": "Absolute Surrender",
            "url": "https:\/\/sermonindex.info\/SID1547",
            "size": "7143424",
            "format": "mp3",
            "scripture": "Jeremiah 1:4-10, Jeremiah 15:19, 2 Corinthians 5:20",
            "topic": "Absolute Surrender",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1547-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "15"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Complete Surrender",
            "url": "https:\/\/sermonindex.info\/SID5025",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Absolute Surrender",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID5025-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "Faith to Fulfill All of God's Will",
            "url": "https:\/\/sermonindex.info\/SID4055",
            "size": "13043712",
            "format": "mp3",
            "scripture": "",
            "topic": "Absolute Surrender",
            "description": "This is a powerful message brought by brother Zac Poonen on full surrender in the Christian life. How much have we realized the great salvation we have are we willing to give it all to God in service in this life. Is our 100% confidence in Christ and in eternity?",
            "download": "https:\/\/sermonindex.info\/SID4055-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Giving Your All",
            "url": "https:\/\/sermonindex.info\/SID16493",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Absolute Surrender",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID16493-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        }
    ]
}