{
    "name": "Anabaptism",
    "description": "",
    "sermons": [
        {
            "title": "(Early Anabaptism) Christ in Early Anabaptism",
            "url": "http:\/\/api.sermonindex.net\/SID18107",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "The history of the church has many treasures for us today. God calls us to walk about Zion and to study it's bulwarks. The history of the early Anabaptist is one rich and alive with the personal testimonies of men and women who found the living God. The deaths that so many of them suffered for Christ brought life all over Europe. God and His principles have not changed. Life in our lives and communities will come in the same way.",
            "download": "http:\/\/api.sermonindex.net\/SID18107-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) Foundation Stones in the Anabaptist Faith",
            "url": "http:\/\/api.sermonindex.net\/SID18110",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "A personal relationship with Jesus, fellowship, accountability, evangelism, and the two kingdoms are a few of the foundations of the Anabaptist faith and practice. Jesus Christ was the chief cornerstone of all of their lives. They lived their lives by His example. Their evangelism, fellowship, and other doctrines flowed out of a life given totally to Christ. This is a very needed message for us as their descendants to practice today.",
            "download": "http:\/\/api.sermonindex.net\/SID18110-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) Gelassenheit—Complete Surrender",
            "url": "http:\/\/api.sermonindex.net\/SID18109",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "God calls His children to complete surrender to Him. The early Anabaptists lived this surrender from day one of their baptism. There wes no middle ground. It was either everything for the Lord or nothing at all. Baptism for them meant very possible death any day forward from then. What does complete surrender mean for you today? Should it be any less radical?",
            "download": "http:\/\/api.sermonindex.net\/SID18109-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) Reviving the Righteous Root of Anabaptism",
            "url": "http:\/\/api.sermonindex.net\/SID18112",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "Oh that God would restore His people to the pristine beauty they once had. The beauty that came, not from Anabaptism, but from the righteous root of Jesus Christ Himself! This message is a challenge to set our sights on everything Jesus bought and paid for, in the shedding of His blood. Will we return to the \"all or nothing\" mentality, making a clear commitment to evangelism, Christ, and persecution as did they? The combination of these is what kept their lives alive!!",
            "download": "http:\/\/api.sermonindex.net\/SID18112-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) The Anabaptist Vision",
            "url": "http:\/\/api.sermonindex.net\/SID18111",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "A Spirit-borne vision is a revealing of the will and mind of God. What we are and what we have is a result of our vision. What is your vision? What do you see? The Anabaptist movement today is a sleeping giant. Persecution is coming to this land, and there will be an awakening sooner or later. May God help us to see what He sees, to awake, and to prepare—to be radical followers of the Lamb.",
            "download": "http:\/\/api.sermonindex.net\/SID18111-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) The Approaching Wave of Persecution",
            "url": "http:\/\/api.sermonindex.net\/SID18113",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "Do you believe that American Christians will face persecution in the near future? Across many denominations the answer is the same. About 75% of the people will answer yes without hesitation. What are we doing to prepare our children for this persecution? Are we ready to face it? The Bible is clear that our enemy, Satan, will make war against us and try to wear out the saints. This message brings in scriptures that make this clear. This message also gives some clear direction for preparation that we can do, so that we are ready to stand.",
            "download": "http:\/\/api.sermonindex.net\/SID18113-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "(Early Anabaptism) Theology Versus Anabaptist Reality",
            "url": "http:\/\/api.sermonindex.net\/SID18108",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anabaptism",
            "description": "In the days of the early Anabaptists there was a stark difference between them and the Reformed churches of the day. Anabaptists believed that they had been living wrong and repented to be followers of the Lord Jesus Christ. The Reformers merely changed the theology they taught in their churches. Are you a follower of the Lord Jesus Christ or have you only changed your \"belief\"?",
            "download": "http:\/\/api.sermonindex.net\/SID18108-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": []
        },
        {
            "title": "Reviving the Righteous Root of Anabaptism",
            "url": "http:\/\/api.sermonindex.net\/SID12705",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 80:7",
            "topic": "Anabaptism",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12705-download",
            "speaker_name": "Denny Kenaston",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        }
    ]
}