{
    "name": "Anniversary",
    "description": "",
    "sermons": [
        {
            "title": "25th Anniversary Plea - Part II",
            "url": "http:\/\/api.sermonindex.net\/SID16074",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anniversary",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16074-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "50 Years of the People's Church",
            "url": "http:\/\/api.sermonindex.net\/SID6716",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anniversary",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6716-download",
            "preacher_name": "Oswald J. Smith",
            "preacher_image": "\/images\/oswald_j_smith.gif",
            "preacher_description": "Oswald J. Smith (1889 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Oswald J. Smith in mp3 format. Was a Canadian pastor, author, and missions advocate. He founded The People's Church in Toronto in 1928. Over the course of eighty years he preached more than 12,000 sermons in 80 countries, wrote thirty-five books (with translations into 128 languages), as well as 1,200 poems, of which 100 have been set to music, including \"Deeper and Deeper\" (first line \"Into the heart of Jesus\").\r\nThe great burden of Oswald J. Smith's Christian life was to see the lost come to the Lord. He was well known for the motto: \"We talk of the Second Coming; half the world has never heard of the first.\" and \"No one has the right to hear the gospel twice, while there remains someone who has not heard it once.\"",
            "_scripture": []
        },
        {
            "title": "Cornerstone 50'th Anniversary De Moines",
            "url": "http:\/\/api.sermonindex.net\/SID9953",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Anniversary",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9953-download",
            "preacher_name": "John Cliff",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}