{
    "name": "Attitudes",
    "description": "",
    "audio_sermons": [
        {
            "title": "Beautiful Attitudes",
            "url": "http:\/\/sermonindex.net\/SID14397",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Attitudes",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14397-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "Spiritual Values",
            "url": "http:\/\/sermonindex.net\/SID28306",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6:19-21",
            "topic": "Attitudes",
            "description": "One of the reasons people have so many problems is that they do not have the right values. Disciples who have the right attitudes within them are living with the right values. That is why they can have a salt and light influence in the world; their priorities are based on eternity and not on earthly treasures.",
            "download": "http:\/\/sermonindex.net\/SID28306-download",
            "preacher_name": "Dick Woodward",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The \"Me-First\" Club",
            "url": "http:\/\/sermonindex.net\/SID28307",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 7:1-2",
            "topic": "Attitudes",
            "description": "Jesus taught His disciples to look inward and realize that His eight beatitudes would make them the salt and light the world needs. He also taught them to look around, apply those blessed attitudes to their relationships, and then to look upward and receive from God the spiritual disciplines and values they needed to continue being fruitful disciples. The last part of the Sermon on the Mount is a challenge: Â“What are you going to do about what you know?Â”",
            "download": "http:\/\/sermonindex.net\/SID28307-download",
            "preacher_name": "Dick Woodward",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "What Are You Doing More than Others?",
            "url": "http:\/\/sermonindex.net\/SID28318",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:43-48",
            "topic": "Attitudes",
            "description": "If we follow Jesus and have His attitudes, we will be changed. We will become the salt of the earth and like lights that shine in the world. That means that we will not live the same way that others live. We will do more because we have Jesus living in our hearts. We will have a greater love than the world knows and show greater grace and mercy than the world understands. In so doing, we will become like our Father in heaven.",
            "download": "http:\/\/sermonindex.net\/SID28318-download",
            "preacher_name": "Dick Woodward",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        }
    ]
}