{
    "name": "Baptism Of The Holy Spirit",
    "description": "",
    "sermons": [
        {
            "title": "A Fresh Baptism of the Holy Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID17330",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Baptism Of The Holy Spirit",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17330-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "And the Country was Filled with Water",
            "url": "http:\/\/api.sermonindex.net\/SID0559",
            "size": "12909568",
            "format": "mp3",
            "scripture": "2 Kings 3:10-20",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Duncan Campbell preached this strong word on the baptism in the Holy Spirit at a camp meeting in America in the 1960's.  \"You can't work up revival, but you can do the digging\"--a breaking through the dry crust of our hearts and removing the 'stones', anything that would hinder a consecrated life to God.  The sermon is alive with vivid revival accounts, as with its sister sermon, \"Lacking One Thing\".",
            "download": "http:\/\/api.sermonindex.net\/SID0559-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Are We Willing to Drink His Cup?",
            "url": "http:\/\/api.sermonindex.net\/SID0220",
            "size": "8626176",
            "format": "mp3",
            "scripture": "Luke 12:49-50 ",
            "topic": "Baptism Of The Holy Spirit",
            "description": "This is a powerful sermon on \"drinking the cup\" and baptism of the holy spirit in a way far different from the meaning that is often heard. It's a long sermon but it's worth the hour. Luke 12:49-50 \"I have a baptism...\" \"I am come to send fire on earth.\" Ravenhill speak in this video of the Baptism of the Holy Spirit and the Baptism of Christ sufferings. This lecture was spoken at last days ministries to a crowd of students. This is a very convicting and passionate video of Ravenhill it is highly recommended.",
            "download": "http:\/\/api.sermonindex.net\/SID0220-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Immersed In The Holy Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID20187",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Baptism Of The Holy Spirit",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20187-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Baptism of the Holy Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID22660",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Baptism Of The Holy Spirit",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22660-download",
            "preacher_name": "Dan Augsburger",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Baptism with the Holy Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID2870",
            "size": "8453632",
            "format": "mp3",
            "scripture": "Exodus 29:1-21",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Let your mind and heart be challenged by truths in God's Word about the blood, the cross and the baptism with the Holy Spirit as shown by Levitical sacrifices and laws given by Moses.",
            "download": "http:\/\/api.sermonindex.net\/SID2870-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "29"
                }
            ]
        },
        {
            "title": "The Need and Personality of the Holy Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID22659",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Baptism Of The Holy Spirit",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22659-download",
            "preacher_name": "Dan Augsburger",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Then the Fire of The Lord Fell",
            "url": "http:\/\/api.sermonindex.net\/SID0501",
            "size": "14865408",
            "format": "mp3",
            "scripture": "1 Kings 18:30-40",
            "topic": "Baptism Of The Holy Spirit",
            "description": "Campbell's main themes are our \"supreme need\" for a Pentecostal revival in the baptism in the Holy Spirit.  \"When the fire falls, the word in the mind becomes the incarnate word in the heart.\"  The prime characteristics that Campbell observed during times of God's visitation were the fear of God, deep conviction of sin, a spiritual atmosphere and a belief in the authority of God's Word.",
            "download": "http:\/\/api.sermonindex.net\/SID0501-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Washed With Fire",
            "url": "http:\/\/api.sermonindex.net\/SID3758",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Baptism Of The Holy Spirit",
            "description": "In this message Ravenhill discusses about the Baptism of the Holy Spirit and Fire. He shows this principle from many illustrations and historical accounts (Salvation Army), but namely from the biblical account of John the Baptist.",
            "download": "http:\/\/api.sermonindex.net\/SID3758-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        }
    ]
}