{
    "name": "Being Ready",
    "description": "",
    "sermons": [
        {
            "title": "What Will We Do When Jesus Knocks?",
            "url": "http:\/\/api.sermonindex.net\/SID21671",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 3:14-22",
            "topic": "Being Ready",
            "description": "December 12, 2010 - If we are truly Christians we are called to be given to the poor and afflicted. When the Son of God knocks on the door of your heart to put what you know about Him into practice, how will you respond? We are called to take everything God has given to us and use it for the betterment of human suffering. This doesn't make sense to the natural man who will choose self preservation and stay locked behind a closed door fellowship. If you reach out to the widow and the hungry in a time of famine, the treasure of Jesus Christ will be unlocked to you. When we turn our hearts away from helping the poor and needy, we rob ourselves of the presence of God. Jesus stands at the door and knocks and if you will open the door He will give you provision to feed the hungry, clothe the naked and touch the heart of a sin-sick world. Let your heart come into agreement with what God speaks for your life. If you have resisted this call Jesus is willing to knock again.",
            "download": "http:\/\/api.sermonindex.net\/SID21671-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "3"
                }
            ]
        }
    ]
}