{
    "name": "Belshazzer",
    "description": "",
    "sermons": [
        {
            "title": "(Daniel) The Writing on the Wall",
            "url": "http:\/\/sermonindex.net\/SID10745",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Belshazzer",
            "description": "During the reign of Belshazzar the king, Darius the Mede laid seige to the city of Babylon, Belshazzar though was so unconcerned about this seige that he decided to hold a party for all his friends, this is so common today how the world is teetering on the brink of destruction and eveyone, in the west at least, is partying and concerned with what is on the television.  But God decides to 'crash' this party  and manifests a disembodied hand to write on the wall, this terrifies the king and he calls for Daniel to interpret the writing.  This is a type of how the world seek out the children of God when 'the writing is on their walls'.  Belshazzar offers Daniel riches and power but Daniel isn't interested and rebukes Belshazzar saying that he should have humbled himself like Nebuchadnezzar, but because he hadn't the kingdom would be taken from him and divided, and this was fullfilled that very night when Darius' army stormed Babylon",
            "download": "http:\/\/sermonindex.net\/SID10745-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Belshazzer",
            "url": "http:\/\/sermonindex.net\/SID10176",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Belshazzer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10176-download",
            "preacher_name": "Welcome Detweiler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        }
    ]
}