{
    "name": "Besetting Sin",
    "description": "",
    "sermons": [
        {
            "title": "Besetting Sin",
            "url": "http:\/\/api.sermonindex.net\/SID13033",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 12:1-4",
            "topic": "Besetting Sin",
            "description": "An admonition to lay aside and overcome sin in our life. Bob has a wonderful way of challenging believers to more godliness.",
            "download": "http:\/\/api.sermonindex.net\/SID13033-download",
            "preacher_name": "Bob Jennings",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "How to Deal with Personal Besetting Sin",
            "url": "http:\/\/api.sermonindex.net\/SID24924",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Besetting Sin",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24924-download",
            "preacher_name": "Al Whittinghill",
            "preacher_image": "",
            "preacher_description": "Al Whittinghill ( - )\r\nListen to freely downloadable audio sermons by the speaker Al Whittinghill in mp3 format. Al was called to join the worldwide ministry of Ambassadors for Christ International. AFCI is a fellowship of preachers and teachers of God’s Word who seek to serve the Church of Jesus Christ as catalysts for genuine spiritual revival and world evangelism, primarily through itinerant preaching ministries. Al works with AFCI out of its office in Atlanta, Georgia having an extensive preaching\/teaching ministry that reaches around the world. His ministry in the local churches encompasses many denominations across the United States and in other countries, where he has presented the unsearchable riches of Christ from God’s Word in more than 50 countries. For more than thirty five years Al has been privileged to preach, teach, and minister across the USA, Europe, India, Canada, Africa, Asia, Australia, the Pacific nations, and in countries behind the former Iron Curtain.\r\n\" I perceive that this man is a prophet who has a word for this generation….\" - Vance Havner  \/ \"My friend and brother Al Whittinghill has been touched with a live coal. He truly points the way and also leads the way. \"A man whose heart the Lord has touched\" 1 Sam.10:26. Hear him.\" - Leonard Ravenhill",
            "_scripture": []
        },
        {
            "title": "Killing Your Giant",
            "url": "http:\/\/api.sermonindex.net\/SID21573",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Besetting Sin",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21573-download",
            "preacher_name": "J.C. Hibbard",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}