{
    "name": "Biblical Salvation",
    "description": "",
    "sermons": [
        {
            "title": "Clarifying True Biblical Salvation (radio interview)",
            "url": "http:\/\/api.sermonindex.net\/SID13262",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Biblical Salvation",
            "description": "Rev. Paul Washer is an itinerant preacher and the General Director for HeartCry Missionary Society. Ingrid played excerpts of a message by Paul Washer that was preached to 5,000 young people at a Southern Baptist conference. Ingrid pointed out that the message was not well received. Why is that? Today, Christian youth are exposed to many entertainment based Bible messages. This is in direct contrast to Reverend Washer's message. He communicated that far too many people believe that even though they love so many things in the world, they're saved because at some point in their life they prayed a prayer and supposedly \"accepted\" Christ into their life. Reverend Washer debunks this notion of split allegiance. He explains how we need to learn how to love the things that God loves and hate the things that God hates, recognizing that the only reason we are saved, if in fact we are, is because Jesus, on the Cross, took upon himself the wrath of the Father; wrath that would otherwise have fallen on us.",
            "download": "http:\/\/api.sermonindex.net\/SID13262-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        }
    ]
}