{
    "name": "Biblical Family",
    "description": "",
    "sermons": [
        {
            "title": "A Biblical family - a tool in God´s hands (part 1)",
            "url": "http:\/\/api.sermonindex.net\/SID14387",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:27",
            "topic": "Biblical Family",
            "description": "Many people today don't know what a family means. Even the president of one of the leading nations in Europe said recently, \"What is a family?\" He's a clever politician, but he's confused about the family. He suggested, \"a man with 2 or 3 wives, or a woman with 2 or 3 husbands\". At his funeral a number of his wives were present. Is there a Biblical standard which is valid today? And if there is, what is it? Here we read that God created man in His own image. They were created in God's image - male and female. He didn't create a man with a harem of women, or like an animal - a bull among the cows. No, He created them male and female.",
            "download": "http:\/\/api.sermonindex.net\/SID14387-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Biblical family - a tool in God´s hands (part 2)",
            "url": "http:\/\/api.sermonindex.net\/SID14386",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 3:14-15",
            "topic": "Biblical Family",
            "description": "It is important for every parent to remember that God often visits the sins of the parents on the children - to the third and fourth generation. Even your selfishness and greed you pass on to your children and they suffer because of you. Turn therefore completely in all sincerity from all sin. It might not trouble you now, but one day it will be revealed and it will be terrible. \r\nBut to those who love God, He blesses to the thousand's generation. A certain newly-born baby simply did not stop crying and the doctor could not find the problem. Eventually he called for a specialist, but still they failed to diagnose the problem. Eventually one of the doctors had an idea, and he took a cigarette and blew the smoke into the face of the child. Immediately the crying stopped. His mother smoked and the child suffered from nicotine-withdrawal symptoms.",
            "download": "http:\/\/api.sermonindex.net\/SID14386-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                }
            ]
        }
    ]
}