{
    "name": "Blessings",
    "description": "",
    "sermons": [
        {
            "title": "(The Spiritual Man) The Law Of Blessings",
            "url": "http:\/\/sermonindex.net\/SID14412",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Blessings",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14412-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "6 Blessings + 6 Barriers",
            "url": "http:\/\/sermonindex.net\/SID21512",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Blessings",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21512-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "6) Blessings and 6 Barriers",
            "url": "http:\/\/sermonindex.net\/SID10960",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 4",
            "topic": "Blessings",
            "description": "Verwer focuses on commitment with balance. He discusses the blessings that encourage him most, including relationships with ex-OMers that have been healed by forgiveness. New frontiers, wisdom, and humility all figure prominently. \"It's unlimited what can be accomplished if you don't care who gets the credit\". Unfortunately there are also barriers to be overcome. Manpower can be a limiting factor, especially as the local church learns to focus on the priorities. Money, gossip and prayerlessness are all vices that can immobilize a movement.",
            "download": "http:\/\/sermonindex.net\/SID10960-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Blessings and Curses",
            "url": "http:\/\/sermonindex.net\/SID12025",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Blessings",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12025-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Hosea #2 Ch. 2-3 Seven Blessings of Israel",
            "url": "http:\/\/sermonindex.net\/SID12109",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 2",
            "topic": "Blessings",
            "description": "The Lord changes the names of Hosea children from 'not my people' to 'my people' and 'no mercy' to 'mercy', showing that one day Israel who had been put away from the Lord because of their sin would be reunited with their God as an adulterous bride reunited with her faithful husband.  This is reflected in Hosea's adulterous wife Gomer and his faithfulness and love towards, the Lord had blessed Israel greatly and they had turned and praised idols for their blessings, so the Lord promises to send judgement on Israel in order to turn them back to Hi, and that is exactly where Israel are today mostly away from the Lord. Chapter 3 of Hosea has been described by some as the greatest chapter in the whole Bible quite a feat for 5 verses.  Gomer is up for auction as a slave and Hosea buys her back with all he has, he then takes her home and reclothes her.  This is exactly what the Lord has done for us, where we are obviously in the place of Gomer and Hosea in the place of the Lord.",
            "download": "http:\/\/sermonindex.net\/SID12109-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "2"
                }
            ]
        }
    ]
}