{
    "name": "Body",
    "description": "",
    "sermons": [
        {
            "title": "The Body is the Cathedral of the Holy Spirit",
            "url": "http:\/\/sermonindex.net\/SID22210",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Body",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22210-download",
            "preacher_name": "James A. Stewart",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Body: Old And New",
            "url": "http:\/\/sermonindex.net\/SID4727",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Body",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4727-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "The Christians Body-Three Stages",
            "url": "http:\/\/sermonindex.net\/SID17535",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5",
            "topic": "Body",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17535-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Sanctity of the Body",
            "url": "http:\/\/sermonindex.net\/SID25572",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Body",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25572-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        }
    ]
}