{
    "name": "Building",
    "description": "",
    "sermons": [
        {
            "title": "Come let us build",
            "url": "http:\/\/api.sermonindex.net\/SID14340",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17",
            "topic": "Building",
            "description": "A certain lady was worried that she was getting older and remaining single. One day she was very distressed and went to pray outside under a tree for a husband. She worked herself up emotionally and eventually she shouted (some Christians like to pray louder and louder and work themselves up to a crechendo, thinking that by their sheer volume they will be heard of God. They fail to distinguish between the soul and spirit). An owl in the tree was startled by her crying and let out \"whooo\". She replied, \"anybody, Lord\". Don't be obsessed with marriage lest you end up with a washout of a husband. Let God be your first priority.",
            "download": "http:\/\/api.sermonindex.net\/SID14340-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Reconstructing The Temple",
            "url": "http:\/\/api.sermonindex.net\/SID20697",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Building",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20697-download",
            "preacher_name": "Mark Steberl",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}