{
    "name": "Burnt Offering",
    "description": "",
    "sermons": [
        {
            "title": "The Burnt Offering",
            "url": "https:\/\/sermonindex.info\/SID5422",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22:7-8, Hebrews 11:17-19, Leviticus 1:3-4",
            "topic": "Burnt Offering",
            "description": "Here in Genesis we read of the Lord testing Abrahams faith, which is confirmed in Hebrews 11.  Isaac was to be the burnt offering which would produce a sweet smelling savour to the Lord, we see him here in the place of the lamb that bows his head instead of stiffening his neck.  Pastor Hession shows there are 3 key sayings in these verses, 1: Where is the Lamb? when we are stubborn and self willed where are the lamb like qualities in us that marked the life of our Lord?  2: God will provide Himself a Lamb,  this He did in the form of his Son, the Lord Jesus, Who was the only One Who could offer up a sweet smelling savour to God.  3: He shall be accepted for Him, here is the wonder of His substitution for us that God credits to us the sweet savour that ascended up from Calvary.",
            "download": "https:\/\/sermonindex.info\/SID5422-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Leviticus",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "11"
                },
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        }
    ]
}