{
    "name": "Cain",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 John #19) Cain-like or Christ-like",
            "url": "http:\/\/sermonindex.net\/SID4820",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Cain",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4820-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "(Church of Cain) The Church Of Cain - Part 1",
            "url": "http:\/\/sermonindex.net\/SID13625",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 4, Luke 17:26-30",
            "topic": "Cain",
            "description": "As parents are we producing children of Cain or children of Abel?  Ralph Sexton contrasts Cain and Abel to today, especially in light of Jesus' words that His coming would be at a time like the days of Noah.",
            "download": "http:\/\/sermonindex.net\/SID13625-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Church of Cain) The Way Of Cain - Part 2",
            "url": "http:\/\/sermonindex.net\/SID13624",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 4:1-10",
            "topic": "Cain",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13624-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Church of Cain) The Words Of Cain - Part 3",
            "url": "http:\/\/sermonindex.net\/SID13623",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:37-39, Genesis 4:1-10",
            "topic": "Cain",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13623-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "(Church of Cain) Works of Cain - Part 4",
            "url": "http:\/\/sermonindex.net\/SID13622",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 4:1-5",
            "topic": "Cain",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13622-download",
            "preacher_name": "Ralph Sexton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Way Of Cain",
            "url": "http:\/\/sermonindex.net\/SID8264",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 3:12-13",
            "topic": "Cain",
            "description": "Brother Zac Poonen shares on the subject of the \"Way Of Cain.\" This message is a strong Biblical warning and such a message is rarely heard in any churches. Some of the eternal truths shared in this message are absolutely essential for leadership of churches to appropriate and know. Oh may we repent where it is needed and fully God with a full heart of faith in these terrible last days. Are you in the way of Cain or in the way of Abel?",
            "download": "http:\/\/sermonindex.net\/SID8264-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Way of Cain",
            "url": "http:\/\/sermonindex.net\/SID23932",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Cain",
            "description": "In this passionate talk, Steve addresses the great reality of our day: a multitude of churchgoers with no more than “a form of godliness.” As he explains, there is a spiritual dynamic involved with a person falling away from God. Could his explanation bridge the gap between Calvinism and Arminianism? The key to this longstanding debate could very well be found in ‘The Way of Cain.’",
            "download": "http:\/\/sermonindex.net\/SID23932-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": []
        }
    ]
}