{
    "name": "Calamities",
    "description": "",
    "sermons": [
        {
            "title": "A Christian’s Response to Calamities",
            "url": "http:\/\/api.sermonindex.net\/SID13883",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Peter 2:4-6",
            "topic": "Calamities",
            "description": "October 23, 2005. Judgment is not the only message of Jesus Christ to the lost in the last days. We are to be messengers of hope to a fearful society. We must take a position of faith in Jesus Christ , fully determined to lay all our burdens at His feet and leave them there. The message of the Church of Jesus Christ in times of calamities such as these is a people That will choose to take a position in faith and offer hope to the hopeless.",
            "download": "http:\/\/api.sermonindex.net\/SID13883-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "2 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "A Time to Weep and a Time to Fight",
            "url": "http:\/\/api.sermonindex.net\/SID17708",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Calamities",
            "description": "October 26, 2008 - God will never leave His church without answers. In these times of sudden calamity the initial response may be fear, but we must trust that God has everything under control. He has a million ways to solve our problems. Usually in these times God is the only one that can give us answers. We must turn off every voice of humanity. God's people get their answers from one place and that is the Bible. God is calling His people in the secret closet of prayer so we can get a Word from Him. Don't let the Sunday morning blessings fade into the troubles of this day. Encourage yourself in the Lord!",
            "download": "http:\/\/api.sermonindex.net\/SID17708-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        }
    ]
}