{
    "name": "Cares",
    "description": "",
    "sermons": [
        {
            "title": "Casting All Your Care upon Him",
            "url": "http:\/\/api.sermonindex.net\/SID22790",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 5:7, Luke 12:7",
            "topic": "Cares",
            "description": "Hans Waldvogel speaks of how God cares for believers and even in the small things such as our very hairs on our head. Our Heavenly Father gives such care and attention to our life as we submit to his Lordship. We can give all parts of our being and life to him and we dishonour him when we do not submit to Him. God is to be the absolute ruler and king of our body, spirit and soul. Through the tests and trials in life allows us to continually choice to keep and trust our Lord with all our cares.",
            "download": "http:\/\/api.sermonindex.net\/SID22790-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "12"
                },
                {
                    "book": "1 Peter",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Thorns",
            "url": "http:\/\/api.sermonindex.net\/SID26902",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Cares",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26902-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        }
    ]
}