{
    "name": "Care",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 34): Casting All Your Cares Upon Him",
            "url": "https:\/\/sermonindex.info\/SID2087",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 5:7",
            "topic": "Care",
            "description": "Tozer shows clearly that God allows us to cast our cares on Him. But he carefully shows only those that have been regenerated and renewed can partake of these precious promises. The promises are for the children of promise not the children of wrath. All the promises of God are conditional.",
            "download": "https:\/\/sermonindex.info\/SID2087-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Mark - He Watches Over His Own",
            "url": "https:\/\/sermonindex.info\/SID26537",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Care",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26537-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        }
    ]
}