{
    "name": "Caring For Others",
    "description": "",
    "sermons": [
        {
            "title": "Disentangled Warriors",
            "url": "http:\/\/sermonindex.net\/SID3065",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy 2:1-5",
            "topic": "Caring For Others",
            "description": "(preached: Dec. 14, 2003) Starting with Timothy, and going through other scriptures, believers are exhorted to care one for another, and fight the good fight. When God sends someone to you who needs encouragement, lifting up will you be able to take time to support those who are falling down? Will you be able to stand up against the devil for your brothers and sisters in the church? Don't be willing to let them go. Hate it when you see the devil gain the advantage. Jesus left the flock for the one. He left the 99 for the one. When you see it, you pray, and you fast for them. You intercede, encourage, lift up. Support. This is the heart of God for his people and this is how he wants them to love one another. Ask God to give you the discernment to see the needs of others around you. To look past your needs and problems to those around you.",
            "download": "http:\/\/sermonindex.net\/SID3065-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                }
            ]
        }
    ]
}