{
    "name": "Carnality",
    "description": "",
    "sermons": [
        {
            "title": "A Cure for Carnality - A Call to be Steadfast - Part 1",
            "url": "https:\/\/sermonindex.info\/SID11002",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11002-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Cure for Carnality - A Call to be Steadfast - Part 2",
            "url": "https:\/\/sermonindex.info\/SID11003",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11003-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Carnal Mind or Mind of Christ",
            "url": "https:\/\/sermonindex.info\/SID27767",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27767-download",
            "preacher_name": "R. Edward Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Corinthians - Stop Thinking Like Children",
            "url": "https:\/\/sermonindex.info\/SID26555",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26555-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "Enlarging Our Hearts",
            "url": "https:\/\/sermonindex.info\/SID16355",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 6:11-13, Ephesians 1:15",
            "topic": "Carnality",
            "description": "Zac Poonen speaks on the problem in the corinthian church and many believers today of having a narrow heart, that is the reason they were fleshy, babes and never grew spiritually. But Paul the apostle exhorts the believers to \"enlarge\" their hearts and not have a narrow hearts. There are 2 things that make a persons heart narrow or large: Faith and Love.",
            "download": "https:\/\/sermonindex.info\/SID16355-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "1"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Esther - Spiritually Alive Yet Carnally Controlled",
            "url": "https:\/\/sermonindex.info\/SID27702",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27702-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "Natural, Spiritual or Carnal",
            "url": "https:\/\/sermonindex.info\/SID20952",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20952-download",
            "preacher_name": "Dennis Kinlaw",
            "preacher_image": "",
            "preacher_description": "Dennis Kinlaw ( - )\r\nListen to freely downloadable audio sermons by the speaker Dennis Kinlaw in mp3 format.  Dennis Franklin Kinlaw was born June 26, 1922, in Lumberton, North Carolina. He attended Asbury College, graduating in 1943, and Asbury Theological Seminary, graduating in 1946. He pursued further studies at Princeton Theological Seminary and University of Edinburgh, Scotland. He received an M.A. and Ph.D. from Brandeis University. On December 31, 1943, Kinlaw married a college classmate, Elsie Blake (Class of 1943). He was ordained in the North Carolina Conference of the United Methodist Church in 1951. (He later transferred to the Kentucky Conference.) In 1959 he served as a visiting professor at Seoul Theological College in South Korea. In 1963 he returned to Asbury Theological Seminary, this time as a professor of Old Testament history, theology, and languages.\r\nIn 1983 Kinlaw founded the Francis Asbury Society, an organization based in Wilmore, Kentucky, whose purpose is to promote the message of Scriptural holiness through evangelism, discipleship, missions outreach, and publications. Kinlaw also served as chairman of the board of the mission organization OMS International. He is an accomplished pastor, professor, administrator, evangelist, teacher, and author.",
            "_scripture": []
        },
        {
            "title": "Symptoms Of Carnal Life",
            "url": "https:\/\/sermonindex.info\/SID5197",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID5197-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "The Carnal & Spiritual Man ",
            "url": "https:\/\/sermonindex.info\/SID21659",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID21659-download",
            "preacher_name": "Tony Sargent",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Carnal American Church",
            "url": "https:\/\/sermonindex.info\/SID24583",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Carnality",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24583-download",
            "preacher_name": "Jon Couch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "When Carnal Men Claim the Throne",
            "url": "https:\/\/sermonindex.info\/SID17109",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 4:8-16, Jeremiah 23:21-22, 2 Chronicles 18",
            "topic": "Carnality",
            "description": "May 4, 2008 - The voice of the Lord is coming to all the Jehoshaphats of this generation asking, \"What are you doing helping those who exploit the poor, the widows and the fatherless?\" God is beseeching them to ask Him for an eye salve anointing that they may see again and to ask for a purity of heart to look away from self and come back to the simplicity that is in Christ. False prophets are resisting Christ Himself for power, money and fame. Biblical prosperity is not given to bigger cars and houses. Biblical prosperity is to be poured out for lost humanity with the compassion and selflessness of Jesus Christ.",
            "download": "https:\/\/sermonindex.info\/SID17109-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Ye Are Yet Carnal",
            "url": "https:\/\/sermonindex.info\/SID15016",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 3:1-8",
            "topic": "Carnality",
            "description": "With a double-edged sword, Ravenhill cuts 2 ways in this stirring message: First he goes after ministers, comparing their impact and ministry philosophies to that of Paul's. Then he puts laymen under the light of regeneration, challenging why they are still babes in Christ.",
            "download": "https:\/\/sermonindex.info\/SID15016-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "3"
                }
            ]
        }
    ]
}