{
    "name": "Castaway",
    "description": "",
    "sermons": [
        {
            "title": "A Castaway",
            "url": "http:\/\/sermonindex.net\/SID21034",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Castaway",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21034-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "Lest after I have preached to Others I Should be a Castaway!",
            "url": "http:\/\/sermonindex.net\/SID26342",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Castaway",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26342-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        }
    ]
}