{
    "name": "Chastening",
    "description": "",
    "sermons": [
        {
            "title": "(Suffering in the Christian Life) 2. The Chastening of the Lord",
            "url": "http:\/\/api.sermonindex.net\/SID18765",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Chastening",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18765-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "The Lord's Chastening",
            "url": "http:\/\/api.sermonindex.net\/SID0752",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Chastening",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID0752-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        }
    ]
}