{
    "name": "Cherishing Christ",
    "description": "",
    "audio_sermons": [
        {
            "title": "Cherishing the Treasure of Christ",
            "url": "http:\/\/sermonindex.net\/SID4175",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 13:44-46,2 Corinthians 4:5-6,Romans 11:33",
            "topic": "Cherishing Christ",
            "description": "We have this treasure in earthen vessels; the Spirit of the living God indwelling believers. And that presence will produce in a hungry soul an ever increasing revelation of who Christ is. This is often revealed in us and to us through suffering and trials. We have this great kingdom which cannot be moved, such great victory, and power living in us. Pastor Conlon goes through many other scriptures revealing how the Lord Jesus Christ is our Treasure. The person drawing closer to Him, cannot help being awed by Him, and at the same time painfully aware of their own sinful flesh in comparison. If your heart is toward Christ he knows, and he will not let the enemy overwhelm you as you trust in him. Pursuit of an ever increasing knowledge and intimacy with Christ should be the Christian's number one priority. When we get careless with the word of God and prayer, tragedy can come. The devil is always after the treasure of the presence of Christ in your life. Pastor Conlon warns: There is no greater danger than to become careless with this Book!",
            "download": "http:\/\/sermonindex.net\/SID4175-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "11"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "13"
                }
            ]
        }
    ]
}