{
    "name": "Chief Cornerstone",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 Peter - Part 19): The Chief Cornerstone and Us Cornerstones",
            "url": "http:\/\/sermonindex.net\/SID2072",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:3-5",
            "topic": "Chief Cornerstone",
            "description": "Christ’s people are the living stones of God’s temple. On January 31, 1954, A. W. Tozer preached “The Chief Cornerstone and Us Cornerstones,” in Chicago, Illinois. It is the 19th message in a 34-part study of Peter’s first epistle. We already know that the Bible is true; the big question is whether it is true in us. From 1 Peter 2:3-5, Pastor Tozer examines the terms, “tasted,” and “lively stones,” and observes that Christians come out of the world, come away from the old life, come unto Christ, and come together. Drawing nearer to Jesus Christ is what draws Christians nearer to each other. The pastor also warns that we can get the gifts of God and then forget the God that gives. God gives himself in every gift, and it is God himself who matters more than all other gifts. The recording length is 38 minutes and 41 seconds.",
            "download": "http:\/\/sermonindex.net\/SID2072-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        }
    ]
}