{
    "name": "Chinese Underground Church",
    "description": "",
    "sermons": [
        {
            "title": "Persecution and the Underground Church in China",
            "url": "https:\/\/sermonindex.info\/SID24861",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 13:3",
            "topic": "Chinese Underground Church",
            "description": "Brother Edgar shares very powerful accounts of suffering of true disciples of Jesus in the underground Church in China. In comparison in the West we fall so short of the same authentic reality of these simple believers. This message is a informational message but also a call by the Holy Spirit to us in other countries to follow Jesus Christ whole-heartily in revival.",
            "download": "https:\/\/sermonindex.info\/SID24861-download",
            "preacher_name": "Edgar Reich",
            "preacher_image": "",
            "preacher_description": "Edgar Reich ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Edgar Reich in mp3 format. The former business man is Reverend Edgar Reich. He has been called by the Lord to teach and preach in Revival. He is a devoted Christian teacher, leading adult Bible study groups at his Church, his former business and his community. God has called him into fulltime Christian Ministry to preach and teach in Revival. \r\n\r\nHe became a Reverend under the leadership of Rev. Dr. R. L. Curry in July 2008.  The Lord has had brother Edgar start Revival Canada USA which is a ministry believing God for revival in North America. \"God has promised to bring a Nation wide Revival to the United States of America and Canada prior to the return of the Lord Jesus Christ. Fires of Revival will break out all over the United States and Canada in many cities and spread from African American Churches to White Churches.\"",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "13"
                }
            ]
        }
    ]
}