{
    "name": "Christ Centered",
    "description": "",
    "sermons": [
        {
            "title": "(Christ) The Power of Christ-Centered Theology - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID16802",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ Centered",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16802-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "(Christ) The Power of Christ-Centered Theology - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID16803",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ Centered",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16803-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "Christ is All - The Christ-Centred Life",
            "url": "http:\/\/api.sermonindex.net\/SID26584",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ Centered",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26584-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "The Churches Of Revelation",
            "url": "http:\/\/api.sermonindex.net\/SID24212",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesus 3",
            "topic": "Christ Centered",
            "description": "In this sombre prophetic message we look at the departing of many from the heart of Christ.Jesus warned the Ephesians that if they did not repent He would remove the candlestick from the midst.Alas today there are assemblies that resemble the tin man from the movie the wizard of Oz.They function,move,skip and dance along a golden road and yet they have no heart.The glory of God has departed and they have been found naked and  at home in their nakedness.It is my prayer that many would hear this message and encourage others to listen as i truly believe it to be applicable to this hour.",
            "download": "http:\/\/api.sermonindex.net\/SID24212-download",
            "preacher_name": "Scott Hynds",
            "preacher_image": "",
            "preacher_description": "Scott Hynds (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Scott Hynds in mp3 format. Through a man of God, witnesses and the inner witness of Gods Spirit, he heard the call to the ministry of preaching the gospel around the world. As John Wesley said \"the world is my parish\" and Scott believes this vision has been passed on to him. In the providence of Almighty God Scott had the great Joy of working in the Roman Catholic community with the elderly. He made sure that these old men and women received the Gospel of the Lord Jesus Christ. He found this experience overwhelming through the love of his master and rejoices in that Christ can set you free from any bondage including deep hatred.\r\nScott recently returned home to Northern Ireland after a few years in Australia as an itinerant Evangelist and Pastor.The Lord has led Scott to plant a church in his home town of Portadown and Pillar Christian Church belongs to the Assemblies of God in Ireland.",
            "_scripture": []
        }
    ]
}