{
    "name": "Christ In Us",
    "description": "",
    "audio_sermons": [
        {
            "title": "Christ in us",
            "url": "http:\/\/sermonindex.net\/SID14337",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-8",
            "topic": "Christ In Us",
            "description": "Woe to us who have God's Word and are not transformed to hear and obey it. Sundar Singh said that salt dissolved in water may disappear but it doesn't cease to exist. We may be sure of its presence by tasting the water. Likewise the indwelling Christ may be realised by His love He imparts to us. Jesus said that He is the Way, the Truth and the Life. When you have Him you've found the way. When you have Him you have the Truth and abundant life. If Christ is a reality to you He leads and guides you. Everybody who tastes you will experience Christ.",
            "download": "http:\/\/sermonindex.net\/SID14337-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "God Indwelling Us",
            "url": "http:\/\/sermonindex.net\/SID21946",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ In Us",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21946-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": []
        },
        {
            "title": "I Will Do it Through You",
            "url": "http:\/\/sermonindex.net\/SID19487",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ In Us",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19487-download",
            "preacher_name": "Norman Grubb",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Let God Be In You",
            "url": "http:\/\/sermonindex.net\/SID0280",
            "size": "5108736",
            "format": "mp3",
            "scripture": "Galatians 4, Luke 1:30",
            "topic": "Christ In Us",
            "description": "In the “fullness of time” God acts.  God knows everything about each one of us.  In this lesson we learn how we should deal with this and how to know we are “letting” God be in us.",
            "download": "http:\/\/sermonindex.net\/SID0280-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "4"
                },
                {
                    "book": "Luke",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Not Becoming, But Being, 1967",
            "url": "http:\/\/sermonindex.net\/SID19477",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Christ In Us",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19477-download",
            "preacher_name": "Norman Grubb",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}