{
    "name": "Christendom",
    "description": "",
    "audio_sermons": [
        {
            "title": "Christendom",
            "url": "http:\/\/sermonindex.net\/SID5705",
            "size": "0",
            "format": "mp3",
            "scripture": "John 8:31-42",
            "topic": "Christendom",
            "description": "“Christendom” was addressed to the attendants of a Christian conference, probably some time between 1960 and 1962. It is 54 minutes, 17 seconds in length. Although the recording intermittently skips words, its sound quality is otherwise good and A. W. Tozer’s valuable lesson can be easily understood. This is a radically challenging message that issues a degree of conviction that believers may find very unpleasant to accept. Pastors, ask yourselves whether you can point at your church and then at your Bible and say, “This is that.” Are you really in spiritual succession to Abraham? John 8:31-42.",
            "download": "http:\/\/sermonindex.net\/SID5705-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "8"
                }
            ]
        }
    ]
}