{
    "name": "Churches of Revelation",
    "description": "",
    "sermons": [
        {
            "title": "The Seven Churches of Revelation",
            "url": "http:\/\/api.sermonindex.net\/SID4490",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 3:14-22, Isaiah 58",
            "topic": "Churches of Revelation",
            "description": "This is a powerful message about the church of Laodicea and much of the Western church of this day.  The message is centered on the verses between Revelation 3:14 to 3:22  Carter also uses verses from Mark chapter 4 to show the disciples fearfulness and lack of concern for others when they were in storm with Jesus in the boat.  The church of Laodicea had the same lack of concern for others with the self-centered life that they were in.  In Isaiah chapter 58, the message speaks of the fast that God has chosen instead of the fasts of pretence that the people of that time were doing.  Like the church of Laodicea, the people of Isaiah’s day were living life for themselves with no concern or grief for the poor or suffering.  With these verses the message went into a parallel with much of the church of today that looks for self-help books, or seminaries, or even counseling without seeking God or God’s word for problems.  Carter encourages married people with problems to look to Ephesians chapter 5 for an answer to problems instead of the counsel of someone who suggests that all your problems are from your third and forth generation.  The message ends with words about revival using the revival of Ezra where it speaks of the people weeping. Revival has a strange mixture of weeping and joy.  In revival the hearts of the people are broken and there is remorse.  The church of Laodicea did not weep for others.",
            "download": "http:\/\/api.sermonindex.net\/SID4490-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Revelation",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Vow of the Nicolaitan Bride",
            "url": "http:\/\/api.sermonindex.net\/SID4491",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 2:12-17,Exodus 34:12-14",
            "topic": "Churches of Revelation",
            "description": "This is part 6 of 7 in the Series of the Seven Churches of Revelation. The Lord has a bride, that he is wooing and dealing with. Part of his bride is wayward, and does not spend time with him, and only seems to love him when it is convenient or doesn't cost anything. The longing in the heart of the Lord to bring again those who have drifted away is astonishing and will amaze you as Pastor Conlon reveals the mercy and grace of our Lord.",
            "download": "http:\/\/api.sermonindex.net\/SID4491-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "34"
                },
                {
                    "book": "Revelation",
                    "chapter": "2"
                }
            ]
        }
    ]
}