{
    "name": "Circumstances",
    "description": "",
    "sermons": [
        {
            "title": "Living Above Our Circumstances",
            "url": "http:\/\/sermonindex.net\/SID22103",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Circumstances",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22103-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Living Above The Circumstances",
            "url": "http:\/\/sermonindex.net\/SID21051",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Circumstances",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21051-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "When God Takes Away Familiar Things",
            "url": "http:\/\/sermonindex.net\/SID4426",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 13:14, Revelation 2",
            "topic": "Circumstances",
            "description": "This message is about the need to not depend on circumstances in our lives staying the same and putting our future in the hands of God. Carter points out that a Christians life of self denial involves continuous change and that it is important not to rely on past or present people, places, or things. We go from glory to glory and there is a constant need for change. When Christians refuse to change, they stay in secure places and do things even in worship that that are the way they have always done them. Churches that that once had fire can become dead by not changing. Carter went to Rev 2 with the church of Ephesus as an example of a church without change leaving it's first love for familiarity. Carter used the example of Peter getting out of the boat to walk on water of a person who gets away from the security of familiar circumstances to follow the Lord's bidding. Hebrews 13;14 Was quoted early by Carter, \"We have no continuing city\".",
            "download": "http:\/\/sermonindex.net\/SID4426-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "13"
                }
            ]
        }
    ]
}