{
    "name": "Classic",
    "description": "",
    "audio_sermons": [
        {
            "title": "William Booth Recording (audio restored)",
            "url": "http:\/\/sermonindex.net\/SID28364",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Classic",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28364-download",
            "preacher_name": "William Booth",
            "preacher_image": "",
            "preacher_description": "William Booth (1829 - 1912)\r\nListen to freely downloadable audio sermons by the speaker William Booth in mp3 format. Was a British Methodist preacher who founded The Salvation Army and became its first General (1878–1912). The Christian movement with a quasi-military structure and government founded in 1865 has spread from London, England to many parts of the world and is known for being one of the largest distributors of humanitarian aid. Though Booth became a prominent Methodist evangelist, he was unhappy that the annual conference of the denomination kept assigning him to a pastorate, the duties of which he had to neglect to respond to the frequent requests that he do evangelistic campaigns. At the Liverpool conference in 1861, after having spent three years at Gateshead, his request to be freed for evangelism full-time was refused yet again, and Booth resigned from the ministry of the Methodist New Connexion.\r\n\r\nThe name The Salvation Army developed from an incident in May 1878. William Booth was dictating a letter to his secretary George Scott Railton and said, \"We are a volunteer army.\" Bramwell Booth heard his father and said, \"Volunteer, I'm no volunteer, I'm a regular!\" Railton was instructed to cross out the word \"volunteer\" and substitute the word \"salvation\". The Salvation Army was modelled after the military, with its own flag (or colours) and its own music, often with Christian words to popular and folkloric tunes sung in the pubs. Booth and the other soldiers in \"God's Army\" would wear the Army's own uniform, 'putting on the armour,' for meetings and ministry work. He became the \"General\" and his other ministers were given appropriate ranks as \"officers\". Other members became \"soldiers\".",
            "_scripture": []
        }
    ]
}