{
    "name": "Comfort",
    "description": "",
    "sermons": [
        {
            "title": "Comfort ye my people",
            "url": "http:\/\/sermonindex.net\/SID23624",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Comfort",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23624-download",
            "preacher_name": "Ken Burnett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Community Thanksgiving - Comfort",
            "url": "http:\/\/sermonindex.net\/SID27661",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Comfort",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27661-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "Heavenly comfort",
            "url": "http:\/\/sermonindex.net\/SID14389",
            "size": "0",
            "format": "mp3",
            "scripture": "Philippians 2:1-4",
            "topic": "Comfort",
            "description": "When the Holy Spirit convicts us of our sins and we confess and forsake them and are washed by the Blood of Jesus, then we shall experience the true comfort of the Holy Spirit. To those who love God, all things work together for good. We don't know what the future holds, but we know Him who holds the future. When Jesus departed, His disciples were sorrowful. Jesus said to them, 'It is expedient for you that I go, for when I depart, the Comforter will come - the Holy Spirit'. In verse 2 we read, \"Fulfill my joy by being like-minded, having the same love, being of one accord, of one mind\". God's people can live in this world of sin and in the devil's domain, being 'likeminded, having the same love, being of one accord, of one mind.' It is a foretaste of heaven, when God's people dwell together in such unity. Such a life is completely dedicated to God. That life and Spirit which was in Christ Jesus must also be in you.",
            "download": "http:\/\/sermonindex.net\/SID14389-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Isaiah 40 - Comfort My People",
            "url": "http:\/\/sermonindex.net\/SID26740",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Comfort",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26740-download",
            "preacher_name": "Mariano Di Gangi",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Comforts of God Job 15:11",
            "url": "http:\/\/sermonindex.net\/SID12757",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 15:11",
            "topic": "Comfort",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12757-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Job",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Words of Comfort",
            "url": "http:\/\/sermonindex.net\/SID10288",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 15:22-30",
            "topic": "Comfort",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10288-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "15"
                }
            ]
        }
    ]
}