{
    "name": "Commands Of Christ",
    "description": "",
    "audio_sermons": [
        {
            "title": "Remember the words I have spoken",
            "url": "http:\/\/sermonindex.net\/SID15984",
            "size": "0",
            "format": "mp3",
            "scripture": "John 15:26, John 16:1-4",
            "topic": "Commands Of Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15984-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "15"
                },
                {
                    "book": "John",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Sermon on the Mount",
            "url": "http:\/\/sermonindex.net\/SID1545",
            "size": "10191872",
            "format": "mp3",
            "scripture": "Matthew 5-7",
            "topic": "Commands Of Christ",
            "description": "Keith Daniel preaches this convicting message in america and its not a sermon to a local congregation but its God given aim is to the entire body of Christ in North America. He reads the entire Sermon on the mount and then focuses soley on the verse Matthew 5:13 which he believes would be the verse that Christ would want to bring to his church in our day. He gives the direct call for us to become the salt in the earth once again. You will [b]not[\/b] be the same again after you hear this message, harden not your hearts.",
            "download": "http:\/\/sermonindex.net\/SID1545-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        }
    ]
}