{
    "name": "Consequences",
    "description": "",
    "audio_sermons": [
        {
            "title": "Better Late Than Never",
            "url": "http:\/\/sermonindex.net\/SID24071",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 3:9-19",
            "topic": "Consequences",
            "description": "There's a consequence for every decision. Let's explore what happens when we hold off trusting in Jesus. 2Kings 3:9-19",
            "download": "http:\/\/sermonindex.net\/SID24071-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Choices, Deeds & Consequences",
            "url": "http:\/\/sermonindex.net\/SID0343",
            "size": "5121485",
            "format": "mp3",
            "scripture": "Haggai 1:5, Haggai 1:7",
            "topic": "Consequences",
            "description": "Dr. Tozer says that considering your ways (your moral ways, that is) is the most important thing that anyone can consider. It is important because everything a person does today -- no matter how slight -- will have consequences tomorrow. God emphasizes this in Haggi 1:5, 7. Pastor Tozer points out that the Pharisees were classic examples of knowing everyone else's ways but their own. They, who should have known better, ignored God's command to examine themselves, so they remained ignorant of their own actions and were spiritually stagnant.",
            "download": "http:\/\/sermonindex.net\/SID0343-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Haggai",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Consequences of Not Trusting God",
            "url": "http:\/\/sermonindex.net\/SID4326",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 12:1, Hebrews 10:38, Jude 1:20",
            "topic": "Consequences",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4326-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jude",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "10"
                },
                {
                    "book": "Genesis",
                    "chapter": "12"
                }
            ]
        }
    ]
}