{
    "name": "Contrite Heart",
    "description": "",
    "sermons": [
        {
            "title": "God looks for a contrite spirit",
            "url": "http:\/\/api.sermonindex.net\/SID24362",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Contrite Heart",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24362-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        },
        {
            "title": "God will not despise a broken and contrite heart",
            "url": "http:\/\/api.sermonindex.net\/SID24361",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Contrite Heart",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24361-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        },
        {
            "title": "Perils and Sorrows of a Contrite Heart",
            "url": "http:\/\/api.sermonindex.net\/SID4181",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 28, 29,Genesis 32:9-10",
            "topic": "Contrite Heart",
            "description": "An in-depth look at the life of Jacob reveals that even when you sin, but want to be right, and sorry for your sin, God will look on you with mercy. Jacob lied, and stole from his brother, but he had a contrite heart. Even though throughout his life he endured many trials, God was with him, all the way. Throughout the 14 years he spent working to marry Rachel, conflict with his fatherinlaw, conflict between his two wives, fear of his brother, his daugther being attacked, and his sons committing murder, to the disappearance of Joseph, and the famine in the land that arose later, God kept Jacob, and his family, and they were never in any real danger. In the end, Jacob's testimony was, \"at 130 years old, few and evil have the days of the years of my life been. \" (Gen. 47:9).  Many are the afflictions of the righteous, but the Lord delivereth him out of them all. Ps. 34:19",
            "download": "http:\/\/api.sermonindex.net\/SID4181-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "32"
                },
                {
                    "book": "Genesis",
                    "chapter": "28"
                }
            ]
        }
    ]
}