{
    "name": "Continuing In Sin",
    "description": "",
    "sermons": [
        {
            "title": "Continue In Sin",
            "url": "http:\/\/api.sermonindex.net\/SID0249",
            "size": "7560000",
            "format": "mp3",
            "scripture": "Romans 6:1-2, Jeremiah 32:39-40, Psalms 89:28-34",
            "topic": "Continuing In Sin",
            "description": "Why do believers continue in sin?  Year after year after year they continue in some sort of sin and they never come into the fullness of the Covenant blessing of God.  Often times it may well just be one area that remains but nonetheless folks continue in that sin.  Wilkerson preaches a very personal message here and he shares his heart and shows his own weakness as an example.  The consequences for a Christian continuing in sin are sobering, but he gave us what we needed to overcome sin, if we want to. For those who are sick of their sin, and hate it, and cry out to God, there is wonderful news. He will empower you, and he wants to put his fear in your heart so you will not turn away from him, and then he can take you into the fullness of the new covenant. Powerful preaching, with a gentle compassion for those who are struggling.",
            "download": "http:\/\/api.sermonindex.net\/SID0249-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                }
            ]
        }
    ]
}