{
    "name": "Culture",
    "description": "",
    "sermons": [
        {
            "title": "Answers for Our Days",
            "url": "https:\/\/sermonindex.info\/SID26201",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Culture",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26201-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Discern Your Culture",
            "url": "https:\/\/sermonindex.info\/SID22338",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Culture",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22338-download",
            "preacher_name": "Albert Mohler",
            "preacher_image": "",
            "preacher_description": "Albert Mohler (1959 - )\r\nListen to freely downloadable audio sermons by the speaker Albert Mohler in mp3 format. \r\nDr. R. Albert Mohler Jr. serves as president of The Southern Baptist Theological Seminary - the flagship school of the Southern Baptist Convention and one of the largest seminaries in the world. Dr. Mohler has been recognized by such influential publications as Time and Christianity Today as a leader among American evangelicals. In fact, Time.com called him the “reigning intellectual of the evangelical movement in the U.S.”\r\nDr. Mohler has presented lectures or addresses at institutions including Columbia University, the University of Virginia, Wheaton College, Samford University, Trinity Evangelical Divinity School, the University of Richmond, Mercer University, Cedarville University, Beeson Divinity School, Reformed Theological Seminary, The Master’s Seminary, Geneva College, Biola University, Covenant Theological Seminary, The Cumberland School of Law, The Regent University School of Law, Grove City College, Vanderbilt University and the historic Chautauqua Institution, among many others.",
            "_scripture": []
        },
        {
            "title": "The Gospel In Contemporary Culture",
            "url": "https:\/\/sermonindex.info\/SID19643",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Culture",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19643-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        }
    ]
}