{
    "name": "Danger",
    "description": "",
    "sermons": [
        {
            "title": "Danger of Defiance",
            "url": "https:\/\/sermonindex.info\/SID28841",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Danger",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28841-download",
            "preacher_name": "+Thaddeus Barnum",
            "preacher_image": "",
            "preacher_description": "Bishop Thaddeus Barnum\r\nListen to freely downloadable audio sermons by the speaker Bishop Thaddeus Barnum in mp3 format. Thad was consecrated in Denver, Colorado by Archbishop Emmanuel Kolini, June 24, 2001. Thad currently serves both as Bishop in Residence at All Saints, Pawleys Island, SC, and as a Chaplain to Clergy.  He has a passion for discipleship and through the ministry of Call 2 Disciple, Erilynne and Thad have given themselves to strengthening the Church in the Scriptures and discipling Christians to maturity in the faith.\r\n\r\nThad has served churches in Connecticut, Pennsylvania and South Carolina and has been married to Erilynne for 35 years. They raised 4 girls and have 11 grandchildren.",
            "_scripture": []
        },
        {
            "title": "The Danger Of A False Center ",
            "url": "https:\/\/sermonindex.info\/SID21282",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Danger",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID21282-download",
            "preacher_name": "Scott Berninger",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Greatest Danger This World Faces Today",
            "url": "https:\/\/sermonindex.info\/SID26341",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Danger",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26341-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        }
    ]
}