{
    "name": "Dangers",
    "description": "",
    "sermons": [
        {
            "title": "(Dangers in the Way Series): Sources of Danger",
            "url": "https:\/\/sermonindex.info\/SID1988",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 18:2",
            "topic": "Dangers",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1988-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Five Dangers A Christian Worker Faces",
            "url": "https:\/\/sermonindex.info\/SID7788",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Dangers",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7788-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        }
    ]
}