{
    "name": "Dating",
    "description": "",
    "sermons": [
        {
            "title": "(The Church Needs To Know) 6. Relationships Before Marriage",
            "url": "http:\/\/api.sermonindex.net\/SID24990",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Dating",
            "description": "If there is one area in the Church today where there exists much confusion, and where there is evidence that the world system has once again crept in and influenced the way Christians think and behave, it is in relationships before marriage. Although this topic might seem only to apply to young people about to get married, it is actually something that is relevant to all believers.",
            "download": "http:\/\/api.sermonindex.net\/SID24990-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        },
        {
            "title": "Attitudes On Spiritual Dating ",
            "url": "http:\/\/api.sermonindex.net\/SID22000",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Dating",
            "description": "Jim Logan shares how God calls us to live with a moral life. When I am pursing a spouse, God is concerned where my heart is in the matter. Jim shares the almost lost knowledge of pursing on a spiritual level and NOT a physical level. If are questioning what to do when single, then this message is for you!",
            "download": "http:\/\/api.sermonindex.net\/SID22000-download",
            "preacher_name": "Jim Logan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Dating Sermon",
            "url": "http:\/\/api.sermonindex.net\/SID14196",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Dating",
            "description": "This message is three short messages put together into one. Paul Washer speaks on the idea of dating and shows that it is very unbiblical and wrong. He breaks down many preconceptions people have about courtship in a biblical sense. This is a very strong message but very important to listen to when we have almost lost all bibilcal instruction and decency in this area of courtship.",
            "download": "http:\/\/api.sermonindex.net\/SID14196-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "God's Truth About Alliances: Dating",
            "url": "http:\/\/api.sermonindex.net\/SID9349",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Dating",
            "description": "The Scripture lays out principles for us to follow concerning the dating relationship. As we go through this lesson, we are reminded that God's goals for relationships are spiritual in nature. As parents we are to teach our children about relationships, starting with godly friendship. We, as parents, are also responsible for controlling who our children date. What questions ought we to ask concerning the ones our children are interested in dating? How do we go about giving our children a road map of conviction they can follow during their teen years? What is the parent's responsibility? What is the child's responsibility? We will see that God has many principles regarding dating.",
            "download": "http:\/\/api.sermonindex.net\/SID9349-download",
            "preacher_name": "Russell Kelfer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Ungodly Practice of Dating",
            "url": "http:\/\/api.sermonindex.net\/SID21285",
            "size": "0",
            "format": "mp3",
            "scripture": "Numbers 30, Deuteronomy 22",
            "topic": "Dating",
            "description": "In this message Tim Conway strongly speaks on the GOD ordained headship of the family. Fathers taking their rightful place to protect their daughters.Referring to old testament scriptures, we are shown the will of GOD concerning dating and marriage. A recommended message for all parents.",
            "download": "http:\/\/api.sermonindex.net\/SID21285-download",
            "preacher_name": "Tim Conway",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "30"
                },
                {
                    "book": "Deuteronomy",
                    "chapter": "22"
                }
            ]
        }
    ]
}