{
    "name": "Dead To Sin",
    "description": "",
    "sermons": [
        {
            "title": "Dead to sin; alive to God",
            "url": "http:\/\/sermonindex.net\/SID15971",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 16:15-18",
            "topic": "Dead To Sin",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15971-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Joy of Preaching Your Own Funeral",
            "url": "http:\/\/sermonindex.net\/SID13962",
            "size": "0",
            "format": "mp3",
            "scripture": "Colossians 3:5-10",
            "topic": "Dead To Sin",
            "description": "Before we surrendered our lives to Christ we were dead in our sin. The only way to be free from this sin is to die to our old way of living. Jesus Christ died for us and when we came to Christ we were baptized in this death. The Bible says, \"he that is dead in Christ is free from the dominion of sin.\" The evidence of this death is that we are not controlled by sin any longer. It doesn't mean we don't have struggles or failures, it means that these things no longer govern our lives. From the time we are born again our whole life is about the funeral of our old nature and the birth of the new man that God is making us to be. The true Christian spends their whole life preaching their own funeral.",
            "download": "http:\/\/sermonindex.net\/SID13962-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "3"
                }
            ]
        }
    ]
}