{
    "name": "Deception",
    "description": "",
    "sermons": [
        {
            "title": "(excerpt) Changing The Word Of God",
            "url": "http:\/\/api.sermonindex.net\/SID24351",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24351-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": []
        },
        {
            "title": "Deceived",
            "url": "http:\/\/api.sermonindex.net\/SID9219",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 13",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9219-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Deception by the Gibeonites",
            "url": "http:\/\/api.sermonindex.net\/SID25711",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25711-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Eight Ways Of Deceiving Ourselves",
            "url": "http:\/\/api.sermonindex.net\/SID11733",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 11:2-3, 1 Corinthians 3:18",
            "topic": "Deception",
            "description": "It is important to remember that the first sin in the human race came through deception and that Satan today is the deceiver of the whole world.  Zac Poonen shares on eight areas we are prone to being deceived and how to protect ourselves.  \"It is only God's mercy,\" he exhorts, \"that can save us from deception.\"",
            "download": "http:\/\/api.sermonindex.net\/SID11733-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Fighting Of Truth In An Age Of Deception",
            "url": "http:\/\/api.sermonindex.net\/",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/-download",
            "preacher_name": "Tyler Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "God's People Deceived",
            "url": "http:\/\/api.sermonindex.net\/SID21092",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21092-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "How To Escape Deception",
            "url": "http:\/\/api.sermonindex.net\/SID7764",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 4:1",
            "topic": "Deception",
            "description": "Zac Poonen shares on the subject of deception and shows how we can steer clear from this prevalent problem in Christendom today. We must be honest with ourselves and the possibility of ourselves being deceived in these last days where God warned us of.",
            "download": "http:\/\/api.sermonindex.net\/SID7764-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Salvation and It's Deadly Deceptions",
            "url": "http:\/\/api.sermonindex.net\/SID24927",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24927-download",
            "preacher_name": "Al Whittinghill",
            "preacher_image": "",
            "preacher_description": "Al Whittinghill ( - )\r\nListen to freely downloadable audio sermons by the speaker Al Whittinghill in mp3 format. Al was called to join the worldwide ministry of Ambassadors for Christ International. AFCI is a fellowship of preachers and teachers of God’s Word who seek to serve the Church of Jesus Christ as catalysts for genuine spiritual revival and world evangelism, primarily through itinerant preaching ministries. Al works with AFCI out of its office in Atlanta, Georgia having an extensive preaching\/teaching ministry that reaches around the world. His ministry in the local churches encompasses many denominations across the United States and in other countries, where he has presented the unsearchable riches of Christ from God’s Word in more than 50 countries. For more than thirty five years Al has been privileged to preach, teach, and minister across the USA, Europe, India, Canada, Africa, Asia, Australia, the Pacific nations, and in countries behind the former Iron Curtain.\r\n\" I perceive that this man is a prophet who has a word for this generation….\" - Vance Havner  \/ \"My friend and brother Al Whittinghill has been touched with a live coal. He truly points the way and also leads the way. \"A man whose heart the Lord has touched\" 1 Sam.10:26. Hear him.\" - Leonard Ravenhill",
            "_scripture": []
        },
        {
            "title": "Take Heed Your Are Not Deceived",
            "url": "http:\/\/api.sermonindex.net\/SID27161",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27161-download",
            "preacher_name": "Derek Prince",
            "preacher_image": "",
            "preacher_description": "Derek Prince (1915 - 2003)\r\nListen to freely downloadable audio sermons by the speaker Derek Prince in mp3 format. Derek's main gift of explaining the Bible and its teaching in a clear and simple way has helped build a foundation of faith in millions of lives. His non-denominational, non-sectarian approach has made his teaching equally relevant and helpful to people from all racial and religious backgrounds. He is the author of over 50 books, 600 audio and 100 video teachings, many of which have been translated and published in more than 100 languages. His daily radio broadcast is translated into Arabic, Chinese (Amoy, Cantonese, Mandarin, Shanghaiese, Swatow), Croatian, German, Malagasy, Mongolian, Russian, Samoan, Spanish and Tongan. The radio program continues to touch lives around the world.\r\nDerek Prince Ministries persists in reaching out to believers in over 140 countries with Derek's teachings, fulfilling the mandate to keep on \"until Jesus returns.\"",
            "_scripture": []
        },
        {
            "title": "The Bible Versus Your God",
            "url": "http:\/\/api.sermonindex.net\/SID20081",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20081-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        },
        {
            "title": "The Great Deception",
            "url": "http:\/\/api.sermonindex.net\/SID24580",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24580-download",
            "preacher_name": "Jon Couch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Power and Danger of Deception",
            "url": "http:\/\/api.sermonindex.net\/SID12804",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "This sermon was preached at a church that had been falling into a deceptive doctrine called the \"Third Day\". The problem with the Third Day doctrine was detected when I attended several classes on the subject, learning that the direction of this particular teaching stressed the second coming of the Lord Jesus Christ not in bodily form, but rather in the Church, the body of Christ. I love dearly all those who have so far been teaching this mistaken doctrine. I love dearly the pastor of the church in which this sermon was preached and only pray that by way of this humble and inadequate admonition, men and women within the body of Christ would stir themselves to watching and prayer, becoming vigorous students of the Word of God, quick to discern truth from error, and that the name of the Lord Jesus Christ and His eternal gospel would advance throughout our lifetime.",
            "download": "http:\/\/api.sermonindex.net\/SID12804-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The deception of the heart",
            "url": "http:\/\/api.sermonindex.net\/SID24359",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24359-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        },
        {
            "title": "Three Battlefronts: Deception",
            "url": "http:\/\/api.sermonindex.net\/SID25953",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25953-download",
            "preacher_name": "Scott Moreau",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "When Signs Point in the Wrong Direction",
            "url": "http:\/\/api.sermonindex.net\/SID15794",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:13-14",
            "topic": "Deception",
            "description": "June 3, 2007 - We are living in a time when the bride of Christ is looking in the wrong direction and her heart is looking back at the world she should have left behind. Jesus makes a clear declaration for His church on this side of eternity that we are the salt of the earth and the light in a dark world. If our heart is one with God's heart, God will work supernaturally through us and we will become a living testimony for the redemption of man. The very life we live should create a thirst for the living God and His light should be seen in us.",
            "download": "http:\/\/api.sermonindex.net\/SID15794-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Will God's Elect Be Deceived?",
            "url": "http:\/\/api.sermonindex.net\/SID1480",
            "size": "5603383",
            "format": "mp3",
            "scripture": "Matthew 24:24",
            "topic": "Deception",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1480-download",
            "preacher_name": "B.B. Caldwell",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        }
    ]
}