{
    "name": "Defeat",
    "description": "",
    "sermons": [
        {
            "title": "Reason for Defeat",
            "url": "http:\/\/api.sermonindex.net\/SID12264",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 6",
            "topic": "Defeat",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12264-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Success That Leads To Defeat And Failure",
            "url": "http:\/\/api.sermonindex.net\/SID25957",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Defeat",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25957-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "When Defeat Becomes Doctrine",
            "url": "http:\/\/api.sermonindex.net\/SID1390",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 6:11-12",
            "topic": "Defeat",
            "description": "Great message! If there were really revival in America, people would be walking in Victory over sin. \"Defeat\" has become doctrine in far too many churches. This is another powerful rebuke toward \"false\" Christianity. A \"must hear\" for any Christian.",
            "download": "http:\/\/api.sermonindex.net\/SID1390-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Judges",
                    "chapter": "6"
                }
            ]
        }
    ]
}