{
    "name": "Devil",
    "description": "",
    "sermons": [
        {
            "title": "A Letter from the Devil",
            "url": "http:\/\/api.sermonindex.net\/SID16332",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16332-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "Our Adversary The Devil And His Angels",
            "url": "http:\/\/api.sermonindex.net\/SID21276",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21276-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        },
        {
            "title": "The Devil In Your Tent",
            "url": "http:\/\/api.sermonindex.net\/SID27926",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27926-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Devil's Afterclap",
            "url": "http:\/\/api.sermonindex.net\/SID27457",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27457-download",
            "preacher_name": "Ray Greenly",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Enemy The Devil",
            "url": "http:\/\/api.sermonindex.net\/SID4636",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 5:8-9",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4636-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Gospel Of The Devil! Believe It Not",
            "url": "http:\/\/api.sermonindex.net\/SID14477",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 3:4",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID14477-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Three Battlefronts: The Devil",
            "url": "http:\/\/api.sermonindex.net\/SID25954",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25954-download",
            "preacher_name": "Scott Moreau",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Why The Devil Hates You",
            "url": "http:\/\/api.sermonindex.net\/SID19851",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Devil",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19851-download",
            "preacher_name": "Dana Carpenter",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}