{
    "name": "Disciple",
    "description": "",
    "sermons": [
        {
            "title": "A Certain Disciple",
            "url": "https:\/\/sermonindex.info\/SID25506",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 9:10-19",
            "topic": "Disciple",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25506-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Disciple Whom Jesus Loved",
            "url": "https:\/\/sermonindex.info\/SID18772",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Disciple",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18772-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "The Disciple who loved Jesus and the One Jesus Loved",
            "url": "https:\/\/sermonindex.info\/SID5420",
            "size": "0",
            "format": "mp3",
            "scripture": "John 21, Matthew 26:31",
            "topic": "Disciple",
            "description": "Roy Hession points out the difference between being a disciple who loves Jesus (i.e., Peter) versus one loved by Jesus (i.e., John).  When our relationship to the Lord is like Peter, the self appointed leader, not a sheep among sheep, God will allow us to fall and fail.  The last 10 minutes starts a new sermon \"Forgiven Much or Forgiven Little\" in which Hession contrasts two classes of Christians out of Luke chapter 7.",
            "download": "https:\/\/sermonindex.info\/SID5420-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "26"
                },
                {
                    "book": "John",
                    "chapter": "21"
                }
            ]
        }
    ]
}