{
    "name": "Division",
    "description": "",
    "audio_sermons": [
        {
            "title": "Call No Man Common or Unclean",
            "url": "http:\/\/sermonindex.net\/SID2794",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 10:9-16",
            "topic": "Division",
            "description": "We who profess the name of Christ are defining him to a world that is lost by whatever we say or do. The world sees a church splintered by division, into numerous denominations and differences in their interpretation of scripture. Too many refuse to fellowship with one another because of their differences. Their is no scripture to condone such division and denominational loyalty. There is one Lord, one faith, and one baptism. A convicting message on dealing with our prejudices. By the way believers live their lives they represent Christ to the world who watches with suspicion. Peter had a hard time dealing with the acceptance of the Gentiles, and learning to share God with them. The Jews had long held the belief God was theirs alone. The Lord revolutionized Peter's and the apostles' thinking when he gave the Holy Ghost to the Gentiles, too. May he revolutionize ours as well. This is one of the best messages on unity in the Body of Christ, and the need for it, ever preached by anyone.",
            "download": "http:\/\/sermonindex.net\/SID2794-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Every House Divided Against Itself Shall Not Stand!",
            "url": "http:\/\/sermonindex.net\/SID23811",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Division",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23811-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        },
        {
            "title": "Facing A Moment Of Bitter Division",
            "url": "http:\/\/sermonindex.net\/SID28343",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Division",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28343-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Foot Washing",
            "url": "http:\/\/sermonindex.net\/SID3675",
            "size": "0",
            "format": "mp3",
            "scripture": "John 13:3-17",
            "topic": "Division",
            "description": "This message can be greatly misinterpreted if one does not know Wilkerson's teachings. It is about division in the Body of Christ. We should not be so quick to judge one another for doctrinal issues that are not pertaining to \"life and godliness.\" This message is NOT intended to make people think they should overlook clear doctrinal error. It is, rather, a message to those who might be becoming a bit \"self-righteous\" in judging others for things that Jesus never considered important.",
            "download": "http:\/\/sermonindex.net\/SID3675-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Great Divide",
            "url": "http:\/\/sermonindex.net\/SID8758",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 65:11-15",
            "topic": "Division",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8758-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "65"
                }
            ]
        }
    ]
}