{
    "name": "Doing Good",
    "description": "",
    "audio_sermons": [
        {
            "title": "After God´s heart",
            "url": "http:\/\/sermonindex.net\/SID3286",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 12:21",
            "topic": "Doing Good",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3286-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "The Power To Do Good Is In Your Hand",
            "url": "http:\/\/sermonindex.net\/SID18786",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 3:19-27",
            "topic": "Doing Good",
            "description": "March 22, 2009 - This message is for those who are struggling with something that is threatening to captivate you and for those whom Satan is desiring to lock in a prison of fear. The question we ask is, \"Do you trust in the midst of the storm?\" We must be gripped with the knowledge that God is in TOTAL CONTROL of everything that is going on around us. In times of calamity it is our human tendency to focus on ourselves and withdraw our hand from the needy around us. As children of God we are admonished not to withdraw our hands in self preservation, but rather to stretch out our hand to the poor and needy. There is power in our hand to do good because Christ's hands stretch forth through us to offer comfort and consolation to those who don't know Him!",
            "download": "http:\/\/sermonindex.net\/SID18786-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "3"
                }
            ]
        }
    ]
}