{
    "name": "Doubt",
    "description": "",
    "sermons": [
        {
            "title": "Actuality or Reality",
            "url": "https:\/\/sermonindex.info\/SID26197",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Doubt",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26197-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Doubt, The Sin God Hates the Most",
            "url": "https:\/\/sermonindex.info\/SID3596",
            "size": "14377984",
            "format": "mp3",
            "scripture": "Psalms 106:6-7",
            "topic": "Doubt",
            "description": "Using the children of Israel, wandering in the desert, Wilkerson explains how it is that doubt in God is the sin that He hates the most.  Even though the cloud of God was present and miracles aboundedÂ…  the children of Israel sinned often by simply doubting what God can do.",
            "download": "https:\/\/sermonindex.info\/SID3596-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        },
        {
            "title": "When Someone Doubts",
            "url": "https:\/\/sermonindex.info\/SID22300",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Doubt",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22300-download",
            "preacher_name": "C.J. Mahaney",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}