{
    "name": "El Elyon",
    "description": "",
    "sermons": [
        {
            "title": "The Transcendence of El Elyon",
            "url": "http:\/\/api.sermonindex.net\/SID20212",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 91",
            "topic": "El Elyon",
            "description": "The principal names of GOD, found in Psalm 91:1-2, gather up the unique glory that belongs to Him. They deserve attention as they show us what God is in His inmost nature. In this message focus is on “the Most High God”, EL Elyon, meaning one who is “elevated, or lofty.” He is Supreme One, MOST HIGH above all created beings in heaven and earth – a Divine transcendence that sees Him exalted so far above the universe He created that human thought cannot even imagine it. You can trust El Elyon to unfailingly furnish you with all you will ever need in order to fulfil His will.",
            "download": "http:\/\/api.sermonindex.net\/SID20212-download",
            "preacher_name": "Aeron Morgan",
            "preacher_image": "",
            "preacher_description": "Aeron Morgan (1934 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Aeron Morgan in mp3 format. Aeron Morgan is a Welshman, born in Aberaman in the Aberdare Valley, South Wales. Raised in a Christian home, his godly parents had a great influence on his life, and he was converted at a very early age in the local Pentecostal Mission. The assembly was truly a 'sending church,' privileged to see many go forth as missionaries, pastors, and evangelists to different parts of the world. \r\nFrom his parents, and a through steady stream of others touched by God,  brother Morgan's early life was enriched by redeemed drunkards, itinerant preachers who would stay with the Morgans when Aeron was young, ( one of whom would lead him into personal, devotional Bible studies,\"We will just study the book of Colossians this week, alright Aeron?\"), and devout Pentecostal christians of all walks of life who stamped their impression on this man of God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "91"
                }
            ]
        }
    ]
}