{
    "name": "Encouragement",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Haggai) Discouragement And Encouragement",
            "url": "http:\/\/sermonindex.net\/SID14739",
            "size": "0",
            "format": "mp3",
            "scripture": "Haggai 2:1-9",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14739-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Haggai",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "A Date To Remember",
            "url": "http:\/\/sermonindex.net\/SID24337",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24337-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "A Message for Those Who Have Little Left to Give",
            "url": "http:\/\/sermonindex.net\/SID24634",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24634-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Being an Encourager",
            "url": "http:\/\/sermonindex.net\/SID10962",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 10:24, Philippians 2:3",
            "topic": "Encouragement",
            "description": "Miscommunication can take the best-intentioned encouragement and turn it to discouragement. Therefore love must overrule in all attempts to encourage. Verwer warns of the danger of \"making the narrow road narrower than it is!\" Forgetfulness and extremism are to be avoided. The importance of prayer combined with writing letters cannot be underestimated. Visiting people whenever possible is vital to the encouragement process.",
            "download": "http:\/\/sermonindex.net\/SID10962-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Colossians - Encourage Your Hearts",
            "url": "http:\/\/sermonindex.net\/SID26714",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26714-download",
            "preacher_name": "Mariano Di Gangi",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "David Gaining Strength and Encouragement in the Lord Part 1",
            "url": "http:\/\/sermonindex.net\/SID25654",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25654-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "David Gaining Strength and Encouragement in the Lord Part 2",
            "url": "http:\/\/sermonindex.net\/SID25655",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25655-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Encouragement",
            "url": "http:\/\/sermonindex.net\/SID21823",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21823-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": []
        },
        {
            "title": "Encouragement",
            "url": "http:\/\/sermonindex.net\/SID23295",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23295-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Encouraging Yourself in the Lord",
            "url": "http:\/\/sermonindex.net\/SID9206",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 30:6",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9206-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Talking To Yourself",
            "url": "http:\/\/sermonindex.net\/SID24902",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24902-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "The World's Greatest Ministry",
            "url": "http:\/\/sermonindex.net\/SID22519",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22519-download",
            "preacher_name": "William Carrol",
            "preacher_image": "",
            "preacher_description": "William Carrol ( - )\r\nListen to freely downloadable audio sermons by the speaker William Carrol in mp3 format. Pastor William Carrol is an associate pastor and longtime “spiritual son” of the Times Square Church family. Shortly after his salvation, Pastor David Wilkerson, recognized the strong call of God on his life and sent him to Bible college and seminary for ministerial training.\r\nWhile completing his studies, Pastor William served as a co-pastor and later as senior pastor of Denver Fellowship in Colorado. He holds a masters degree in philosophy of religion. In 2005, Pastor William was invited to “come home” and serve on the pastoral staff of Times Square Church.",
            "_scripture": []
        },
        {
            "title": "Three Encouragements",
            "url": "http:\/\/sermonindex.net\/SID25449",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25449-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": []
        },
        {
            "title": "We Do Not Lose Heart",
            "url": "http:\/\/sermonindex.net\/SID24336",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24336-download",
            "preacher_name": "Daniel Henderson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "When You Can't Go On",
            "url": "http:\/\/sermonindex.net\/SID24325",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24325-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        }
    ]
}