{
    "name": "End Of The World",
    "description": "",
    "audio_sermons": [
        {
            "title": "A Whole New World is Coming",
            "url": "http:\/\/sermonindex.net\/SID2833",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 16:11; Jude 24-25,2 Peter 3:7-14",
            "topic": "End Of The World",
            "description": "This message is about how things will change for the better when Jesus suddenly stops time and eternity begins. This message is meant to bring peace and security to the believer's heart. No matter how bad things will be on earth when the Lord comes, look up, this is not your world. God wants you to know who you are in Christ, and that he loves you and yes, you can make it.",
            "download": "http:\/\/sermonindex.net\/SID2833-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "2 Peter",
                    "chapter": "3"
                },
                {
                    "book": "Psalm",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Looking In Three Directions",
            "url": "http:\/\/sermonindex.net\/SID19263",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 17:22, Luke 21:26",
            "topic": "End Of The World",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19263-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "17"
                },
                {
                    "book": "Luke",
                    "chapter": "21"
                }
            ]
        }
    ]
}