{
    "name": "Enoch",
    "description": "",
    "sermons": [
        {
            "title": "(Genesis #7) Enoch Walked With God",
            "url": "https:\/\/sermonindex.info\/SID4837",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Enoch",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4837-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "(Genesis) 13 - The Reign of the Grim Reaper and the Rapture of Enoch",
            "url": "https:\/\/sermonindex.info\/SID12939",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 5:1-32",
            "topic": "Enoch",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12939-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Hebrews) 5-Abel and Enoch",
            "url": "https:\/\/sermonindex.info\/SID14728",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:4-6",
            "topic": "Enoch",
            "description": "A brief exhortation to follow the examples of Abel and Enoch, who by faith became witnesses to the truth that God is the rewarder of those who diligently seek Him.",
            "download": "https:\/\/sermonindex.info\/SID14728-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Men God Made) Enoch",
            "url": "https:\/\/sermonindex.info\/SID16305",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Enoch",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID16305-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": []
        },
        {
            "title": "Enoch",
            "url": "https:\/\/sermonindex.info\/SID19125",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Enoch",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19125-download",
            "preacher_name": "John Hunter",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Jude #7 - Enoch",
            "url": "https:\/\/sermonindex.info\/SID12156",
            "size": "0",
            "format": "mp3",
            "scripture": "Jude 1:14-15",
            "topic": "Enoch",
            "description": "Enoch was the first prophet that we know of from the scripture, but why is he mentioned in an epistle about apostacy?  Because this is exactly what Enoch prophesied against, Enoch was given a reveltaion from God that caused him to name his son Methuselah (whose name means 'when he dies judgement shall be sent'), no wonder Enoch walked with God after Methusaleh was born.  And yet Methuselah is a model of the Lord's grace because he is oldest man in the scripture. Interestingly some rabinical sources claim that Methuselah died one week before the flood, just when Noah entered into the Ark, we do know from the scripture that Methuselah died in the same year as the flood.  Enoch confronted the apostates of his day and some signs of apostacy are murmering, just as Israel did at the beginning of Jude, complaining as the angels did, and going after their own lusts just as Sodom and Gomorah did.",
            "download": "https:\/\/sermonindex.info\/SID12156-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jude",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Walking With God - Enoch",
            "url": "https:\/\/sermonindex.info\/SID27116",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Enoch",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27116-download",
            "preacher_name": "Doc Greenway",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}