{
    "name": "Esau",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Genesis) 41 - Esau's Profane Act",
            "url": "http:\/\/sermonindex.net\/SID13030",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 25:27-34",
            "topic": "Esau",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13030-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "(Genesis) 52 - Lessons from the Generations of Esau",
            "url": "http:\/\/sermonindex.net\/SID13095",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 36:1-43",
            "topic": "Esau",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13095-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "36"
                }
            ]
        },
        {
            "title": "Esau Lost His Birthright",
            "url": "http:\/\/sermonindex.net\/SID25722",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Esau",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25722-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "From The Hands Of Esau",
            "url": "http:\/\/sermonindex.net\/SID1534",
            "size": "3350528",
            "format": "mp3",
            "scripture": "",
            "topic": "Esau",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1534-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        }
    ]
}