{
    "name": "Established Church",
    "description": "",
    "audio_sermons": [
        {
            "title": "When Revival Bypasses The Established Church",
            "url": "http:\/\/sermonindex.net\/SID25505",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:1-13",
            "topic": "Established Church",
            "description": "Brother EA shares his heart towards revival in the nation of America and the sad state of the formal established denominational churches. He shows how God works outside the box in a New Thing and that God always raises up preachers to minister His truth whether or not they are accepted by the masses. This is an important message to bring many to repentance and to support and proclaim the gospel in its purity and power in our day.",
            "download": "http:\/\/sermonindex.net\/SID25505-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        }
    ]
}