{
    "name": "Evil",
    "description": "",
    "sermons": [
        {
            "title": "Elisha's Prediction of Evil",
            "url": "http:\/\/sermonindex.net\/SID25721",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evil",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25721-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Evil Is At The Gate",
            "url": "http:\/\/sermonindex.net\/SID27806",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5, Galatians 6:7",
            "topic": "Evil",
            "description": "Carter Conlon speaks of the great moral and spiritual evil at the doorstep of the Church and America. He speaks of the history of sins in the culture of America and in the Church including slavery. Evil is becoming good and good is becoming evil. It is time to turn away godless false religion and seek God in prayer now because evil is at the gate.",
            "download": "http:\/\/sermonindex.net\/SID27806-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                },
                {
                    "book": "Galatians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Evils of Postponed Living",
            "url": "http:\/\/sermonindex.net\/SID5712",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evil",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5712-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "I Will Fear No Evil",
            "url": "http:\/\/sermonindex.net\/SID2514",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 23:4",
            "topic": "Evil",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2514-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "What can turn the tide of evil",
            "url": "http:\/\/sermonindex.net\/SID23994",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evil",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23994-download",
            "preacher_name": "David Watson II",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Why Does God Permit Evil In The World?",
            "url": "http:\/\/sermonindex.net\/SID12490",
            "size": "0",
            "format": "mp3",
            "scripture": "Habakkuk 1-3",
            "topic": "Evil",
            "description": "Pastor Fuller explains that sometimes we need to trust God 's Holy hand even though we can not see it. Will not the Lord of all the earth do right? We must try and look at things by the eyes of faith from God's perspective.",
            "download": "http:\/\/sermonindex.net\/SID12490-download",
            "preacher_name": "Charles E. Fuller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Habakkuk",
                    "chapter": "1"
                }
            ]
        }
    ]
}