{
    "name": "Evolution",
    "description": "",
    "sermons": [
        {
            "title": "Digestive System",
            "url": "http:\/\/api.sermonindex.net\/SID0553",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evolution",
            "description": "While the stomach has the need to digest and break down food into its component nutrients, so also the mind is a digestive system designed to break information down into satisfying informative components.  As food is flavored by salts and spices for our pleasure in just the right amounts, so also our conversation ought to be seasoned by just the right amount of salt.  As Christ told the disciples to not waste a bit of the bread he broke, so also he wastes nothing in our spiritual upbringing.  Jesus was perfectly efficient.  He cares about efficiency in his creation.  Smith explains how the human digestive system is obviously the product of incredibly careful thought and intention.   He also explains how the theory of evolution is quite simply wasteful, and inefficient.  Wilder shows that where the digestive system is hungry for nutrients, so also the mind is hungry for meaning.",
            "download": "http:\/\/api.sermonindex.net\/SID0553-download",
            "speaker_name": "Dr. A.E. WilderSmith",
            "_scripture": []
        },
        {
            "title": "Evolution & Causation",
            "url": "http:\/\/api.sermonindex.net\/SID27558",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 6:3",
            "topic": "Evolution",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27558-download",
            "speaker_name": "John Follette",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Evolution or Creation",
            "url": "http:\/\/api.sermonindex.net\/SID0542",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1",
            "topic": "Evolution",
            "description": "In the debate between creation vs. evolution, the fundamental nail in evolution theories coffin is the field of study known as information science.  All existing life exists as a result of information, organized information.  Statistical analysts understand that information does not arise by chance.  AE Wilder-Smith shows in this discussion how to understand information theory, and how it proves creationism to be the only logical viewpoint.  Matter is not self-organizing; it is merely a medium for information.   Smith discusses the classic debate between Bishop Wilberforce and Aldous Huxley concerning the watch-maker.  He shows the fallacy of Huxley’s argument.  If you are not familiar with this debate it is a rather essential understanding in order to unravel the Gordian-Knot of evolution theory.  Smith argues in this teaching how important creationism understandings are because man is accountable to God upon the basis of God being revealed through nature.",
            "download": "http:\/\/api.sermonindex.net\/SID0542-download",
            "speaker_name": "Dr. A.E. WilderSmith",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Origin of Man in Relation to the Theory of Evolution",
            "url": "http:\/\/api.sermonindex.net\/SID1239",
            "size": "5675520",
            "format": "mp3",
            "scripture": "",
            "topic": "Evolution",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1239-download",
            "speaker_name": "John Murray",
            "_scripture": []
        },
        {
            "title": "Pilgrims Problems No. 10 Evolution",
            "url": "http:\/\/api.sermonindex.net\/SID22680",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evolution",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22680-download",
            "speaker_name": "Willie Mullan",
            "_scripture": []
        },
        {
            "title": "Pilgrims Problems No. 11 Evolution",
            "url": "http:\/\/api.sermonindex.net\/SID22681",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Evolution",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22681-download",
            "speaker_name": "Willie Mullan",
            "_scripture": []
        }
    ]
}