{
    "name": "Faith",
    "description": "",
    "sermons": [
        {
            "title": "(2 Peter) Precious Faith",
            "url": "http:\/\/sermonindex.net\/SID7178",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Peter 1:1-2",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7178-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "2 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Hebrews) 8-Faith",
            "url": "http:\/\/sermonindex.net\/SID14731",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:6",
            "topic": "Faith",
            "description": "This final message summarizes and recapitulates the entire series in a sweeping biblical survey showing that without faith it is impossible to please God, but all things are possible to him who believes!",
            "download": "http:\/\/sermonindex.net\/SID14731-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Luke) 25 - The Stormy Sea",
            "url": "http:\/\/sermonindex.net\/SID15125",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 8:19-25",
            "topic": "Faith",
            "description": "What is faith?  What does it mean to really believe?  The stormy sea is Jesus' \"lab\" that followed the lecture on the parable of the sower.  Many times the Lord does great things in our lives not because we have great faith but to encourage us in the little faith that we have.",
            "download": "http:\/\/sermonindex.net\/SID15125-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(Radical Jesus) 26 Radical Faith",
            "url": "http:\/\/sermonindex.net\/SID28012",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28012-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "(Radical Jesus) 27 Radical Faith",
            "url": "http:\/\/sermonindex.net\/SID28013",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28013-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "(Radical Jesus) 28 Radical Faith",
            "url": "http:\/\/sermonindex.net\/SID28014",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28014-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Call To Faith",
            "url": "http:\/\/sermonindex.net\/SID16331",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16331-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "A Crisis Of Faith",
            "url": "http:\/\/sermonindex.net\/SID3969",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 4:1,1 Peter 1:6",
            "topic": "Faith",
            "description": "May 16, 2004 - We are facing in the Church of Jesus Christ a crisis of faith. The hardest part of faith is the last half hour and just before the victory we give up turning away from God with a evil heart of unbelief. God will lead us into places where we are shut up and nothing short of a miracle will get us out of the situation. It is in these places of hopeless crisis that God will come through to glorify His name. We must stand on the promises of God with a heart full of faith declaring that God is faithful. Pastor Wilkerson examines the lives of Saul, Solomon and Samson as men of God who went into a crises of faith and failed the test. Our faith will be tried, as by fire. If your faith is being tested, you should listen carefully to this message.",
            "download": "http:\/\/sermonindex.net\/SID3969-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                },
                {
                    "book": "1 Timothy",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "A Declaration of the Faith",
            "url": "http:\/\/sermonindex.net\/SID12706",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12706-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "A Declaration of the Faith - Part 6",
            "url": "http:\/\/sermonindex.net\/SID3816",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "The true faith exposes the end-time apostasy, which is producing \"Christian\" lawlessnes. It opposes amusements and entertainments. The faith is safe, sound security that is conditional. The faith is opposed to any involvement in witchcraft, yet believes in the miraculous. The faith is expressed in modesty and simplicity. The faith is unity in the true body of Christ.",
            "download": "http:\/\/sermonindex.net\/SID3816-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "A Faith That Does Not Save",
            "url": "http:\/\/sermonindex.net\/SID0705",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0705-download",
            "preacher_name": "Danny Bond",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Word of Faith",
            "url": "http:\/\/sermonindex.net\/SID25007",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25007-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        },
        {
            "title": "A Working Faith: Arrogant Presumption Exposed",
            "url": "http:\/\/sermonindex.net\/SID4743",
            "size": "0",
            "format": "mp3",
            "scripture": "James 4:11-12",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4743-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "A test of faith",
            "url": "http:\/\/sermonindex.net\/SID24360",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24360-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        },
        {
            "title": "ABRAHAM Example of Faith",
            "url": "http:\/\/sermonindex.net\/SID23840",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23840-download",
            "preacher_name": "Billy Strachen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Abraham's Faith",
            "url": "http:\/\/sermonindex.net\/SID20943",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20943-download",
            "preacher_name": "Dennis Kinlaw",
            "preacher_image": "",
            "preacher_description": "Dennis Kinlaw ( - )\r\nListen to freely downloadable audio sermons by the speaker Dennis Kinlaw in mp3 format.  Dennis Franklin Kinlaw was born June 26, 1922, in Lumberton, North Carolina. He attended Asbury College, graduating in 1943, and Asbury Theological Seminary, graduating in 1946. He pursued further studies at Princeton Theological Seminary and University of Edinburgh, Scotland. He received an M.A. and Ph.D. from Brandeis University. On December 31, 1943, Kinlaw married a college classmate, Elsie Blake (Class of 1943). He was ordained in the North Carolina Conference of the United Methodist Church in 1951. (He later transferred to the Kentucky Conference.) In 1959 he served as a visiting professor at Seoul Theological College in South Korea. In 1963 he returned to Asbury Theological Seminary, this time as a professor of Old Testament history, theology, and languages.\r\nIn 1983 Kinlaw founded the Francis Asbury Society, an organization based in Wilmore, Kentucky, whose purpose is to promote the message of Scriptural holiness through evangelism, discipleship, missions outreach, and publications. Kinlaw also served as chairman of the board of the mission organization OMS International. He is an accomplished pastor, professor, administrator, evangelist, teacher, and author.",
            "_scripture": []
        },
        {
            "title": "According To Your Faith",
            "url": "http:\/\/sermonindex.net\/SID25510",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 9",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25510-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Add to Your Faith - 2 Peter",
            "url": "http:\/\/sermonindex.net\/SID25243",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Peter",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25243-download",
            "preacher_name": "Anton Bosch",
            "preacher_image": "",
            "preacher_description": "Anton Bosch ( - )\r\nListen to freely downloadable audio sermons by the speaker Anton Bosch in mp3 format.  Privileged to be born into a long line of preachers, Anton Bosch met the Lord Jesus Christ as his Saviour in 1968. In 1971 he entered the Theological College of South Africa for two years, completed the third year by correspondence and was awarded the Diploma in Theology. In 2005 he was awarded the degree Master in Theology cum laude. The title of his dissertation was â€œThe pastoral and practical principles on which the churches in the New Testament are basedâ€\u009d. He is currently working on his Ph.D. in Biblical Studies. \r\n\r\nIn 2003 he was elected to the board of the International Fellowship of Christian Believers (formerly OFFI) with responsibility for the African continent and in 2004 was asked to serve as its international president. At the end of 2003 he was called to assist Burbank Community Church (Los Angeles, California) as itâ€™s senior pastor.. In 2009 the church moved to new premises in Sun Valley and us now known as Sun Valley Community Church (SVCC). Anton continues to teach at SVCC. It has been his life-long quest to rediscover New Testament Christianity and to call Christians and churches back to knowing, believing and living the Bible. He has planted a number of churches that are based on these principles. He is passionate about a correct exegesis of the Word and specialises in expository preaching and teaching.",
            "_scripture": []
        },
        {
            "title": "All Things Are Possible To Him That Believes",
            "url": "http:\/\/sermonindex.net\/SID22220",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22220-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": []
        },
        {
            "title": "An Active Faith Necessary",
            "url": "http:\/\/sermonindex.net\/SID23834",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23834-download",
            "preacher_name": "Billy Strachen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "An Attested Faith",
            "url": "http:\/\/sermonindex.net\/SID4592",
            "size": "0",
            "format": "mp3",
            "scripture": "James 1:2-4",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4592-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "An Eclipse of Faith",
            "url": "http:\/\/sermonindex.net\/SID16653",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16653-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "Appropriation By Faith",
            "url": "http:\/\/sermonindex.net\/SID25643",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25643-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Around the World on Faith",
            "url": "http:\/\/sermonindex.net\/SID27571",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27571-download",
            "preacher_name": "John Follette",
            "preacher_image": "",
            "preacher_description": "John Follette (1883 - 1966)\r\nListen to freely downloadable audio sermons by the speaker John Follette in mp3 format. Follette was a gifted Bible teacher and author, who had both perspective and spiritual depth in his interpretation of the Word. He was an illuminated spirit in the field of spiritual reality, and had an unusual ability to impart â€œspirit and lifeâ€\u009d into those who sat under his ministry.\r\n\r\nHe received the Baptism in the Holy Spirit in 1913 while a student at a Bible School in Rochester, New York, and later became a teacher there until the school closed. He also taught for many years at Southern California Bible College. During the later years of his life, he was called into a wider field, ministering in conferences and retreats which took him around the world. He passed into his eternal reward in 1966 at the age of 82.",
            "_scripture": []
        },
        {
            "title": "Avoid These Errors (Faith Defined)",
            "url": "http:\/\/sermonindex.net\/SID25513",
            "size": "0",
            "format": "mp3",
            "scripture": "John 10:7-11",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25513-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Beginning Faith",
            "url": "http:\/\/sermonindex.net\/SID20565",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11, I Thessalonians 3:10, 2 Thessalonians 1:3-4",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20565-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                },
                {
                    "book": "2 Thessalonians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "By Faith",
            "url": "http:\/\/sermonindex.net\/SID15246",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "Just as the Galatians began by faith, then foolishly leaned back toward the works of the flesh, we too can be tempted to \"methods\" as we practice the Word of God. The danger is to become principle oriented and lose sight of the God of the principles. This message exhorts us to live BY FAITH.",
            "download": "http:\/\/sermonindex.net\/SID15246-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Characteristics of Faith",
            "url": "http:\/\/sermonindex.net\/SID20901",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20901-download",
            "preacher_name": "Dennis Kinlaw",
            "preacher_image": "",
            "preacher_description": "Dennis Kinlaw ( - )\r\nListen to freely downloadable audio sermons by the speaker Dennis Kinlaw in mp3 format.  Dennis Franklin Kinlaw was born June 26, 1922, in Lumberton, North Carolina. He attended Asbury College, graduating in 1943, and Asbury Theological Seminary, graduating in 1946. He pursued further studies at Princeton Theological Seminary and University of Edinburgh, Scotland. He received an M.A. and Ph.D. from Brandeis University. On December 31, 1943, Kinlaw married a college classmate, Elsie Blake (Class of 1943). He was ordained in the North Carolina Conference of the United Methodist Church in 1951. (He later transferred to the Kentucky Conference.) In 1959 he served as a visiting professor at Seoul Theological College in South Korea. In 1963 he returned to Asbury Theological Seminary, this time as a professor of Old Testament history, theology, and languages.\r\nIn 1983 Kinlaw founded the Francis Asbury Society, an organization based in Wilmore, Kentucky, whose purpose is to promote the message of Scriptural holiness through evangelism, discipleship, missions outreach, and publications. Kinlaw also served as chairman of the board of the mission organization OMS International. He is an accomplished pastor, professor, administrator, evangelist, teacher, and author.",
            "_scripture": []
        },
        {
            "title": "Childlike Faith (4 of 4)",
            "url": "http:\/\/sermonindex.net\/SID12978",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11",
            "topic": "Faith",
            "description": "We believe that these messages truly flesh out what is meant by the phrase, 'We walk by faith, not by sight.' Because 'faith' is so easily misunderstood this is a much needed truth.",
            "download": "http:\/\/sermonindex.net\/SID12978-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Climbing Mountains",
            "url": "http:\/\/sermonindex.net\/SID20190",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20190-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": []
        },
        {
            "title": "Communication Of Our Faith - Part 1",
            "url": "http:\/\/sermonindex.net\/SID3228",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3228-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Communication Of Our Faith - Part 2",
            "url": "http:\/\/sermonindex.net\/SID3229",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3229-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Communication Of Our Faith - Part 3",
            "url": "http:\/\/sermonindex.net\/SID3230",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3230-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Communication Of Our Faith - Part 4",
            "url": "http:\/\/sermonindex.net\/SID3231",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3231-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Communication Of Our Faith - Part 5",
            "url": "http:\/\/sermonindex.net\/SID3232",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3232-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Complete Faith",
            "url": "http:\/\/sermonindex.net\/SID17540",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 2:14, Ephesians 1, John 14:30",
            "topic": "Faith",
            "description": "Discussed here is the unregenerate soul; natural man, or animal man as Major Thomas describes man without Christ.",
            "download": "http:\/\/sermonindex.net\/SID17540-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "2"
                },
                {
                    "book": "Ephesians",
                    "chapter": "1"
                },
                {
                    "book": "John",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Contend for the Faith ",
            "url": "http:\/\/sermonindex.net\/SID21297",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21297-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Contending for the Faith",
            "url": "http:\/\/sermonindex.net\/SID24394",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24394-download",
            "preacher_name": "Jack Hudson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Does Faith Make Sense?",
            "url": "http:\/\/sermonindex.net\/SID21959",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21959-download",
            "preacher_name": "J. Edwin Orr",
            "preacher_image": "\/images\/j_edwin_orr.gif",
            "preacher_description": "J. Edwin Orr (1912 - 1987)\r\nListen to freely downloadable audio sermons by the speaker J. Edwin Orr in mp3 format. Brother Orr shared in an experience of revival in his youth as he traveled by faith and saw many powerful workings of God. After years of seeing personal revival and experiences in his ministry he studied the theme of historical revival to equip and teach the Church.\r\n\r\nHe published many books on the topic of subject of revival: \"Can God?\" \"Full Surrender\" and many others. He ministered cross-denoninationally in baptist, pentecostal, calvary chapel and in many other movements. He was also influential in the Campus Crusade for Christ organization.",
            "_scripture": []
        },
        {
            "title": "Extraordinary Faith",
            "url": "http:\/\/sermonindex.net\/SID27520",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 2:1-6",
            "topic": "Faith",
            "description": "Pastor Cymbala presents examples of Jesus performing miracles by honoring the faith of others. After hearing this short teaching, we hope you will be driven to pray for the needs of others. John 4:46-51; Mark 2:1-6",
            "download": "http:\/\/sermonindex.net\/SID27520-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Facts - The Foundation of Faith",
            "url": "http:\/\/sermonindex.net\/SID25536",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 1:3",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25536-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Faith",
            "url": "http:\/\/sermonindex.net\/SID16231",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16231-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Faith",
            "url": "http:\/\/sermonindex.net\/SID12029",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12029-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Faith",
            "url": "http:\/\/sermonindex.net\/SID15887",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15887-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        },
        {
            "title": "Faith",
            "url": "http:\/\/sermonindex.net\/SID1869",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1869-download",
            "preacher_name": "Les Wheeldon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Faith",
            "url": "http:\/\/sermonindex.net\/SID23069",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23069-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Faith (Abraham was “fully persuaded”)",
            "url": "http:\/\/sermonindex.net\/SID22900",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22900-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Faith And Works - Part 1",
            "url": "http:\/\/sermonindex.net\/SID23296",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23296-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Faith And Works - Part 2",
            "url": "http:\/\/sermonindex.net\/SID23297",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23297-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Faith In Action",
            "url": "http:\/\/sermonindex.net\/SID27707",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27707-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "Faith Made Complete",
            "url": "http:\/\/sermonindex.net\/SID15242",
            "size": "0",
            "format": "mp3",
            "scripture": "James 2",
            "topic": "Faith",
            "description": "An expository teaching on James 2, covering the subjects of partiality and of faith and works. Partiality is showing preference to someone we feel comfortable around. Faith works. Very practical definitions are given to each of these subjects.",
            "download": "http:\/\/sermonindex.net\/SID15242-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Faith May 2007",
            "url": "http:\/\/sermonindex.net\/SID16236",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16236-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Faith Series - Part 1",
            "url": "http:\/\/sermonindex.net\/SID19691",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19691-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Faith Series - Part 2",
            "url": "http:\/\/sermonindex.net\/SID19692",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19692-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Faith That Faints Not",
            "url": "http:\/\/sermonindex.net\/SID23321",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23321-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Faith That Overcomes",
            "url": "http:\/\/sermonindex.net\/SID18303",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18303-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Faith That Works",
            "url": "http:\/\/sermonindex.net\/SID25537",
            "size": "0",
            "format": "mp3",
            "scripture": "James 2:17",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25537-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Faith That Works",
            "url": "http:\/\/sermonindex.net\/SID3325",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3325-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Faith That Works",
            "url": "http:\/\/sermonindex.net\/SID18553",
            "size": "0",
            "format": "mp3",
            "scripture": "James 2:17-23",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18553-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Faith To Give and Receive",
            "url": "http:\/\/sermonindex.net\/SID27784",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27784-download",
            "preacher_name": "R. Edward Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Faith To Leave The Gas Station",
            "url": "http:\/\/sermonindex.net\/SID3939",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 10:17, Hebrews 4:2, 1 Peter 2:1",
            "topic": "Faith",
            "description": "We are reminded here that we can have all the Biblical knowledge possible, yet still be empty.  You must have a personal relationship with Jesus to go out and serve Him. He uses a lot of Scripture confirming this and also shares how one can find such a relationship with Christ.",
            "download": "http:\/\/sermonindex.net\/SID3939-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "10"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                },
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Faith Towards God",
            "url": "http:\/\/sermonindex.net\/SID17251",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17251-download",
            "preacher_name": "Anton Bosch",
            "preacher_image": "",
            "preacher_description": "Anton Bosch ( - )\r\nListen to freely downloadable audio sermons by the speaker Anton Bosch in mp3 format.  Privileged to be born into a long line of preachers, Anton Bosch met the Lord Jesus Christ as his Saviour in 1968. In 1971 he entered the Theological College of South Africa for two years, completed the third year by correspondence and was awarded the Diploma in Theology. In 2005 he was awarded the degree Master in Theology cum laude. The title of his dissertation was â€œThe pastoral and practical principles on which the churches in the New Testament are basedâ€\u009d. He is currently working on his Ph.D. in Biblical Studies. \r\n\r\nIn 2003 he was elected to the board of the International Fellowship of Christian Believers (formerly OFFI) with responsibility for the African continent and in 2004 was asked to serve as its international president. At the end of 2003 he was called to assist Burbank Community Church (Los Angeles, California) as itâ€™s senior pastor.. In 2009 the church moved to new premises in Sun Valley and us now known as Sun Valley Community Church (SVCC). Anton continues to teach at SVCC. It has been his life-long quest to rediscover New Testament Christianity and to call Christians and churches back to knowing, believing and living the Bible. He has planted a number of churches that are based on these principles. He is passionate about a correct exegesis of the Word and specialises in expository preaching and teaching.",
            "_scripture": []
        },
        {
            "title": "Faith Vs. Unbelief",
            "url": "http:\/\/sermonindex.net\/SID18398",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18398-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Faith and Revival",
            "url": "http:\/\/sermonindex.net\/SID26213",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26213-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Faith and Sight",
            "url": "http:\/\/sermonindex.net\/SID23501",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:1-6",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23501-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Faith in Impossible Situations",
            "url": "http:\/\/sermonindex.net\/SID3882",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3882-download",
            "preacher_name": "Hoseah Wu",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Faith of Soldiers",
            "url": "http:\/\/sermonindex.net\/SID21300",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21300-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Faith vs Sight",
            "url": "http:\/\/sermonindex.net\/SID26922",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26922-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Faith vs. Works",
            "url": "http:\/\/sermonindex.net\/SID1588",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1588-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "Faith, Hope, and Love",
            "url": "http:\/\/sermonindex.net\/SID22788",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22788-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Faith, New Birth, Witness of the Spirit",
            "url": "http:\/\/sermonindex.net\/SID24387",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24387-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        },
        {
            "title": "Faith: True Or False?",
            "url": "http:\/\/sermonindex.net\/SID22243",
            "size": "0",
            "format": "mp3",
            "scripture": "James 2:14",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22243-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Feet First",
            "url": "http:\/\/sermonindex.net\/SID17594",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 10:38-42",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17594-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Five Stones - Part 1",
            "url": "http:\/\/sermonindex.net\/SID26139",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26139-download",
            "preacher_name": "Bakht Singh",
            "preacher_image": "\/images\/bakht_singh.gif",
            "preacher_description": "Bakht Singh (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Bakht Singh in mp3 format. He is often regarded as one of the most well-known bible teachers and preachers and pioneers of the Indian Church movements. He was India's foremost evangelist, preacher and indigenous church planter who founded churches based on New Testament principles. He began a worldwide indigenous church-planting movement in India that eventually saw more than 10,000 local churches. Norman Grubb missionary statesman, author and teacher: \"In all my missionary experience I think these churches on their New Testament foundations are the nearest I have seen to a replica of the early church and a pattern for the birth and growth of the young churches in all the countries which we used to talk about as mission fields.\"\r\nLife of prayer. Brother Bakht Singh was a man of prayer. He spent hours upon his knees in communion with the Lord seeking the Lord's mind regarding His will concerning the work and ministry. Therefore, the Lord also honored him and blessed him beyond any human understanding. This is one of the reasons why the Lord has used him so mightily for the edification of His Body and for the extension of His glorious kingdom both in India and abroad.",
            "_scripture": []
        },
        {
            "title": "Five Stones - Part 2",
            "url": "http:\/\/sermonindex.net\/SID26140",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26140-download",
            "preacher_name": "Bakht Singh",
            "preacher_image": "\/images\/bakht_singh.gif",
            "preacher_description": "Bakht Singh (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Bakht Singh in mp3 format. He is often regarded as one of the most well-known bible teachers and preachers and pioneers of the Indian Church movements. He was India's foremost evangelist, preacher and indigenous church planter who founded churches based on New Testament principles. He began a worldwide indigenous church-planting movement in India that eventually saw more than 10,000 local churches. Norman Grubb missionary statesman, author and teacher: \"In all my missionary experience I think these churches on their New Testament foundations are the nearest I have seen to a replica of the early church and a pattern for the birth and growth of the young churches in all the countries which we used to talk about as mission fields.\"\r\nLife of prayer. Brother Bakht Singh was a man of prayer. He spent hours upon his knees in communion with the Lord seeking the Lord's mind regarding His will concerning the work and ministry. Therefore, the Lord also honored him and blessed him beyond any human understanding. This is one of the reasons why the Lord has used him so mightily for the edification of His Body and for the extension of His glorious kingdom both in India and abroad.",
            "_scripture": []
        },
        {
            "title": "Footsteps in the Hallway",
            "url": "http:\/\/sermonindex.net\/SID15555",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 21:18-22",
            "topic": "Faith",
            "description": "April 29, 2007 - When we live outside of the boundaries of God’s Word we will end up with a life of fruitless religion, and a manmade covering. The true life of Christ will be shut off to every man or woman who comes through Christ through human effort and human intellect. What we could never accomplish in a lifetime, God did in one day by sending His son to be a covering for all of our sins and to empower us to glorify His name through the Holy Spirit. At the end of your life you want to be sure that it is God’s footsteps coming to take you home with Him.",
            "download": "http:\/\/sermonindex.net\/SID15555-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Four Anchors",
            "url": "http:\/\/sermonindex.net\/SID20534",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 27:1-23",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20534-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "Freedom in Faith",
            "url": "http:\/\/sermonindex.net\/SID10287",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 15:19-22",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10287-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Genesis #25 Ch. 46-48 & 50 Jacob's & Joseph's Faith",
            "url": "http:\/\/sermonindex.net\/SID12152",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 46-48",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12152-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "46"
                }
            ]
        },
        {
            "title": "Get Out Of The Box!",
            "url": "http:\/\/sermonindex.net\/SID19738",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19738-download",
            "preacher_name": "Andrew Strom",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Getting the Report",
            "url": "http:\/\/sermonindex.net\/SID26216",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26216-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Give me this mountain",
            "url": "http:\/\/sermonindex.net\/SID15888",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15888-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        },
        {
            "title": "God Bless The Small - Part 1",
            "url": "http:\/\/sermonindex.net\/SID20498",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20498-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        },
        {
            "title": "God Bless The Small - Part 2",
            "url": "http:\/\/sermonindex.net\/SID20499",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20499-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        },
        {
            "title": "God's School of Faith",
            "url": "http:\/\/sermonindex.net\/SID24047",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 24:1-4",
            "topic": "Faith",
            "description": "God builds our faith and strengthens us through hard times and difficult moments. He wants to make us into sons and daughters He can trust and who will bless others. Joshua 24:1-4",
            "download": "http:\/\/sermonindex.net\/SID24047-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Great Faith Over Great Fear - Psalm 46",
            "url": "http:\/\/sermonindex.net\/SID28632",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 46",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28632-download",
            "preacher_name": "Michael Flowers",
            "preacher_image": "",
            "preacher_description": "Michael Flowers ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael Flowers in mp3 format. Michael serves as the founding Rector (the lead pastor \/ priest) of St. Aidanâ€™s Anglican Church in Kansas City, MO. He received his Masters in Theology from Fuller Theological Seminary, Pasadena, CA. \r\n\r\nFor over 20 years, he served as a pastor in the Vineyard and a network of house churches around the San Francisco Bay Area. While on Sabbatical in KC, he answered his initial calling to become an Anglican priest and planted St. Aidanâ€™s, a member of the Anglican Church of North America. Michael is married to Liz, his beloved.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "46"
                }
            ]
        },
        {
            "title": "Growing Faith",
            "url": "http:\/\/sermonindex.net\/SID12101",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12101-download",
            "preacher_name": "Prabhudas Koshy",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Have Faith in God",
            "url": "http:\/\/sermonindex.net\/SID24516",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24516-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Have Faith in God",
            "url": "http:\/\/sermonindex.net\/SID24643",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24643-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Have Faith in God",
            "url": "http:\/\/sermonindex.net\/SID25073",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:22",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25073-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Having The Faith Of God",
            "url": "http:\/\/sermonindex.net\/SID20386",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20386-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Heart-Faith And Not Mind-Faith",
            "url": "http:\/\/sermonindex.net\/SID16353",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16353-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Hebrews 11",
            "url": "http:\/\/sermonindex.net\/SID7136",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7136-download",
            "preacher_name": "Pat Kenney",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Hebrews 11",
            "url": "http:\/\/sermonindex.net\/SID3328",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3328-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Hebrews 11:23-33",
            "url": "http:\/\/sermonindex.net\/SID20622",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:23-33",
            "topic": "Faith",
            "description": "il",
            "download": "http:\/\/sermonindex.net\/SID20622-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Heroes In Hebrews",
            "url": "http:\/\/sermonindex.net\/SID1930",
            "size": "15679488",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "*poor tape quality",
            "download": "http:\/\/sermonindex.net\/SID1930-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "How much can you lose without losing your faith",
            "url": "http:\/\/sermonindex.net\/SID8298",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8298-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "How much could you lose",
            "url": "http:\/\/sermonindex.net\/SID8582",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8582-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "I Can't Take It",
            "url": "http:\/\/sermonindex.net\/SID25998",
            "size": "0",
            "format": "mp3",
            "scripture": "Num 13:25-33, Numbers 14:1-4",
            "topic": "Faith",
            "description": "In this study, Pastor Cymbala takes us to the Old Testament and we learn that bad things can happen when God's people loose their faith. Num 13:25-14:4; I Corinth 10:6,10; Phil 2:14-15 (GNT)",
            "download": "http:\/\/sermonindex.net\/SID25998-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Numbers",
                    "chapter": "13"
                },
                {
                    "book": "Numbers",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "I Have Kept the Faith",
            "url": "http:\/\/sermonindex.net\/SID22465",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22465-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        },
        {
            "title": "II Peter - How Firm is your Faith?",
            "url": "http:\/\/sermonindex.net\/SID26737",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26737-download",
            "preacher_name": "Mariano Di Gangi",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Imagination and Faith",
            "url": "http:\/\/sermonindex.net\/SID23513",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 3:17",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23513-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Levels of Faith",
            "url": "http:\/\/sermonindex.net\/SID26227",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26227-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Living Faith",
            "url": "http:\/\/sermonindex.net\/SID12105",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1 ",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12105-download",
            "preacher_name": "Stephen Khoo",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Look On Us",
            "url": "http:\/\/sermonindex.net\/SID18351",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 3:1-19",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18351-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Making It Over The Last Mountain",
            "url": "http:\/\/sermonindex.net\/SID24612",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24612-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Most Holy Faith",
            "url": "http:\/\/sermonindex.net\/SID4370",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4370-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Mountains Brought Down",
            "url": "http:\/\/sermonindex.net\/SID24519",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24519-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Now Faith Is",
            "url": "http:\/\/sermonindex.net\/SID26231",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26231-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Perfect Faith, 1980",
            "url": "http:\/\/sermonindex.net\/SID19475",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19475-download",
            "preacher_name": "Norman Grubb",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Personal Discoveries In the Faith Life",
            "url": "http:\/\/sermonindex.net\/SID26232",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26232-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Prayer 06 The Prayer Of Faith",
            "url": "http:\/\/sermonindex.net\/SID10602",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10602-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Precious faith",
            "url": "http:\/\/sermonindex.net\/SID13359",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 18:8",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13359-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Pure By Faith",
            "url": "http:\/\/sermonindex.net\/SID10285",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 15:6-11",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10285-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "RAHAB - Example of Faith",
            "url": "http:\/\/sermonindex.net\/SID23841",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23841-download",
            "preacher_name": "Billy Strachen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Reach out in faith and expect confidently",
            "url": "http:\/\/sermonindex.net\/SID23063",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23063-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Reasonable Faith",
            "url": "http:\/\/sermonindex.net\/SID23532",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 17:1-9",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23532-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Revelation of Faith",
            "url": "http:\/\/sermonindex.net\/SID27174",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27174-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        },
        {
            "title": "Something Out of Nothing",
            "url": "http:\/\/sermonindex.net\/SID24903",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24903-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Source of Faith",
            "url": "http:\/\/sermonindex.net\/SID3338",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3338-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Special Faith",
            "url": "http:\/\/sermonindex.net\/SID27679",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 3:11-16",
            "topic": "Faith",
            "description": "This is the final message from the Brooklyn Tabernacle's special week of prayer. In this teaching, you will be encouraged to seek God for increased faith to better serve Him in 2016. Acts 3:11-16 (NIV)",
            "download": "http:\/\/sermonindex.net\/SID27679-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Step out in Faith 2.11.86",
            "url": "http:\/\/sermonindex.net\/SID21615",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21615-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "Stepping Out In God",
            "url": "http:\/\/sermonindex.net\/SID24114",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24114-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Sustaining Faith By Vision",
            "url": "http:\/\/sermonindex.net\/SID28294",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28294-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "The Certainty of Our Faith",
            "url": "http:\/\/sermonindex.net\/SID13701",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13701-download",
            "preacher_name": "Cornelius Van Til",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Cosmic Setting",
            "url": "http:\/\/sermonindex.net\/SID3145",
            "size": "19628032",
            "format": "mp3",
            "scripture": "Psalm 102:13-14",
            "topic": "Faith",
            "description": "The faith is set in the context of a cosmic perspective, presently so lacking in the understanding of contemporary church life.  Another unique expression of this timeless theme.",
            "download": "http:\/\/sermonindex.net\/SID3145-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "102"
                }
            ]
        },
        {
            "title": "The Day the Sun Stood Still",
            "url": "http:\/\/sermonindex.net\/SID2571",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 10:12-14",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2571-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Faith that Lets",
            "url": "http:\/\/sermonindex.net\/SID26486",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26486-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "The Faith that Persuades",
            "url": "http:\/\/sermonindex.net\/SID12214",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12214-download",
            "preacher_name": "J. Edwin Orr",
            "preacher_image": "\/images\/j_edwin_orr.gif",
            "preacher_description": "J. Edwin Orr (1912 - 1987)\r\nListen to freely downloadable audio sermons by the speaker J. Edwin Orr in mp3 format. Brother Orr shared in an experience of revival in his youth as he traveled by faith and saw many powerful workings of God. After years of seeing personal revival and experiences in his ministry he studied the theme of historical revival to equip and teach the Church.\r\n\r\nHe published many books on the topic of subject of revival: \"Can God?\" \"Full Surrender\" and many others. He ministered cross-denoninationally in baptist, pentecostal, calvary chapel and in many other movements. He was also influential in the Campus Crusade for Christ organization.",
            "_scripture": []
        },
        {
            "title": "The Fight of Faith",
            "url": "http:\/\/sermonindex.net\/SID23599",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23599-download",
            "preacher_name": "George Duncan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Hearing Of Faith",
            "url": "http:\/\/sermonindex.net\/SID20423",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20423-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Hidden Life of Faith",
            "url": "http:\/\/sermonindex.net\/SID5790",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5790-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "The Holy Anger of Faith",
            "url": "http:\/\/sermonindex.net\/SID20873",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20873-download",
            "preacher_name": "Randy Jones",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Law And Faith",
            "url": "http:\/\/sermonindex.net\/SID17146",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17146-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Life Of Faith",
            "url": "http:\/\/sermonindex.net\/SID7681",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:23-26, Hebrews 11:37",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7681-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Prayer of Faith",
            "url": "http:\/\/sermonindex.net\/SID19875",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:20-26, Romans 10:8",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19875-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                },
                {
                    "book": "Romans",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Principle of Faith",
            "url": "http:\/\/sermonindex.net\/SID17375",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "For us to experience the supernatural intervention of God, such as answers to prayer we must have faith. The amount of bible knowledge will not help us, we need the faith to believe God is able and He needs to be our confidence. If we can comprehend everything and can do things in our own strength, there is no need to have faith and rely on God. God wants to do more but we must believe.",
            "download": "http:\/\/sermonindex.net\/SID17375-download",
            "preacher_name": "K.P. Yohannan",
            "preacher_image": "\/images\/kp_yohannan.gif",
            "preacher_description": "K.P. Yohannan ( - Present)\r\nListen to freely downloadable audio sermons by the speaker K.P. Yohannan in mp3 format. Dr. K.P. Yohannan, the Metropolitan Bishop of Believers Church, was born and brought up in Niranam, Kerala. Niranam has immense historical significance in the tradition of Saint Thomas, a disciple of Jesus Christ who planted the first church there in AD 52.  K.P. Yohannan dedicated his life to God at a young age to serve the needy and downtrodden. He prayed, â€œOh my Lord, let my heart break with the things that break Your heartâ€\u009d and his life was never the same. Itâ€™s his belief that one can only demonstrate Godâ€™s love by loving people. After over four decades of selfless service, he says, I have no regrets in praying that prayer for I know God has touched millions through what He did in and through me. It is all Godâ€™s grace.\r\n\r\nHe spent the early years of his service in North India and traveled to the remote villages sharing the love of Christ and doing charitable works. Through numerous encounters during those years, he was instilled with an increasing passion to bring hope, peace, and comfort to the needy and deprived. His sacrificial commitment, farsightedness and aptitude to perceive helped him to lead a life of unhindered devotion to serve Christ and His church. K.P. Yohannan is also the voice of Athmeeya Yathra, touching millions through his daily radio and TV broadcasts. His 250 books offer practical and spiritual guidance on hundreds of subjects.",
            "_scripture": []
        },
        {
            "title": "The Proof Of Faith",
            "url": "http:\/\/sermonindex.net\/SID16253",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "nil",
            "download": "http:\/\/sermonindex.net\/SID16253-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Response of Faith",
            "url": "http:\/\/sermonindex.net\/SID19243",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19243-download",
            "preacher_name": "Derek Melton",
            "preacher_image": "",
            "preacher_description": "Derek Melton ( - )\r\nListen to freely downloadable audio sermons by the speaker Derek Melton in mp3 format. Pastor Derek and Stacey Melton planted Pryor ON Fire Teen Ministries in 1991, having a deep burden to reach the troubled youth of our generation with the saving gospel of Jesus Christ. This burden soon gave birth to an opportunity for teens to begin meeting in a small classroom south of Pryor. This was the birth of Pryor ON Fire Teen Ministries. After a short time that small classroom was packed and overflowing so the meetings were moved to two different locations, both of which were outgrown. The ministry continued to expand and grow as Thunderbird Youth Academy began to bus their cadets to the services weekly to join with local youth. In January of 1999, Pastor Derek and Stacey once again, felt the undeniable burden of the Lord to plant a church for adults who had began to attend these teen services. Grace Life Church was born out of this burden. The ministry was then moved to 110 E. Graham, where the ministry has purchased two properties giving the ministry 14,000 sq. ft., and a sanctuary that will seat over 250. The ministry resides in this location today.\r\nToday, Pastor Derek and Stacey continue to experience a deep burden for at-risk youth struggling in our generation, ministering Jesus Christ and His love to hurting teens several times per week. Grace Life Church is also a godly presence in our city, as many families have found their place in this Christ exalting body of believers. These members are maturing in Christ from glory to glory.",
            "_scripture": []
        },
        {
            "title": "The Supernatural Hand Of Faith",
            "url": "http:\/\/sermonindex.net\/SID20606",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20606-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Test of Faith",
            "url": "http:\/\/sermonindex.net\/SID20869",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20869-download",
            "preacher_name": "Randy Jones",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Ups And Downs Of Faith",
            "url": "http:\/\/sermonindex.net\/SID27523",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 12:4-13:4",
            "topic": "Faith",
            "description": "As Christians, walking the life of faith, we have ups and downs in our faith and can learn lessons from Abraham's experiences. 1-Abraham succeeding in his faith 2-Abraham falling in his faith 3-Abraham being renewed in his faith",
            "download": "http:\/\/sermonindex.net\/SID27523-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "The Walk Of Faith",
            "url": "http:\/\/sermonindex.net\/SID24022",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24022-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        },
        {
            "title": "The eye is faith, and the light is His presence",
            "url": "http:\/\/sermonindex.net\/SID23043",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23043-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Through A Glass Darkly",
            "url": "http:\/\/sermonindex.net\/SID24879",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:12",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24879-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "True Faith",
            "url": "http:\/\/sermonindex.net\/SID3266",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3266-download",
            "preacher_name": "Albu van Eeden",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Trusting God Again Like A Child",
            "url": "http:\/\/sermonindex.net\/SID24080",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24080-download",
            "preacher_name": "Francis Chan",
            "preacher_image": "",
            "preacher_description": "Francis Chan ( - )\r\nListen to freely downloadable audio sermons by the speaker Francis Chan in mp3 format.  Is an American preacher. He is the former teaching pastor of Cornerstone Community Church in Simi Valley, CA, a church he and his wife started in 1994. He is also the Founder and Chancellor of Eternity Bible College and author of the best-selling book, Crazy Love: Overwhelmed by a Relentless God, which came out in 2009. He released his second book Forgotten God: Reversing Our Tragic Neglect of the Holy Spirit in August 2009. His other works include Erasing Hell in 2011, Multiply: Disciples Making Disciples in 2012, and the Basic Series by Francis Chan, a DVD series started in 2010. He also sits on the board of directors of Childrenâ€™s Hunger Fund and World Impact.\r\nCurrently, Francis is working to start a church planting movement in the inner city of San Francisco called: We Are Church. He is also working to launch a countrywide discipleship movement. Francis now lives in Northern California with his wife, Lisa, and their five children.",
            "_scripture": []
        },
        {
            "title": "Turn Your Eyes Upon Jesus",
            "url": "http:\/\/sermonindex.net\/SID20482",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "This sermon clearly shows us through God's word that when trials and temptations come, Jesus Christ is the “way,” the “truth,” and the “life”. Each of these aspects of the life of Christ is brought out in a deeper way through this message. When difficult times come and you seem to be in stormy weather, just “turn your eyes upon Jesus.”",
            "download": "http:\/\/sermonindex.net\/SID20482-download",
            "preacher_name": "Mel Esh",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Types In Hebrews 11",
            "url": "http:\/\/sermonindex.net\/SID20552",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20552-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Unfeigned Faith",
            "url": "http:\/\/sermonindex.net\/SID23040",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23040-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Walking Out Our Faith",
            "url": "http:\/\/sermonindex.net\/SID26276",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26276-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Walking in the Wind (conclusion)",
            "url": "http:\/\/sermonindex.net\/SID22711",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22711-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "What God Can Do Today",
            "url": "http:\/\/sermonindex.net\/SID18486",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18486-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "What Is Faith - Part 1",
            "url": "http:\/\/sermonindex.net\/SID23376",
            "size": "0",
            "format": "mp3",
            "scripture": "John 6:28",
            "topic": "Faith",
            "description": "The Bible is mean to be heard, accepted but beyond all of that it is to be obeyed. True faith is taught by Manley Beasley as obedient faith. He shares great truths on this subject and from Jesus's teachings.",
            "download": "http:\/\/sermonindex.net\/SID23376-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "What Is Faith - Part 2",
            "url": "http:\/\/sermonindex.net\/SID23377",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 11:24",
            "topic": "Faith",
            "description": "Faith is not a leap into the dark but a leap into the light. Manley Beasley continues his teaching on faith as a necessary element of the Christian Life. And clears up many wrong teachings on faith. And how to trust Jesus and put your faith in Him for your walk with Him.",
            "download": "http:\/\/sermonindex.net\/SID23377-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "What is Faith",
            "url": "http:\/\/sermonindex.net\/SID3342",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3342-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "When Faith Breaks Down",
            "url": "http:\/\/sermonindex.net\/SID26037",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26037-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "When He Comes",
            "url": "http:\/\/sermonindex.net\/SID27984",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27984-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "When You Would Rather Die Then Live",
            "url": "http:\/\/sermonindex.net\/SID20205",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20205-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "When the Unseen Becomes Visible",
            "url": "http:\/\/sermonindex.net\/SID19513",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 2:7-14",
            "topic": "Faith",
            "description": "December 20, 2009 - This message is for those who know the right thing to do but find that you are powerless to do so. It’s for: dishonest people who want to trust God but don’t know how, selfish people that want to be generous, wounded hearts that want to let go and forgive, and the verbally abusive who have a desire to speak with kind words. How do we get free from this? How do we experience peace on earth and goodwill towards man? The answer is the gift of Jesus. God in the flesh burst forth into the visible because humanity had no way out! This is the message of Christmas. He came with a display of compassion for our weaknesses and nailed them to a Tree. The good news is that Jesus forgives our sin and enables us to live a life that is pleasing to Him and those around us.",
            "download": "http:\/\/sermonindex.net\/SID19513-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Without Faith It Is Impossible to Please God",
            "url": "http:\/\/sermonindex.net\/SID23045",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23045-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        }
    ]
}