{
    "name": "False Teaching",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 29): False Teaching On Obscure Teaching",
            "url": "http:\/\/api.sermonindex.net\/SID2082",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 3:18-24",
            "topic": "False Teaching",
            "description": "A critically important theology lesson designed to armor the people of God against heretics who use certain hard, obscure texts from the Bible to teach things that the Bible never says at all. In “False Teaching on Obscure Teaching,” A. W. Tozer demolishes several dark misrepresentations of First Peter 3:18-24 and 4:6, by shining upon them the brilliant light of the rest of God’s Word. “Let me give you a good working rule for the understanding of Scripture: if you haven’t more than one verse to support it, don’t teach it. Because if it isn’t found in more than one verse of the Bible, the chances are it isn’t found there, either.” Pastor Tozer preached the 29th part of his 34-part series on First Peter in Chicago, Illinois, on June 13, 1954. Its length is 34 minutes and 43 seconds. \r\n\r\nIt is recommended that you follow along with the [url=http:\/\/www.sermonindex.net\/modules\/articles\/index.php?view=article&aid=18521]text transcription[\/url] of this sermon, as the sound quality makes listening difficult in some places.",
            "download": "http:\/\/api.sermonindex.net\/SID2082-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "(Depressed Disciples) False Teaching",
            "url": "http:\/\/api.sermonindex.net\/SID7319",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 11:2-3",
            "topic": "False Teaching",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7319-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Discerning the Fellowship of Jesus Christ",
            "url": "http:\/\/api.sermonindex.net\/SID1139",
            "size": "8091648",
            "format": "mp3",
            "scripture": "Malachi 1:2-4, Matthew 24:3-5",
            "topic": "False Teaching",
            "description": "(preached: June 8, 2003) This is a great message about discerning between Truth as it is in Jesus and false teaching. God promises to those that seek Him with all their hearts that He will lead them into all truth. Truth seekers are those that worship God acceptably, but we must be careful of falling into the error of by our own human minds diserning and doubting all that is of God.",
            "download": "http:\/\/api.sermonindex.net\/SID1139-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Malachi",
                    "chapter": "1"
                }
            ]
        }
    ]
}