{
    "name": "False Teachings",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Where is the Church Going) 9. The Dangers of False Teachings",
            "url": "http:\/\/sermonindex.net\/SID25050",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachings",
            "description": "Christians around the world are being deceived by false teaching, with devastating results. When you are constantly hearing about what you can get from God, you don’t want to hear about what you can give. But the Christian life is one of sacrifice; a life completely surrendered to God. Anything else is compromise!",
            "download": "http:\/\/sermonindex.net\/SID25050-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        }
    ]
}