{
    "name": "False Teachers",
    "description": "",
    "sermons": [
        {
            "title": "Better Never to Have Known the Way",
            "url": "http:\/\/sermonindex.net\/SID22486",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22486-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        },
        {
            "title": "Beware of Dogs",
            "url": "http:\/\/sermonindex.net\/SID16234",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16234-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Destruction Is not Sleeping",
            "url": "http:\/\/sermonindex.net\/SID22485",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22485-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        },
        {
            "title": "False Prophets are in Our Midst",
            "url": "http:\/\/sermonindex.net\/SID18233",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18233-download",
            "preacher_name": "Aaron Ernst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "False Teachers",
            "url": "http:\/\/sermonindex.net\/SID23623",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23623-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "JUDE - Pt 2  False teachers are present",
            "url": "http:\/\/sermonindex.net\/SID23859",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23859-download",
            "preacher_name": "Billy Strachen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Jude - False Teachers",
            "url": "http:\/\/sermonindex.net\/SID3636",
            "size": "0",
            "format": "mp3",
            "scripture": "Jude",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3636-download",
            "preacher_name": "Martin Geehan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Satan's Servants in God's Pulpit",
            "url": "http:\/\/sermonindex.net\/SID19386",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 11:13, 2 Peter 2:1, 2 Peter 2:19",
            "topic": "False Teachers",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19386-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "11"
                },
                {
                    "book": "2 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Redeemer is Coming to Zion",
            "url": "http:\/\/sermonindex.net\/SID1304",
            "size": "6229504",
            "format": "mp3",
            "scripture": "Isaiah 59:20, Isaiah 59:14-15",
            "topic": "False Teachers",
            "description": "Dating from late 1982 and given to a Canadian gathering, this sermon is a cry against the shallow, me-first \"gospel.\" The true Gospel of repentance and intimacy is presented forcefully: \"some of the greatest men the world has ever seen are going to stand there [the judgment] naked and have nothing.\" The starting point is the text of Isaiah 59 and 60. (The powerful file \"Another Gospel\" is taken from the middle portion of this sermon.)",
            "download": "http:\/\/sermonindex.net\/SID1304-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                }
            ]
        },
        {
            "title": "Wolves",
            "url": "http:\/\/sermonindex.net\/SID1826",
            "size": "10395648",
            "format": "mp3",
            "scripture": "Acts 20:28-31",
            "topic": "False Teachers",
            "description": "Beginning with Paul's tearful warning in Acts 20:28-31, about grievous wolves entering in and  even rising up from among the church at Ephesus itself, Pastor Conlon delivers a powerful sermon on wolves among the church of Jesus Christ and how to tell who they are.  He explains how the wolves operate, seeking the weak, the naive, or the injured in the church, and how dangerous they are to the Body of Christ. Have a pad and pen handy, he goes through many scriptures, which will enlighten and exhort every believer. A warning every believer needs to hear, especially new believers.",
            "download": "http:\/\/sermonindex.net\/SID1826-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "20"
                }
            ]
        }
    ]
}