{
    "name": "False Doctrines",
    "description": "",
    "sermons": [
        {
            "title": "Come Out of False Doctrines and of the World",
            "url": "https:\/\/sermonindex.info\/SID26393",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Doctrines",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26393-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        },
        {
            "title": "Making a Difference—An Exposition of Jude",
            "url": "https:\/\/sermonindex.info\/SID15248",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "False Doctrines",
            "description": "There are many lessons in Jude which are relevant to us today. This message warns us of false prophets and false doctrines which are infiltrating the church and society. However, in the midst of this decay, there are those who are seeking for truth and righteousness. Will we make a difference in their lives?",
            "download": "https:\/\/sermonindex.info\/SID15248-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "New Life Baptist Church - Part 3",
            "url": "https:\/\/sermonindex.info\/SID13235",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 13:27, 2 Corinthians 13:5, 1 John",
            "topic": "False Doctrines",
            "description": "In this message, Paul confronts the listener with many of the false doctrines found in American Christianity today. By taking us through the tests in 1 John, he helps us examine our choices and lifestyle. Do we look and act like the world around us or are we striving against the current to follow our King?",
            "download": "https:\/\/sermonindex.info\/SID13235-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "13"
                },
                {
                    "book": "Luke",
                    "chapter": "13"
                }
            ]
        }
    ]
}