{
    "name": "Famine",
    "description": "",
    "audio_sermons": [
        {
            "title": "Don't Live in Famine",
            "url": "http:\/\/sermonindex.net\/SID27782",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Famine",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27782-download",
            "preacher_name": "R. Edward Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "How to Thrive in the Famine",
            "url": "http:\/\/sermonindex.net\/SID23744",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Famine",
            "description": "December 4, 2011 – God brings us into a place of promise to provide for us and protect us. How do the people of God thrive in the midst of a famine? When God’s people declare that we will live for the purposes of God we will experience supernatural provision. The purpose of God will always move us into the compassion of God for human need. When the church of Jesus Christ reaches out to the poor and needy in a time of famine God will give you His strength and His provision for yourself and others.",
            "download": "http:\/\/sermonindex.net\/SID23744-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Kashrut and Famine",
            "url": "http:\/\/sermonindex.net\/SID12032",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Famine",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12032-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Famine Has Begun",
            "url": "http:\/\/sermonindex.net\/SID2489",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 8:11-13",
            "topic": "Famine",
            "description": "Out of the 8th Chapter of Amos, Wilkerson preaches a prophetic message for the Church today.  This is not a famine of bread or a thirst for water but is a famine from the Word of the Lord. He speaks of shepherds who do not preach on sin and just preach messages to comfort people in their sins. There is a great need for burning bush preachers who have been in the presence of God and minister the Word of the Lord in a day of famine.",
            "download": "http:\/\/sermonindex.net\/SID2489-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "8"
                }
            ]
        }
    ]
}