{
    "name": "Family Life",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 Peter - Part 25): On Wives and Their Place in Family Life",
            "url": "http:\/\/sermonindex.net\/SID2078",
            "size": "0",
            "format": "m3",
            "scripture": "1 Peter 3:1-7",
            "topic": "Family Life",
            "description": "The subject of 1 Peter 3:1-7 is no joking matter. In the home, says Dr. Tozer, “there’s place for recognition of the proper relationships and positions, but there is no place for domination.” “The dominating wife is a product of sin and of unbelief,” the pastor declares, “and has no place whatsoever in the will of God.” As for the husband, there is no biblical example, anywhere, for the brutal lord who rules his home with an iron hand. Pastor Tozer bravely tackles the subject of how a woman should dress, by describing four general traits: clean, neat, modest, and appropriate. “On Wives and Their Place in Family Life” is the 25th message in this 34-part study of Peter’s first epistle. It was preached in Chicago, Illinois on April 4, 1954, and its length is 29 minutes and 58 seconds.",
            "download": "http:\/\/sermonindex.net\/SID2078-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Importance of Biblical Family Life for the Spread of the Gospel",
            "url": "http:\/\/sermonindex.net\/SID22571",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Family Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22571-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Twenty Years of Family Life",
            "url": "http:\/\/sermonindex.net\/SID21643",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Family Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21643-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        }
    ]
}