{
    "name": "Fear",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 John #26) The Love That Casts Out Fear",
            "url": "http:\/\/sermonindex.net\/SID4827",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4827-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "(1 Peter - Part 27): Who is He That Will Harm you?",
            "url": "http:\/\/sermonindex.net\/SID2080",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 8:33-39, 1 Peter 3:13",
            "topic": "Fear",
            "description": "A. W. Tozer strikes a blow against fear. With searing eloquence and sober erudition, Dr. Tozer sets forth an extremely encouraging message for all of Christ’s servants and missionaries. He starts by taking us through Romans 8:33-39 to underscore the bold exhortation of 1 Peter 3:13. Nothing can harm a good man! “Nothing can debase his quality, nothing can reduce his dimensions, nothing can prevent the fulfillment of his destiny, nothing can block the accomplishment of his appointed task, and nothing can lower his value before God and the universe!” With this May 16, 1954 sermon, Pastor Tozer marked one year from the beginning of his 34-part series on Peter’s first epistle. “Who is He That Will Harm You?” is the 27th message, preached at Southside Alliance Church in Chicago, Illinois. It is 38 minutes, 43 seconds in length.",
            "download": "http:\/\/sermonindex.net\/SID2080-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Do not fear",
            "url": "http:\/\/sermonindex.net\/SID3988",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3988-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Don't Be Afraid",
            "url": "http:\/\/sermonindex.net\/SID25489",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25489-download",
            "preacher_name": "Brother Yun",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Facing Your Fears - Part 1",
            "url": "http:\/\/sermonindex.net\/SID0718",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0718-download",
            "preacher_name": "Danny Bond",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Facing Your Fears - Part 2",
            "url": "http:\/\/sermonindex.net\/SID0719",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0719-download",
            "preacher_name": "Danny Bond",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Fear",
            "url": "http:\/\/sermonindex.net\/SID26085",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "Pastor Carter speaks on the subject of fear in the Christian life. He shares how fear paralyzes us and makes us unfruitful to God. Fear even can cause a false religious pretence and effort to be given in the flesh and will. True worshippers will not give into fear but will have a inner thankfulness of God's provision and care no matter what circumstances they are in.",
            "download": "http:\/\/sermonindex.net\/SID26085-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Fear Factor",
            "url": "http:\/\/sermonindex.net\/SID21824",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21824-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": []
        },
        {
            "title": "Fear Not",
            "url": "http:\/\/sermonindex.net\/SID24140",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24140-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Fear Not, Neither Be Dismayed",
            "url": "http:\/\/sermonindex.net\/SID19666",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19666-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Fears Unlimited",
            "url": "http:\/\/sermonindex.net\/SID16237",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16237-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Fears Within",
            "url": "http:\/\/sermonindex.net\/SID22214",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "How many of us are truly desperate for the Lord? When you begin to search for wisdom and understanding as you would for priceless treasure, then you will find Him. God hides himself from the casual seeker. When life is going well we lose our passion for the Lord, our hunger. Sometimes God allows circumstances in our lives to expose how needy for him that we really are.  Just like in the life of Samson God will bring about circumstances that reveal that we are not as strong as we think we are. The strongest men realize their need for Christ and His strength and how much we need Him and his grace.",
            "download": "http:\/\/sermonindex.net\/SID22214-download",
            "preacher_name": "Andy Brink",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Freedom From Fear",
            "url": "http:\/\/sermonindex.net\/SID17139",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "In his inimitable fashion, Brother Zac shares practical wisdom concerning the difference between fear and caution a.k.a. wisdom. He explains the importance of funneling all decisions through the filter of faith instead of the slavery of fear. He also lambastes men who act effeminate through fear.",
            "download": "http:\/\/sermonindex.net\/SID17139-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "God's Cure For Fear",
            "url": "http:\/\/sermonindex.net\/SID8765",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 41:10",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8765-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "41"
                }
            ]
        },
        {
            "title": "Hiding In Fear",
            "url": "http:\/\/sermonindex.net\/SID24849",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24849-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Let Compassion Swallow Your Fear",
            "url": "http:\/\/sermonindex.net\/SID17631",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17631-download",
            "preacher_name": "Ray Comfort",
            "preacher_image": "\/images\/ray_comfort.gif",
            "preacher_description": "Ray Comfort ( - )\r\nListen to freely downloadable audio sermons by the speaker Ray Comfort in mp3 format. Is a New Zealand-born Christian minister and evangelist. Comfort started Living Waters Publications and The Way of the Master in Bellflower, California and has written a number of books. Comfort says that evangelism is the main reason the Christian Church exists and that many of the evangelistic methods used over the last century have produced false conversions to Christianity. Comfort often uses the Ten Commandments to speak about sin before presenting the gospel of Jesus. In the mid-1980s he formulated two sermons entitled \"Hell's Best Kept Secret\" and \"True and False Conversions.\"\r\nComfort speaks professionally at churches and evangelism seminars, and preaches in Huntington Beach, California. As well as co-hosting the former The Way of the Master Radio with Kirk Cameron, he is co-host of The Way of the Master Television Show, and the \"Creationism Examiner\" on The Examiner.",
            "_scripture": []
        },
        {
            "title": "Living in Fear Where No Fear is",
            "url": "http:\/\/sermonindex.net\/SID14794",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 53:1-6",
            "topic": "Fear",
            "description": "February 13, 2007 - When we magnify the power of our enemies over the power of our God we place ourselves in a foolish position. God is more powerful then any enemy that comes our way. Magnifying the enemy over the greatness of our God is saying in our hearts that there is no God. There is a point in our lives when we have to face our fears and believe God to deliver us. God has already defeated every enemy we will ever face in Jesus Christ. We must understand the enemy is not defying us, but rather he is attempting to defy the Christ in us who has purchased us with His own Blood. We are called to be a compelling testimony to this generation and to show that Jesus Christ is alive.",
            "download": "http:\/\/sermonindex.net\/SID14794-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "53"
                }
            ]
        },
        {
            "title": "Love Casts Out All Fear",
            "url": "http:\/\/sermonindex.net\/SID19790",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19790-download",
            "preacher_name": "Joe Aldrich",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Love Will Soon Cast Out All Fear ",
            "url": "http:\/\/sermonindex.net\/SID21992",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16-19",
            "topic": "Fear",
            "description": "January 9, 2011 - We live in a time that makes it so easy to be fearful. Day after day we are inundated with statistics that bring fear to our heart. In these last days God will do such a profound work in our hearts that fear will lose its power. You might ask the question how will God keep us from giving into the power of fear? We must understand His love brings incredible hope and power into our hearts. God will bring us to the full understanding that He loves us with a perfect love. His love for the genuine believer will give us an incredible security about the future. God's love covers and empowers us to join Him in His redemptive purposes. By faith, receive the incredible love of God and allow His love to flow through you to those around you.",
            "download": "http:\/\/sermonindex.net\/SID21992-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Never Afraid!",
            "url": "http:\/\/sermonindex.net\/SID27210",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27210-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Overcoming Fear",
            "url": "http:\/\/sermonindex.net\/SID19874",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19874-download",
            "preacher_name": "Gisela Yohannan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Overcoming The Voices Of Fear",
            "url": "http:\/\/sermonindex.net\/SID2777",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:1-10",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2777-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "Perfect Love Casteth Out Fear",
            "url": "http:\/\/sermonindex.net\/SID8294",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 4:16-18, Romans 8:15, 2 Timothy 1:7",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8294-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "1"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "1 John",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Prepare Now to Face Tomorrow’s Fears",
            "url": "http:\/\/sermonindex.net\/SID20777",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20777-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "So Do Not Fear",
            "url": "http:\/\/sermonindex.net\/SID18973",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18973-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Stop Running From Your Fears",
            "url": "http:\/\/sermonindex.net\/SID23076",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23076-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Fear Factor",
            "url": "http:\/\/sermonindex.net\/SID11008",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11008-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Three Secrets to Conquer Fear",
            "url": "http:\/\/sermonindex.net\/SID19997",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy 1:7",
            "topic": "Fear",
            "description": "Josef Tson speaks of the persecution of Christians under communist Russia. He shares about fear and how the enemy uses fear against us in Christian life. He shows how conquering fear is a key towards overcoming in a time of persecution and suffering of believers. A very important message to hear in the times we are living in the world.",
            "download": "http:\/\/sermonindex.net\/SID19997-download",
            "preacher_name": "Josef Tson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Trapped by Fear",
            "url": "http:\/\/sermonindex.net\/SID9203",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9203-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}