{
    "name": "Feast Of Tabernacles",
    "description": "",
    "sermons": [
        {
            "title": "(Following The Footsteps Of Christ) The Feast Of Tabernacles",
            "url": "http:\/\/api.sermonindex.net\/SID8385",
            "size": "0",
            "format": "mp3",
            "scripture": "John 7:1-53",
            "topic": "Feast Of Tabernacles",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8385-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "39 - Feast Of Tabernacles",
            "url": "http:\/\/api.sermonindex.net\/SID24748",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Feast Of Tabernacles",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24748-download",
            "preacher_name": "Ben Torrey",
            "preacher_image": "",
            "preacher_description": "Ben Torrey ( - )\r\nListen to freely downloadable audio sermons by the speaker Ben Torrey in mp3 format. Executive director of The Fourth River Project, Inc which is an organization that is preparing for the opening of North Korea. Their intercession and practical preparations are helping the body of Christ to be spiritually prepared to share the Good News of Christ effectively with North Korea.\r\nJesus Abbey is an intentional community and house of intercessory prayer founded by Jane and Archer Torrey, in 1965 by faith in God's provision. Currently Ben Torrey serves as chairman of the Jesus Abbey board of trustees. As he travels to America yearly he serves as the Archdeacon in the Evangelical Apostolic Church of North America which is in the tradition of the Church of the East. All 53 of the recordings below were recorded for the Far East Broadcasting company in 2007.",
            "_scripture": []
        }
    ]
}