{
    "name": "Fellowship With God",
    "description": "",
    "audio_sermons": [
        {
            "title": "Breaking Away From Father",
            "url": "http:\/\/sermonindex.net\/SID15393",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 15:11-13",
            "topic": "Fellowship With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15393-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Enjoying fellowship with God",
            "url": "http:\/\/sermonindex.net\/SID21074",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fellowship With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21074-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Living before the Lord",
            "url": "http:\/\/sermonindex.net\/SID21314",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Fellowship With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21314-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        }
    ]
}