{
    "name": "Fervent Prayer",
    "description": "",
    "sermons": [
        {
            "title": "Effectual Fervent Prayer",
            "url": "http:\/\/sermonindex.net\/SID3790",
            "size": "12107776",
            "format": "mp3",
            "scripture": "Philippians 4:6-7, James 5:16, John 17:20",
            "topic": "Fervent Prayer",
            "description": "Corrie Ten Boom shares some testimony on putting her burden's and cares on the Lord. Also she shares how she had burdens of impatience that she left with the Lord. \"There is nothing too great for God's power and nothing to small for His love.\" This is a excellent teaching on many aspects of prayer.",
            "download": "http:\/\/sermonindex.net\/SID3790-download",
            "preacher_name": "Corrie Ten Boom",
            "preacher_image": "\/images\/corrie_ten_boom.gif",
            "preacher_description": "Corrie Ten Boom (1892 - 1983)\r\nListen to freely downloadable audio sermons by the speaker Corrie Ten Boom in mp3 format. Known for the book the \"Hiding Place\" where she smuggled Jewish people during the great World Wars under the Nazi regime. She had a vibrant faith in the Lord Jesus Christ and that showed in her love for others especially the people of Israel. She ended up going to a concentration camp where she suffered greatly and survived to share the story of faith. \r\n\r\nCorrie's faith story and testimony was shared in many settings especially in the 60-70's where she toured all across North America encouraging Christians of how to endure coming persecution. Her ministry was to encourage faith and love in the hardest circumstances.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "James",
                    "chapter": "5"
                },
                {
                    "book": "Philippians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Give Me Souls Or I'll Die - Part 1",
            "url": "http:\/\/sermonindex.net\/SID3798",
            "size": "21159936",
            "format": "mp3",
            "scripture": "1 Samuel 1, Genesis 30:1",
            "topic": "Fervent Prayer",
            "description": "Leonard Ravenhill's opening prayer says it all: \"Take us out of the nursery to the armory.\"  He calls upon the church to awake to fervent prayer, salting our appetites by the example of others: people he had met personally (Duncan Campbell, Smith Wigglesworth, Jonathan Goforth's daughter) and people whose lifestyle of agonizing intercession had impacted him (David Brainerd, Praying Payson of Portland, John Hyde, Susanna Wesley and others).",
            "download": "http:\/\/sermonindex.net\/SID3798-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "30"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "1"
                }
            ]
        }
    ]
}