{
    "name": "Finding Life",
    "description": "",
    "sermons": [
        {
            "title": "Finding Life Beyond The Grave",
            "url": "http:\/\/api.sermonindex.net\/SID18908",
            "size": "0",
            "format": "mp3",
            "scripture": "John 20:1-16, Hebrews 9:12, Hebrews 7:25",
            "topic": "Finding Life",
            "description": "April 12, 2009 - There are a lot of people who want to hear the truth about Jesus but they don't want to embrace that truth. God offers a personal relationship to all who desire Him with a sincere heart. When you come with a sincere heart the first thing you will see is His mercy. As you behold the mercy of God and the promises of God you will be changed into a new person. God longs to give you something deeper than a casual relationship. He longs to give you something deeper than just knowing some facts about Him. Have the courage to go deeper and come home to God today!",
            "download": "http:\/\/api.sermonindex.net\/SID18908-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "7"
                },
                {
                    "book": "Hebrews",
                    "chapter": "9"
                },
                {
                    "book": "John",
                    "chapter": "20"
                }
            ]
        }
    ]
}