{
    "name": "Foolish Things",
    "description": "",
    "sermons": [
        {
            "title": "God Uses Foolish Things",
            "url": "http:\/\/api.sermonindex.net\/SID19143",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 1:26-27, Luke 4:18, Matthew 5:3",
            "topic": "Foolish Things",
            "description": "Throughout this beautiful and anointed message, Jackie shares many wonderful testimonies of the work of the Holy Spirit saving, healing and delivering drug addicts, prostitutes and criminals in the Wall City in Hong Kong. She speaks about the revival in China, and how teenage girls leave their homes and walk from village to village sharing Jesus. They come back two years later and multitudes have accepted Christ. These girls have never been to a seminar or a worship service. They simply give everything they have away. Jackie also witnesses about brothers and sisters coming out of decades in prison with broken bodies many times, but rejoicing and shining in their Saviour. She emphasizes that the revival in China is not facilitated by visual aids, life changing tapes, videos of the month or Christian magazines. It comes through the Holy Spirit using \"just a few people who aren't very educated, without microphones, who loved their lives not unto death - that's it.\" In this way, God has chosen the foolish things of the world to shame the wise (1 Corinthians 1:26-27). Jesus came to preach the good news to the poor (Luke 4:18). Jackie explains how the poor are often able to hear the gospel much quicker than an educated person, because they can hear spiritually. This is why the poor in spirit are blessed (Matthew 5:3). Jackie Pullinger emphasizes that men and women are saved through the Spirit of God, not through man's reasoning. She concludes with a call to die and a profound challenge: \"His glory will fall if you go out with nothing except a broken heart and some precious seed, and I suppose we have all got that.\"",
            "download": "http:\/\/api.sermonindex.net\/SID19143-download",
            "speaker_name": "Jackie Pullinger",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                },
                {
                    "book": "Luke",
                    "chapter": "4"
                },
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        }
    ]
}