{
    "name": "Foolish Man",
    "description": "",
    "sermons": [
        {
            "title": "The Wise Man's Eyes\t",
            "url": "http:\/\/sermonindex.net\/SID18511",
            "size": "0",
            "format": "mp3",
            "scripture": "Ecclesiastes 2:14-20",
            "topic": "Foolish Man",
            "description": "February 1, 2009 - The fool says in his heart there is not an absolute sovereign God, and God does not have the right to govern our lives. The fool cannot see the work of God or the value of a soul. We can have all wisdom and knowledge and still reject the truth of God's Word. The wise man however, sees God above all that exists and allows His Word to begin to shape and mold the very fibers of our being. The wise man acknowledges that God chose us to display His justice and mercy in the earth so that the destitute would come to know there is a God who loves them. God's work in the earth is ALL ABOUT PEOPLE.",
            "download": "http:\/\/sermonindex.net\/SID18511-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ecclesiastes",
                    "chapter": "2"
                }
            ]
        }
    ]
}