{
    "name": "Forsaking All",
    "description": "",
    "sermons": [
        {
            "title": "(Revelations Of The Gospel) 2. A Revelation Of Forsaking All",
            "url": "http:\/\/sermonindex.net\/SID17762",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 13:1-5, Luke 14:33",
            "topic": "Forsaking All",
            "description": "The Gospel is like a Crystal, with many different colored lights shinning out of the same gem.  Some look at the Crystal and say it is green, and others say \"no its red.\"  But the mature one walks around the Crystal and says \"your both right\" It is the same with the gospel in the scriptures.  There are many different ingredients that make up the recipe of the gospel.  This series attempts to show all the ingredients of the gospel.  This is important because if our recipe is different than Gods, then we will not get the same result found in the book of Acts.",
            "download": "http:\/\/sermonindex.net\/SID17762-download",
            "preacher_name": "Jason Robinson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "14"
                },
                {
                    "book": "Luke",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "2012 – A Year To Consider Jesus",
            "url": "http:\/\/sermonindex.net\/SID23914",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Forsaking All",
            "description": "As you begin the new year, will you stop and consider how deep and how far you are willing to go with Jesus? Consider Jesus and go outside the boundaries of a scornful world, lay aside every weight and don’t allow your struggles to dominate your focus. We are to stand and fight for a people who are fighting against their own salvation. It’s all about people and all about those who need a Savior. Consider Jesus and go all the way with Him.",
            "download": "http:\/\/sermonindex.net\/SID23914-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        }
    ]
}