{
    "name": "Free Gift",
    "description": "",
    "sermons": [
        {
            "title": "Gift Our Lord Brought To The World - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID1528",
            "size": "4251648",
            "format": "mp3",
            "scripture": "",
            "topic": "Free Gift",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1528-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "Gift Our Lord Brought To The World - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID1529",
            "size": "4677632",
            "format": "mp3",
            "scripture": "",
            "topic": "Free Gift",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1529-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "God's Invitation",
            "url": "http:\/\/api.sermonindex.net\/SID12707",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Free Gift",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12707-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "God's Priceless Gift to a Bankrupt World",
            "url": "http:\/\/api.sermonindex.net\/SID21527",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Free Gift",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21527-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": []
        },
        {
            "title": "Thanks be to God for His gift of Salvation",
            "url": "http:\/\/api.sermonindex.net\/SID6723",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Free Gift",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6723-download",
            "preacher_name": "Oswald J. Smith",
            "preacher_image": "\/images\/oswald_j_smith.gif",
            "preacher_description": "Oswald J. Smith (1889 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Oswald J. Smith in mp3 format. Was a Canadian pastor, author, and missions advocate. He founded The People's Church in Toronto in 1928. Over the course of eighty years he preached more than 12,000 sermons in 80 countries, wrote thirty-five books (with translations into 128 languages), as well as 1,200 poems, of which 100 have been set to music, including \"Deeper and Deeper\" (first line \"Into the heart of Jesus\").\r\nThe great burden of Oswald J. Smith's Christian life was to see the lost come to the Lord. He was well known for the motto: \"We talk of the Second Coming; half the world has never heard of the first.\" and \"No one has the right to hear the gospel twice, while there remains someone who has not heard it once.\"",
            "_scripture": []
        }
    ]
}