{
    "name": "Future",
    "description": "",
    "audio_sermons": [
        {
            "title": "Remembering the Future",
            "url": "http:\/\/sermonindex.net\/SID26700",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26700-download",
            "preacher_name": "John Vissers",
            "preacher_image": "\/images\/john_vissers.gif",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Future State",
            "url": "http:\/\/sermonindex.net\/SID25959",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25959-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "The Future is Already Written",
            "url": "http:\/\/sermonindex.net\/SID25612",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25612-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "What Do You Do with Your Future",
            "url": "http:\/\/sermonindex.net\/SID21931",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21931-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": []
        },
        {
            "title": "What's Next?",
            "url": "http:\/\/sermonindex.net\/SID9202",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 46",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9202-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "46"
                }
            ]
        },
        {
            "title": "Wonderful And Awesome Days Ahead",
            "url": "http:\/\/sermonindex.net\/SID22134",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22134-download",
            "preacher_name": "Ben Crandall",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Yesterday, Today and Tomorrow",
            "url": "http:\/\/sermonindex.net\/SID20881",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Future",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20881-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        }
    ]
}