{
    "name": "Gift",
    "description": "",
    "sermons": [
        {
            "title": "A Gift that Lasts",
            "url": "https:\/\/sermonindex.info\/SID26699",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gift",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26699-download",
            "preacher_name": "John Vissers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The First Gift Of The Father",
            "url": "https:\/\/sermonindex.info\/SID13256",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 37:1-4, Luke 15:11-22",
            "topic": "Gift",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13256-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "15"
                },
                {
                    "book": "Genesis",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "The Gift",
            "url": "https:\/\/sermonindex.info\/SID24448",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gift",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24448-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        }
    ]
}