{
    "name": "Gift Of Tongues",
    "description": "",
    "sermons": [
        {
            "title": "Praying In Tongues",
            "url": "https:\/\/sermonindex.info\/SID25279",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 14:4-17",
            "topic": "Gift Of Tongues",
            "description": "Jim Cymbala gives a very clear and down to earth message on a Scriptural experience that many have confused and brought to extremes in the body of Christ. He clearly shows according to the Bible that the gift of tongues is still for the body of Christ and simply part of the expression of the body of Christ on earth. A very simple yet powerful message that will bless you.",
            "download": "https:\/\/sermonindex.info\/SID25279-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "The Gift Of Tongues",
            "url": "https:\/\/sermonindex.info\/SID7824",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gift Of Tongues",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7824-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        }
    ]
}