{
    "name": "Glory",
    "description": "",
    "sermons": [
        {
            "title": "Bring Back the Glory",
            "url": "http:\/\/sermonindex.net\/SID26205",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26205-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "Changed From Glory To Glory",
            "url": "http:\/\/sermonindex.net\/SID25984",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25984-download",
            "preacher_name": "Richard Wurmbrand",
            "preacher_image": "",
            "preacher_description": "Richard Wurmbrand (1909 - 2001)\r\nListen to freely downloadable audio sermons by the speaker Richard Wurmbrand in mp3 format. Was a Romanian Christian minister of Jewish descent. He was a youth during a time of anti-Semitic activity in Romania, but it was later, after becoming a believer in Jesus Christ as Messiah, and daring to publicly say that Communism and Christianity were not compatible, that he experienced imprisonment and torture for his beliefs. After serving five years of a second prison sentence, he was ransomed for $10,000.\r\nHis colleagues in Romania urged him to leave the country and work for religious freedom from a location less personally dangerous. After spending time in Norway and England, he and his wife Sabina, who had also been imprisoned, emigrated to America and dedicated the rest of their lives to publicizing and helping Christians who are persecuted for their beliefs. He wrote more than 18 books, the most widely known being Tortured for Christ. Variations of his works have been translated into more than 60 languages. He founded the international organization Voice of the Martyrs, which continues to aid Christians around the world who are persecuted for their faith.",
            "_scripture": []
        },
        {
            "title": "Getting Ready for the Glory",
            "url": "http:\/\/sermonindex.net\/SID16337",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16337-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "Glory: wanting it, getting it, having it",
            "url": "http:\/\/sermonindex.net\/SID22351",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22351-download",
            "preacher_name": "Peter Jensen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Isaiah 40 - Glory Shall be Revealed",
            "url": "http:\/\/sermonindex.net\/SID26741",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26741-download",
            "preacher_name": "Mariano Di Gangi",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Shouting Glory in the Temple",
            "url": "http:\/\/sermonindex.net\/SID26274",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26274-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Throne Of His Glory",
            "url": "http:\/\/sermonindex.net\/SID23607",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Glory",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23607-download",
            "preacher_name": "J. Sidlow Baxter",
            "preacher_image": "\/images\/j_sidlow_baxter.gif",
            "preacher_description": "J. Sidlow Baxter (1903 - 1999)\r\nListen to freely downloadable audio sermons by the speaker J. Sidlow Baxter in mp3 format.   J. Sidlow Baxter was born in Australia and grew up in Lancashire, England.  He attended Spurgeon's Theological College in London and was a pastor in Scotland and England.  He is the author of over thirty books and has ministered in churches, Bible Conferences, and missionary centers throughout the United States, Canada, Great Britain and other places around the world.\r\nHe is scholarly but very practical and helpful.  These spoken sermons will be a great blessing to God's people for many years to come.  What a time it will be when we are able to meet with men like Dr. Baxter in the New Jerusalem that John saw coming down out of heaven.",
            "_scripture": []
        }
    ]
}