{
    "name": "God's Word",
    "description": "",
    "audio_sermons": [
        {
            "title": "Eat this Scroll ",
            "url": "http:\/\/sermonindex.net\/SID21311",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "God's Word",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21311-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "God Confirming His Word",
            "url": "http:\/\/sermonindex.net\/SID20050",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "God's Word",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20050-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        }
    ]
}