{
    "name": "Gods Judgement",
    "description": "",
    "sermons": [
        {
            "title": "(Romans) God's Judgement On The Jews",
            "url": "http:\/\/sermonindex.net\/SID6895",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 2:17-29",
            "topic": "God's Judgement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6895-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(Romans) His Judgement And Ours",
            "url": "http:\/\/sermonindex.net\/SID6942",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 14:1-23",
            "topic": "God's Judgement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6942-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Judgement is Mine",
            "url": "http:\/\/sermonindex.net\/SID8290",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 20:13",
            "topic": "God's Judgement",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8290-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The Voice of Gods Judgement",
            "url": "http:\/\/sermonindex.net\/SID2205",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 14:12,1 Corinthians 3:13,1 Corinthians 4:5",
            "topic": "Gods Judgement",
            "description": "According to Dr. Tozer, Christians have a tendency to hold fast to one truth at the expense of another. Then, after a time, someone comes along and preaches the forgotten Truth -- as Martin Luther did with the doctrine of justification by faith. He was first considered a heretic for peaching an unfamiliar (actually, forgotten) doctrine, but it marked the beginning of the reformation of the church. Has justification by faith now overshadowed other truths, like the inevitability of God's judgment? Dr. Tozer explores this possibility and reaches some disturbing conclusions.",
            "download": "http:\/\/sermonindex.net\/SID2205-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "4"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "14"
                }
            ]
        }
    ]
}