{
    "name": "Goodness",
    "description": "",
    "sermons": [
        {
            "title": "The Goodness of the Lord in the Land of the Living",
            "url": "http:\/\/api.sermonindex.net\/SID13769",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 27:11-14",
            "topic": "Goodness",
            "description": "October 01, 2006 – There will come seasons of sorrow and sickness, seasons when death will knock on our doors and everything will begin to change in our lives. It is in these times that we all have a choice to make. We can choose to stop trusting God because we are confronted with things we don't understand or we can fix our eyes on Jesus and believe that all things work together for the good for those who love God and are called according to His purpose. God is calling us to reflect His Goodness in the land of the living. He wants to use our lives to see that every grave looses its power off those who end up in it.",
            "download": "http:\/\/api.sermonindex.net\/SID13769-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "27"
                }
            ]
        }
    ]
}