{
    "name": "Gospel Message",
    "description": "",
    "sermons": [
        {
            "title": "Plain Old Gospel Message Path of Reward - Lake Johanna Conference",
            "url": "https:\/\/sermonindex.info\/SID26909",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel Message",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26909-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        },
        {
            "title": "The First Gospel Message",
            "url": "https:\/\/sermonindex.info\/SID20850",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel Message",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20850-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Simple Gospel Message",
            "url": "https:\/\/sermonindex.info\/SID17235",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel Message",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID17235-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Ten Commandments Gospel Message",
            "url": "https:\/\/sermonindex.info\/SID12775",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel Message",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12775-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        }
    ]
}