{
    "name": "Gospel",
    "description": "",
    "sermons": [
        {
            "title": "(Genesis #5) First Foregleams of Gospel Light",
            "url": "http:\/\/api.sermonindex.net\/SID4835",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4835-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "(True Disciple Conference) The Greatness of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID16501",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthian 15:1-4",
            "topic": "Gospel",
            "description": "The Apostle is here declaring the gospel to believers, not the lost; those who have already heard and received it. This shows that the gospel is not something learned in five minutes, after which we go on to ‘deeper things’. The gospel of Jesus Christ is the deepest and greatest truth in all scripture – and we still won’t understand its greatness after an eternity of eternities. People are not excited about the gospel these days, because they don’t know it, and they don’t understand the fullness of it. Mr Washer pulls no punches: “If Jesus Christ and his gospel do not excite you, you are going to hell”, he pleads, before going on to explain what he means. He argues the great need for preachers of the true gospel, and explains what it means to receive the gospel, and how we may know that we have received it. What is your motivation for coming to Jesus Christ? Security? Healing? A new Mercedes? Or do you come for salvation? But what about coming to Christ simply because he is worthy? That alone ought to be motivation enough to repent and believe. This potent and searching message ends with a sober warning of the perils of ignoring this gospel. (50 minutes)",
            "download": "http:\/\/api.sermonindex.net\/SID16501-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "(Where is the Church Going) 4. The Gospel and the Heart of Man",
            "url": "http:\/\/api.sermonindex.net\/SID25045",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "The true gospel speaks to the heart of man, not to his intellect. Are we serving God religiously, following techniques and principles, or are we allowing His gospel to win our hearts and surrendering our lives to Him?",
            "download": "http:\/\/api.sermonindex.net\/SID25045-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        },
        {
            "title": "(Where is the Church Going) 5. Our Reaction to the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID25046",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "If we are truly born again, our hearts will identify with the preaching of the true gospel. When we hear the message of Jesus Christ and Him crucified our spirits will testify that it is the truth! What is your reaction to the gospel?",
            "download": "http:\/\/api.sermonindex.net\/SID25046-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        },
        {
            "title": "A Clear Gospel Message",
            "url": "http:\/\/api.sermonindex.net\/SID17217",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17217-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "A Gospel Tract Ministry",
            "url": "http:\/\/api.sermonindex.net\/SID24529",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24529-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Grasp Of The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID18974",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18974-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Return to the True Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID26391",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26391-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        },
        {
            "title": "A World of Idols",
            "url": "http:\/\/api.sermonindex.net\/SID22513",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 17:16-34",
            "topic": "Gospel",
            "description": "The gospel should change not just our inner being but also the way we relate to the outside world. Paul engaged with society every day. He was distressed, indignant and compassionate about the Athenians' beliefs, but he kept his eyes on the cross to inform his words. He recognized their idols and raised up Jesus as the only true God.",
            "download": "http:\/\/api.sermonindex.net\/SID22513-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Adorning the Gospel of God Our Saviour (Part 1)",
            "url": "http:\/\/api.sermonindex.net\/SID17272",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17272-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "An Awakening Sermon",
            "url": "http:\/\/api.sermonindex.net\/SID24862",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 7:11-12",
            "topic": "Gospel",
            "description": "We live in a day of a compromised gospel, a powerless pulpit and a worldly church. I can sum up the American church today as described by a recent visit of an Oriental pastor who came to America to see for himself what the churches were like. He said, “First, karaoke, then a lecture.” That sums it up friends. We have very little preaching in our pulpits today. It is mainly teaching, teaching informs, teaching transforms. The message you’re about to hear is not a politically correct gospel, rather it is a full presentation of the gospel of the Son of God preached in the full counsel of God.",
            "download": "http:\/\/api.sermonindex.net\/SID24862-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "An Unchanging Scandalous Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID19003",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16",
            "topic": "Gospel",
            "description": "Recorded at the HBC Missions Conference 2008. After introductory exhortations to up-coming preachers and evangelists, Paul Washer sets out to highlight some of the errors destroying modern-day evangelism. He also explains what should be preached, and how, and likens labouring with souls to the travails of birth. We must understand that the gospel is unbelievable, and is scandalous; if we remove the scandal, we remove the power. This world is ripe for a move of God: What a time to be alive!!, he exclaims (67 minutes).",
            "download": "http:\/\/api.sermonindex.net\/SID19003-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "And Kissed Him",
            "url": "http:\/\/api.sermonindex.net\/SID22514",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 15:11-24",
            "topic": "Gospel",
            "description": "When God forgives of our sins, he assertively initiates the process of reconciliation even before we ask his forgiveness. The essence of God's forgiveness is that he absorbs the debt of our sinfulness upon Himself in Jesus Christ, rather than requiring us to repay the debt through our moral efforts. Because God sees us for who we are in Jesus and not who we are as sinners, we are empowered to become a community that doesn't bear grudges, belittle those who have hurt us, or force people to carry the sins of their past with them forever.",
            "download": "http:\/\/api.sermonindex.net\/SID22514-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "At Stake The Truth Of The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID18982",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18982-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Attempting to Improve the Gospel",
            "url": "http:\/\/api.sermonindex.net\/",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/-download",
            "preacher_name": "Mark Denver",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Be Rich: I Know a Secret",
            "url": "http:\/\/api.sermonindex.net\/SID11802",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 3:1-13",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11802-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Believe in Your Heart that God Raised Jesus from the Dead",
            "url": "http:\/\/api.sermonindex.net\/SID22481",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22481-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        },
        {
            "title": "Charge That to My Account",
            "url": "http:\/\/api.sermonindex.net\/SID0270",
            "size": "2033152",
            "format": "mp3",
            "scripture": "Philemon 1:8-18",
            "topic": "Gospel",
            "description": "\"Paul might have said, . . . 'Onesimus, I'm going to become your surety. I'll undertake to settle your debt. And I'm going to write a letter to Philemon and I want you to take it to him. Don't plead anything for yourself, just hand him the letter in which he will learn that I'm willing to settle everything in a righteous way.'... \"When the Lord Jesus Christ became my surety . . . he went to Calvary's cross, and all my guilt was charged against Him. He settled for everything, and then He cried, 'It is finished.' And on the basis of that finished work, God can freely forgive, and justify completely, every poor sinner who trusts in the Lord Jesus Christ.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0270-download",
            "preacher_name": "Harry A. Ironside",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Philemon",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Conduct Worthy of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID24018",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24018-download",
            "preacher_name": "Shane Idleman",
            "preacher_image": "",
            "preacher_description": "Shane Idleman ( - )\r\nListen to freely downloadable audio sermons by the speaker Shane Idleman in mp3 format. Shane Idleman is the founder and lead pastor of Westside Christian Fellowship, in Lancaster, Ca. His sermons, books, articles, and radio program have sparked change in the lives of many. Today, as we continually drift away in a current of moral decline and relativism, many believe that the battle is too advanced and that we cannot make a difference. Shane, however, believes that we can, and offers his books as contributions to that commitment.\r\nShane’s ministry has sparked change in the lives of many. He’s calling families, marriages, and the country back to the biblical principles that once made America prized among nations. His bold stance has led to speaking engagements at some of the largest churches in the nation.",
            "_scripture": []
        },
        {
            "title": "Defending the heart of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID22345",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22345-download",
            "preacher_name": "Phil Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Differences In The Gospels Similarities And Differences",
            "url": "http:\/\/api.sermonindex.net\/SID12437",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew, Mark, Luke, John",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12437-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "Everlasting Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID19306",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19306-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Every Knee Shall Bow",
            "url": "http:\/\/api.sermonindex.net\/SID19305",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19305-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Exploring the Simple Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID27704",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27704-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "Four R's Of The Gospel: Regeneration",
            "url": "http:\/\/api.sermonindex.net\/SID24536",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24536-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": []
        },
        {
            "title": "Four R's Of The Gospel:Repentance",
            "url": "http:\/\/api.sermonindex.net\/SID24535",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 15:7",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24535-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Four R's of the Gospel: Ruin",
            "url": "http:\/\/api.sermonindex.net\/SID24533",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 2:1",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24533-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Fundamentals Of The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID12443",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12443-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Galatians: The Gospel of Grace",
            "url": "http:\/\/api.sermonindex.net\/SID1932",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1932-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID22551",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22551-download",
            "preacher_name": "Stephen Olford",
            "preacher_image": "",
            "preacher_description": "Stephen Olford (1918 - 2004)\r\nListen to freely downloadable audio sermons by the speaker Stephen Olford in mp3 format. Was a 20th-century Christian leader. Dr. Billy Graham called him \"the man who most influenced my ministry.\" He was a personal confidant of Graham. Olford was also a role model and friend to prominent pastors such as Charles Stanley and Adrian Rogers. He was a pioneer in Christian television programming with his show, Encounter, in New York. His Sunday morning sermons were also broadcast around the world on radio.[1] He was the Founder and Chairman of the Board of Olford Ministries International in Memphis, Tennessee which became The Stephen Olford Center at Union University. His authorized biography, Only One Life, was written by John Philipps.\r\nIn 1953, Dr. Stephen F. Olford's years of pastoral ministry began by serving the Duke Street Baptist Church in Richmond, Surrey England (1953–1959) and then the Calvary Baptist Church in New York City (1959–1973).[1] Olford systematized his method of expository preaching and formed a curriculum used to train preachers at the Olford Institute for Biblical Preaching in Memphis, Tennessee. Pastors and scholars migrated to the institute for inspiration and instruction that often resulted in upgraded pulpit ministries.",
            "_scripture": []
        },
        {
            "title": "Gospel & Spirit",
            "url": "http:\/\/api.sermonindex.net\/SID27804",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27804-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Gospel Grace Applied",
            "url": "http:\/\/api.sermonindex.net\/SID26271",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26271-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID16055",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16055-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID16056",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16056-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 3",
            "url": "http:\/\/api.sermonindex.net\/SID16057",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16057-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 4",
            "url": "http:\/\/api.sermonindex.net\/SID16058",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16058-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 5",
            "url": "http:\/\/api.sermonindex.net\/SID16059",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16059-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Gospel Meetings - Part 6",
            "url": "http:\/\/api.sermonindex.net\/SID16060",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16060-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID28145",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28145-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID28146",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28146-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 3",
            "url": "http:\/\/api.sermonindex.net\/SID28147",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28147-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 4",
            "url": "http:\/\/api.sermonindex.net\/SID28148",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28148-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 5",
            "url": "http:\/\/api.sermonindex.net\/SID28149",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28149-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Great Words of the Gospel - Part 6",
            "url": "http:\/\/api.sermonindex.net\/SID28150",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28150-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "II Timothy - Part 1 - Continue in the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID11787",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11787-download",
            "preacher_name": "John Stott",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "II Timothy - Part 3 - Guard the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID11789",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11789-download",
            "preacher_name": "John Stott",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Jewish Opposition to the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID3138",
            "size": "11568065",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "We don’t know the depth of historical Jewish resistance to the Gospel.  Art touches some of the deep-seated reasons for this, and therefore the challenge that is presented before the church.",
            "download": "http:\/\/api.sermonindex.net\/SID3138-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": []
        },
        {
            "title": "Mark - The Beginning of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID26514",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26514-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "Mark 4",
            "url": "http:\/\/api.sermonindex.net\/SID1444",
            "size": "4738048",
            "format": "mp3",
            "scripture": "Mark 4",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1444-download",
            "preacher_name": "Norman Meeten",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Mid South Conference 1978-01 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10309",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10309-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mid South Conference 1978-02 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10310",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10310-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mid South Conference 1978-03 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10311",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10311-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mid South Conference 1978-04 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10312",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10312-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mid South Conference 1978-05 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10313",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10313-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mid South Conference 1978-06 Fellowship In The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID10314",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10314-download",
            "preacher_name": "Aldy Fam Fanous",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Moreover Brethren I Declare Unto You The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID27622",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27622-download",
            "preacher_name": "John R. Rice",
            "preacher_image": "\/images\/john_r_rice.gif",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "No Gospel For Me!",
            "url": "http:\/\/api.sermonindex.net\/SID20059",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20059-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        },
        {
            "title": "Not Ashamed",
            "url": "http:\/\/api.sermonindex.net\/SID27822",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27822-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "O, That You Knew the Terms of Peace!",
            "url": "http:\/\/api.sermonindex.net\/SID22467",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22467-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        },
        {
            "title": "Redefining the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID12043",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12043-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Repent, Believe And The Gospel Of God",
            "url": "http:\/\/api.sermonindex.net\/SID12479",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12479-download",
            "preacher_name": "Charles E. Fuller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Riding On A Donkey",
            "url": "http:\/\/api.sermonindex.net\/SID25441",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 21:1-9",
            "topic": "Gospel",
            "description": "In this Palm Sunday study, according to God's word, we all need a Lamb and a King. God is inviting us to accept the Lamb and King Jesus. He saves. He protects. Salvation is as simple as saying: \"I believe\".",
            "download": "http:\/\/api.sermonindex.net\/SID25441-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Separated unto the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID17122",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17122-download",
            "preacher_name": "Detlef Stegen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Still A Great Way Off (Gospel)",
            "url": "http:\/\/api.sermonindex.net\/SID18741",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18741-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "The Blood, the Call, the Promise",
            "url": "http:\/\/api.sermonindex.net\/SID3817",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 11:25-27",
            "topic": "Gospel",
            "description": "A very clear presentation of the Gospel. Brother David wants to leave no doubt, but that everyone under the sound of his voice gets a simple understanding of the blood of Jesus, the power of the call and the promise that is ours, as we respond.",
            "download": "http:\/\/api.sermonindex.net\/SID3817-download",
            "preacher_name": "David Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "The Book of Life",
            "url": "http:\/\/api.sermonindex.net\/SID13789",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 20:11",
            "topic": "Gospel",
            "description": "We are not preaching the gospel today, we are hearing motivational speaking and things that are good. We are told that \"we are good\" and we walk away refreshed, this is not gospel preaching, the gospel is not being preached in our pulpits. \"Motivationalism\" is the error of our today, Our job is not to motivate, it is to preach the truth!",
            "download": "http:\/\/api.sermonindex.net\/SID13789-download",
            "preacher_name": "+Thaddeus Barnum",
            "preacher_image": "",
            "preacher_description": "Bishop Thaddeus Barnum\r\nListen to freely downloadable audio sermons by the speaker Bishop Thaddeus Barnum in mp3 format. Thad was consecrated in Denver, Colorado by Archbishop Emmanuel Kolini, June 24, 2001. Thad currently serves both as Bishop in Residence at All Saints, Pawleys Island, SC, and as a Chaplain to Clergy.  He has a passion for discipleship and through the ministry of Call 2 Disciple, Erilynne and Thad have given themselves to strengthening the Church in the Scriptures and discipling Christians to maturity in the faith.\r\n\r\nThad has served churches in Connecticut, Pennsylvania and South Carolina and has been married to Erilynne for 35 years. They raised 4 girls and have 11 grandchildren.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The Depth of the Gospel - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID21484",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21484-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "The Depth of the Gospel - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID21485",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22:2",
            "topic": "Gospel",
            "description": "From between the towering monoliths of Gods justice, and His mercy, a beleaguered and hungry pilgrim pleads from amongst the airy climbs of the gospels’ narrow pathway to the ambivalent travelers’ content upon lower, wider ways.  He cries that others would capture just a glimpse of the sheep-gate of love that is found in the radical subjection of the Son.  Re-discover the tragically hopeful message of the gospel lest ye forget from whence ye have been saved O Pilgrim’s.  Have we forgotten that If God spared us, that he did not spare His Son?",
            "download": "http:\/\/api.sermonindex.net\/SID21485-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "The Fifth Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID18401",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18401-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "The First Gospel Sermon (Part 3)",
            "url": "http:\/\/api.sermonindex.net\/SID24099",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24099-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "The First Word of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID0184",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 4:17, Mark 1:15, Luke 15:10",
            "topic": "Gospel",
            "description": "Dr. Orr discusses the modern corruption of the word 'repent,' what the Scriptural meaning is, and discusses the Greek word that was translated into 'repent.' The main push of the message is that the gospel always begins and continues with repentance, and that the gospel preached without it is not the true gospel at all. \"Now, would it not be a master stroke of the enemy of the Christian faith to take the very first word of the gospel and change its meaning...well that's exactly what's been done.\"",
            "download": "http:\/\/api.sermonindex.net\/SID0184-download",
            "preacher_name": "J. Edwin Orr",
            "preacher_image": "\/images\/j_edwin_orr.gif",
            "preacher_description": "J. Edwin Orr (1912 - 1987)\r\nListen to freely downloadable audio sermons by the speaker J. Edwin Orr in mp3 format. Brother Orr shared in an experience of revival in his youth as he traveled by faith and saw many powerful workings of God. After years of seeing personal revival and experiences in his ministry he studied the theme of historical revival to equip and teach the Church.\r\n\r\nHe published many books on the topic of subject of revival: \"Can God?\" \"Full Surrender\" and many others. He ministered cross-denoninationally in baptist, pentecostal, calvary chapel and in many other movements. He was also influential in the Campus Crusade for Christ organization.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "15"
                },
                {
                    "book": "Mark",
                    "chapter": "1"
                },
                {
                    "book": "Matthew",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Four R's Of The Gospel: Redemption",
            "url": "http:\/\/api.sermonindex.net\/SID24534",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 1:7",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24534-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Foursquare Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID27451",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27451-download",
            "preacher_name": "George Jeffreys",
            "preacher_image": "",
            "preacher_description": "George Jeffreys (1889 - 1962)\r\nListen to freely downloadable audio sermons by the speaker George Jeffreys in mp3 format.  was a Welsh minister who founded the Elim Pentecostal Church, one of the first Pentecostal organisations. As a fifteen-year-old from Nantyffylon, Maesteg, Wales, George became a Christian during the 1904-1905 Welsh Revival, along with his older brother Stephen. At the time, many local Christians believed the two brothers were appointed by God to do great works for Him.\r\nIn the many churches, conventions and camp meetings where George and Stephen Jeffreys preached in the years after this, there were reports of many miraculous healings and other acts of God. Such healings brought George to his \"foursquare\" belief that Jesus is Saviour, Healer, Baptiser and Coming King. George, along with a small group of peers, became known as the Elim Evangelistic Band in Belfast and all over Ulster. This group of people brought crowds into their large tent, and later, into the Belfast hall they acquired. Out of this, George founded his first church in Belfast in 1914, and the Elim Foursquare Gospel Alliance, as it is officially known, was born.",
            "_scripture": []
        },
        {
            "title": "The Free Offer of the Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID0308",
            "size": "5696000",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "The mind of the flesh recoils from Christ as the supreme manifestation of God's glory; to believe on Christ is something the natural man cannot do; alongside renewal by the Holy Spirit is the drawing and giving by the Father which enables us to come to Christ; we come because a mysterious transaction has taken place between the persons of the Godhead, the Father making a donation of us to his Son, bringing raptures of holy delight to the Son; stress on the action of God is not inconsistent with stress on the activity of the person being saved; it is a divine impossibility for the Son to refuse anyone presented to him by the Father; no limitation can be placed on the simple word of Christ that whoever comes to Him will in no wise be cast out; sovereign operations of God's efficacious grace and free overtures of the gospel are not antithetical to one another; full and free overtures of the gospel confront your responsibility, and you cannot plead depravity as excuse for unbelief.",
            "download": "http:\/\/api.sermonindex.net\/SID0308-download",
            "preacher_name": "John Murray",
            "preacher_image": "\/images\/john_murray.gif",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID22517",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 53:4-11",
            "topic": "Gospel",
            "description": "The gospel is not moral conformity, which is religion, nor is it self-discovery, which is secularism. The gospel is something else altogether — a grid through which we see the world. There are three results of the gospel: the restructuring of our hearts, the removal of our sin, and the reversal of our values.",
            "download": "http:\/\/api.sermonindex.net\/SID22517-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "53"
                }
            ]
        },
        {
            "title": "The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID24825",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:6",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24825-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Gospel According To Noah",
            "url": "http:\/\/api.sermonindex.net\/SID28700",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28700-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Gospel According to Isaiah",
            "url": "http:\/\/api.sermonindex.net\/SID16630",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16630-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "The Gospel Paul Preached",
            "url": "http:\/\/api.sermonindex.net\/SID4629",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 1,1 Corinthians 1:15",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4629-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "1"
                },
                {
                    "book": "Galatians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Gospel and the Righteousness of God",
            "url": "http:\/\/api.sermonindex.net\/SID21772",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21772-download",
            "preacher_name": "Art Katz",
            "preacher_image": "\/images\/art_katz.gif",
            "preacher_description": "Art Katz (1929 â€“ 2007)\r\nListen to freely downloadable audio sermons by the speaker Art Katz in mp3 format. He was radically converted by reading the New Testament. God used him to have a powerful prophetic insight into the end-times and the coming suffering of the jewish people before the great accepting of Jesus as Messiah. His eschatological insight is a very needful truth to be realized in the body of Christ. \r\n\r\nArt was a prophetic voice insofar as he called his listeners to purposes in God that would affect both time and eternity, purposes that had to do with the glory of God in the Church.   Frequently, his messages called the Church to an awareness of the Last Days [End-times] in such a way that made that time seem imminent and at the door.",
            "_scripture": []
        },
        {
            "title": "The Gospel in Philemon",
            "url": "http:\/\/api.sermonindex.net\/SID25247",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25247-download",
            "preacher_name": "Anton Bosch",
            "preacher_image": "",
            "preacher_description": "Anton Bosch ( - )\r\nListen to freely downloadable audio sermons by the speaker Anton Bosch in mp3 format.  Privileged to be born into a long line of preachers, Anton Bosch met the Lord Jesus Christ as his Saviour in 1968. In 1971 he entered the Theological College of South Africa for two years, completed the third year by correspondence and was awarded the Diploma in Theology. In 2005 he was awarded the degree Master in Theology cum laude. The title of his dissertation was â€œThe pastoral and practical principles on which the churches in the New Testament are basedâ€\u009d. He is currently working on his Ph.D. in Biblical Studies. \r\n\r\nIn 2003 he was elected to the board of the International Fellowship of Christian Believers (formerly OFFI) with responsibility for the African continent and in 2004 was asked to serve as its international president. At the end of 2003 he was called to assist Burbank Community Church (Los Angeles, California) as itâ€™s senior pastor.. In 2009 the church moved to new premises in Sun Valley and us now known as Sun Valley Community Church (SVCC). Anton continues to teach at SVCC. It has been his life-long quest to rediscover New Testament Christianity and to call Christians and churches back to knowing, believing and living the Bible. He has planted a number of churches that are based on these principles. He is passionate about a correct exegesis of the Word and specialises in expository preaching and teaching.",
            "_scripture": []
        },
        {
            "title": "The Gospel is the Power of God",
            "url": "http:\/\/api.sermonindex.net\/SID22253",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16-17",
            "topic": "Gospel",
            "description": "This message was preached August 24, 2008 at Valley Church in Smithfield, Utah. \"For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek. For therein is the righteousness of God revealed from faith to faith: as it is written. The just shall live by faith.\" (Romans 1:16-17) The Gospel which saves us is the power of God and the wisdom of God; for no one was saved by their own power, nor their own wisdom, but by the working alone of God's mighty power. The greatest need of man is righteousness with God, but it is also his greatest impossibility. Only through the Gospel is that righteousness secured, not by the strength and will of the flesh, but by the power and wisdom and God.",
            "download": "http:\/\/api.sermonindex.net\/SID22253-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Gospel of Jesus Christ (S.N.E. Reformation Conference)",
            "url": "http:\/\/api.sermonindex.net\/SID24205",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 34:5-8",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24205-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "The Gospel of Mark",
            "url": "http:\/\/api.sermonindex.net\/SID20885",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20885-download",
            "preacher_name": "Dennis Kinlaw",
            "preacher_image": "",
            "preacher_description": "Dennis Kinlaw ( - )\r\nListen to freely downloadable audio sermons by the speaker Dennis Kinlaw in mp3 format.  Dennis Franklin Kinlaw was born June 26, 1922, in Lumberton, North Carolina. He attended Asbury College, graduating in 1943, and Asbury Theological Seminary, graduating in 1946. He pursued further studies at Princeton Theological Seminary and University of Edinburgh, Scotland. He received an M.A. and Ph.D. from Brandeis University. On December 31, 1943, Kinlaw married a college classmate, Elsie Blake (Class of 1943). He was ordained in the North Carolina Conference of the United Methodist Church in 1951. (He later transferred to the Kentucky Conference.) In 1959 he served as a visiting professor at Seoul Theological College in South Korea. In 1963 he returned to Asbury Theological Seminary, this time as a professor of Old Testament history, theology, and languages.\r\nIn 1983 Kinlaw founded the Francis Asbury Society, an organization based in Wilmore, Kentucky, whose purpose is to promote the message of Scriptural holiness through evangelism, discipleship, missions outreach, and publications. Kinlaw also served as chairman of the board of the mission organization OMS International. He is an accomplished pastor, professor, administrator, evangelist, teacher, and author.",
            "_scripture": []
        },
        {
            "title": "The Gospel of Romans",
            "url": "http:\/\/api.sermonindex.net\/SID7361",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1-16",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7361-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Greatest Story Ever Told",
            "url": "http:\/\/api.sermonindex.net\/SID6741",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6741-download",
            "preacher_name": "Oswald J. Smith",
            "preacher_image": "\/images\/oswald_j_smith.gif",
            "preacher_description": "Oswald J. Smith (1889 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Oswald J. Smith in mp3 format. Was a Canadian pastor, author, and missions advocate. He founded The People's Church in Toronto in 1928. Over the course of eighty years he preached more than 12,000 sermons in 80 countries, wrote thirty-five books (with translations into 128 languages), as well as 1,200 poems, of which 100 have been set to music, including \"Deeper and Deeper\" (first line \"Into the heart of Jesus\").\r\nThe great burden of Oswald J. Smith's Christian life was to see the lost come to the Lord. He was well known for the motto: \"We talk of the Second Coming; half the world has never heard of the first.\" and \"No one has the right to hear the gospel twice, while there remains someone who has not heard it once.\"",
            "_scripture": []
        },
        {
            "title": "The Last Gospel Message to an Ungodly World",
            "url": "http:\/\/api.sermonindex.net\/SID23361",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23361-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Old Gospel versus a New Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID26892",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26892-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        },
        {
            "title": "The Pleasure of God in the Gospel of His Son",
            "url": "http:\/\/api.sermonindex.net\/SID22250",
            "size": "0",
            "format": "mp3",
            "scripture": "Colossians 1:19-22",
            "topic": "Gospel",
            "description": "This message was preached on September 6, 2009, at the Guinavah Campground amphitheater. \"For it pleased the Father that in Him all the fullness should dwell, and by Him to reconcile all things to Himself, by Him, whether things on earth or things in heaven, having made peace through the blood of His cross. And you, who once were alienated and enemies in your mind by wicked works, yet now He has reconciled in the body of His flesh through death, to present you holy, and blameless, and above reproach in His sight.\" (Colossians 1:19-22) Contrary to what we might feel, God does not reluctantly forgive sins but He is pleased and full of joy to reconcile His enemies unto Himself. It pleased the Lord to crush His Son for our sakes, and when we apprehend this wonderful knowledge of God's good pleasure in the gospel, our hearts will be liberated and our lives transformed.",
            "download": "http:\/\/api.sermonindex.net\/SID22250-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Power Of The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID17026",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17026-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Power Of The Gospel And The Poison Of The Devil",
            "url": "http:\/\/api.sermonindex.net\/SID27534",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 14:1-7",
            "topic": "Gospel",
            "description": "1-The power of the Gospel 2-The poison of the devil",
            "download": "http:\/\/api.sermonindex.net\/SID27534-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "The Problem Of A Good God",
            "url": "http:\/\/api.sermonindex.net\/SID22316",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22316-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "The True Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID19741",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19741-download",
            "preacher_name": "Andrew Strom",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The True Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID20961",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 3:23-27",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20961-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The True Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID23261",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23261-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "The last 3 - I AMs of Johns Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID23675",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23675-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Try To Determine",
            "url": "http:\/\/api.sermonindex.net\/SID20056",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20056-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        },
        {
            "title": "Two Minute Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID27820",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27820-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Unashamed of the Gospel Amidst Our Culture",
            "url": "http:\/\/api.sermonindex.net\/SID16479",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:16",
            "topic": "Gospel",
            "description": "Paul Washer uses examples from within his own denomination to reveal what is true of so many places that call themselves churches, with regard to (1) the ways in which Biblical and historical Christianity has been reduced to an impotent and empty creed, and (2) the effects of this reduction upon the people who are influenced by it. But whilst casting down false strongholds, he is also faithful to build up that which is true, clearly setting out what is the TRUE gospel of Christ, of which the Apostle was not ashamed. When that gospel is preached, we should be asking men, not “Do you know you’re a sinner?” but “Has God so worked in your heart that the sin you once loved you now hate?”; not “Have you made a decision?” but “Has God worked in your heart?”; not “Do you want to go to heaven?” but ”Has God so worked in your heart that you now esteem him worthy above all things, and desire HIM?”. Mr Washer includes examples of some Godly conversions, which clearly bear the fruits of  that miraculous and supernatural repentance and regeneration which are the work of God alone. (50 minutes).",
            "download": "http:\/\/api.sermonindex.net\/SID16479-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Unto The Furthermost Of The Gospel",
            "url": "http:\/\/api.sermonindex.net\/SID20853",
            "size": "0",
            "format": "mp3",
            "scripture": "Philippians 1:1-13",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20853-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "What Angels long to see! ",
            "url": "http:\/\/api.sermonindex.net\/SID22352",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22352-download",
            "preacher_name": "Phillip Jensen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "What Is The Gospel?",
            "url": "http:\/\/api.sermonindex.net\/SID22623",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 9:30-33",
            "topic": "Gospel",
            "description": "Most people in churches today have a false understanding of the Gospel. We associate it with things that are really the law. In this Sermon, Dr. Baucham discusses what the Gospel is \"not\" and what the Gospel \"is\".",
            "download": "http:\/\/api.sermonindex.net\/SID22623-download",
            "preacher_name": "Voddie Baucham",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "What is the Gospel?",
            "url": "http:\/\/api.sermonindex.net\/SID26891",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID26891-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        },
        {
            "title": "What is the Gospel? - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID25994",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25994-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "What is the Gospel? - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID25995",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Gospel",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25995-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        }
    ]
}