{
    "name": "Government",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 Peter - Part 23): The Christians Relation to Government",
            "url": "http:\/\/sermonindex.net\/SID2076",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:13-16",
            "topic": "Government",
            "description": "True to its title, this 23rd message of A. W. Tozer’s 34-part study on Peter’s first epistle explores “The Christian’s Relation to Government.” The words of 1 Peter 2:13-16 testify that human government is of divine order. However, Dr. Tozer debunks a myth that the Bible endorses the primitive concept of “divine right” rule. He explains, “The father, as the paternal source of the family, and thus as head of the family, and naturally as protector, defender, and bread winner of the family, was the first ruler.” Human government thus developed from the idea of the family. Furthermore, God’s Truth transcends all politics and human government. The pastor concludes with the beautiful words of Hebrews 12:22-24. The message was recorded on March 7, 1954, in Chicago, Illinois, and is 29 minutes and 42 seconds in length.",
            "download": "http:\/\/sermonindex.net\/SID2076-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Human Authorities-God's Servants",
            "url": "http:\/\/sermonindex.net\/SID12654",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Government",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12654-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        }
    ]
}