{
    "name": "Grace Of God",
    "description": "",
    "sermons": [
        {
            "title": "(Genesis) Genesis 22-24:60",
            "url": "http:\/\/sermonindex.net\/SID11894",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 22-23, Genesis 24:1-60",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11894-download",
            "preacher_name": "Joe Focht",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "22"
                },
                {
                    "book": "Genesis",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Colossians: Understanding God's Grace",
            "url": "http:\/\/sermonindex.net\/SID26706",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26706-download",
            "preacher_name": "Mariano Di Gangi",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Covenant of Grace ",
            "url": "http:\/\/sermonindex.net\/SID19775",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 2:16-21",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19775-download",
            "preacher_name": "Al Henson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Enjoying God's Grace - Part 1",
            "url": "http:\/\/sermonindex.net\/SID19617",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19617-download",
            "preacher_name": "Derek Prince",
            "preacher_image": "",
            "preacher_description": "Derek Prince (1915 - 2003)\r\nListen to freely downloadable audio sermons by the speaker Derek Prince in mp3 format. Derek's main gift of explaining the Bible and its teaching in a clear and simple way has helped build a foundation of faith in millions of lives. His non-denominational, non-sectarian approach has made his teaching equally relevant and helpful to people from all racial and religious backgrounds. He is the author of over 50 books, 600 audio and 100 video teachings, many of which have been translated and published in more than 100 languages. His daily radio broadcast is translated into Arabic, Chinese (Amoy, Cantonese, Mandarin, Shanghaiese, Swatow), Croatian, German, Malagasy, Mongolian, Russian, Samoan, Spanish and Tongan. The radio program continues to touch lives around the world.\r\nDerek Prince Ministries persists in reaching out to believers in over 140 countries with Derek's teachings, fulfilling the mandate to keep on \"until Jesus returns.\"",
            "_scripture": []
        },
        {
            "title": "Enjoying God's Grace - Part 2",
            "url": "http:\/\/sermonindex.net\/SID19618",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19618-download",
            "preacher_name": "Derek Prince",
            "preacher_image": "",
            "preacher_description": "Derek Prince (1915 - 2003)\r\nListen to freely downloadable audio sermons by the speaker Derek Prince in mp3 format. Derek's main gift of explaining the Bible and its teaching in a clear and simple way has helped build a foundation of faith in millions of lives. His non-denominational, non-sectarian approach has made his teaching equally relevant and helpful to people from all racial and religious backgrounds. He is the author of over 50 books, 600 audio and 100 video teachings, many of which have been translated and published in more than 100 languages. His daily radio broadcast is translated into Arabic, Chinese (Amoy, Cantonese, Mandarin, Shanghaiese, Swatow), Croatian, German, Malagasy, Mongolian, Russian, Samoan, Spanish and Tongan. The radio program continues to touch lives around the world.\r\nDerek Prince Ministries persists in reaching out to believers in over 140 countries with Derek's teachings, fulfilling the mandate to keep on \"until Jesus returns.\"",
            "_scripture": []
        },
        {
            "title": "Everything is For the Glory of God",
            "url": "http:\/\/sermonindex.net\/SID21736",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "Jim Cymbala shares how everything in the world, life and Christian life is for the glory of God. This is an important foundational message for Christian life and many of us seem to drift from this sure place and goal. He also shares how our constant victory in Christ must be soley by His grace and for His glory.",
            "download": "http:\/\/sermonindex.net\/SID21736-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "God Of Grace And Glory",
            "url": "http:\/\/sermonindex.net\/SID4638",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 5:10-11",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4638-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "God Omnipotent Reigns In Our Lives",
            "url": "http:\/\/sermonindex.net\/SID27672",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5:19",
            "topic": "Grace Of God",
            "description": "This message was preached at the 1981 General Council of the Assemblies of God. Wilkerson gives a overview of the ministry God has given him to serve New York City and speaks of the wickedness growing in America. He speaks of the growing homosexual movement in America. He speaks of the grace of God and that God can forgive anyone who repents and comes to Christ.",
            "download": "http:\/\/sermonindex.net\/SID27672-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "God's Grace",
            "url": "http:\/\/sermonindex.net\/SID21090",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21090-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "Grace of God",
            "url": "http:\/\/sermonindex.net\/SID22873",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22873-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Great Men by the Grace of God",
            "url": "http:\/\/sermonindex.net\/SID17266",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17266-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": []
        },
        {
            "title": "Growing in the Grace of God #23 - Various Aspects of New Covenant Grace Part 1",
            "url": "http:\/\/sermonindex.net\/SID11358",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 15:6",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11358-download",
            "preacher_name": "Bob Hoekstra",
            "preacher_image": "",
            "preacher_description": "Bob Hoekstra ( - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bob Hoekstra in mp3 format. Bob's involvement with the Calvary Chapels began in 1971, when he and his wife Dini visited Calvary Chapel Costa Mesa on a Sunday evening. They were deeply touched by the life-giving teaching of the word of God, the simple worship \"in Spirit and in truth\", and the profound expressions of the love of the Lord among the saints. Upon returning to Dallas, they regularly obtained Pastor Chuck Smith's teaching tapes and eventually became daily listeners of the Word for Today on the radio.\r\n\r\nSince 1993, Bob had been teaching at Calvary Chapel and other church fellowships across the country and overseas (including, Seminars, Pastors' Conferences, Church Services, Leadership Conferences, Retreats, and Schools of Evangelism\/Ministry). He has taught numerous classes at Calvary Chapel Bible College (both at its former location in Twin Peaks, CA and its current location in Murrieta Hot Springs, CA) as well as at the extension campuses of Costa Mesa, Vista, San Diego, El Cajon, and others. Bob's teaching generally highlights such subjects as Counseling God's Way ,Family God's Way ,Growing in the Grace of God ,The Church: How Jesus Builds It ,Contending for the Faith ,Promise Believers ,The Sufficiency of Christ and His Word ,The Psychologizing of the Faith , and related themes.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Not to Be Wasted",
            "url": "http:\/\/sermonindex.net\/SID1184",
            "size": "6881280",
            "format": "mp3",
            "scripture": "John 3:16",
            "topic": "Grace Of God",
            "description": "Starting from John 3:16, we find that the word \"perish\" means far more than we might first expect. God does not desire that any life be wasted and become as refuse, but that all men live abundantly in the purpose for which they were created.   The grace of God provides the way of escape for His children. When we embrace the   will of God it is not in just a moment of surrender, but a lifetime.",
            "download": "http:\/\/sermonindex.net\/SID1184-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Gospel of the Grace of God",
            "url": "http:\/\/sermonindex.net\/SID14161",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 20:20-24",
            "topic": "Grace Of God",
            "description": "December 3, 2006 - A true conversion of Christ becomes miraculous when we understand that there is an enablement through the Spirit to love and serve Him. God will send promptings of His love to open our hearts to the Gospel of Jesus Christ. Everything that man longs for is found in Jesus and in knowing His plan for our lives. The question is, \"can we be brought to this place of truth?\" It is the love of God that brings you into a love relationship with Him. Jesus came to seek and save those who are lost.",
            "download": "http:\/\/sermonindex.net\/SID14161-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The Grace Of God-01 Grandeur Of Grace",
            "url": "http:\/\/sermonindex.net\/SID12760",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12760-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "The Grace Of God-02 Grandeur Of Grace",
            "url": "http:\/\/sermonindex.net\/SID12761",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12761-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "The Grace of God",
            "url": "http:\/\/sermonindex.net\/SID1062",
            "size": "0",
            "format": "mp3",
            "scripture": "Titus 2:1-15, Hebrews 12:6",
            "topic": "Grace Of God",
            "description": "\"You can never have the fruit until the blossom is gone, and it takes terrible winds to get rid of the blossom in order to bring on the fruit.\" If you are in struggles or trials and feel things are not going the way you want them to go. Take the time to listen to this. It is only 22 minutes long delivered by Sparks in 1955, but it is of eternal value for them that has ears to hear. Heb 12:6 For whom the Lord loveth he chasteneth, and scourgeth every son whom he receiveth.",
            "download": "http:\/\/sermonindex.net\/SID1062-download",
            "preacher_name": "T. Austin Sparks",
            "preacher_image": "\/images\/t_austin_sparks.gif",
            "preacher_description": "T. Austin Sparks (1888 â€“ 1971)\r\nListen to freely downloadable audio sermons by the speaker T. Austin Sparks in mp3 format. He was ordained as a Baptist pastor at the age of 24, and from 1912 to 1926 led three congregations in Greater London. During these years, he was also closely related to Jessie Penn-Lewis and her publication and speaking ministry, the \"Overcomer Testimony.\"\r\n\r\nAmong the many books that he wrote, at least three are regarded as Christian classics: The School of Christ, The Centrality and Supremacy of the Lord Jesus Christ and We Beheld His Glory. The primary theme of Sparks' books is the exaltation of the Lord Jesus Christ. He mentored Watchman Nee for many years and was very influential in his understanding of the Church Life.",
            "_scripture": [
                {
                    "book": "Titus",
                    "chapter": "2"
                },
                {
                    "book": "Hebrews",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "The Grace of God in this Present Age",
            "url": "http:\/\/sermonindex.net\/SID26682",
            "size": "0",
            "format": "mp3",
            "scripture": "Titus 2:11-14",
            "topic": "Grace Of God",
            "description": "We preachers should revive each other so that the Gospel can go forth. Islamists like Gadaffi had said that they will take Europe simply by having more children, while Africa will become Islamic. We Christians should stop betray the Lord like Judas. We must remember who the real enemy, satan is. We find the grace of God first mentioned in the time of Noah, in Gen 6:8, \"Noah found favour in the eyes of the Lord\". Way back then Noah found grace in Godâ€™s eyes. Jesus said in the last days will be a time like the time of Noah. There was sexual immorality and flirting around between boys and girls. And itâ€™s the same today. It reminds one of the large ship built in Britain, the Titanic. After the construction of that ship, which was at that time the largest ship of its time, one of the builders commented that even God cannot sink it. Many booked for its maiden voyage. It traveled through an area full of icebergs, struck one and sank. Most people on the Titanic drowned. At the moment when it struck the iceberg there was a party going on, but when the news spread that it had struck an iceberg, they changed the music to \"nearer my God to Thee\".",
            "download": "http:\/\/sermonindex.net\/SID26682-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Titus",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Plan of Grace",
            "url": "http:\/\/sermonindex.net\/SID2890",
            "size": "11067392",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2890-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        },
        {
            "title": "The Provision of Grace",
            "url": "http:\/\/sermonindex.net\/SID2891",
            "size": "7677440",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2891-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        },
        {
            "title": "The True Grace Of God",
            "url": "http:\/\/sermonindex.net\/SID4080",
            "size": "12895232",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4080-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The True Grace Of God",
            "url": "http:\/\/sermonindex.net\/SID15475",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grace Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15475-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}