{
    "name": "Grieving The Spirit",
    "description": "",
    "audio_sermons": [
        {
            "title": "Grieve Not The Holy Spirit",
            "url": "http:\/\/sermonindex.net\/SID23875",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 4:30",
            "topic": "Grieving The Spirit",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23875-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Grieving The Spirit",
            "url": "http:\/\/sermonindex.net\/SID3784",
            "size": "13713408",
            "format": "mp3",
            "scripture": "",
            "topic": "Grieving The Spirit",
            "description": "A gripping sermon where Leonard Ravenhill preaches on the grieving of the Holy Spirit. Ravenhill is convinced the reason we do not see the power of the Spirit today can be found from the following verse: \"the Spirit was not yet given, because Jesus was not yet glorified.\" (John 7:39) This is perhaps one of Ravenhill's best sermons.",
            "download": "http:\/\/sermonindex.net\/SID3784-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Sins Against The Holy Spirit",
            "url": "http:\/\/sermonindex.net\/SID18307",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Grieving The Spirit",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18307-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        }
    ]
}