{
    "name": "Happiness",
    "description": "",
    "audio_sermons": [
        {
            "title": "My Happy Plenty",
            "url": "http:\/\/sermonindex.net\/SID18860",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Happiness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18860-download",
            "preacher_name": "Jack Hyles",
            "preacher_image": "",
            "preacher_description": "Jack Hyles (1926 - 2001)\r\nListen to freely downloadable audio sermons by the speaker Jack Hyles in mp3 format. Dr. Hyles was Pastor of First Baptist Church from August, 1959 until his death in February, 2001.  In the last five years of his ministry, this church had an average weekly attendance of over 15,000 with approximately 10,000 baptisms each year.  For many years, the church has been acclaimed to have the \"World's Largest Sunday School.\"\r\nDr. Hyles is the author of 49 books and pamphlets.  Many of his sermons are available on audio and video tape.  Dr. Hyles' experience covers numerous evangelistic campaigns, Bible conferences, etc.  He preached in virtually every state of the Union and in many foreign countries.  He hosted 37 annual Pastors' Schools, which have attracted thousands of preachers from all over the world.",
            "_scripture": []
        },
        {
            "title": "The Pursuit of Happiness",
            "url": "http:\/\/sermonindex.net\/SID11920",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 20:20-24",
            "topic": "Happiness",
            "description": "September 4, 2005 - Jesus will come in His compassion and turn our feet around to walk in all His ways. As we begin to serve Jesus we will share His burden for the lost and gird ourselves with a towel that will reach out to a fallen humanity and point their feet to the only path of life that leads to true happiness. There is no other way to happiness but through the fullness of Jesus Christ.",
            "download": "http:\/\/sermonindex.net\/SID11920-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "20"
                }
            ]
        }
    ]
}