{
    "name": "Heavenly Minded",
    "description": "",
    "audio_sermons": [
        {
            "title": "Behold, your King comes to you",
            "url": "http:\/\/sermonindex.net\/SID14305",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 21:1–9",
            "topic": "Heavenly Minded",
            "description": "It is a pity when people are blunt towards the things of heaven. The natural man cannot fathom or understand the things of heaven. The things of the earth are very dear and close to them, but the things of heaven are dim. This should not be the case. The things of heaven should be close to us and the things of the earth should be strangely dim. Our Lord said in Matt 6:33, \"seek first the Kingdom of God and His righteousness, and all these things shall be added unto you\". Satan blinds the eyes of the people of this world so that they do not regard or seek the things of heaven. They are possessed with the lusts of this earth and have lost even their humanity. They have become like the beasts for they are ruled by the lusts of the flesh. Even their language and thoughts are perverted and bestial.",
            "download": "http:\/\/sermonindex.net\/SID14305-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Being Heavenly Minded",
            "url": "http:\/\/sermonindex.net\/SID18799",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Heavenly Minded",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18799-download",
            "preacher_name": "Dany Hameau",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}