{
    "name": "Hinderances",
    "description": "",
    "sermons": [
        {
            "title": "Hinderances to Beholding Him",
            "url": "http:\/\/sermonindex.net\/SID13861",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Hinderances",
            "description": "Alan Martin speaks on hindrances in our inner man that restrain ourselves to behold God in all His glory. To share in the sufferings of Christ and the power of Christ. Many things hold us back from all that God desires to do in our lifes. God desires to perfect His saints according to His will. The word of God is that mirror and balm that will lead us to the fulness of Christ.",
            "download": "http:\/\/sermonindex.net\/SID13861-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Prayer 02 Luke 11: - Hinderances",
            "url": "http:\/\/sermonindex.net\/SID10598",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 11",
            "topic": "Hinderances",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10598-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Why is it so Hard to Pray?",
            "url": "http:\/\/sermonindex.net\/SID15832",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:17",
            "topic": "Hinderances",
            "description": "June 12, 2007 - Our whole life is to be a walking, breathing prayer. Satan will oppose prayer because He knows it is our life line to God. This message speaks of 3 reasons why people stop praying. First, our journey and will are not in line with God. Second, unconfessed sin. And lastly, a wrong perception of what prayer is. Prayer is simply knowing the mind of God and moving forward in faith with Him. We can come boldly with an honest heart and agree with what He has spoken to us until He brings it to pass.",
            "download": "http:\/\/sermonindex.net\/SID15832-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        }
    ]
}