{
    "name": "Holy Place",
    "description": "",
    "sermons": [
        {
            "title": "Entering Into The Holy Place",
            "url": "http:\/\/api.sermonindex.net\/SID23872",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Holy Place",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23872-download",
            "preacher_name": "Ralph Sutera",
            "preacher_image": "",
            "preacher_description": "Ralph Sutera ( - )\r\nListen to freely downloadable audio sermons by the speaker Ralph Sutera in mp3 format. Twin brothers Used of God in revival since 1971. Single and joint church revival ministries usually two and one-half weeks in length. Characterized by straight-forward preaching, visual presentations, follow-through teaching, personal counselling by lay-team workers, etc. Crusades include sessions for men, ladies, youth, children, church leaders and pastoral staffs.",
            "_scripture": []
        },
        {
            "title": "Standing in the Holy Place",
            "url": "http:\/\/api.sermonindex.net\/SID20821",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Holy Place",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20821-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        }
    ]
}