{
    "name": "Home",
    "description": "",
    "sermons": [
        {
            "title": "Building The Home And The Church",
            "url": "http:\/\/api.sermonindex.net\/SID4052",
            "size": "11607040",
            "format": "mp3",
            "scripture": "",
            "topic": "Home",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4052-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Christ in the Home",
            "url": "http:\/\/api.sermonindex.net\/SID27132",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Home",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27132-download",
            "preacher_name": "Doc Greenway",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Home",
            "url": "http:\/\/api.sermonindex.net\/SID20407",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Home",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20407-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": []
        }
    ]
}