{
    "name": "Honor Of God",
    "description": "",
    "sermons": [
        {
            "title": "A Call to Those Who Care About the Honor of God",
            "url": "http:\/\/api.sermonindex.net\/SID19379",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1:1-11",
            "topic": "Honor Of God",
            "description": "October 4, 2009 - There is a spiritual wall that separates those who are truly serving God and those who are bringing carnality into His church. If God is going to be honored in this generation we must begin to rebuild the testimony of Christ in our lives. You may ask yourself how does this happen? How do I begin to rebuild this wall? The first thing we do is apply the truth of God's Word to every area of our life where we are not in agreement with Him. Secondly, we must remove the rubble in our homes that has blocked the door to the prayer closet. Lastly, call our children by example into the work of God. Suddenly there will be a people arise and begin to build according the ways of God and they will do it all for His honor!",
            "download": "http:\/\/api.sermonindex.net\/SID19379-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        }
    ]
}