{
    "name": "Hosea",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Hosea) The Prophet and the Prostitute",
            "url": "http:\/\/sermonindex.net\/SID11029",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 1-3",
            "topic": "Hosea",
            "description": "Hosea lived in the nation of Judah but his message was to the kings of the northern nation of Israel.  The Lord instructed Hosea to do a very difficult thing, to marry a woman who was a known prostitute, God commanded this because of Israels adultery against Him and He desired to work His word into the life of the prophet.  Hosea was the instructed by the Lord what to name each of his children the first was Jezreel (scattered), the second was Lo-ruhamah (no mercy) the third was Lo-ammi (not my people)  each of these childens names was reminder to all around them that the Lord would scatter the nation of Israel and would not show mercy to them as they no longer wanted to be His people. The Lord showed His love for the people in the life of Hosea in that when his adulterous wife was living with another man Hosea still povided for her, such is the Lord attitude of grace towards us in that even though we go astray He still mercifully provides for us.",
            "download": "http:\/\/sermonindex.net\/SID11029-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Hosea #1 Ch. 1 Introduction",
            "url": "http:\/\/sermonindex.net\/SID12108",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 1",
            "topic": "Hosea",
            "description": "Hosea was prophet for the northern kingdom of Israel at a time of great prosperity materially but great poverty spiritually speaking.  The 'core' sin of Israel was idolatry, but it was not their only sin far from it.  The Lord chose Hosea's marriage to illustrate how He felt toward Israel, His adulterous wife. the Lord commanded hosea to marry a woman of whoredom and shows Hosea before hand what she will be like toward him.  Each of their childen God then names, again as an illustration of how He felt toward Israel ie the children were the result of a relationship where the husband loved the wife but the wife went away to other men. The first was named Jezreel, which is a place in Israel where there has been great bloodshed and will one day be the location of the final war battle Armageddon. Hosea's other children children showed how the Lord for a time would judge Israel and not show mercy to them for they were no longer considered his people, hence they were called Lo-ruhammah (no mercy) and Lo-ammi (not My people).",
            "download": "http:\/\/sermonindex.net\/SID12108-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Hosea #6 Ch. 9-10 Hosea",
            "url": "http:\/\/sermonindex.net\/SID12113",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 9-10",
            "topic": "Hosea",
            "description": "Hosea refers to the sins of Gibeah which to ancient Israel was synonymous with some of  the most terrible acts ever to take place in Israel, they are chronicled in Judges 19-21 and almost lead to the entire tribe of Benjamin being wiped out.  But now Israel was almost as abominable as in those days.  Verse 11 of chapter 9 is one of the many 'Pro-life' verses of the Bible stating plainly that life begins at conception. Hosea predicts that Israel would be scattered among the nations until the Lord regathered them into the land as only He could do this.  The Lord as always offered Israel one last chance to repent but they did not and so judgement came in the form of exhile into Assyria.",
            "download": "http:\/\/sermonindex.net\/SID12113-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Hosea #7 Ch. 11-12 Hosea",
            "url": "http:\/\/sermonindex.net\/SID12114",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 11-12",
            "topic": "Hosea",
            "description": "Here in Hosea we find the troubled heart of the Lord for His people Israel, the Lord's love for humanity is one of the greatest mysteries, it is shown in God's fatherly attributes toward us, yet these attributes are not common in the Old Testament and so this revelation must have been astonishing to Hosea at the time.  The prophet began to discover that at the very heart of the almighty Creator was love and that God is love.  The Lord shows how His heart was torn for His people as He did not want to judge them but His holiness demanded it.  So judgement had to be prescribed upon the nation as they had commited idolatry in Bethel (the house of God) and this was a forshadowing of the abomination of desolation. We know that ultimately the Lord's love and justice met when His wrath was poured upon our Lord Jesus on the cross of Calvary.  How only His precious blood could atone for the wrong of not just Israel but for all of us.",
            "download": "http:\/\/sermonindex.net\/SID12114-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Hosea #8 Ch. 13-14 Hosea",
            "url": "http:\/\/sermonindex.net\/SID12115",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 13-14",
            "topic": "Hosea",
            "description": "Israel was rooted in idolatry in that they had been worshipping golden calves in Bathel.  The Lord reminded Israel that He had brought them out of Egypt and out of bondage, and from this reminded them that He alone was their Saviour.  He shows them that He is their only Hope but they have stubbornly rejected Him and so their Saviour would be their Judge. Hosea beseeches the people to return to the Lord and repent. The Lord states that He will restore them to Him after they have repented, and the Lord would wonderfully take them back to Himself.  The prophecy of Hosea finishes with the ultimate repentence of Israel and turning back to the Lord and the Lord's acceptance of them which will herald the Second Coming.",
            "download": "http:\/\/sermonindex.net\/SID12115-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "13"
                }
            ]
        }
    ]
}