{
    "name": "Household Salvation",
    "description": "",
    "sermons": [
        {
            "title": "Bringing Your House To Spiritual Victory",
            "url": "https:\/\/sermonindex.info\/SID3064",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 10:30-33",
            "topic": "Household Salvation",
            "description": "(preached: Dec. 7, 2003) What an outstanding message of exhortation! Using the account of Cornelius in Acts 10, Pastor Conlon shows us that we should have an expectancy that God is going to move among our family and those around us, an expectancy that our lives will change every day.",
            "download": "https:\/\/sermonindex.info\/SID3064-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Go and Get Your Family",
            "url": "https:\/\/sermonindex.info\/SID16793",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Household Salvation",
            "description": "February 3, 2008 - We are living in a society that is grieved for their sons and daughters. Underneath this grief is a cry that is asking WHERE IS GOD? Some are in the church asking the same thing - How can we get our family back? How can we get back what we have lost? The answer is that we must get back to the place where God first anointed us. We must get back to the secret closet of prayer and begin one more time to WALK in the SPIRIT! God has given us a LIFE PARTNER who is the HOLY SPIRIT to enable us to be more than we cloud ever be by any amount of human wisdom and strength. God is calling His church to lay down our lives for others. When we get back to the secret closet of prayer we will hear the Lord say go and get my sons and daughters, go and get your family. When we go in faith we will get back ALL that the devil has stolen.",
            "download": "https:\/\/sermonindex.info\/SID16793-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        }
    ]
}