{
    "name": "Idolatry",
    "description": "",
    "audio_sermons": [
        {
            "title": "Bondage",
            "url": "http:\/\/sermonindex.net\/SID3617",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 3",
            "topic": "Idolatry",
            "description": "This message was delivered at Bob Jones Univeristy and begins with Bible recitals and hymns sung by some of the girls who were saved while in Lester Rolofs homes for young people. The sin of Idolatory almost always leads into bondage, and this is where we find the children of Isreal at the start of Exodus.  Dr Rolof reveals a great turth in this story of the exodus, that it wasn't the plagues that freed the people God had chosen from bondage but the Blood. How it was only possible, and still is, only possible to be truelly free bondage by no other way than by the blood of the Lord Jesus Christ.",
            "download": "http:\/\/sermonindex.net\/SID3617-download",
            "preacher_name": "Lester Roloff",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Christian Idolatry",
            "url": "http:\/\/sermonindex.net\/SID28320",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Idolatry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28320-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "False Gods",
            "url": "http:\/\/sermonindex.net\/SID17305",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 20:1-5",
            "topic": "Idolatry",
            "description": "None are more likely to be worshipping a false god, than the man who is so self-deceived and \"sure\" that he is worshipping the true God. Examination of one's relationship with God thru Christ is always a blessed experience. Search your heart before God in this message, or rather ask the Lord to come by His Spirit and root out all deception that may be lingering in your heart. We want a true relationship with the God of the Bible. We want that relationship to be subjected to scrutiny and founded on the great principles of the Word of God. Know HIM and be at peace. Miss HIM and you will find unending remorse.",
            "download": "http:\/\/sermonindex.net\/SID17305-download",
            "preacher_name": "B.B. Caldwell",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Idolatry Is To Love The World",
            "url": "http:\/\/sermonindex.net\/SID13464",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Idolatry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13464-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Man-Made Gods",
            "url": "http:\/\/sermonindex.net\/SID19226",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Idolatry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19226-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Other god's dominion over us",
            "url": "http:\/\/sermonindex.net\/SID4259",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Idolatry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4259-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Soul Idolatry",
            "url": "http:\/\/sermonindex.net\/SID15425",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Idolatry",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15425-download",
            "preacher_name": "Dean Taylor",
            "preacher_image": "",
            "preacher_description": "Dean Taylor ( Â– Present)\r\nListen to freely downloadable audio sermons by the speaker Dean Taylor in mp3 format. Dean Taylor is the general editor of The Remnant of the Charity church movement. He has written a powerful book on non-resistance: A Change of Allegiance. His teachings on suffering and martyrdom are important for the body of Christ and we must learn again from our forefathers and how they suffered for Christ.\r\n\"Every day IÂ’m more convinced that the only thing worth putting my life into is the simple, child-like acceptance of the teachings of Jesus. I believe that Jesus meant what He said. But even more, I believe that JesusÂ’ plan for humanity is actually a great idea! Sometimes the ways and wisdom of Jesus donÂ’t make sense.\" - Dean Taylor",
            "_scripture": []
        },
        {
            "title": "The Image of God",
            "url": "http:\/\/sermonindex.net\/SID16288",
            "size": "0",
            "format": "mp3",
            "scripture": "Ezekiel 8:1-5, Revelation 1:14-15",
            "topic": "Idolatry",
            "description": "October 21, 2007 - When the church of Jesus Christ begins to portray a wrong image of God, it opens the door for uncalled and unfaithful men to take positions as spiritual leaders. The end result of standing before the wrong image of God will lead the people into a theological perspective that is based on human optimism as opposed to sacrifice and truth. The true image of God represents Jesus Christ, the Cross , His sacrifice and all that is Holy. If we are going to know the true image of God, we will be led to a place where we are undone, where everything that we thought we were has to die. We must take joyfully the spoils of all of our religious goods and come before this image of the TRUE and Holy God. It is only in the presence of Jesus Christ that we are turned from image to image by the Glory of God.",
            "download": "http:\/\/sermonindex.net\/SID16288-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        }
    ]
}