{
    "name": "Ignorance",
    "description": "",
    "audio_sermons": [
        {
            "title": "Hosea #3 Ch. 4-5 Israel's Willful Ignorance",
            "url": "http:\/\/sermonindex.net\/SID12110",
            "size": "0",
            "format": "mp3",
            "scripture": "Hosea 3",
            "topic": "Ignorance",
            "description": "In Hosea 4 the Lord lays the charges of Israels sin and open rebellion out for all to see, they included, idolatry (covetousness), lying stealing and adultery to name but a few because of this sin and Israels unrepentent attitude toward the Lord the Lord would set them aside for judgement and He laid the blame at the feet of the priests who had not instructed the people in the ways of the Lord and hence the Lord rejected the priesthood. Chapter 5 deals with the punishment for their crimes Hosea prophesied the Israel would fall and later on Judah would fall too, this is exactly what happened even though Judah were given 100 years longer than Israel.  The Lord passed judgement on Israel.  The final verse in chapter 5 is of particular note as it refers to Christs first coming as it mentions the Lord going and the returning (to Heaven) and returning again until Israel acknowledges their sin of rejecting their Messiah and then He will return to them.",
            "download": "http:\/\/sermonindex.net\/SID12110-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Ignorance, Prejudice",
            "url": "http:\/\/sermonindex.net\/SID12727",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 1:12-13",
            "topic": "Ignorance",
            "description": "Preached at Knox Presbyterian Church, Toronto on Aug 1967. Posted with the permission of Knox Presbyterian Church, Toronto.",
            "download": "http:\/\/sermonindex.net\/SID12727-download",
            "preacher_name": "Martyn-Lloyd Jones",
            "preacher_image": "\/images\/martynlloyd_jones.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "1"
                }
            ]
        }
    ]
}