{
    "name": "Image Of God",
    "description": "",
    "sermons": [
        {
            "title": "Bearing the Image of God",
            "url": "http:\/\/sermonindex.net\/SID17260",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Image Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17260-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": []
        },
        {
            "title": "In the Image of God",
            "url": "http:\/\/sermonindex.net\/SID4413",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:26",
            "topic": "Image Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4413-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        }
    ]
}