{
    "name": "Impossibilities",
    "description": "",
    "sermons": [
        {
            "title": "Doing the Impossible",
            "url": "http:\/\/sermonindex.net\/SID27667",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27667-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": []
        },
        {
            "title": "God Can When We Cannot ",
            "url": "http:\/\/sermonindex.net\/SID20167",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20167-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": []
        },
        {
            "title": "God Enjoys the Impossible",
            "url": "http:\/\/sermonindex.net\/SID28384",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28384-download",
            "preacher_name": "Otto Koning",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "How to do the Impossible",
            "url": "http:\/\/sermonindex.net\/SID19825",
            "size": "0",
            "format": "mp3",
            "scripture": "John 5-7",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19825-download",
            "preacher_name": "Don Higgins",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Impossible Situations",
            "url": "http:\/\/sermonindex.net\/SID24214",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 1:1-20",
            "topic": "Impossibilities",
            "description": "Just like with Hannah, many times when God is about to do something great, He looks for impossible situations. When we are broken and don't know where to turn, let's run to the Lord who can do miracles in our lives.",
            "download": "http:\/\/sermonindex.net\/SID24214-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Is The Lord Limited?",
            "url": "http:\/\/sermonindex.net\/SID24407",
            "size": "0",
            "format": "mp3",
            "scripture": "Micah 2:6-7",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24407-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Micah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Our God Can Fix Anything",
            "url": "http:\/\/sermonindex.net\/SID3600",
            "size": "17053696",
            "format": "mp3",
            "scripture": "Genesis 18:14, Luke 18:27",
            "topic": "Impossibilities",
            "description": "This is a faith-building message for all.  We often tell folks that there is nothing impossible with God.  But do we really believe that in our own lives?  If we say this to others then we had best understand and believe that very same thing when it comes to our own lives and walk with God.",
            "download": "http:\/\/sermonindex.net\/SID3600-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "18"
                },
                {
                    "book": "Genesis",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "The Glory of the Impossible",
            "url": "http:\/\/sermonindex.net\/SID3870",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3870-download",
            "preacher_name": "Devern Fromke",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "When Even Prayer Seems Impossible",
            "url": "http:\/\/sermonindex.net\/SID13194",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 26:36-46, 1 Chronicles 13:1-11",
            "topic": "Impossibilities",
            "description": "Have you ever been in a place where you feel something you have to do is impossible? where you try to accomplish what you think is the will of God only to find that your religious zeal is going against the very revealed word of almighty God. This is where Peter, James and John where when Jesus invited them to go into Gethsemane, just a few hours before they had pledged to the Lord that they would not desert Him even though He Himself had told them they would scatter as sheep without a Shepherd.  The power of the Holy Spirit was not yet given and so Peter was moving in the flesh, he didn't see where the resources for maintaining a close walk with Jesus would come from.  But it is through Christ that all things are made possible to us, all the purposes God would have us to accomplish can be met as long as we realize our own weakness and abject need for Christ to live His life through us and that this can only be done by complete reliance on Him for the resources.",
            "download": "http:\/\/sermonindex.net\/SID13194-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "13"
                },
                {
                    "book": "Matthew",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "Why Should I Pray for What Seems to be Impossible?",
            "url": "http:\/\/sermonindex.net\/SID23965",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Impossibilities",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23965-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        }
    ]
}