{
    "name": "Inheritance",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 4): The Christians Inheritance",
            "url": "http:\/\/sermonindex.net\/SID2057",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:1-5",
            "topic": "Inheritance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2057-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(1 Peter - Part 5): The Defiled World and Our Undefiled Inheritance",
            "url": "http:\/\/sermonindex.net\/SID2058",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:4",
            "topic": "Inheritance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2058-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Defiling The Inheritance",
            "url": "http:\/\/sermonindex.net\/SID15394",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:7",
            "topic": "Inheritance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15394-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Don't Break God's Heart",
            "url": "http:\/\/sermonindex.net\/SID13790",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 8:3, 2 Corinthians 5:21",
            "topic": "Inheritance",
            "description": "What a tradegy that many of God's people are missing their birthright, inheritance and what Christ secured on us for the cross. Forgiveness of sins is just like cleaning the cup but there is much more purpose and fulness in God that we need to seek after. Is the Devil robbing our inheritance in Christ? This breaks God's heart in our day.",
            "download": "http:\/\/sermonindex.net\/SID13790-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Glory of His inheritance",
            "url": "http:\/\/sermonindex.net\/SID15889",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Inheritance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15889-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        }
    ]
}