{
    "name": "Intimacy with God",
    "description": "",
    "audio_sermons": [
        {
            "title": "Intimacy",
            "url": "http:\/\/sermonindex.net\/SID13459",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy with God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13459-download",
            "preacher_name": "Jackie Pullinger",
            "preacher_image": "\/images\/jackie_pullinger.gif",
            "preacher_description": "Jackie Pullinger (1944 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jackie Pullinger in mp3 format. Shortly after her experience of being born-again the Lord called her to take a one-way ticket to Hong Kong, China. Her story is chronicled in the book: \"Chasing the Dragon\" which is a best-seller inspirational missionary story. He has founded St Stephen's Society in Hong Kong that helps serve drug addicts and gives them the life-transforming Gospel message.\r\n\r\nHer burden in ministry has been to show the love of Christ to the hurting and helpless. She saw in the message of the Gospel it had to have a response for us also to go and serve others. She teaches and shows this full-surrender is a simple response to receiving God's love in Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "Intimacy With God",
            "url": "http:\/\/sermonindex.net\/SID0149",
            "size": "4559360",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0149-download",
            "preacher_name": "J. Oswald Sanders",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Intimacy with God",
            "url": "http:\/\/sermonindex.net\/SID17711",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy with God",
            "description": "October 19, 2008 - In every person's heart there is a need for true intimacy. God the Father sent His Son Jesus Christ to sacrifice His life so we can have intimate access to God. We were created for intimacy with a living God. Some people go through their whole life searching to satisfy this need. Today Jesus Christ offers you this intimacy. The Bible says there is a day coming when some will stand before a Holy God only to find they let this intimacy and eternal life slip though their fingers. Sad to say in that moment you will understand how much God loved you. Today is the day of salvation, don't let it slip away.",
            "download": "http:\/\/sermonindex.net\/SID17711-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Intimacy with God",
            "url": "http:\/\/sermonindex.net\/SID20894",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20894-download",
            "preacher_name": "Dennis Kinlaw",
            "preacher_image": "",
            "preacher_description": "Dennis Kinlaw ( - )\r\nListen to freely downloadable audio sermons by the speaker Dennis Kinlaw in mp3 format.  Dennis Franklin Kinlaw was born June 26, 1922, in Lumberton, North Carolina. He attended Asbury College, graduating in 1943, and Asbury Theological Seminary, graduating in 1946. He pursued further studies at Princeton Theological Seminary and University of Edinburgh, Scotland. He received an M.A. and Ph.D. from Brandeis University. On December 31, 1943, Kinlaw married a college classmate, Elsie Blake (Class of 1943). He was ordained in the North Carolina Conference of the United Methodist Church in 1951. (He later transferred to the Kentucky Conference.) In 1959 he served as a visiting professor at Seoul Theological College in South Korea. In 1963 he returned to Asbury Theological Seminary, this time as a professor of Old Testament history, theology, and languages.\r\nIn 1983 Kinlaw founded the Francis Asbury Society, an organization based in Wilmore, Kentucky, whose purpose is to promote the message of Scriptural holiness through evangelism, discipleship, missions outreach, and publications. Kinlaw also served as chairman of the board of the mission organization OMS International. He is an accomplished pastor, professor, administrator, evangelist, teacher, and author.",
            "_scripture": []
        },
        {
            "title": "Intimacy with God - Prayer Meeting (CD Quality)",
            "url": "http:\/\/sermonindex.net\/SID0622",
            "size": "108426640",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy with God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0622-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Prayer - Fellowship With God",
            "url": "http:\/\/sermonindex.net\/SID18446",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Intimacy with God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18446-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        }
    ]
}