{
    "name": "Intuition",
    "description": "",
    "sermons": [
        {
            "title": "God Given Intuition",
            "url": "http:\/\/api.sermonindex.net\/SID26665",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 5:20",
            "topic": "Intuition",
            "description": "You do not have to go around telling people to do this and not that for if they're truly saved they will know the Lord and do the right for He writes His law in the heart of His children. We read in Acts how the early Christians were all of one heart and mind (Acts 4:32). If you have this sixth sense you cannot fight among yourselves but are one with God's children. You feel the same about different matters. You will even see things in the same way. But it's a pity that very often among Christians there is disunity because some are still holding on to their sin and own way. Sin darkens your understanding. God gives this sixth sense to His children that they aim at the same thing, they see things in the same way.",
            "download": "http:\/\/api.sermonindex.net\/SID26665-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "5"
                }
            ]
        }
    ]
}