{
    "name": "Irreverence",
    "description": "",
    "sermons": [
        {
            "title": "The Dangers Of Irreverence Before God",
            "url": "http:\/\/api.sermonindex.net\/SID26006",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Timothy 2:10-22, Numbers 16",
            "topic": "Irreverence",
            "description": "This sermon explores the danger of irreverence towards God in our associations and in ministry. There will always be people among us who desire to go back to \"Egypt.\" To them it is the land flowing with milk and honey. We must avoid their irreverant and profane words. We must avoid them and their influence. That is, we must \"purge ourselves of these\" in order to be pure and useful to God. In fact, Paul references the rebellion of Korah in 2 Timothy 2:19ff. as an example of God's estimate of this type of sin and rebellion.",
            "download": "http:\/\/api.sermonindex.net\/SID26006-download",
            "preacher_name": "Robert Wurtz II",
            "preacher_image": "",
            "preacher_description": "Robert Wurtz II ( - )\r\nListen to freely downloadable audio sermons by the speaker Robert Wurtz II in mp3 format.  For almost 20 years I have served as a author and teacher of advanced biblical studies. My interests are the New Covenant, apologetics and classical revival. Native of the Kansas City, Mo area and reside now in Independence, MO with wife Anna.\r\nHe is the author of many books including the newest Televangelicalism. In this insightful and thought provoking book, Robert Wurtz II traces the history of Christian evangelism from the book of Acts to modern times. The contrast between pre-1900 and post-1900 evangelism is so sharp, that the book is divided into two sections: Part 1, the pre-Billy Sunday era and Part 2, the post-Billy Sunday evangelistic era. This book is a must-read for anyone that has concerns about issues such as \"the sinner's prayer\" or shallow concepts of conversion.",
            "_scripture": [
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                },
                {
                    "book": "Numbers",
                    "chapter": "16"
                }
            ]
        }
    ]
}