{
    "name": "Ishmael",
    "description": "",
    "sermons": [
        {
            "title": "(Genesis) - Part 16",
            "url": "http:\/\/api.sermonindex.net\/SID14654",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 16:1-17:14",
            "topic": "Ishmael",
            "description": "The birth of Ishmael is a picture of doing things for God but not after God's way.  What we first call victory over sin is only an Ishmael, our own efforts under law.  When we come to our wits end and are broken like Abraham, then we can be a prince with God.",
            "download": "http:\/\/api.sermonindex.net\/SID14654-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Fatherlessness, the Cry of Ishmael",
            "url": "http:\/\/api.sermonindex.net\/SID17301",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Ishmael",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17301-download",
            "preacher_name": "Emanuel Esh",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "What is Your Ishmael",
            "url": "http:\/\/api.sermonindex.net\/SID3081",
            "size": "9169408",
            "format": "mp3",
            "scripture": "",
            "topic": "Ishmael",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID3081-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        }
    ]
}