{
    "name": "Jealousy",
    "description": "",
    "audio_sermons": [
        {
            "title": "God's Jealousy For His People",
            "url": "http:\/\/sermonindex.net\/SID1825",
            "size": "7069696",
            "format": "mp3",
            "scripture": "",
            "topic": "Jealousy",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1825-download",
            "preacher_name": "George Warnock",
            "preacher_image": "\/images\/george_warnock.gif",
            "preacher_description": "George Warnock (1917 - 2016)\r\nListen to freely downloadable audio sermons by the speaker George Warnock in mp3 format. Brother George Warnock was used of the Lord in the latter rain movement which he had influence in. He wrote some books which were corrections to imbalances in his day. His well known book was: \"The Feast Of Tabernacles\"\r\nHis heart has been to serve the body of Christ and see a last days manifestation of a pure Church that Jesus Christ will redeem as His bride. He tentmaked as a carpenter until well into retirement. He resided in Cranbrook, BC, Canada until his death. You can read a expanded biography of him on his family website.",
            "_scripture": []
        },
        {
            "title": "The Darkness Of Jealousy",
            "url": "http:\/\/sermonindex.net\/SID28613",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Jealousy",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28613-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Depravity Of Jealousy",
            "url": "http:\/\/sermonindex.net\/SID20281",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Jealousy",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20281-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "The Jealousy of God",
            "url": "http:\/\/sermonindex.net\/SID15408",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 34:5-6",
            "topic": "Jealousy",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15408-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "34"
                }
            ]
        }
    ]
}