{
    "name": "Jehovah Witness",
    "description": "",
    "sermons": [
        {
            "title": "Evangelism of The Jehovah's Witness",
            "url": "https:\/\/sermonindex.info\/SID18229",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 15:1-4,  Galatians 1:9",
            "topic": "Jehovah Witness",
            "description": "In this brief message (7 minutes long) Paul Washer reveals three helps in dealing with Jehovah’s Witnesses, which are useful additions to what he says elsewhere in various other messages. Firstly, Christians believe the Bible even if they cannot explain what the Bible says; they do not alter the texts they cannot explain. Secondly, Christians can testify of times of prayer when the presence and power of God fill the heart almost to bursting; it is not so with the Jehovah’s Witness, for God is not with them. Thirdly, check whether the Jehovah’s Witness’ “gospel” conforms to the Gospel that the Apostle Paul preached, using the above scriptures.",
            "download": "https:\/\/sermonindex.info\/SID18229-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "15"
                },
                {
                    "book": "Galatians",
                    "chapter": "1"
                }
            ]
        }
    ]
}