{
    "name": "Joshua",
    "description": "",
    "sermons": [
        {
            "title": "(Men Who Saw God) 4. Joshua",
            "url": "http:\/\/api.sermonindex.net\/SID18642",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18642-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "Giant Joshua",
            "url": "http:\/\/api.sermonindex.net\/SID14716",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID14716-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Houston Colonial Hills Conference 1995-05 Joshua 24:14",
            "url": "http:\/\/api.sermonindex.net\/SID11854",
            "size": "0",
            "format": "mp3",
            "scripture": "Joshua 24:14",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID11854-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Joshua",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Joshua",
            "url": "http:\/\/api.sermonindex.net\/SID23520",
            "size": "0",
            "format": "mp3",
            "scripture": "Deuteronomy 34:1-12, Joshua 1:1-13",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23520-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Deuteronomy",
                    "chapter": "34"
                },
                {
                    "book": "Joshua",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Studies In Joshua 02 - Entering The Land",
            "url": "http:\/\/api.sermonindex.net\/SID10612",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10612-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Studies In Joshua 03 - Conquering The Land",
            "url": "http:\/\/api.sermonindex.net\/SID10613",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10613-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Studies In Joshua 04 - Dividing The Land",
            "url": "http:\/\/api.sermonindex.net\/SID10614",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Joshua",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10614-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}