{
    "name": "Judah",
    "description": "",
    "sermons": [
        {
            "title": "(Genesis) - Part 27",
            "url": "http:\/\/sermonindex.net\/SID13407",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 38-40, Matthew 1:1-6",
            "topic": "Judah",
            "description": "Judah's backsliding and adultery with his daughter-in-law Tamar holds out warnings of ungodly association but also the mercy of God through Jesus' willingness to be identified with sinners.  The tests of Joseph are the tests for every believer: submission to spiritual authority and keeping oneself pure.  The \"post-graduate\" tests come when we can stand up under false accusation and suffer for the sins of others.",
            "download": "http:\/\/sermonindex.net\/SID13407-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "1"
                },
                {
                    "book": "Genesis",
                    "chapter": "38"
                }
            ]
        },
        {
            "title": "(Genesis) 54 - Judah and the Messianic Succession",
            "url": "http:\/\/sermonindex.net\/SID13097",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 38:1-30",
            "topic": "Judah",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13097-download",
            "preacher_name": "S. Lewis Johnson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "38"
                }
            ]
        },
        {
            "title": "Judah's Plea",
            "url": "http:\/\/sermonindex.net\/SID25883",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Judah",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25883-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}