{
    "name": "Judgement Seat Of Christ",
    "description": "",
    "sermons": [
        {
            "title": "(Happenings Ahead) The Judgement Seat Of Christ",
            "url": "https:\/\/sermonindex.info\/SID9614",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5:1-10",
            "topic": "Judgement Seat Of Christ",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9614-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Judgement Seat of Christ, Does It Matter?",
            "url": "https:\/\/sermonindex.info\/SID24888",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5:10",
            "topic": "Judgement Seat of Christ",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24888-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        }
    ]
}