{
    "name": "Judgement",
    "description": "",
    "sermons": [
        {
            "title": "A Judgement Is Coming",
            "url": "https:\/\/sermonindex.info\/SID27490",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Judgement",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27490-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        },
        {
            "title": "The Writing on the Wall",
            "url": "https:\/\/sermonindex.info\/SID23634",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Judgement",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23634-download",
            "preacher_name": "Peter Orasuk",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The hour  of His Judgement is Come",
            "url": "https:\/\/sermonindex.info\/SID26107",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Judgement",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26107-download",
            "preacher_name": "Bakht Singh",
            "preacher_image": "\/images\/bakht_singh.gif",
            "preacher_description": "Bakht Singh (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Bakht Singh in mp3 format. He is often regarded as one of the most well-known bible teachers and preachers and pioneers of the Indian Church movements. He was India's foremost evangelist, preacher and indigenous church planter who founded churches based on New Testament principles. He began a worldwide indigenous church-planting movement in India that eventually saw more than 10,000 local churches. Norman Grubb missionary statesman, author and teacher: \"In all my missionary experience I think these churches on their New Testament foundations are the nearest I have seen to a replica of the early church and a pattern for the birth and growth of the young churches in all the countries which we used to talk about as mission fields.\"\r\nLife of prayer. Brother Bakht Singh was a man of prayer. He spent hours upon his knees in communion with the Lord seeking the Lord's mind regarding His will concerning the work and ministry. Therefore, the Lord also honored him and blessed him beyond any human understanding. This is one of the reasons why the Lord has used him so mightily for the edification of His Body and for the extension of His glorious kingdom both in India and abroad.",
            "_scripture": []
        }
    ]
}