{
    "name": "Judgment Of God",
    "description": "",
    "audio_sermons": [
        {
            "title": "The Written Judgment Of God",
            "url": "http:\/\/sermonindex.net\/SID3967",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 149",
            "topic": "Judgment Of God",
            "description": "This message is especially for people who are tormented by past experiences and failures.  Carter uses Mark 5, where the word speaks of the man who cuts himself, in a word picture that describes someone whose thinking can’t get free from the past.  Carter also describes what Jesus has done at the cross with his death and resurrection in taking captivity captive along with Psalm 149 to describe a Christian’s victory over Satan because of what Christ has done.  The sermon is titled The Written Judgment Of God because of the judgment that is written against Satan in the scriptures.  Satan no longer has the power keep a Christian in a place of defeat and cause the Christian to cut himself with thoughts because of the past.  As Jesus said, “It is finished.”  These past sins have been removed as far as the East is from the West.",
            "download": "http:\/\/sermonindex.net\/SID3967-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "149"
                }
            ]
        }
    ]
}