{
    "name": "Judgement Seat",
    "description": "",
    "sermons": [
        {
            "title": "(Happenings Ahead) Regenerated At The Judgement Seat",
            "url": "http:\/\/sermonindex.net\/SID9615",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5:10-17",
            "topic": "Judgement Seat",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9615-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "If you Stand Before God Today",
            "url": "http:\/\/sermonindex.net\/SID9470",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Thessalonians 1:8, Revelation 20:11-15",
            "topic": "Judgement Seat",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9470-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "20"
                },
                {
                    "book": "2 Thessalonians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Final Judgement",
            "url": "http:\/\/sermonindex.net\/SID4074",
            "size": "8503296",
            "format": "mp3",
            "scripture": "",
            "topic": "Judgement Seat",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4074-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Great Judgement",
            "url": "http:\/\/sermonindex.net\/SID19269",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 20:12",
            "topic": "Judgement Seat",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19269-download",
            "preacher_name": "Alan Bartley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "20"
                }
            ]
        }
    ]
}