{
    "name": "Kingdom",
    "description": "",
    "sermons": [
        {
            "title": "Embracing the Gospel of the Kingdom",
            "url": "https:\/\/sermonindex.info\/SID25993",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingdom",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25993-download",
            "preacher_name": "John D. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Kingdom In Crisis - Part 2",
            "url": "https:\/\/sermonindex.info\/SID28431",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingdom",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28431-download",
            "preacher_name": "Dean Taylor",
            "preacher_image": "",
            "preacher_description": "Dean Taylor ( Â– Present)\r\nListen to freely downloadable audio sermons by the speaker Dean Taylor in mp3 format. Dean Taylor is the general editor of The Remnant of the Charity church movement. He has written a powerful book on non-resistance: A Change of Allegiance. His teachings on suffering and martyrdom are important for the body of Christ and we must learn again from our forefathers and how they suffered for Christ.\r\n\"Every day IÂ’m more convinced that the only thing worth putting my life into is the simple, child-like acceptance of the teachings of Jesus. I believe that Jesus meant what He said. But even more, I believe that JesusÂ’ plan for humanity is actually a great idea! Sometimes the ways and wisdom of Jesus donÂ’t make sense.\" - Dean Taylor",
            "_scripture": []
        },
        {
            "title": "Necessity of Seeing Jesus as King",
            "url": "https:\/\/sermonindex.info\/SID5748",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 6:1-8, Revelation 1:17, 2 Chronicles 7:1-14",
            "topic": "Kingdom",
            "description": "David Smithers challenges the hearers to examine their view of Jesus whether He truly be King or if we have focused upon attributes that best suit us.  \"If we're interested in kingdom work,\" he says, \"we need to be submitted to the King.\"  Are you subject to the King?  NOTE: (Part 1 - Necessity of Seeing Jesus as King \/ Part 2 - Effects of Seeing Jesus as King \/ Part 3 - Repentance (High Quality))",
            "download": "https:\/\/sermonindex.info\/SID5748-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                },
                {
                    "book": "Isaiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Davidic Kingdom",
            "url": "https:\/\/sermonindex.info\/SID25797",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingdom",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25797-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Kingdoms",
            "url": "https:\/\/sermonindex.info\/SID27173",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingdom",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27173-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        }
    ]
}