{
    "name": "Kingship",
    "description": "",
    "sermons": [
        {
            "title": "Effects of Seeing Jesus as King",
            "url": "http:\/\/api.sermonindex.net\/SID5749",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 110:3, Joshua 5:13-6:3, Exodus 3:1-11",
            "topic": "Kingship",
            "description": "\"The appearance of the King,\" says David Smithers, \"demands radical surrender.\"  As subjects, saint, servants and soldiers, our prime duty is to keep our eyes on the King and not on ourselves.  NOTE: (Part 1 - Necessity of Seeing Jesus as King \/ Part 2 - Effects of Seeing Jesus as King \/ Part 3 - Repentance (High Quality))",
            "download": "http:\/\/api.sermonindex.net\/SID5749-download",
            "preacher_name": "David Smithers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "3"
                },
                {
                    "book": "Psalms",
                    "chapter": "110"
                }
            ]
        },
        {
            "title": "When Jesus is King ... ",
            "url": "http:\/\/api.sermonindex.net\/SID21316",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingship",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID21316-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Who is the King",
            "url": "http:\/\/api.sermonindex.net\/SID22322",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Kingship",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22322-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        }
    ]
}