{
    "name": "Laodicea",
    "description": "",
    "sermons": [
        {
            "title": "(Revelation Thoughts from the Book) 4. The Letter to Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID18661",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Laodicea",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID18661-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": []
        },
        {
            "title": "(Revelation) The Church At Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID6952",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 3:14-22",
            "topic": "Laodicea",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID6952-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Condition of the Church of Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID3323",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Laodicea",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID3323-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "The Candlestick - Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID2879",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:6, Mark 4:35, Isaiah 58",
            "topic": "Laodicea",
            "description": "Above all things we need to desire an ever increasing revelation of who our Lord Jesus Christ is. The disciples were caught in a storm, but Jesus was in their boat with them. There were other ships caught in the storm as well. But the disciples cried out in fear, not having the confidence, God was in their boat! The still didn't realize who Jesus was. We need to focus on those who need Jesus and are lost in this stormy world in these last days. No matter what storm we face as believers, we have Christ in the ship, so let's get away from the focus on self and focus on those around us who don't know the Savior! Woe to those who are at ease in Zion! (Amos 6:1).",
            "download": "http:\/\/api.sermonindex.net\/SID2879-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "58"
                },
                {
                    "book": "Mark",
                    "chapter": "4"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Laodicean Church",
            "url": "http:\/\/api.sermonindex.net\/SID23320",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Laodicea",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23320-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "The Letter to the Church in Laodicea",
            "url": "http:\/\/api.sermonindex.net\/SID24851",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Laodicea",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24851-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        }
    ]
}