{
    "name": "Laying Aside",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 18): On Laying Aside Certain Things",
            "url": "http:\/\/sermonindex.net\/SID2071",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:1-3,Isaiah 40:6-7",
            "topic": "Laying Aside",
            "description": "“On Laying Aside Certain Things” is part 18 of Pastor A. W. Tozer’s delightful, 34-part series based upon Peter’s first epistle. The message was preached in Chicago, Illinois, on January 24, 1954, and it addresses 1 Peter 2:1-3, as well as 1 Peter 1:23-25 (from Isaiah 40:6-7.) Pastor Tozer treats us to several very astute word studies: “wherefore,” “laying aside,” “guile,” “hypocrisies,” “envies,” and “sincere milk.” Without rebirth, the most promising child, the actress in Hollywood, the president in the White House, and the eugenicists’ theoretical “super man,” all exist beneath the same two, dark clouds: mortality and corruption. Men die and then they rot; thank God for the birth that is incorruptible and never dies! Drawing wisely from Socrates, Pastor Tozer also challenges those liberals who ask, instead of turning from wickedness, “What is wickedness?” The length of the recording is 39 minutes and 5 seconds.",
            "download": "http:\/\/sermonindex.net\/SID2071-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "40"
                },
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        }
    ]
}