{
    "name": "Lazarus",
    "description": "",
    "sermons": [
        {
            "title": "Killing Lazarus",
            "url": "http:\/\/sermonindex.net\/SID11928",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 4:12-16",
            "topic": "Lazarus",
            "description": "May 22,2005 - The message from Lazarus is this “Jesus gave me LIFE”. The moment the life of Christ is seen upon you and in you- you will find yourself in a trial of suffering of the mockings and anger of the rage of the unsaved attacking the Christ in you. When this happens trust God for the strength and grace to bring you through. The bible says we should rejoice exceedingly because the glory of God rests upon you.",
            "download": "http:\/\/sermonindex.net\/SID11928-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Luke 16:19",
            "url": "http:\/\/sermonindex.net\/SID7685",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19",
            "topic": "Lazarus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7685-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Mary, Martha and Lazarus",
            "url": "http:\/\/sermonindex.net\/SID17561",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lazarus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17561-download",
            "preacher_name": "J. Oswald Sanders",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Rich Man and Lazarus",
            "url": "http:\/\/sermonindex.net\/SID0309",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 16:19-31",
            "topic": "Lazarus",
            "description": "There is contrast in this life between the splendor of the rich man and the poverty of Lazarus; there is also the contrast of complete reversal of condition for each man when he dies; God's tender care in the ministry of angels at death; Lazarus was brought into intimate relationship to the saints in heaven; the rich man's torments in hell were so extreme that he desired even a momentary alleviation; the condition of each man after death cannot be changed; the rich man's request that a messenger from the dead be sent to warn his brothers insinuates that God had been unjust in not giving more opportunity for repentance; but messengers from the dead would not bring us to repentance if we will not hearken to the warnings of Scripture.",
            "download": "http:\/\/sermonindex.net\/SID0309-download",
            "preacher_name": "John Murray",
            "preacher_image": "\/images\/john_murray.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "16"
                }
            ]
        }
    ]
}