{
    "name": "Lessons",
    "description": "",
    "audio_sermons": [
        {
            "title": "Lessons For Us To Learn Day To Day",
            "url": "http:\/\/sermonindex.net\/SID7312",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 5:1-14",
            "topic": "Lessons",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7312-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Lessons From the Wilderness Journey",
            "url": "http:\/\/sermonindex.net\/SID25886",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lessons",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25886-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Lessons for Life",
            "url": "http:\/\/sermonindex.net\/SID21835",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lessons",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21835-download",
            "preacher_name": "John McGregor",
            "preacher_image": "",
            "preacher_description": "John McGregor ( - )\r\nListen to freely downloadable audio sermons by the speaker John McGregor in mp3 format.  At John McGregor Ministries, we are focused on providing renewal  services with the highest levels of integrity – we will do everything we can to seek the Face of God (2 Chron. 7:14) With 40 years of experience in ministry  we’re sure you’ll find working with us can bring encouragement and strength to your church or organization. Look around our website and if you have any comments or questions, please feel free to contact us. We hope to see you again! Check back later for new updates to our website. There’s much more to come!\r\nJohn McGregor has a world-wide preaching schedule and enjoys traveling to the four corners of the earth to share the Gospel of God. John has worked closely with Billy Graham Ministries, Canadian Revival Fellowship and has been serving Glencairn as full time Lead pastor since 2009. He has a deep passion to see people introduced to Jesus and desires to nurture the love of God in each person he meets.",
            "_scripture": []
        },
        {
            "title": "Lessons from James 1",
            "url": "http:\/\/sermonindex.net\/SID22737",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lessons",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22737-download",
            "preacher_name": "Edwin H. Waldvogel",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Ten Things I learned before I was 21",
            "url": "http:\/\/sermonindex.net\/SID25906",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lessons",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25906-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        }
    ]
}