{
    "name": "Logos",
    "description": "",
    "sermons": [
        {
            "title": "Logos in Language",
            "url": "http:\/\/sermonindex.net\/SID0556",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 3, Galatians 5:22-26",
            "topic": "Logos",
            "description": "In this message, Dr. Smith explains how all of nature contains language.  Animals, plants, humans, every living thing has what he acutely titles, “psycho-space.”  The psycho space being the realm in which each living thing has the capacity for some degree of thought or communication.  He proceeds to explain that the logos of God is communicated fundamentally to man through his character.  We see the logos of God in how Jesus healed Malcus’s ear, and how he endured such contradiction from rebel’s and sinners.  It is within our psycho-space that we must fill our “minds” with this mind of Christ, which is full of love, joy, peace, patience, and the fruit of the Spirit, as we follow the Spirit, the logos of God step-wise begins to conform us into the likeness of the logos of Christ.  Smith also shares a great testimony how an SS Nazi officer was converted to the faith when he shared with him about the strength of Christ character.",
            "download": "http:\/\/sermonindex.net\/SID0556-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "3"
                },
                {
                    "book": "Galatians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Logos in Nature",
            "url": "http:\/\/sermonindex.net\/SID0555",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 4:4",
            "topic": "Logos",
            "description": "Thought, communication, and ideas cannot occur by random chance.  Dr. Smith shows how chance is not capable of producing instrumentation.   He discusses in this sermon how our instrumentation was designed in its origins to enjoy God and take pleasure in Him forever.  If we are not in the place of operating as our instrumentation was designed, we need to ask the Lord as to why we are all out of whack, in hopes that He will correct us.  Smith discusses how happy marriages are often an indication of God’s working in our instrumentation just like the Albatross happily maintains their monogamy for life, and revels in it with dancin",
            "download": "http:\/\/sermonindex.net\/SID0555-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "4"
                }
            ]
        }
    ]
}