{
    "name": "Lord's Prayer",
    "description": "",
    "sermons": [
        {
            "title": "(Luke) 31 - The Lord's Prayer",
            "url": "http:\/\/sermonindex.net\/SID15131",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 11:1-4, Matthew 6:9-13",
            "topic": "Lord's Prayer",
            "description": "The key point of the Lord's Prayer is relationship, and Ed draws out how the various relationships are underscored, such as Father-child, holy God-sinner, King-subject, and so on.  As the model prayer progresses, God gets bigger and bigger and man gets smaller and smaller.  In prayer we pour out our hearts before the Lord, expressing our longings to see Him and to depend upon Him for everything.",
            "download": "http:\/\/sermonindex.net\/SID15131-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                },
                {
                    "book": "Luke",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Father",
            "url": "http:\/\/sermonindex.net\/SID26381",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6:9",
            "topic": "Lord's Prayer",
            "description": "At a recent prayer meeting, Pastor Cymbala taught about The Lords Prayer and what it means to pray to our Father. Matt. 6:9",
            "download": "http:\/\/sermonindex.net\/SID26381-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Lord's Prayer",
            "url": "http:\/\/sermonindex.net\/SID20863",
            "size": "0",
            "format": "mp3",
            "scripture": "John 17",
            "topic": "Lord's Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20863-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "The Lord's Prayer",
            "url": "http:\/\/sermonindex.net\/SID18612",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6",
            "topic": "Lord's Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18612-download",
            "preacher_name": "Clayton Dougan",
            "preacher_image": "",
            "preacher_description": "Clayton Dougan ( - )\r\nListen to freely downloadable audio sermons by the speaker Clayton Dougan in mp3 format. Following 20 years of full time ministry in evangelism and Bible teaching based in the south of England Clayton and Isobel Dougan followed God's call to Canada in 1984. Evangelism International was incorporated as a charitable society in 1986 to provide a support base and accountability structure for ministry in their new base, Victoria, B.C. Clayton has travelled to about a dozen countries of the world preaching the gospel and teaching God's word.\r\nClayton's calling is, as our Vision Statement says, to preach the gospel of our Lord Jesus Christ worldwide. He still feels strongly the call of God to be a preaching evangelist. The various ministries of E.I. include: Guest preaching interdenominationally, Bible teaching in conferences and church retreats, A four hour seminar on evangelism - \"Evangelism is Not a Fatal Disease\".",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Lord's Prayer ",
            "url": "http:\/\/sermonindex.net\/SID12764",
            "size": "0",
            "format": "mp3",
            "scripture": "John 17",
            "topic": "Lord's Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12764-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "The Lord’s Prayer — Our Daily Bread",
            "url": "http:\/\/sermonindex.net\/SID23024",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Lord's Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23024-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        }
    ]
}