{
    "name": "Love Of Christ",
    "description": "",
    "audio_sermons": [
        {
            "title": "Love Of Christ Constraineth Me",
            "url": "http:\/\/sermonindex.net\/SID7684",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 5:13",
            "topic": "Love Of Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7684-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Love of Christ Constrains",
            "url": "http:\/\/sermonindex.net\/SID5360",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Love Of Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5360-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        }
    ]
}