{
    "name": "Loving Jesus",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 Peter - Part 8): Whom Having Not Seen, Ye Love",
            "url": "http:\/\/sermonindex.net\/SID2061",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:8",
            "topic": "Loving Jesus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2061-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Loving Jesus",
            "url": "http:\/\/sermonindex.net\/SID3796",
            "size": "0",
            "format": "mp3",
            "scripture": "John 21:15-19",
            "topic": "Loving Jesus",
            "description": "March 28,2004 - Do you love Jesus enough to go all the way? Are you willing to deny self and abandon your own ambitions to follow Him where He leads? Loving Jesus is totally abandoning ourselves for His purpose and plan so that, through our lives, He can reach to a lost and dying world.",
            "download": "http:\/\/sermonindex.net\/SID3796-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Loving Jesus",
            "url": "http:\/\/sermonindex.net\/SID22786",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Loving Jesus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22786-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Why I Love Jesus",
            "url": "http:\/\/sermonindex.net\/SID24106",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Loving Jesus",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24106-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "You Have to Love Jesus to Follow Him",
            "url": "http:\/\/sermonindex.net\/SID19406",
            "size": "0",
            "format": "mp3",
            "scripture": "John 21:7-22, Psalm 119:97",
            "topic": "Loving Jesus",
            "description": "October 18, 2009 - Do you love Jesus? Are you willing to break away from those familiar things that you thought would give you purpose, provision and joy? What about your old life and your friends that are not willing to follow Jesus? Are you willing to allow the Holy Spirit to search out your heart so you can break away and follow Jesus? Jesus is asking you are you willing to take the journey with Him so we can make a difference in this generation. Jesus asked Peter, \"Do you love me more than these?\". What are your \"these\"?",
            "download": "http:\/\/sermonindex.net\/SID19406-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "119"
                },
                {
                    "book": "John",
                    "chapter": "21"
                }
            ]
        }
    ]
}