{
    "name": "Loyalty",
    "description": "",
    "audio_sermons": [
        {
            "title": "Building Loyalty",
            "url": "http:\/\/sermonindex.net\/SID10986",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Loyalty",
            "description": "For the leader of a largely volunteer run organization an important question is how to build loyalty with those volunteers. Some steps to be taken are to focus on biblical, holy spirit filled, balanced leadership. It is hard to get people to unite and stay on course. At the same time intellectual honesty and openess must be maintained. Leadership and serventhood must go hand in hand. A good leader seeking to have loyal team members must take time to communicate with people and win their hearts. Verwer emphasizes that loyalty can exist in a balanced, non-cultish form.",
            "download": "http:\/\/sermonindex.net\/SID10986-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "Loyalty",
            "url": "http:\/\/sermonindex.net\/SID23086",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Loyalty",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23086-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        }
    ]
}