{
    "name": "Man",
    "description": "",
    "sermons": [
        {
            "title": "Man as You Are",
            "url": "https:\/\/sermonindex.info\/SID17549",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 14:12, Romans 8:5, Ephesians 3:14",
            "topic": "Man",
            "description": "Where many Christians are utterly content to only embrace the forgiveness of God, there remains a severe ignorance of God’s full intent through the power of Christ.  Before one becomes a partaker of the divine nature, Major Thomas expounds what man in fact is.  We discover he is a living soul wrapped in flesh, needing the Spirit of God to breathe life into his Spirit.  Once the man is forgiven his goal must become, through grace, to allow and yield the Spirit’s infiltration into jis soul and flesh that he may become an instrument of righteousness.",
            "download": "https:\/\/sermonindex.info\/SID17549-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                },
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Isaiah",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "The Origin of Man - Antiquity of Man Part 1",
            "url": "https:\/\/sermonindex.info\/SID1240",
            "size": "6033920",
            "format": "mp3",
            "scripture": "",
            "topic": "Man",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1240-download",
            "preacher_name": "John Murray",
            "preacher_image": "\/images\/john_murray.gif",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "When I Consider The Heavens",
            "url": "https:\/\/sermonindex.info\/SID9882",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 8",
            "topic": "Man",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9882-download",
            "preacher_name": "Earl R. Clark",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Who is Man, What is Man",
            "url": "https:\/\/sermonindex.info\/SID25592",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Man",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25592-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        }
    ]
}