{
    "name": "Mark",
    "description": "",
    "sermons": [
        {
            "title": "Gospel according to Mark I",
            "url": "http:\/\/sermonindex.net\/SID0795",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Mark",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0795-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "Mark",
            "url": "http:\/\/sermonindex.net\/SID2271",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark",
            "topic": "Mark",
            "description": "Zac draws attention to a wide variety of precious truths that shape a disciple being made after the likeness of Jesus.  Hindrances include trying to make yourself into what God can only do, living under the law, asceticism, valuing human traditions more than God's Word, and setting you mind upon your own gain.  Our encouragements are to receive the new wine--the life of Jesus--and come to know Jesus through the Scriptures.",
            "download": "http:\/\/sermonindex.net\/SID2271-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Mark - Come, See: Go, Tell",
            "url": "http:\/\/sermonindex.net\/SID26558",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Mark",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26558-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        }
    ]
}