{
    "name": "Mark Of The Beast",
    "description": "",
    "sermons": [
        {
            "title": "(Fury of Fire) 11 - The Mark of God or the Mark of the Beast",
            "url": "https:\/\/sermonindex.info\/SID12185",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians  6; Romans 7",
            "topic": "Mark Of The Beast",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12185-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Antichrist Armageddon Mark of the Beast",
            "url": "https:\/\/sermonindex.info\/SID4239",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 2:18; Hosea 2:6-17; Isaiah 35:1-10",
            "topic": "Mark Of The Beast",
            "description": "Too many are worried about prophecy of future end time events but we need to be more concerned about the armageddon in our own hearts. This is a time of unprecedented temptation, and the pull of the world is strong. God wants to draw his own back to intimacy with him, but they are for the most part full and satisfied.",
            "download": "https:\/\/sermonindex.info\/SID4239-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Mark Of The Beast",
            "url": "https:\/\/sermonindex.info\/SID21024",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 13:15-18",
            "topic": "Mark Of The Beast",
            "description": "October 24, 2010 - How willing are we to allow God to unfold His plan in our life? Those who will be deceived into taking the mark of the beast will be unsatisfied with the things of God, and develop a false value system. As a result they will bring to God less than He requires of them. But those who choose to live for the will of God are promised His peace and strength. God will take us into His protective hand and nothing will harm us. God knows those who are His and we are sealed in the almighty hands of God.",
            "download": "https:\/\/sermonindex.info\/SID21024-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Mark of The Beast",
            "url": "https:\/\/sermonindex.info\/SID12207",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Mark Of The Beast",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12207-download",
            "preacher_name": "John Rhys Watkins",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}