{
    "name": "Meekness",
    "description": "",
    "sermons": [
        {
            "title": "Blessed are the Meek",
            "url": "http:\/\/api.sermonindex.net\/SID18533",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:5, Psalm 37:1-11",
            "topic": "Meekness",
            "description": "Paul Washer begins this exposition of Matthew 5:5 by explaining that ‘The Beatitudes’ (verses 3-11) do not just speak of what it is to live a blessed life, but they speak of conformity to the image of Christ, for they are a great description of Jesus Christ as he walked on this earth. Many preachers say little more about meekness than showing that is not weakness; but what does the word really mean? The true meaning of any word is defined not merely through a dictionary, but by studying the context of the passage(s) where it occurs; so, using the obvious parallels between Matthew 5:5 and Psalm 37:11, Mr Washer uses the context of Psalm 37:1-11 to define the word ‘meek’. He works through the verses one by one, revealing the character of the meek man: he does not fret, nor envy the wicked; he trusts in God and dwells in the land; he delights himself in the Lord, commits his way unto the Lord, rests in the Lord, and so on. “This is what it means to be meek”, says Mr Washer, “and it is one of our greatest needs today”.  (31 minutes)",
            "download": "http:\/\/api.sermonindex.net\/SID18533-download",
            "speaker_name": "Paul Washer",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                },
                {
                    "book": "Psalms",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "Meek and Mild",
            "url": "http:\/\/api.sermonindex.net\/SID28378",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Meekness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28378-download",
            "speaker_name": "Jim Cymbala",
            "_scripture": []
        },
        {
            "title": "Meekness",
            "url": "http:\/\/api.sermonindex.net\/SID25193",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Meekness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25193-download",
            "speaker_name": "Anton Bosch",
            "_scripture": []
        },
        {
            "title": "Poverty Mourning and Meekness",
            "url": "http:\/\/api.sermonindex.net\/SID23531",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:1-12",
            "topic": "Meekness",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23531-download",
            "speaker_name": "Paris Reidhead",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Who Are the Meek and What Do They Inherit",
            "url": "http:\/\/api.sermonindex.net\/SID1387",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 11:28-30",
            "topic": "Meekness",
            "description": "Very good message defining the importance of \"meekness.\" \"Meekness is not weakness.\" This is a must hear sermon by Carter Conlon on meekness.  The heart of the message is about the need for each of us to walk in meekness in order to lead others to Jesus.  The meek man Moses could not lead the children into the promised land, because of one instance of anger.  There is a warning to us in this example.  We can miss the opportunity to lead family, friends, and others to the Lord by one instance of walking out of the character of Christ.  Carter used Mathew 11:28 when Jesus said, “I am meek and lowly of heart.”  Carter also used Mathew 5 Jesus said, “blessed are the meek” but the main text he used was the story of Moses hitting the rock in anger and the inability of Moses to then lead others into the promised land.",
            "download": "http:\/\/api.sermonindex.net\/SID1387-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "11"
                }
            ]
        }
    ]
}