{
    "name": "Mental Health",
    "description": "",
    "sermons": [
        {
            "title": "Death Of Life In The Mind",
            "url": "http:\/\/sermonindex.net\/SID8078",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 2:9, Romans 5:17",
            "topic": "Mental Health",
            "description": "When man fell in the garden of Eden, it caused the breakdown ofthe mind. But through a relationship with Jesus and through the Holy Spirit, we can regain control of our minds and have peace and good mental health.",
            "download": "http:\/\/sermonindex.net\/SID8078-download",
            "preacher_name": "Ernest O'Neill",
            "preacher_image": "",
            "preacher_description": "Ernest O'Neill ( - )\r\nListen to freely downloadable audio sermons by the speaker Ernest O'Neill in mp3 format. Ernest W. O'Neill was born in Belfast, Northern Ireland in 1934 and educated at Queen's University, where he received a degree in English Literature - Stranmillis Training College, where he obtained a teaching diploma - and Edgehill Theological Seminary, where he received a degree in theology. After teaching English at Methodist College, he was ordained to the Methodist ministry in Ireland in 1960 and served churches there and in London, England before moving to the United States in 1963.\r\nErnest O'Neill pastored Methodist churches in Minneapolis for three years and taught English in a Christian Brothers' School for four years. He preached in Bethany Presbyterian Church at the University of Minnesota for four years. Then in 1970, he founded Campus Church in Minneapolis, an independent, non-denominational body, to demonstrate the intellectual validity and spiritual reality of Jesus Christ on a secular campus.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "2"
                },
                {
                    "book": "Romans",
                    "chapter": "5"
                }
            ]
        }
    ]
}