{
    "name": "Motivation",
    "description": "",
    "sermons": [
        {
            "title": "(The Glory of God) in Motivation",
            "url": "http:\/\/api.sermonindex.net\/SID14505",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 43:6",
            "topic": "Motivation",
            "description": "Brother Paul Washer here describes the true motivation to living in holiness, as well as the motivation that should permeate every other aspect of our lives. After destroying the presupposition that has infiltrated our thinking, that there are \"great men of God\", Brother Paul then bursts out of the gate to show us that all that matters is the glory of God, and we must be motivated in every aspect of our lives to that one singular end.",
            "download": "http:\/\/api.sermonindex.net\/SID14505-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "43"
                }
            ]
        },
        {
            "title": "Pleasing God",
            "url": "http:\/\/api.sermonindex.net\/SID27897",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 2:1-6",
            "topic": "Motivation",
            "description": "As Pastor Cymbala teaches from 1 Thessalonians, we learn about Paul's ministry and his motivations. 1 Thess 2:1-6 (NIV)",
            "download": "http:\/\/api.sermonindex.net\/SID27897-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "2"
                }
            ]
        }
    ]
}