{
    "name": "Need For Direction",
    "description": "",
    "audio_sermons": [
        {
            "title": "When You Don't Know What to Do",
            "url": "http:\/\/sermonindex.net\/SID16294",
            "size": "0",
            "format": "mp3",
            "scripture": "John 19:25-27",
            "topic": "Need For Direction",
            "description": "December 2, 2007 - This message is for people who are in a particular situation and you don’t know what to do. The first thing to do is to go to the Cross. At the cross you will find life and all the power of God that you will need. Secondly, begin to love your mom, wife, husband, brother and those around you. There is going to be a last days church that will come back to the cross trusting God for the power to forgive those who have wounded us. A supernatural love and care will come upon us, for those around us. In this Cross Centered Church the heart of the Father will be turned to the children and the hearts of the children to the Father.",
            "download": "http:\/\/sermonindex.net\/SID16294-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "19"
                }
            ]
        }
    ]
}