{
    "name": "New Convenant",
    "description": "",
    "sermons": [
        {
            "title": "The Terms Of The New Convenant",
            "url": "https:\/\/sermonindex.info\/SID4079",
            "size": "8215040",
            "format": "mp3",
            "scripture": "Hebrews 8:6-13, John 1:17",
            "topic": "New Convenant",
            "description": "Zac teaches three fundamental truths about the new covenant as it is explained in Hebrews 8.  The new covenant begins with an assurance that our sins have been cleansed away, not just covered, coupled with a warning about the sin of unforgiveness.  Secondly, we can know Him personally as our Father, in living connection with Him all the day, both speaking and listening.  And finally, God writes upon the two tablets--the mind and the heart--to not only be willing but the grace as God's power to do it.",
            "download": "https:\/\/sermonindex.info\/SID4079-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "8"
                }
            ]
        }
    ]
}