{
    "name": "Obedience",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 John #10) Ring of Reality",
            "url": "http:\/\/sermonindex.net\/SID4811",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 2:3-6",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4811-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(1 Peter - Part 12): As Obedient Children",
            "url": "http:\/\/sermonindex.net\/SID2065",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:14,Romans 10:8-13",
            "topic": "Obedience",
            "description": "This lesson is on the necessity of obedience in a Christian life. Also how as Christians following God we can be much happier than not following God.",
            "download": "http:\/\/sermonindex.net\/SID2065-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "10"
                },
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Fury of Fire) 10 - Being a Doer of the Law Through the Covenant of Scriptures",
            "url": "http:\/\/sermonindex.net\/SID12184",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 15, Revelation 1",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12184-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "1"
                },
                {
                    "book": "Genesis",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "A Prepared Heart",
            "url": "http:\/\/sermonindex.net\/SID3189",
            "size": "7966208",
            "format": "mp3",
            "scripture": "2 Chronicles 11,2 Chronicles 12:14",
            "topic": "Obedience",
            "description": "You must seek the Lord with all your heart, prepared to listen to him, and prepared to follow his instructions in obedience and faith. As long as Rehoboam sought the Lord, he prospered and had peace. When he stopped seeking God, and began to do things his own way, the enemy came in and stole the treasures of God out of the temple. Believers are the temple of the Holy Ghost. Take careful heed to this message.",
            "download": "http:\/\/sermonindex.net\/SID3189-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "12"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Action And Obedience",
            "url": "http:\/\/sermonindex.net\/SID0360",
            "size": "7775232",
            "format": "mp3",
            "scripture": "Matthew 21:1-7",
            "topic": "Obedience",
            "description": "Duncan Campbell speaks very plainly and directly towards the root causes of what hinder revival, namely not obeying the voice of the Lord and holding on to secret sins.  God desires to 'open the floodgates of glory' but obedience is a fundamental truth for blessing.  Campbell appeals to the simple yielding of oneself to Christ and like the donkey being serviceable for Him to meet the need.",
            "download": "http:\/\/sermonindex.net\/SID0360-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Applying Psalm 1 to Life",
            "url": "http:\/\/sermonindex.net\/SID27905",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 1",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27905-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Psalm",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Be Ye Doers of the Word",
            "url": "http:\/\/sermonindex.net\/SID26202",
            "size": "0",
            "format": "mp3",
            "scripture": "James 1:22",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26202-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Biblical Obedience",
            "url": "http:\/\/sermonindex.net\/SID12655",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12655-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "Breaking The Heart Of Obedience",
            "url": "http:\/\/sermonindex.net\/SID19540",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 21:8-14, 2 Timothy 2:1-7",
            "topic": "Obedience",
            "description": "January 10, 2010 - Have you ever asked yourself why do things have to change? We are all resistant to change especially when it involves what we perceive to be hardship or loss to ourselves or someone we love. There is nothing in us that wants to gravitate toward difficulty. In the western world we have formed a Christian theological perspective that avoids difficulty, which results in an anemic Christianity. When we get a word from the Lord that sometimes doesn't make sense to the natural mind, we must be careful to who and what we listen to. There are well meaning people all along our journey that will unknowingly try to break your heart of obedience. God call us to a radical obedience where we will go where you lead us no matter what the cost! When we learn to walk in the ways of God and follow the voice of God the miraculous is released in our lives. Are you willing to respond to the Lord with, “here I am Lord, send me”?",
            "download": "http:\/\/sermonindex.net\/SID19540-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "21"
                },
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Choose to obey",
            "url": "http:\/\/sermonindex.net\/SID3981",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3981-download",
            "preacher_name": "Friedel Stegen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Chosen For Obedience",
            "url": "http:\/\/sermonindex.net\/SID22115",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22115-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Christ Magnified In Our Bodies",
            "url": "http:\/\/sermonindex.net\/SID0129",
            "size": "6470000",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "Asked why he was used of the Lord so greatly in China, Hudson Taylor replied, 'God had looked long for a man weak enough, and He found me.' He takes the weak things of the world to confound the mighty. Spiritual wisdom does not come with years; neither does maturity. The key to both is obedience. Whatsoever He saith unto YOU, do it.",
            "download": "http:\/\/sermonindex.net\/SID0129-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "Consider Your Ways",
            "url": "http:\/\/sermonindex.net\/SID12487",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12487-download",
            "preacher_name": "Charles E. Fuller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Don't say No to God",
            "url": "http:\/\/sermonindex.net\/SID8293",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 55:6-7",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8293-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "55"
                }
            ]
        },
        {
            "title": "Dry Believers",
            "url": "http:\/\/sermonindex.net\/SID26676",
            "size": "0",
            "format": "mp3",
            "scripture": "John 7:37-39",
            "topic": "Obedience",
            "description": "Before the revival I was troubled, for I would go around holding services and many would repent. But after 2 or 3 years when I return to visit them again I would find the Christians in disunity. But we read in Acts how the early Christians were of one heart and soul (Acts 4:32). But what I found among the Christians were in opposition to this, the one would criticize the next; the other would complain that theyâ€™re not treated well or greeted properly. I knew that revival wouldnâ€™t start if things didnâ€™t come right among the Christians first, for the Bible says that judgment must begin in the house of God (1Pet 4:17). The reason the Word of God, the Bible, doesnâ€™t cover the earth, is not because of the heathen, but because of the Christians that arenâ€™t living according to the Word of God. Jesus said that the one who believes in Him as the Scripture has said, from his innermost being will flow rivers of Living Waters. Rivers of water cannot be stopped. You might try to stop a river by building a restraining wall in the river, but the water will only build up on the one side and eventually break the wall in a massive flood, or the water will rise up and flow over the wall.",
            "download": "http:\/\/sermonindex.net\/SID26676-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Faith Obeys (3 of 4)",
            "url": "http:\/\/sermonindex.net\/SID12979",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11",
            "topic": "Obedience",
            "description": "We believe that these messages truly flesh out what is meant by the phrase, 'We walk by faith, not by sight.' Because 'faith' is so easily misunderstood this is a much needed truth.",
            "download": "http:\/\/sermonindex.net\/SID12979-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Faith, love and obedience",
            "url": "http:\/\/sermonindex.net\/SID14328",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 5:1-3",
            "topic": "Obedience",
            "description": "What is believing? James tells us that the demons also believe in God, but they tremble and shake. James continue to say that unless you continue to show by your life that you have the true faith, your faith is worthless. Faith is directional in a Person. Faith not only requires that something is held true, but that Someone has entered into your life. Grasp this secret or you've missed the crux of the matter. Faith is not believing a set of historical facts. All the historical facts about Jesus, that He was the perfect spotless Lamb of God, born of a virgin, died for our sins, was buried and rose again the third day - all of this the demons know to be true, but it doesn't help them. You need a special agreement with Jesus Christ, and then confess that commitment before people publicly. You must believe with the heart unto righteousness and confess with your mouth unto salvation (Rom 10:10).",
            "download": "http:\/\/sermonindex.net\/SID14328-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "First thing is First",
            "url": "http:\/\/sermonindex.net\/SID4556",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 12:29-34",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4556-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Gird Up Now Thy Loins",
            "url": "http:\/\/sermonindex.net\/SID16813",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16813-download",
            "preacher_name": "Emanuel Esh",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Has My Soul Been Purified By Obedience To The Truth?",
            "url": "http:\/\/sermonindex.net\/SID24185",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24185-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": []
        },
        {
            "title": "Holiness and Obedience",
            "url": "http:\/\/sermonindex.net\/SID10230",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 19:4-6",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10230-download",
            "preacher_name": "B.H. Clendennen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "I Once Longed For New Things To Obey",
            "url": "http:\/\/sermonindex.net\/SID21795",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21795-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "In the Hands Of the Potter",
            "url": "http:\/\/sermonindex.net\/SID4576",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 18:1-12",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4576-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "Instant obedience or The frozen chosen",
            "url": "http:\/\/sermonindex.net\/SID3279",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3279-download",
            "preacher_name": "Friedel Stegen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Jehovah's Obedient Servant",
            "url": "http:\/\/sermonindex.net\/SID12482",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12482-download",
            "preacher_name": "Charles E. Fuller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Key Words: Obedience",
            "url": "http:\/\/sermonindex.net\/SID4559",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 6:37-49",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4559-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Marching Orders",
            "url": "http:\/\/sermonindex.net\/SID24065",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 9:3-6",
            "topic": "Obedience",
            "description": "We want to do what Jesus asks us to do. And God will help! Acts 9:3-6",
            "download": "http:\/\/sermonindex.net\/SID24065-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Meeting a Need",
            "url": "http:\/\/sermonindex.net\/SID16681",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "God wants to meet our need.  In this sermon, Duncan explains that there is no moral virtue in obedience unless there is recognition of a higher authority that calls for that obedience.  What does that type of obedience look like?  That means you have to hand Jesus the keys to every room in your life.  Do you still hold on to a key?",
            "download": "http:\/\/sermonindex.net\/SID16681-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": []
        },
        {
            "title": "Obedience",
            "url": "http:\/\/sermonindex.net\/SID23311",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 7",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23311-download",
            "preacher_name": "Bill Stafford",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Obedience",
            "url": "http:\/\/sermonindex.net\/SID24664",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24664-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Obedience",
            "url": "http:\/\/sermonindex.net\/SID0201",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0201-download",
            "preacher_name": "Harold Vaughan",
            "preacher_image": "\/images\/harold_vaughan.gif",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Obedience And Commitment",
            "url": "http:\/\/sermonindex.net\/SID19947",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19947-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "Obedience and Authentically Walking With God",
            "url": "http:\/\/sermonindex.net\/SID28286",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28286-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": []
        },
        {
            "title": "Obedience and Love",
            "url": "http:\/\/sermonindex.net\/SID28353",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28353-download",
            "preacher_name": "K.P. Yohannan",
            "preacher_image": "\/images\/kp_yohannan.gif",
            "preacher_description": "K.P. Yohannan ( - Present)\r\nListen to freely downloadable audio sermons by the speaker K.P. Yohannan in mp3 format. Dr. K.P. Yohannan, the Metropolitan Bishop of Believers Church, was born and brought up in Niranam, Kerala. Niranam has immense historical significance in the tradition of Saint Thomas, a disciple of Jesus Christ who planted the first church there in AD 52.  K.P. Yohannan dedicated his life to God at a young age to serve the needy and downtrodden. He prayed, â€œOh my Lord, let my heart break with the things that break Your heartâ€\u009d and his life was never the same. Itâ€™s his belief that one can only demonstrate Godâ€™s love by loving people. After over four decades of selfless service, he says, I have no regrets in praying that prayer for I know God has touched millions through what He did in and through me. It is all Godâ€™s grace.\r\n\r\nHe spent the early years of his service in North India and traveled to the remote villages sharing the love of Christ and doing charitable works. Through numerous encounters during those years, he was instilled with an increasing passion to bring hope, peace, and comfort to the needy and deprived. His sacrificial commitment, farsightedness and aptitude to perceive helped him to lead a life of unhindered devotion to serve Christ and His church. K.P. Yohannan is also the voice of Athmeeya Yathra, touching millions through his daily radio and TV broadcasts. His 250 books offer practical and spiritual guidance on hundreds of subjects.",
            "_scripture": []
        },
        {
            "title": "Obedience of Faith",
            "url": "http:\/\/sermonindex.net\/SID28180",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28180-download",
            "preacher_name": "K.P. Yohannan",
            "preacher_image": "\/images\/kp_yohannan.gif",
            "preacher_description": "K.P. Yohannan ( - Present)\r\nListen to freely downloadable audio sermons by the speaker K.P. Yohannan in mp3 format. Dr. K.P. Yohannan, the Metropolitan Bishop of Believers Church, was born and brought up in Niranam, Kerala. Niranam has immense historical significance in the tradition of Saint Thomas, a disciple of Jesus Christ who planted the first church there in AD 52.  K.P. Yohannan dedicated his life to God at a young age to serve the needy and downtrodden. He prayed, â€œOh my Lord, let my heart break with the things that break Your heartâ€\u009d and his life was never the same. Itâ€™s his belief that one can only demonstrate Godâ€™s love by loving people. After over four decades of selfless service, he says, I have no regrets in praying that prayer for I know God has touched millions through what He did in and through me. It is all Godâ€™s grace.\r\n\r\nHe spent the early years of his service in North India and traveled to the remote villages sharing the love of Christ and doing charitable works. Through numerous encounters during those years, he was instilled with an increasing passion to bring hope, peace, and comfort to the needy and deprived. His sacrificial commitment, farsightedness and aptitude to perceive helped him to lead a life of unhindered devotion to serve Christ and His church. K.P. Yohannan is also the voice of Athmeeya Yathra, touching millions through his daily radio and TV broadcasts. His 250 books offer practical and spiritual guidance on hundreds of subjects.",
            "_scripture": []
        },
        {
            "title": "Obedience to God brings freedom",
            "url": "http:\/\/sermonindex.net\/SID20314",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20314-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Obedience to Jesus´ final command",
            "url": "http:\/\/sermonindex.net\/SID13352",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 16:14-20",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13352-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Obedience, The Condition of Blessing",
            "url": "http:\/\/sermonindex.net\/SID21907",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21907-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Obeying Jesus",
            "url": "http:\/\/sermonindex.net\/SID24109",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24109-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "One Thing I Do",
            "url": "http:\/\/sermonindex.net\/SID24395",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24395-download",
            "preacher_name": "Vincent G. Artese",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Principles Of Faith and Obedience ",
            "url": "http:\/\/sermonindex.net\/SID21980",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:8",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21980-download",
            "preacher_name": "C. Stacey Woods",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Studies In Joshua 01 -  Faith + Obedience = Success",
            "url": "http:\/\/sermonindex.net\/SID10611",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10611-download",
            "preacher_name": "Alden Gannett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Take up your Cross",
            "url": "http:\/\/sermonindex.net\/SID15905",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15905-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        },
        {
            "title": "The Basic Requirements of Obedience",
            "url": "http:\/\/sermonindex.net\/SID25852",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25852-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Blessing of Obedience",
            "url": "http:\/\/sermonindex.net\/SID24073",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 1:17, James 1:22-25",
            "topic": "Obedience",
            "description": "We all have some area that we struggle with, but there is a blessing to obeying Jesus. Ephesians 1:17; James 1:22-25; Psalm 119:145-146",
            "download": "http:\/\/sermonindex.net\/SID24073-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "1"
                },
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Blessings of Obedience Part 1",
            "url": "http:\/\/sermonindex.net\/SID25856",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25856-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Blessings of Obedience Part 2",
            "url": "http:\/\/sermonindex.net\/SID25857",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25857-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Greatest Sin In The Church",
            "url": "http:\/\/sermonindex.net\/SID13370",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22",
            "topic": "Obedience",
            "description": "Stephen Olford shares a powerful message on the need for obedience to the voice of the Lord. Apart from sacrifice, christian ministry, busyness the Lord desires us to deal with God about sin. There is a deception that can easily take us over and we can be blind to our condition. The greatest sin is partial obedience.",
            "download": "http:\/\/sermonindex.net\/SID13370-download",
            "preacher_name": "Stephen Olford",
            "preacher_image": "",
            "preacher_description": "Stephen Olford (1918 - 2004)\r\nListen to freely downloadable audio sermons by the speaker Stephen Olford in mp3 format. Was a 20th-century Christian leader. Dr. Billy Graham called him \"the man who most influenced my ministry.\" He was a personal confidant of Graham. Olford was also a role model and friend to prominent pastors such as Charles Stanley and Adrian Rogers. He was a pioneer in Christian television programming with his show, Encounter, in New York. His Sunday morning sermons were also broadcast around the world on radio.[1] He was the Founder and Chairman of the Board of Olford Ministries International in Memphis, Tennessee which became The Stephen Olford Center at Union University. His authorized biography, Only One Life, was written by John Philipps.\r\nIn 1953, Dr. Stephen F. Olford's years of pastoral ministry began by serving the Duke Street Baptist Church in Richmond, Surrey England (1953–1959) and then the Calvary Baptist Church in New York City (1959–1973).[1] Olford systematized his method of expository preaching and formed a curriculum used to train preachers at the Olford Institute for Biblical Preaching in Memphis, Tennessee. Pastors and scholars migrated to the institute for inspiration and instruction that often resulted in upgraded pulpit ministries.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Journey From Prayer To Obedience",
            "url": "http:\/\/sermonindex.net\/SID3582",
            "size": "10122752",
            "format": "mp3",
            "scripture": "Esther 3:7-13,Esther 4:13-14,Romans 8:9-11",
            "topic": "Obedience",
            "description": "(Preached: Feb. 8th, 2004). In a place of complacency, the enemy rose up to try to destroy God's people. After the captivity in Babylon, many of Israel had grown comfortable and stayed, rather than returning. Mixture in the world gives the enemy room to rise up and rule over you. Esther fasted and prayed, but she then had to get up and go to the king. We, as the Body of Christ, need to remember we are ambassadors of Christ, and there is no time for games. Jesus is coming, and we need to come out from among the world, and seperate ourselves for his purposes. If you are struggling with your flesh, this message will help you, and hopefully motivate you. Esther risked her life to intercede for her people. We need to risk whatever will come into our lives whether persecution, or trouble, to be seperated to God's purposes.",
            "download": "http:\/\/sermonindex.net\/SID3582-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Esther",
                    "chapter": "4"
                },
                {
                    "book": "Esther",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Obedience That Prepares The Way",
            "url": "http:\/\/sermonindex.net\/SID19823",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 7:14",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19823-download",
            "preacher_name": "Wesley Duewel",
            "preacher_image": "\/images\/wesley_duewel.gif",
            "preacher_description": "Wesley Duewel (1916 - 2016)\r\nListen to freely downloadable audio sermons by the speaker Wesley Duewel in mp3 format. Dr. Wesley Duewel has given himself to the cause of missions for the past 68 years. Following ministry in India for nearly 25 years, he served as president of One Mission Society (1969-1982). He is now President Emeritus and special assistant to the president for evangelism and intercession. His writings on the Holy Spirit, revival, and soul winning call Godâ€™s people back to prayer, the source of all power and passion for ministry. His hundreds of poems and all of his books express his hunger and passion. His book Touch the World Through Prayer, published in 1986, is now in its 36th printing. Later books, Let God Guide You Daily; Ablaze for God; Mighty Prevailing Prayer; Measure Your Life; Godâ€™s Great Salvation; Revival Fire; Godâ€™s Power Is for You; More God, More Power; and his latest book, Heroes of the Holy Life, are also widely acclaimed. Nearly 2.5 million of his books are now in circulation in 58 languages or national editions around the world. Several international editions are also in process.\r\n\r\nRecognized as an authority on missions, Dr. Duewel served for 16 years on the board of directors of the Evangelical Fellowship of Mission Agencies of which he was president from 1969-1972, 19 years on the North American Board of the World Evangelical Fellowship, 20 years on the board of the National Association of Evangelicals, and a life trustee of Asbury Theological Seminary. During his years in India, Dr. Duewel followed closely the development of postwar independent India. He was prominent in leadership of the North India Christian Literature Society, as well as the Bible Society of India. He helped spearhead the Evangelical Fellowship of India and was serving as its president when he was transferred from India.",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "There Comes A Time",
            "url": "http:\/\/sermonindex.net\/SID22218",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22218-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": []
        },
        {
            "title": "They Were More Noble",
            "url": "http:\/\/sermonindex.net\/SID20862",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 17",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20862-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Whatever it Takes",
            "url": "http:\/\/sermonindex.net\/SID27975",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27975-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "When Obedience Makes You Dance",
            "url": "http:\/\/sermonindex.net\/SID20369",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22-23",
            "topic": "Obedience",
            "description": "May 16, 2010 - \"Obey God,\" the words of Evan Roberts that started the Welsh Revival. What would be the outcome if we would simply choose to obey God? At some point we have to realize that the same God who created the universe lives inside of us and will enable us to accomplish all that He's called us to do. There comes a time when God doesn't have to speak anymore because you already know what He wants you to do. God says put away the old man and put away the old nature. He is seeking for a man after His own heart who would simply walk in obedience with Him. Are you embracing something that God has clearly told you to put away? The word of the Lord to you today is obey God! Obedience is the beginning of the journey of dancing.",
            "download": "http:\/\/sermonindex.net\/SID20369-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Will Ye Hear the Lord?",
            "url": "http:\/\/sermonindex.net\/SID23810",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Obedience",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23810-download",
            "preacher_name": "Darin Chappell",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}