{
    "name": "Obstacles",
    "description": "",
    "sermons": [
        {
            "title": "Obstacles to Jesus and His Mission",
            "url": "http:\/\/sermonindex.net\/SID3391",
            "size": "9248256",
            "format": "mp3",
            "scripture": "Mark 9",
            "topic": "Obstacles",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3391-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Devil's Nightmare",
            "url": "http:\/\/sermonindex.net\/SID5309",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 21:19-22, Mark 9:17-30",
            "topic": "Obstacles",
            "description": "Pastor Conlon begins in Matthew 21:19-22 on faith, and overcoming obstacles that hinder our victory. God wants us to come to him for the Holy Ghost as a people that will not be denied, that will rise up in faith and lay hold on the promises God has made, and appropriate and apply the spiritual authority given to us by Jesus. Pastor Conlon goes on to Mark 9:17-30. The casual seeker of God will never know the power of being able to walk in the spirit as Jesus did and be a vessel God can channel his power through to deliver those oppressed and bound by the enemy. A Message of obtainable victory. Must hear.",
            "download": "http:\/\/sermonindex.net\/SID5309-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "9"
                },
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        }
    ]
}