{
    "name": "Offended",
    "description": "",
    "sermons": [
        {
            "title": "(Australia) Offended in Christ",
            "url": "http:\/\/api.sermonindex.net\/SID14613",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 11:1-6, Hebrews 6:12",
            "topic": "Offended",
            "description": "he enemy is speaking to John: \"Why are you in prison? Why is Jesus so Passive? John is becoming offended by Christ. The enemy attacks us the same way.  Are you offended by Christ? We pray and doubt that God can hear us, or answer our prayers. so we have unfulfilled expectations. God responds to us, \"You are offended by the way I am bringing about my kingdom\" You have need of patience after you have done the will of the father to receive the promise. David Wilkerson says, \"I am so glad that God didn't answer my prayers in the way that I asked him! I would not be here!\"  One thing that John did well, was to take his doubts to Jesus.  Jesus reaffirmed him of who he was and pressed him further, \"...blessed is he who is not offended because of me\"",
            "download": "http:\/\/api.sermonindex.net\/SID14613-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "11"
                },
                {
                    "book": "Hebrews",
                    "chapter": "6"
                }
            ]
        }
    ]
}