{
    "name": "Pain",
    "description": "",
    "audio_sermons": [
        {
            "title": "God Has Not Passed You By",
            "url": "http:\/\/sermonindex.net\/SID13880",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel",
            "topic": "Pain",
            "description": "January 1, 2006. When we are in spiritual, mental and physical pain and you have never endured more than your going through now, God will come with the comfort of the Holy Spirit and lead you to His word and His promises and He will reveal Himself through His word. The Devil will tell you God has passed you by Â– But you will hear a voice behind you say I will never leave you or forsake you.",
            "download": "http:\/\/sermonindex.net\/SID13880-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "Pain a Sign of Life",
            "url": "http:\/\/sermonindex.net\/SID22717",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Pain",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22717-download",
            "preacher_name": "Reuben Walter",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}