{
    "name": "Passion",
    "description": "",
    "sermons": [
        {
            "title": "(Radical Jesus) 20 Radical Passion",
            "url": "https:\/\/sermonindex.info\/SID28006",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28006-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "(Radical Jesus) 21 Radical Passion",
            "url": "https:\/\/sermonindex.info\/SID28007",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28007-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "(Radical Jesus) 22 Radical Passion",
            "url": "https:\/\/sermonindex.info\/SID28008",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28008-download",
            "preacher_name": "Glenn Meldrum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Passion Of God",
            "url": "https:\/\/sermonindex.info\/SID22066",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22066-download",
            "preacher_name": "Gayle Erwin",
            "preacher_image": "",
            "preacher_description": "Gayle Erwin ( - )\r\nListen to freely downloadable audio sermons by the speaker Gayle Erwin in mp3 format.  He is a father and grandfather, a writer and editor, a talker and listener. He has created five magazines, served six years as a college teacher and twenty years as a pastor. Now, as the director of a ministry called \"Servant Quarters,\" he spends his time speaking at conferences and retreats (as he works on his third million miles of flying) and writing. His humorous style delights audiences of all ages wherever he goes.\r\nGayle's first book, The Jesus Style, has sold more than 500,000 copies and has been translated into 35 languages. Many churches and missions groups require their leaders to study this book. Gayle Erwin travels around the globe playing, as he puts it, \"the one string on my guitar.\" That \"one string\" is the Nature of Jesus, a message developed over a lifetime of study and experience -- a simple message of servant lifestyle for this complex age.",
            "_scripture": []
        },
        {
            "title": "Pauls passion in life",
            "url": "https:\/\/sermonindex.info\/SID3250",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID3250-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Wanted: Preachers with Passion & Power",
            "url": "https:\/\/sermonindex.info\/SID2764",
            "size": "10680320",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "This message Dr. Cairns shows the deep spirituality and devotion to Christ in the reformation. But it goes on to say that we need Men of God to rise up and to be used of the Lord today! This is a great sermon with many good points and quotes and well worth a careful listen with an open heart.",
            "download": "https:\/\/sermonindex.info\/SID2764-download",
            "preacher_name": "Alan Cairns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Where Does Passion Come From?",
            "url": "https:\/\/sermonindex.info\/SID17009",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 6:1-7, John 12:41",
            "topic": "Passion",
            "description": "Paul Washer sets out to answer the question of where his passion comes from, and in so doing he traces a path to the holiness and extra-ordinary majesty of God as seen by Isaiah. He reveals his own love for Godly men of old, who thought great thoughts about God, and whose writings have been influential in his own life. Reading from some of their writings, as well as his own notes, he explains something of what Isaiah saw. The Apostle John shows that Isaiah saw a revelation of the Son (thereby proving his eternal deity), yet Isaiah saw only an image, reduced to what his finite capacity could receive. Holiness is so much more than we think; holiness is the highest statement which could ever be made in regard to God; it speaks of separateness and uniqueness. And what is the effect of its revelation? We are faced with our own uncleanness and nothingness in the presence of a holy God; yet at the same time a Saviour is revealed to us in his condescending love. Let all flesh be abased, that God’s glory may be the more elevated. (73 minutes)",
            "download": "https:\/\/sermonindex.info\/SID17009-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "6"
                },
                {
                    "book": "John",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Your Passion for God",
            "url": "https:\/\/sermonindex.info\/SID23751",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Passion",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23751-download",
            "preacher_name": "Gbile Akanni",
            "preacher_image": "",
            "preacher_description": "Gbile Akanni ( - )\r\nWatch video sermons by the speaker Gbile Akanni in youtube format. Who lives in Gboko is a teacher of the Word. He holds an inter-denominational fellowship which attracts Christians of all backgrounds. This is possible because the services are held during week days. He does not run a church. He is an itinerant preacher who moves from one denomination to another on invitation.  \r\n\r\nGbile Akanni heads up a ministry, ‘Living Seed’, centred in Gboko, Nigeria and is committed to turning believers into disciples. The ministry is trans-denominational and reaches into every strata of the nation. His Ministers’ Leadership Retreat which takes place in December every year is attended by 15,000 leaders from all walks of life, not just the Church. Gbile travels extensively and his authoritative teaching is deeply challenging and life-changing and he has deep desire to see a mighty visitation of God in these crucial times.",
            "_scripture": []
        }
    ]
}