{
    "name": "Patriotism",
    "description": "",
    "audio_sermons": [
        {
            "title": "God's Truth: Rebellion and Patriotism",
            "url": "http:\/\/sermonindex.net\/SID9343",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Patriotism",
            "description": "In this lesson, we continue our study of Satan's lies and God's truths concerning three basic areas: authority, rebellion and patriotism. Satan has fostered basic lies in each of these three areas, but we want to take a look at what it means to be under authority, and we will also take a test to find out about our rebellion quotient. Finally, we will take a brief look at what our duty is concerning our country.",
            "download": "http:\/\/sermonindex.net\/SID9343-download",
            "preacher_name": "Russell Kelfer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Why A Lack Of Patriotism",
            "url": "http:\/\/sermonindex.net\/SID20518",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Patriotism",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20518-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        }
    ]
}