{
    "name": "Persecution",
    "description": "",
    "sermons": [
        {
            "title": "(Revelation) God Allowing Persecution On Earth",
            "url": "http:\/\/sermonindex.net\/SID7055",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 7:1-8",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7055-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "A Sure Path Through the Coming Storm",
            "url": "http:\/\/sermonindex.net\/SID26170",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26170-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "A westerner reflects on persecution",
            "url": "http:\/\/sermonindex.net\/SID26027",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 13:3",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26027-download",
            "preacher_name": "Bob Faulkner",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Beheading in the Bible: Are You Ready to Lose Your Head for Jesus?",
            "url": "http:\/\/sermonindex.net\/SID27517",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27517-download",
            "preacher_name": "Jason Cooley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Could We Handle Heavy Persecution?",
            "url": "http:\/\/sermonindex.net\/SID24279",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 12:5",
            "topic": "Persecution",
            "description": "Could Christians today handle any real persecution? Do we avoid trials? Excellent challenge for all that name the name of Christ. There truly is a time of great testing coming to the Church in the west can we start to learn how to suffer in the small tests first?",
            "download": "http:\/\/sermonindex.net\/SID24279-download",
            "preacher_name": "Ed Hicks",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Courage in Christian Ministry",
            "url": "http:\/\/sermonindex.net\/SID24584",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24584-download",
            "preacher_name": "Josef Tson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "How to Handle Persecution",
            "url": "http:\/\/sermonindex.net\/SID0708",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0708-download",
            "preacher_name": "Danny Bond",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Imperial Persecutions",
            "url": "http:\/\/sermonindex.net\/SID22299",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22299-download",
            "preacher_name": "Robin Boisvert",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Persecution & the Cross",
            "url": "http:\/\/sermonindex.net\/SID24318",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "Some of the speakers are sharing short audio and video segments sharing their burden about the theme of the upcoming conference. Do listen to these and share them with others. Please also be in prayer for each of the speakers and their families and for those whom will be attending this event. All the speakers are listed here: http:\/\/sermonindex2012.eventbrite.ca\/",
            "download": "http:\/\/sermonindex.net\/SID24318-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": []
        },
        {
            "title": "Persecution And The Underground House Churches In Iran",
            "url": "http:\/\/sermonindex.net\/SID24869",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "Brother Edgar shares about the history of the persecuted church in Iran. He gives some wonderful glimpses into the fast expanding house church movement in this country. Lastly this message leaves us with a deep sobriety to join with suffering with these brothers and sisters by being more obedient to the great commission call in our lives.",
            "download": "http:\/\/sermonindex.net\/SID24869-download",
            "preacher_name": "Edgar Reich",
            "preacher_image": "",
            "preacher_description": "Edgar Reich ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Edgar Reich in mp3 format. The former business man is Reverend Edgar Reich. He has been called by the Lord to teach and preach in Revival. He is a devoted Christian teacher, leading adult Bible study groups at his Church, his former business and his community. God has called him into fulltime Christian Ministry to preach and teach in Revival. \r\n\r\nHe became a Reverend under the leadership of Rev. Dr. R. L. Curry in July 2008.  The Lord has had brother Edgar start Revival Canada USA which is a ministry believing God for revival in North America. \"God has promised to bring a Nation wide Revival to the United States of America and Canada prior to the return of the Lord Jesus Christ. Fires of Revival will break out all over the United States and Canada in many cities and spread from African American Churches to White Churches.\"",
            "_scripture": []
        },
        {
            "title": "Persecution for Righteousness",
            "url": "http:\/\/sermonindex.net\/SID23584",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23584-download",
            "preacher_name": "Dwight Pentecost",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Persecution, Affliction, And Tribulation",
            "url": "http:\/\/sermonindex.net\/SID4041",
            "size": "15887872",
            "format": "mp3",
            "scripture": "2 Timothy 3:12, Isaiah 59:15",
            "topic": "Persecution",
            "description": "This messsage starts off with Keith Daniel thanking his hosts, Denny Kennesaton and the Charity Fellowship. He went on a 8 week tour of USA in different preaching venues. The actual sermon recording starts at the 28 minute poing. There are alot of profound statements given by Keith Daniel throughout the sermon, namely a prophetic voicing of the next revival of religion and how it will be birthed through persection of a servere degree. This is a great recording to really put in perspective your anguish and trials in the Chrisitan life.",
            "download": "http:\/\/sermonindex.net\/SID4041-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "59"
                },
                {
                    "book": "2 Timothy",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Power in Persecution",
            "url": "http:\/\/sermonindex.net\/SID12725",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 4:23-24",
            "topic": "Persecution",
            "description": "Preached at Knox Presbyterian Church, Toronto on Aug 1967. Posted with the permission of Knox Presbyterian Church, Toronto.",
            "download": "http:\/\/sermonindex.net\/SID12725-download",
            "preacher_name": "Martyn-Lloyd Jones",
            "preacher_image": "\/images\/martynlloyd_jones.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Preparing For Persecution",
            "url": "http:\/\/sermonindex.net\/SID28083",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 4",
            "topic": "Persecution",
            "description": "Don Currin shares on the topic of coming persecution to North America. From modern events he gives a prophetic sense of what is coming from the Lord. He exposits 1 Peter 4 to give us clear direction from God of what to do when persecution comes to believers. Through examples martyrdom is shown to be a way of great glory for believers and God will give us grace in our hour of trial and pressure.",
            "download": "http:\/\/sermonindex.net\/SID28083-download",
            "preacher_name": "Don Currin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Preparing the Body of Christ for Persecution by Edgar Reich",
            "url": "http:\/\/sermonindex.net\/",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:9-13",
            "topic": "Persecution",
            "description": "Brother Edgar shares an important message that is prophetic for the body of Christ in North America. He speaks of a coming persecution that we must prepare for now. We must be in obedience now and simply follow the Lord in His revival for North America. The time is now to go and witness and be the body of Christ to others.",
            "download": "http:\/\/sermonindex.net\/-download",
            "preacher_name": "SermonIndex.net Simulcast 2013",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Revival Amidst (Islamic & Communistic) Persecution",
            "url": "http:\/\/sermonindex.net\/SID24277",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24277-download",
            "preacher_name": "Peter Hammond",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Scattered",
            "url": "http:\/\/sermonindex.net\/SID18849",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18849-download",
            "preacher_name": "Jack Hyles",
            "preacher_image": "",
            "preacher_description": "Jack Hyles (1926 - 2001)\r\nListen to freely downloadable audio sermons by the speaker Jack Hyles in mp3 format. Dr. Hyles was Pastor of First Baptist Church from August, 1959 until his death in February, 2001.  In the last five years of his ministry, this church had an average weekly attendance of over 15,000 with approximately 10,000 baptisms each year.  For many years, the church has been acclaimed to have the \"World's Largest Sunday School.\"\r\nDr. Hyles is the author of 49 books and pamphlets.  Many of his sermons are available on audio and video tape.  Dr. Hyles' experience covers numerous evangelistic campaigns, Bible conferences, etc.  He preached in virtually every state of the Union and in many foreign countries.  He hosted 37 annual Pastors' Schools, which have attracted thousands of preachers from all over the world.",
            "_scripture": []
        },
        {
            "title": "The Approaching Wave of Persecution",
            "url": "http:\/\/sermonindex.net\/SID17276",
            "size": "0",
            "format": "mp3",
            "scripture": "Habakkuk 2:1-4, Daniel 7:21-25, Daniel 8:23-27",
            "topic": "Persecution",
            "description": "Brother Denny Kenaston shares his burden on the coming persecution that will come in the end times but very possibly soon to Christianity world-wide. He clearly shows biblically that if we are of the kingdom of Christ the kingdom of this world will be in opposition against us. We need to prepare for this and prepare to love our enemies and share the Gospel.",
            "download": "http:\/\/sermonindex.net\/SID17276-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                },
                {
                    "book": "Daniel",
                    "chapter": "7"
                },
                {
                    "book": "Habakkuk",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Coming Final Persecution",
            "url": "http:\/\/sermonindex.net\/SID19451",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 13:9-13",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19451-download",
            "preacher_name": "Steven J. Lawson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Godly People Will Be Persecuted",
            "url": "http:\/\/sermonindex.net\/SID19332",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19332-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Persecuted",
            "url": "http:\/\/sermonindex.net\/SID25198",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25198-download",
            "preacher_name": "Anton Bosch",
            "preacher_image": "",
            "preacher_description": "Anton Bosch ( - )\r\nListen to freely downloadable audio sermons by the speaker Anton Bosch in mp3 format.  Privileged to be born into a long line of preachers, Anton Bosch met the Lord Jesus Christ as his Saviour in 1968. In 1971 he entered the Theological College of South Africa for two years, completed the third year by correspondence and was awarded the Diploma in Theology. In 2005 he was awarded the degree Master in Theology cum laude. The title of his dissertation was â€œThe pastoral and practical principles on which the churches in the New Testament are basedâ€\u009d. He is currently working on his Ph.D. in Biblical Studies. \r\n\r\nIn 2003 he was elected to the board of the International Fellowship of Christian Believers (formerly OFFI) with responsibility for the African continent and in 2004 was asked to serve as its international president. At the end of 2003 he was called to assist Burbank Community Church (Los Angeles, California) as itâ€™s senior pastor.. In 2009 the church moved to new premises in Sun Valley and us now known as Sun Valley Community Church (SVCC). Anton continues to teach at SVCC. It has been his life-long quest to rediscover New Testament Christianity and to call Christians and churches back to knowing, believing and living the Bible. He has planted a number of churches that are based on these principles. He is passionate about a correct exegesis of the Word and specialises in expository preaching and teaching.",
            "_scripture": []
        },
        {
            "title": "The Secret Door",
            "url": "http:\/\/sermonindex.net\/SID20822",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20822-download",
            "preacher_name": "Corrie Ten Boom",
            "preacher_image": "\/images\/corrie_ten_boom.gif",
            "preacher_description": "Corrie Ten Boom (1892 - 1983)\r\nListen to freely downloadable audio sermons by the speaker Corrie Ten Boom in mp3 format. Known for the book the \"Hiding Place\" where she smuggled Jewish people during the great World Wars under the Nazi regime. She had a vibrant faith in the Lord Jesus Christ and that showed in her love for others especially the people of Israel. She ended up going to a concentration camp where she suffered greatly and survived to share the story of faith. \r\n\r\nCorrie's faith story and testimony was shared in many settings especially in the 60-70's where she toured all across North America encouraging Christians of how to endure coming persecution. Her ministry was to encourage faith and love in the hardest circumstances.",
            "_scripture": []
        },
        {
            "title": "What Will You Do When YOU Face the Fire?",
            "url": "http:\/\/sermonindex.net\/SID24278",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Persecution",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24278-download",
            "preacher_name": "E.L. Bynum",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}