{
    "name": "Poor",
    "description": "",
    "audio_sermons": [
        {
            "title": "Good News To The Poor",
            "url": "http:\/\/sermonindex.net\/SID22723",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Poor",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22723-download",
            "preacher_name": "Jackie Pullinger",
            "preacher_image": "\/images\/jackie_pullinger.gif",
            "preacher_description": "Jackie Pullinger (1944 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jackie Pullinger in mp3 format. Shortly after her experience of being born-again the Lord called her to take a one-way ticket to Hong Kong, China. Her story is chronicled in the book: \"Chasing the Dragon\" which is a best-seller inspirational missionary story. He has founded St Stephen's Society in Hong Kong that helps serve drug addicts and gives them the life-transforming Gospel message.\r\n\r\nHer burden in ministry has been to show the love of Christ to the hurting and helpless. She saw in the message of the Gospel it had to have a response for us also to go and serve others. She teaches and shows this full-surrender is a simple response to receiving God's love in Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "How to Find Your Place",
            "url": "http:\/\/sermonindex.net\/SID10821",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Poor",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10821-download",
            "preacher_name": "Derek Prince",
            "preacher_image": "",
            "preacher_description": "Derek Prince (1915 - 2003)\r\nListen to freely downloadable audio sermons by the speaker Derek Prince in mp3 format. Derek's main gift of explaining the Bible and its teaching in a clear and simple way has helped build a foundation of faith in millions of lives. His non-denominational, non-sectarian approach has made his teaching equally relevant and helpful to people from all racial and religious backgrounds. He is the author of over 50 books, 600 audio and 100 video teachings, many of which have been translated and published in more than 100 languages. His daily radio broadcast is translated into Arabic, Chinese (Amoy, Cantonese, Mandarin, Shanghaiese, Swatow), Croatian, German, Malagasy, Mongolian, Russian, Samoan, Spanish and Tongan. The radio program continues to touch lives around the world.\r\nDerek Prince Ministries persists in reaching out to believers in over 140 countries with Derek's teachings, fulfilling the mandate to keep on \"until Jesus returns.\"",
            "_scripture": []
        },
        {
            "title": "The Rich and the Poor Part 1",
            "url": "http:\/\/sermonindex.net\/SID25900",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Poor",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25900-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Rich and the Poor Part 2",
            "url": "http:\/\/sermonindex.net\/SID25901",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Poor",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25901-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}