{
    "name": "Power of Sin",
    "description": "",
    "sermons": [
        {
            "title": "The Power of Sin",
            "url": "https:\/\/sermonindex.info\/SID5417",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 6:14-23",
            "topic": "Power of Sin",
            "description": "Pastor Hession reveals that this chapter of Romans is the charter for the freedom of the saints.  First the dominion of sin is the guilt of sin which is the same as the power of sin, sin has power over us when we feel the guilt that comes with it, and the passage of time does nothing to releave the power of sin over us to make us feel condemned.  Secondly to be under the Law means that we are trying to please God by trying to keep the moral Law which cannot be done thus the law is the power of sin, as we try and keep the law and fail the guilt , or power, of sin increases on us, we thus end up feeling so condemned that we think that bit of extra sin cannot make a bad situation worse.  Thirdly though despite all this we are under grace, not the dominion of sin, neither the law but grace!  The grace of God is shown in that even though we deserve Hell He gives us love and mercy.  Finally to reckon ourselves dead to sin means to realise sin has no more power to condemn us because of the work of the Lord Jesus on the cross of calvary.",
            "download": "https:\/\/sermonindex.info\/SID5417-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "6"
                }
            ]
        }
    ]
}