{
    "name": "Power Of Darkness",
    "description": "",
    "sermons": [
        {
            "title": "Stopping the Power of Darkness",
            "url": "http:\/\/sermonindex.net\/SID20575",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 4:20-21",
            "topic": "Power Of Darkness",
            "description": "Ravenhill gives an account of John Sung at the very end of this message. The testimony covers his academic success and then utter transformation upon conversion and filling of the Spirit. This message covers getting alone being still to hear God and what total consecration looks like. Spoken in the eve of abortion's legalization in Hawaii, he calls for people to walk in the measure of faith they been given with illustration from the testimony of Rees Howell purchasing the Bible school property.",
            "download": "http:\/\/sermonindex.net\/SID20575-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "4"
                }
            ]
        }
    ]
}