{
    "name": "Preparation",
    "description": "",
    "sermons": [
        {
            "title": "(Awake! Series): Prepare by Prayer",
            "url": "https:\/\/sermonindex.info\/SID1984",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 26:31-46",
            "topic": "Preparation",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1984-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "A People Prepared For The Lord",
            "url": "https:\/\/sermonindex.info\/SID1610",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 3:1-14",
            "topic": "Preparation",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1610-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Christmas Preparations",
            "url": "https:\/\/sermonindex.info\/SID27578",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 12:9-10",
            "topic": "Preparation",
            "description": "With the recent world events, Pastor Cymbala teaches about what we need to do to prepare for this Christmas. Romans 12:9-10, 14, 15-16, 18 (NIV)",
            "download": "https:\/\/sermonindex.info\/SID27578-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "How God Prepares Us (Part 9)",
            "url": "https:\/\/sermonindex.info\/SID24087",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 4:32-37",
            "topic": "Preparation",
            "description": "Acts 4:32-37; 13:1-3; 9:26-27; 11:22-24",
            "download": "https:\/\/sermonindex.info\/SID24087-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Prep Time Is Never Wasted Time",
            "url": "https:\/\/sermonindex.info\/SID23305",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Preparation",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23305-download",
            "preacher_name": "Michael Catt",
            "preacher_image": "",
            "preacher_description": "Michael Catt ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael Catt in mp3 format.  Michael served as the President of the 2008 Southern Baptist Convention Pastors’ Conference, representing over 42,000 churches. He has spoken at conferences, colleges, seminaries, rallies, camps, NBA and college chapel services, well as The Billy Graham Training Center at The Cove. He was also honored to be the sole Southern Baptist representative at a small group meeting with President George W. Bush in the oval office in 2002.\r\nMichael has served as Senior Pastor of Sherwood Baptist Church since 1989. The church has 3,000 members and has averaged one hundred baptisms each year. Thousands have joined the church from Albany and 29 surrounding communities. The church has changed from a neighborhood church to a regional, multi-ethnic congregation with members from eleven nations. Sherwood has three campuses covering 130-plus acres—the main church campus, the lower school campus and the upper school campus.",
            "_scripture": []
        },
        {
            "title": "Prepare Your Heart",
            "url": "https:\/\/sermonindex.info\/SID24624",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Preparation",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24624-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": []
        },
        {
            "title": "Preparing Your Heart to Receive the Truth",
            "url": "https:\/\/sermonindex.info\/SID15660",
            "size": "0",
            "format": "mp3",
            "scripture": "James 1:16-22, Hosea 10:12",
            "topic": "Preparation",
            "description": "It is shared in this sermon that we need to take the time to prepare our hearts to receive the truth of God. The preparation is from God in proverbs, and yet it says sow to yourselves righteousness and break up your fallow ground. This sermon covers the need for people to have their hearts prepared to receive the truth to come into vital relationship with God.",
            "download": "https:\/\/sermonindex.info\/SID15660-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Hosea",
                    "chapter": "10"
                },
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The University Of The Burning Bush",
            "url": "https:\/\/sermonindex.info\/SID27537",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 3:1-8",
            "topic": "Preparation",
            "description": "Moses was trained in Pharaoh's university in all the wisdom Egypt had to offer. But at the burning bush Moses is enrolled in God's university and learns important truths about God, about the people of God, and about the Christ of God.",
            "download": "https:\/\/sermonindex.info\/SID27537-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "3"
                }
            ]
        }
    ]
}