{
    "name": "Presence Of The Lord",
    "description": "",
    "sermons": [
        {
            "title": "The Lord Is My Light",
            "url": "http:\/\/sermonindex.net\/SID26066",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 27:1",
            "topic": "Presence Of The Lord",
            "description": "The confidence of the Psalmist lies in the Lord. He had experienced the Lord's presence and described it as his light and stronghold. That pertains to the experience of salvation and the promise of victory that He has promised to His people. God is the stronghold of His people because He is their strength. The intimate protection of God gives confidence and banishes fear, regardless of how great our adversaries. We look to the Lord and in His greatness our problems and adversaries become insignificant. Opposition and outright war did not touch him because his heart was strengthened by the Lord. The psalmist longs for God's temple and expresses the intensity of his seeking after God Himself. He desires to dwell in the temple of God for the rest of his life, and to gaze on the Lord's beauty. May we hold onto this word and make it our own.",
            "download": "http:\/\/sermonindex.net\/SID26066-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "27"
                }
            ]
        }
    ]
}