{
    "name": "Private Prayer",
    "description": "",
    "sermons": [
        {
            "title": "Secrets of a Private Prayer Life ",
            "url": "http:\/\/api.sermonindex.net\/SID22212",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Private Prayer",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22212-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": []
        },
        {
            "title": "The Ingredients of Closet Prayer",
            "url": "http:\/\/api.sermonindex.net\/SID24930",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Private Prayer",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24930-download",
            "preacher_name": "Al Whittinghill",
            "preacher_image": "",
            "preacher_description": "Al Whittinghill ( - )\r\nListen to freely downloadable audio sermons by the speaker Al Whittinghill in mp3 format. Al was called to join the worldwide ministry of Ambassadors for Christ International. AFCI is a fellowship of preachers and teachers of God’s Word who seek to serve the Church of Jesus Christ as catalysts for genuine spiritual revival and world evangelism, primarily through itinerant preaching ministries. Al works with AFCI out of its office in Atlanta, Georgia having an extensive preaching\/teaching ministry that reaches around the world. His ministry in the local churches encompasses many denominations across the United States and in other countries, where he has presented the unsearchable riches of Christ from God’s Word in more than 50 countries. For more than thirty five years Al has been privileged to preach, teach, and minister across the USA, Europe, India, Canada, Africa, Asia, Australia, the Pacific nations, and in countries behind the former Iron Curtain.\r\n\" I perceive that this man is a prophet who has a word for this generation….\" - Vance Havner  \/ \"My friend and brother Al Whittinghill has been touched with a live coal. He truly points the way and also leads the way. \"A man whose heart the Lord has touched\" 1 Sam.10:26. Hear him.\" - Leonard Ravenhill",
            "_scripture": []
        }
    ]
}