{
    "name": "Promises Of God",
    "description": "",
    "sermons": [
        {
            "title": "Abiding in God's promise",
            "url": "http:\/\/api.sermonindex.net\/SID24357",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24357-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        },
        {
            "title": "Binding God to His Own Word",
            "url": "http:\/\/api.sermonindex.net\/SID14750",
            "size": "0",
            "format": "mp3",
            "scripture": "Philippians 4:6, Hebrews 4:16, Ephesians 3:12",
            "topic": "Promises Of God",
            "description": "February 11, 2007 - We are invited to come boldly to the Throne of Grace, \"Christ Possessed\", knowing He is Our Father and He is also our King. When God speaks and makes a decree He speaks by His Living Word and He is Bound to His own promises and divine purposes. We cannot go into God's presence without a promise from His Word. When God speaks a word to you don't consult with your flesh and don't allow your feelings of unworthiness to effect your prayers. We are to come boldly with a fixed position, believing the truth and power of His Word. We do not try to persuade God, but rather are fully persuaded with a fixed position to the faithfulness of His Word.",
            "download": "http:\/\/api.sermonindex.net\/SID14750-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                },
                {
                    "book": "Philippians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Blood Upon Dry Land",
            "url": "http:\/\/api.sermonindex.net\/SID11906",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 4:1-9",
            "topic": "Promises Of God",
            "description": "December 25, 2005 - One of the ways God witnesses to the lost is through the change He makes in our lives. The very testimony of Christ in us will be a voice crying out to them. We as children of God are to take the promises of God and begin to speak what God is speaking to us about this lost generation. We are to allow the word of God’s promises become a higher reality than every situation and pour the water of life on the dry land and this life flowing force will lead the lost to the Blood of Jesus and the finished work of Calvary.",
            "download": "http:\/\/api.sermonindex.net\/SID11906-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "First Commandment With a Promise",
            "url": "http:\/\/api.sermonindex.net\/SID1386",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 6:2-3",
            "topic": "Promises Of God",
            "description": "This message deals with honoring your parents.",
            "download": "http:\/\/api.sermonindex.net\/SID1386-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "God's Great Promise to His Church",
            "url": "http:\/\/api.sermonindex.net\/SID0208",
            "size": "5253962",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "The Holy Spirit is the promise of the Father. To neglect Him is to give up our birthright and to hinder ourselves in our spiritual walk.",
            "download": "http:\/\/api.sermonindex.net\/SID0208-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "How to Start Taking - Promises",
            "url": "http:\/\/api.sermonindex.net\/SID24298",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24298-download",
            "preacher_name": "Steve Mays",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Leaving A Lot To Gain The Rest",
            "url": "http:\/\/api.sermonindex.net\/SID20699",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "August 1, 2010 - Sometimes when God makes a promise to us that seems to be way out in the future we can tend to hold on and settle for something that is right in front of us. We may hold on to relationships, plans, dreams and\/or a set of goals. Many times these are the very things that are hindering us from the supernatural plan that God has for our lives. This message provokes us to have a direct confrontation with these things and a mindset that says this thing needs to go! As we begin to let go God will begin to take us into the blessings that were already promised to us. The rest comes when we simply agree with God in every area of our life.",
            "download": "http:\/\/api.sermonindex.net\/SID20699-download",
            "preacher_name": "William Carrol",
            "preacher_image": "",
            "preacher_description": "William Carrol ( - )\r\nListen to freely downloadable audio sermons by the speaker William Carrol in mp3 format. Pastor William Carrol is an associate pastor and longtime “spiritual son” of the Times Square Church family. Shortly after his salvation, Pastor David Wilkerson, recognized the strong call of God on his life and sent him to Bible college and seminary for ministerial training.\r\nWhile completing his studies, Pastor William served as a co-pastor and later as senior pastor of Denver Fellowship in Colorado. He holds a masters degree in philosophy of religion. In 2005, Pastor William was invited to “come home” and serve on the pastoral staff of Times Square Church.",
            "_scripture": []
        },
        {
            "title": "Living in the Land - Part 1",
            "url": "http:\/\/api.sermonindex.net\/SID1815",
            "size": "5497344",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1815-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        },
        {
            "title": "Living in the Land - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID1816",
            "size": "5279744",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1816-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        },
        {
            "title": "Persevering To Inheriting The Promise",
            "url": "http:\/\/api.sermonindex.net\/SID15296",
            "size": "0",
            "format": "mp3",
            "scripture": "James 5:10-11",
            "topic": "Promises Of God",
            "description": "A passionate message to encourage us to endure under lifes circumstances and persevere to the end. We are called to inherit the promise and hope to the end. Are we a persevering people that are \"suffering long\" and not sinning? Only those that inherit the promises are those that are persevering and suffering long against sin.",
            "download": "http:\/\/api.sermonindex.net\/SID15296-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Most Overlooked Promise In The Bible",
            "url": "http:\/\/api.sermonindex.net\/SID1775",
            "size": "10977280",
            "format": "mp3",
            "scripture": "1 John 5:13",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1775-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Promises of the Lord Part I",
            "url": "http:\/\/api.sermonindex.net\/SID23392",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23392-download",
            "preacher_name": "Bertha Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Promises of the Lord Part II",
            "url": "http:\/\/api.sermonindex.net\/SID23394",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID23394-download",
            "preacher_name": "Bertha Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Upon This Rock",
            "url": "http:\/\/api.sermonindex.net\/SID20515",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Promises Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20515-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        }
    ]
}