{
    "name": "Prosperity Gospel",
    "description": "",
    "sermons": [
        {
            "title": "Another Gospel",
            "url": "https:\/\/sermonindex.info\/SID0228",
            "size": "1170000",
            "format": "mp3",
            "scripture": "2 Corinthians 11:14, 1 Timothy 6:5",
            "topic": "Prosperity Gospel",
            "description": "David Wilkerson gives a strong message with \"prophetic urgency.\" He clearly shows that the \"prosperity gospel\" teaching that gain is godliness is unscriptural and a lie from hell. Surely this is a word from God to a generation of Christians in America that have swallowed this ear tickling teaching up to their demise.",
            "download": "https:\/\/sermonindex.info\/SID0228-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "6"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Putting an End to the Prosperity Message",
            "url": "https:\/\/sermonindex.info\/SID26392",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Prosperity Gospel",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26392-download",
            "preacher_name": "Miki Hardy",
            "preacher_image": "",
            "preacher_description": "Miki Hardy ( - )\r\nListen to freely downloadable audio sermons by the speaker Miki Hardy in mp3 format. Miki Hardy was born and raised in Mauritius, and graduated from university in Australia in 1973. On returning to Mauritius he married Audrey and they were both born-again during charismatic meetings held in the Catholic Church. They started Eglise Chrétienne (Christian Church) with a group of believers in Curepipe, Mauritius, before travelling to Durban, South Africa to attended the Christian Bible Training College in 1979. They returned to Mauritius and to Eglise Chrétienne, and as a result of evangelism meetings, several churches were opened in Mauritius, Rodrigues, Reunion and the Seychelles. With the support of the local church, Miki and his wife Audrey began traveling to Africa to share what the Lord had done in their lives and in the church. \r\nTogether with other pastors, Pastor Miki founded Church Team Ministries International in 2001 to meet the growing demand of Christians on the African continent. Today CTMI consists of a network of churches in over 29 countries, with weekly radio and TV broadcasts that cover most of the continent. Pastor Miki Hardy continues to preach the message of the Cross and the grace of God; a message that transforms the life and ministry of Church Leadership and Christians. His desire to see restoration and unity in the lives of Church Leaders has continued to grow and motivate CTMI’s activities.",
            "_scripture": []
        }
    ]
}