{
    "name": "Purification",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 17): Seeing Ye Have Purified Your Souls",
            "url": "https:\/\/sermonindex.info\/SID2070",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:22",
            "topic": "Purification",
            "description": "“Seeing Ye Have Purified Your Souls” is part 17 of Pastor A. W. Tozer’s delightful, 34-part series based upon 1 Peter. The message was preached in Chicago, Illinois on January 17, 1954. Pastor Tozer notes that 1 Peter 1:22 is perfect for a sermon, as it may be conveniently divided into 7 parts: 1) You have purified your souls; 2) By obeying the truth; 3) Through the Spirit; 4) Unto unfeigned love of the brethren; 5) See therefore that ye love one another; 6) Out of a pure heart; 7) Fervently. He also teaches quick but important refresher courses in homiletics, comparative religion, and apologetics (from Hebrews 11.) The length of the recording is 31 minutes and 36 seconds.",
            "download": "https:\/\/sermonindex.info\/SID2070-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Purification For Sins",
            "url": "https:\/\/sermonindex.info\/SID22120",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Purification",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22120-download",
            "preacher_name": "Matthew Maxwell-Carr",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Take Away The Stone",
            "url": "https:\/\/sermonindex.info\/SID24081",
            "size": "0",
            "format": "mp3",
            "scripture": "John 11:21-27",
            "topic": "Purification",
            "description": "Just as Jesus needed to \"take away the stone\" to revive Lazarus, He also wants to help us remove the stones from our life that keep us from being all God desires us to be. John 11:21-27, 38-44",
            "download": "https:\/\/sermonindex.info\/SID24081-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "11"
                }
            ]
        }
    ]
}