{
    "name": "Questions",
    "description": "",
    "sermons": [
        {
            "title": "Eight Questions",
            "url": "http:\/\/api.sermonindex.net\/SID12486",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Questions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12486-download",
            "preacher_name": "Charles E. Fuller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Questions Of The World To Man Or God",
            "url": "http:\/\/api.sermonindex.net\/SID19677",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Questions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19677-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "The Gift of Questions",
            "url": "http:\/\/api.sermonindex.net\/SID28857",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Questions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28857-download",
            "preacher_name": "+Thaddeus Barnum",
            "preacher_image": "",
            "preacher_description": "Bishop Thaddeus Barnum\r\nListen to freely downloadable audio sermons by the speaker Bishop Thaddeus Barnum in mp3 format. Thad was consecrated in Denver, Colorado by Archbishop Emmanuel Kolini, June 24, 2001. Thad currently serves both as Bishop in Residence at All Saints, Pawleys Island, SC, and as a Chaplain to Clergy.  He has a passion for discipleship and through the ministry of Call 2 Disciple, Erilynne and Thad have given themselves to strengthening the Church in the Scriptures and discipling Christians to maturity in the faith.\r\n\r\nThad has served churches in Connecticut, Pennsylvania and South Carolina and has been married to Erilynne for 35 years. They raised 4 girls and have 11 grandchildren.",
            "_scripture": []
        },
        {
            "title": "The Inescapable Question",
            "url": "http:\/\/api.sermonindex.net\/SID2498",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Questions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2498-download",
            "preacher_name": "Skip Heitzig",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Two Most Important Questions Ever Asked",
            "url": "http:\/\/api.sermonindex.net\/SID25578",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Questions",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25578-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": []
        }
    ]
}