{
    "name": "Readiness",
    "description": "",
    "audio_sermons": [
        {
            "title": "Be Ye Ready is No Joking Matter",
            "url": "http:\/\/sermonindex.net\/SID4241",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:42,Revelation 19:7,Isaiah 56:9",
            "topic": "Readiness",
            "description": "This is a chilling message which should awake and shake anyone who listens to it prayerfully. Much of the church is fast asleep as the foolish virgins with no oil were, in Matt. 25. How do you know if you are ready? Get your eyes on Jesus, focus on his purposes for your life, not the things of this world, (Col 3:1-3), Stay in the Word daily; seeking him, for how shall you escape if you neglect so great a salvation? (Heb. 2:3). Settle every grudge, forgive those who have hurt you and don't be a smiter or unbeliever! If you really BELIEVE he's coming, does your life reflect that? Or are you at ease in Zion? Pray before you listen to this, and while you listen to this, for the Holy Spirit to shed his Light in your heart.",
            "download": "http:\/\/sermonindex.net\/SID4241-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "56"
                },
                {
                    "book": "Revelation",
                    "chapter": "19"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Spiritual Readiness",
            "url": "http:\/\/sermonindex.net\/SID22559",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Readiness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22559-download",
            "preacher_name": "Stephen Olford",
            "preacher_image": "",
            "preacher_description": "Stephen Olford (1918 - 2004)\r\nListen to freely downloadable audio sermons by the speaker Stephen Olford in mp3 format. Was a 20th-century Christian leader. Dr. Billy Graham called him \"the man who most influenced my ministry.\" He was a personal confidant of Graham. Olford was also a role model and friend to prominent pastors such as Charles Stanley and Adrian Rogers. He was a pioneer in Christian television programming with his show, Encounter, in New York. His Sunday morning sermons were also broadcast around the world on radio.[1] He was the Founder and Chairman of the Board of Olford Ministries International in Memphis, Tennessee which became The Stephen Olford Center at Union University. His authorized biography, Only One Life, was written by John Philipps.\r\nIn 1953, Dr. Stephen F. Olford's years of pastoral ministry began by serving the Duke Street Baptist Church in Richmond, Surrey England (1953–1959) and then the Calvary Baptist Church in New York City (1959–1973).[1] Olford systematized his method of expository preaching and formed a curriculum used to train preachers at the Olford Institute for Biblical Preaching in Memphis, Tennessee. Pastors and scholars migrated to the institute for inspiration and instruction that often resulted in upgraded pulpit ministries.",
            "_scripture": []
        },
        {
            "title": "Spiritual Readiness",
            "url": "http:\/\/sermonindex.net\/SID27533",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 21:1-14",
            "topic": "Readiness",
            "description": "In this passage we see the apostle Paul's readiness to preach the gospel anywhere and his readiness to die for Christ. How do we explain Paul's spiritual readiness? 1-He was guided by the Spirit. 2-He was motivated by love for Christ. 3-He was fortified by the fellowship of other believers.",
            "download": "http:\/\/sermonindex.net\/SID27533-download",
            "preacher_name": "Roger Ellsworth",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "Why Must We Be Spiritually Ready?",
            "url": "http:\/\/sermonindex.net\/SID13835",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:32-45, Genesis 3:15, Isaiah 9:6-7",
            "topic": "Readiness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13835-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "9"
                },
                {
                    "book": "Genesis",
                    "chapter": "3"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                }
            ]
        }
    ]
}