{
    "name": "Rehoboam",
    "description": "",
    "audio_sermons": [
        {
            "title": "He Did Not Set His Heart",
            "url": "http:\/\/sermonindex.net\/SID9336",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rehoboam",
            "description": "Rehoboam was a man destined for greatness simply by virtue of who his father was, and yet a man who missed greatness, simply because he forgot who His Heavenly Father was. He did evil, because he did not set his heart to seek the Lord. He wanted to enjoy the fruits of the kingdom without surrendering to the disciplines of the King, so he missed it, and his name goes down in history, simply as one of the king's kids who missed his claim to greatness. Has there ever been a time when, by an act of your will, you simply handed over the reigns of your life to a Sovereign God who has an incredible plan for that life that will both honor Him and make you what you were intended to be?",
            "download": "http:\/\/sermonindex.net\/SID9336-download",
            "preacher_name": "Russell Kelfer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Rehoboam: If You Will Be Kind",
            "url": "http:\/\/sermonindex.net\/SID9335",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rehoboam",
            "description": "Have you ever looked back on your life, or on the life of someone you have studied about in history, and thought to yourself, \"how different it all would have turned out, had it not been for that one major mistake? The difference between the greats of the ages and the goats of the ages has often been told in the story of one simple wrong decision. Instead of following the advice of his father's counselors, Rehoboam did the opposite, and with that decision destroyed his people. How does a godly leader lead his people? See how one decision can affect so many.",
            "download": "http:\/\/sermonindex.net\/SID9335-download",
            "preacher_name": "Russell Kelfer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}