{
    "name": "Rejoice",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 6): Rejoice...Though Now...Ye Are in Heaviness",
            "url": "http:\/\/sermonindex.net\/SID2059",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 1:6-9",
            "topic": "Rejoice",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2059-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Rejoicing in God, Living Unto God",
            "url": "http:\/\/sermonindex.net\/SID28139",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rejoice",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28139-download",
            "preacher_name": "Richard Owen Roberts",
            "preacher_image": "\/images\/richard_owen_roberts.gif",
            "preacher_description": "Richard Owen Roberts ( - )\r\nListen to freely downloadable audio sermons by the speaker Richard Owen Roberts in mp3 format. Richard Owen Roberts is the President and founding Director of International Awakening Ministries. Mr. Roberts serves as the itinerant preacher for IAM. A native of Schenectady, New York, Mr. Roberts prepared for the ministry at Gordon College, Whitworth College and Fuller Theological Seminary. He has been the pastor of churches in Idaho, Oregon, Washington and California. During the years he served the Conservative Congregational Christian Conference as Minister-at-Large, he was instrumental in the formation of two churches in the Albany capitol district: the Bethlehem Community Church of Delmar, New York, and the Clifton Park Community Church in Clifton Park, New York.\r\n\r\nSince 1975, Mr. Roberts has been an ardent student of spiritual awakenings. His vast personal collection of revival material serves as the nucleus of the research library at the Billy Graham Center in Wheaton, Illinois. Mr. Roberts also served on the board of directors of the Oxford Association for Research in Revival founded and lead by the late J. Edwin Orr. Mr. Roberts succeeded Dr. Orr as the Association’s president. He has authored, edited and or published numerous volumes relating to revival and revivalism all of which can be found on line at the IAM bookstore. Mr. Roberts continues to be a much sought out conference speaker, lecturer and consultant in matters pertaining to revival. Through his preaching, writing and personal counsel he continues to motivate and inspire a generation of men and women who are devoted to the glory of God in revival.",
            "_scripture": []
        }
    ]
}