{
    "name": "Rejoicing",
    "description": "",
    "sermons": [
        {
            "title": "How to Rejoice When the Battle's Over",
            "url": "http:\/\/sermonindex.net\/SID9338",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rejoicing",
            "description": "This is the final of a four-part series outlining a \"Blueprint For Battle\" from the life of Jehoshaphat. As we saw the enemy bearing down upon Israel, we saw Jehoshaphat pray, surrendering his will to God's. We saw him stand in the midst of battle and watch to see what God would do. This lesson is about what to do when God has handed us even the smallest of victories. We need to stop and praise Him as God gives us rest. It may be for only a day or a long while, but it is imperative that we take the holiday with Him.",
            "download": "http:\/\/sermonindex.net\/SID9338-download",
            "preacher_name": "Russell Kelfer",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Rejoicing In What God Has Done",
            "url": "http:\/\/sermonindex.net\/SID14667",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rejoicing",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID14667-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "The Command To Rejoice Evermore",
            "url": "http:\/\/sermonindex.net\/SID22876",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rejoicing",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22876-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "The Weapon of Rejoicing",
            "url": "http:\/\/sermonindex.net\/SID28392",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rejoicing",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28392-download",
            "preacher_name": "Otto Koning",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "There Is A Way To A Rejoicing Heart",
            "url": "http:\/\/sermonindex.net\/SID2788",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 1:6-7;Psalms 74:10;Luke 10:25",
            "topic": "Rejoicing",
            "description": "It would be awful to go before the Lord with a barren place in our heart and life, an area not touched yet by the Lord where we do not have victory. Yet that is exactly what Hannah did, in spite of the fact she was provoked sore by her adversary, and mocked for her barrenness. The enemy will come and lie to you accusing you, telling you God sees your flaws and has withdrawn from you. Hannah began to fast and pray, so desperate for God to birth something in her that she was willing to give it back to him if he would. And he did. We can appropriate this lesson for our own lives. And we will find the way to the rejoicing heart, just as Hannah did.",
            "download": "http:\/\/sermonindex.net\/SID2788-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "1"
                }
            ]
        }
    ]
}