{
    "name": "Relationship With Christ",
    "description": "",
    "sermons": [
        {
            "title": "At His feet",
            "url": "http:\/\/sermonindex.net\/SID20308",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Relationship With Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20308-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": []
        },
        {
            "title": "Our Relationship With Christ",
            "url": "http:\/\/sermonindex.net\/SID18439",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Relationship With Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18439-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        }
    ]
}