{
    "name": "Religious Movie",
    "description": "",
    "sermons": [
        {
            "title": "The Menace of the Religious Movie (reading)",
            "url": "https:\/\/sermonindex.info\/SID13785",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 23:15",
            "topic": "Religious Movie",
            "description": "This is a reading, by Howard Douglas King, of an article taken from A. W. Tozer's book, 'Worship and Entertainment'. Tozer, in keeping with the historic Christian stance on the theater, condemns the religious movie, giving the following seven reasons: 1. It violates the scriptural law of hearing. 2. The religious movie embodies the mischievous notion that religion is, or can be made, a form of entertainment. 3. The religious movie is a menace to true religion because it embodies acting, a violation of sincerity. 4. They who present the gospel movie owe it to the public to give biblical authority for their act: and this they have not done. 5. God has ordained four methods only by which Truth shall prevail -- and the religious movie is not one of them. 6. The religious movie is out of harmony with the whole spirit of the Scriptures and contrary to the mood of true godliness. 7. I am against the religious movie because of the harmful effect upon everyone associated with it.",
            "download": "https:\/\/sermonindex.info\/SID13785-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "23"
                }
            ]
        }
    ]
}