{
    "name": "Reprobate",
    "description": "",
    "sermons": [
        {
            "title": "Reprobates and Trembling Nations",
            "url": "http:\/\/sermonindex.net\/SID16264",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:15-32",
            "topic": "Reprobate",
            "description": "Carter Conlon delivers a powerful stirring rebuke and exhortation to this generation to seek God with a whole heart. There is misuse of the things of God in the churches and a lack of regard for the holiness of God in America. There are terrible times coming for America and this message proves a warning to many preachers who are preaching soft, small, slick messages in these last days.",
            "download": "http:\/\/sermonindex.net\/SID16264-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Development of a Reprobate",
            "url": "http:\/\/sermonindex.net\/SID21000",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Reprobate",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21000-download",
            "preacher_name": "James Robison",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}