{
    "name": "Rest",
    "description": "",
    "sermons": [
        {
            "title": "(1 John #20) Hearts at Rest in His Presence",
            "url": "https:\/\/sermonindex.info\/SID4821",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4821-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "Abundantly Satisfied",
            "url": "https:\/\/sermonindex.info\/SID3257",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID3257-download",
            "preacher_name": "Friedel Stegen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Come unto me and I will give you rest\t",
            "url": "https:\/\/sermonindex.info\/SID23633",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23633-download",
            "preacher_name": "Peter Orasuk",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Enter Into His Rest",
            "url": "https:\/\/sermonindex.info\/SID16336",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID16336-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": []
        },
        {
            "title": "Enter Into Rest",
            "url": "https:\/\/sermonindex.info\/SID4053",
            "size": "10164736",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4053-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Entering into Rest",
            "url": "https:\/\/sermonindex.info\/SID22777",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22777-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Entering into Rest",
            "url": "https:\/\/sermonindex.info\/SID23692",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23692-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        },
        {
            "title": "His Resting Place",
            "url": "https:\/\/sermonindex.info\/SID28108",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28108-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "How to Find Rest",
            "url": "https:\/\/sermonindex.info\/SID26448",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26448-download",
            "preacher_name": "Elisabeth Elliot",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Imperatives - Relatedness",
            "url": "https:\/\/sermonindex.info\/SID3863",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "The enemy would seek to seduce us and draw us away from the simplicity that is in Christ. It is through our inward harmony with God that comes through dwelling in Him, beholding His countenance, and enquiring in His temple that we find rest for our souls, healing for our bodies, and are able to relate to one another in a right way.",
            "download": "https:\/\/sermonindex.info\/SID3863-download",
            "preacher_name": "Devern Fromke",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Labor to enter into that rest",
            "url": "https:\/\/sermonindex.info\/SID22989",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22989-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Matthew 11:28",
            "url": "https:\/\/sermonindex.info\/SID8044",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 11:28",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8044-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Ministers of Comfort and Recipe for Rest",
            "url": "https:\/\/sermonindex.info\/SID28302",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:4-5",
            "topic": "Rest",
            "description": "Believers sometimes have the misguided opinion that their faith is weak if they show signs of mourning. This beatitude not only supports mourningÂ— it links it to a blessing. Mourning a loss is normal and there are things God wants us to learn from the loss. We must let God use our mourning to move us in three ways. First, mourning helps us ask the right questions about life. Second, it helps us to seek GodÂ’s answers. Third, it also helps us to accept the blessing God has provided including our salvation.",
            "download": "https:\/\/sermonindex.info\/SID28302-download",
            "preacher_name": "Dick Woodward",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Rest in the Lord",
            "url": "https:\/\/sermonindex.info\/SID22780",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22780-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "Return Unto Thy Rest O My Soul",
            "url": "https:\/\/sermonindex.info\/SID13956",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 116:1-2",
            "topic": "Rest",
            "description": "February 27,2005 - There is no measure of human strength to take us to the place that God has prepared for us. When we become utterly bankrupt and we exhausted from all self effort and our best attempts . there will be cry formed in our heart to say God I cant go another step without you. This is the cry that God waits for so that He can do for us what we cant do for ourselves and in that place we will find rest.",
            "download": "https:\/\/sermonindex.info\/SID13956-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                }
            ]
        },
        {
            "title": "The Rest",
            "url": "https:\/\/sermonindex.info\/SID27172",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27172-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        },
        {
            "title": "The Rest of God",
            "url": "https:\/\/sermonindex.info\/SID15907",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15907-download",
            "preacher_name": "Gareth Evans",
            "preacher_image": "",
            "preacher_description": "Gareth Evans ( - )\r\nListen to freely downloadable audio sermons by the speaker Gareth Evans in mp3 format. Gareth Evans is an itinerant pastor\/teacher with a burden to minister to the hurting church his ministry website is Gareth Evans Ministries.  Formerly a Physics teacher in the UK and Canada, he became a pastor with the Christian & Missionary Alliance in Canada in 1979. In 1991, he was invited to serve as pastor on board the M\/V Anastasis, a medical, missionary ship operated by Youth With A Mission (YWAM). Since leaving that ministry four years later, Gareth has traveled to many countries, encouraging pastors and missionaries.\r\nHe is married to Anne and they have three married daughters, nine grandchildren and three great grandchildren. Gareth and Anne live in Victoria, in beautiful British Columbia, Canada. Some of his main burdens is to mentor young men to see them walk in the anointing of God and soar on wings as eagles. He has also prayed for revival and moderated many SermonIndex revival conferences across the world.",
            "_scripture": []
        },
        {
            "title": "The Secret Place of Rest",
            "url": "https:\/\/sermonindex.info\/SID20778",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20778-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Way To Find Rest In Our Soul",
            "url": "https:\/\/sermonindex.info\/SID14159",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Rest",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14159-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        }
    ]
}