{
    "name": "Resurrection Of Christ",
    "description": "",
    "sermons": [
        {
            "title": "The Post Resurrection of Christ",
            "url": "http:\/\/sermonindex.net\/SID20753",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 24:11-35",
            "topic": "Resurrection Of Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20753-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "The Resurrection Of Christ ",
            "url": "http:\/\/sermonindex.net\/SID12772",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 15",
            "topic": "Resurrection Of Christ",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12772-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "15"
                }
            ]
        }
    ]
}