{
    "name": "Revival Prayer",
    "description": "",
    "sermons": [
        {
            "title": "Praying For Revival",
            "url": "http:\/\/sermonindex.net\/SID25054",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival Prayer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25054-download",
            "preacher_name": "Byron Paulus",
            "preacher_image": "",
            "preacher_description": "Byron Paulus ( - )\r\nListen to freely downloadable audio sermons by the speakerByron Paulus in mp3 format.  Byron was appointed by the Board of Directors as Executive Director and President of Life Action Ministries. Byron’s three decades of experience in leadership with America’s largest revival ministry (over 200 staff), and his vision to see God send another Spiritual Awakening to our nation, have given him an opportunity to influence thousands through his various speaking, writing, and leadership endeavors.\r\nByron grew up on a dairy farm near Elkhart Indiana. He and his wife, Sue, reside in Niles, Michigan, near Life Action’s National Ministry Center, and have three adult children, all of whom are involved in full-time Christian ministry. They are the proud grandparents of ten grandchildren. Byron also serves on Life Action’s Board of Directors and the Executive Committee of the Board. Byron has committed his life to leading Life Action in its ongoing pursuit of believing God for a national revival throughout North America.",
            "_scripture": []
        },
        {
            "title": "The Place of Prayer in Revival",
            "url": "http:\/\/sermonindex.net\/SID12225",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Revival Prayer",
            "description": "A great discussion of the Korean Revival in the early 20th century, and then about the work of conviction of sin in revival.",
            "download": "http:\/\/sermonindex.net\/SID12225-download",
            "preacher_name": "J. Edwin Orr",
            "preacher_image": "\/images\/j_edwin_orr.gif",
            "preacher_description": "J. Edwin Orr (1912 - 1987)\r\nListen to freely downloadable audio sermons by the speaker J. Edwin Orr in mp3 format. Brother Orr shared in an experience of revival in his youth as he traveled by faith and saw many powerful workings of God. After years of seeing personal revival and experiences in his ministry he studied the theme of historical revival to equip and teach the Church.\r\n\r\nHe published many books on the topic of subject of revival: \"Can God?\" \"Full Surrender\" and many others. He ministered cross-denoninationally in baptist, pentecostal, calvary chapel and in many other movements. He was also influential in the Campus Crusade for Christ organization.",
            "_scripture": []
        }
    ]
}