{
    "name": "Riches",
    "description": "",
    "sermons": [
        {
            "title": "A Rich Young Man",
            "url": "http:\/\/sermonindex.net\/SID23399",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Riches",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23399-download",
            "preacher_name": "Bertha Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "A Truly Wealthy Man",
            "url": "http:\/\/sermonindex.net\/SID4102",
            "size": "13767680",
            "format": "mp3",
            "scripture": "Proverbs 13:7",
            "topic": "Riches",
            "description": "This message looks in the book of proverbs and gives a clear picture of what really a truly wealthy man is. This is more of a teaching rather than preaching session, I really appreciated alot of the bible study hints brother daniel gives.",
            "download": "http:\/\/sermonindex.net\/SID4102-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Riches that Bring No Sorrow",
            "url": "http:\/\/sermonindex.net\/SID0236",
            "size": "4982241",
            "format": "mp3",
            "scripture": "",
            "topic": "Riches",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID0236-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": []
        },
        {
            "title": "The Eye Of the Needle",
            "url": "http:\/\/sermonindex.net\/SID27175",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Riches",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27175-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        },
        {
            "title": "The Foolish and How Riches Cannot Redeem",
            "url": "http:\/\/sermonindex.net\/SID26194",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Riches",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26194-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Sorrow Of Riches",
            "url": "http:\/\/sermonindex.net\/SID13505",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Riches",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13505-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}