{
    "name": "Sabbath",
    "description": "",
    "sermons": [
        {
            "title": "(God and Man) Entering God's sabbath rest",
            "url": "https:\/\/sermonindex.info\/SID7230",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 21:1-6, 31:12-17, Hebrews 4:9",
            "topic": "Sabbath",
            "description": "What does it mean to rest from my works?  Brother Zac shares a lot of personal testimony of how the Lord brought him from a life of unrest and pleasing others to a life of rest in Him.",
            "download": "https:\/\/sermonindex.info\/SID7230-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "21"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Sabbath Miracles) 01 - Nazareth Grain Field",
            "url": "https:\/\/sermonindex.info\/SID15003",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 4:16-19, Matthew 12:1-8",
            "topic": "Sabbath",
            "description": "Jesus came to rescue His beautiful Sabbath that became encrusted over with the barnacles of man's rules and traditions.  Ed's introductory lesson touches upon the first Sabbath truth in the Lord's preaching on the Sabbath in Nazareth and develops the reality of walking with Jesus in the grain fields of life in which He satisfies our every hunger!",
            "download": "https:\/\/sermonindex.info\/SID15003-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "12"
                },
                {
                    "book": "Luke",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Episodes In Life Of T\/Lord 08 Healing On The Sabbath",
            "url": "https:\/\/sermonindex.info\/SID10008",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Sabbath",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10008-download",
            "preacher_name": "Robert Constable",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Honoring the Sabbath",
            "url": "https:\/\/sermonindex.info\/SID4253",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 16:22-30",
            "topic": "Sabbath",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4253-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Mark - Lord even of the Sabbaths",
            "url": "https:\/\/sermonindex.info\/SID26521",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Sabbath",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26521-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "The Lord's Day",
            "url": "https:\/\/sermonindex.info\/SID15254",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Sabbath",
            "description": "Sunday is becoming another ordinary day in today's society. While we are not required to keep the Old Testament sabbath, the principles of it still apply to us today. Those who don't set aside a day for the Lord don't prosper spiritually. Don't let the cares of life distract you on the Lord's Day. Our focus should be on the Lord, not our own pleasure.",
            "download": "https:\/\/sermonindex.info\/SID15254-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}