{
    "name": "Saving Faith",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Christ—The Way God Makes Man Righteous) 8. Saving Faith",
            "url": "http:\/\/sermonindex.net\/SID18681",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saving Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18681-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "A Faith That Works",
            "url": "http:\/\/sermonindex.net\/SID5638",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 1:1-10",
            "topic": "Saving Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID5638-download",
            "preacher_name": "David Roper",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Serious Look at Saving Faith",
            "url": "http:\/\/sermonindex.net\/SID24916",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saving Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24916-download",
            "preacher_name": "Al Whittinghill",
            "preacher_image": "",
            "preacher_description": "Al Whittinghill ( - )\r\nListen to freely downloadable audio sermons by the speaker Al Whittinghill in mp3 format. Al was called to join the worldwide ministry of Ambassadors for Christ International. AFCI is a fellowship of preachers and teachers of God’s Word who seek to serve the Church of Jesus Christ as catalysts for genuine spiritual revival and world evangelism, primarily through itinerant preaching ministries. Al works with AFCI out of its office in Atlanta, Georgia having an extensive preaching\/teaching ministry that reaches around the world. His ministry in the local churches encompasses many denominations across the United States and in other countries, where he has presented the unsearchable riches of Christ from God’s Word in more than 50 countries. For more than thirty five years Al has been privileged to preach, teach, and minister across the USA, Europe, India, Canada, Africa, Asia, Australia, the Pacific nations, and in countries behind the former Iron Curtain.\r\n\" I perceive that this man is a prophet who has a word for this generation….\" - Vance Havner  \/ \"My friend and brother Al Whittinghill has been touched with a live coal. He truly points the way and also leads the way. \"A man whose heart the Lord has touched\" 1 Sam.10:26. Hear him.\" - Leonard Ravenhill",
            "_scripture": []
        },
        {
            "title": "Saving Faith",
            "url": "http:\/\/sermonindex.net\/SID6727",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saving Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6727-download",
            "preacher_name": "Oswald J. Smith",
            "preacher_image": "\/images\/oswald_j_smith.gif",
            "preacher_description": "Oswald J. Smith (1889 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Oswald J. Smith in mp3 format. Was a Canadian pastor, author, and missions advocate. He founded The People's Church in Toronto in 1928. Over the course of eighty years he preached more than 12,000 sermons in 80 countries, wrote thirty-five books (with translations into 128 languages), as well as 1,200 poems, of which 100 have been set to music, including \"Deeper and Deeper\" (first line \"Into the heart of Jesus\").\r\nThe great burden of Oswald J. Smith's Christian life was to see the lost come to the Lord. He was well known for the motto: \"We talk of the Second Coming; half the world has never heard of the first.\" and \"No one has the right to hear the gospel twice, while there remains someone who has not heard it once.\"",
            "_scripture": []
        },
        {
            "title": "The Saving Faith",
            "url": "http:\/\/sermonindex.net\/SID15517",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saving Faith",
            "description": "Is saving faith a reality in your life today? We can know that God has saved us. Salvation is a work of God that changes the heart from the inside out. Just as the caterpillar is changed into a butterfly, so saving faith in our hearts will change our lives.",
            "download": "http:\/\/sermonindex.net\/SID15517-download",
            "preacher_name": "Emanuel Esh",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "What Is Saving Faith - Part 2",
            "url": "http:\/\/sermonindex.net\/SID20053",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saving Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20053-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": []
        }
    ]
}