{
    "name": "Saviour",
    "description": "",
    "sermons": [
        {
            "title": "(John) An Outstanding Revelation Of The Saviour",
            "url": "http:\/\/sermonindex.net\/SID6861",
            "size": "0",
            "format": "mp3",
            "scripture": "John 8:12-59",
            "topic": "Saviour",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6861-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "A Prince And Saviour",
            "url": "http:\/\/sermonindex.net\/SID8015",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saviour",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8015-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Mark - The Sleeping Saviour & The Stormy Sea",
            "url": "http:\/\/sermonindex.net\/SID26528",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Saviour",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26528-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "Portrait Of The Saviour",
            "url": "http:\/\/sermonindex.net\/SID3207",
            "size": "10170368",
            "format": "mp3",
            "scripture": "",
            "topic": "Saviour",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3207-download",
            "preacher_name": "J. Sidlow Baxter",
            "preacher_image": "\/images\/j_sidlow_baxter.gif",
            "preacher_description": "J. Sidlow Baxter (1903 - 1999)\r\nListen to freely downloadable audio sermons by the speaker J. Sidlow Baxter in mp3 format.   J. Sidlow Baxter was born in Australia and grew up in Lancashire, England.  He attended Spurgeon's Theological College in London and was a pastor in Scotland and England.  He is the author of over thirty books and has ministered in churches, Bible Conferences, and missionary centers throughout the United States, Canada, Great Britain and other places around the world.\r\nHe is scholarly but very practical and helpful.  These spoken sermons will be a great blessing to God's people for many years to come.  What a time it will be when we are able to meet with men like Dr. Baxter in the New Jerusalem that John saw coming down out of heaven.",
            "_scripture": []
        },
        {
            "title": "The Church and the Saviour",
            "url": "http:\/\/sermonindex.net\/SID22566",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 2:11-16",
            "topic": "Saviour",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22566-download",
            "preacher_name": "Robert Dowie",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "2"
                }
            ]
        }
    ]
}