{
    "name": "Science",
    "description": "",
    "sermons": [
        {
            "title": "Dimension Theory\/Time Theory",
            "url": "https:\/\/sermonindex.info\/SID0544",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 2",
            "topic": "Science",
            "description": "God’s mind is not bound by time.  Neither is his interaction with our reality.  Wilder-Smith uses one of his greatest analogies concerning the impossibility of using the scientific method to perceive or interact with heaven and hell.  The analogy comes in the form of understanding that there is no way to interact with a Black Hole, yet we know that they exist by inference.  So also, we are able to interact with eternal realities by inference.  Through this analogy, Smith reveals the lie concerning our inability to scientifically measure heaven or hell to prove it's existence because you cannot scientifically tamper with a black hole in any way yet scientists believe in them just the same.   The second analogy he explains about dimensionality is that a two dimensional person would be incapable of capturing a three dimensional person, because they would always use their higher dimensionality to give their captors the slip.  So also, Jesus gave death the slip.  Smith explains that this life is about preparation for glorification, as the power that comes with a resurrected body would be too dangerous to place within the hands of immoral people.   So if we suffer with him, so also shall we reign with him.",
            "download": "https:\/\/sermonindex.info\/SID0544-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Is Man a Machine?",
            "url": "https:\/\/sermonindex.info\/SID0547",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "In this speaking, we discover the dire necessity to recognize man as a machine.  In spite of the tendency to be repulsed by such an idea, the facts belie this reality.  As scientists have attempted to understand how to make a machine that is capable of replicating itself, they have discovered the astronomical amount of information required to make a machine that is not only self-replicating, but also self-diagnosing.  This type of machine is called a Von Neummann machine, and is incredibly complex to develop and requires millions of individual moving components, as well as the information to drive them.  In this analogy we see that man is an incredibly complex machine, obviously designed, and if he\/she is designed, then they are also designed to operate in a certain fashion.  Smith points out that to use our machines in a way that contradict God’s laws is to operate out of our designed ordinances.  When we, as complex Von Neummann machines operate out of our intended purpose then God no longer seems real or meaningful to us in any way.",
            "download": "https:\/\/sermonindex.info\/SID0547-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Locks & Keys",
            "url": "https:\/\/sermonindex.info\/SID0552",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "Whenever food is consumed, that food has to be broken down into its constituent nutrients.  Each nutrient is “locked” and the human body has to “unlock” the nutrients from the cells it is consuming.   The human body has the array of keys necessary to unlock all of the nutrients it must consume from the food.   How do you possess all of these keys?  You must have them programmed into you ahead of time.  Secondarily, language and the capacity to learn and translate it is also entirely contained within the sperm of men, which is then transferred into our genes and then into our minds.  How much pleasure must it give the creator when we use the machines of our minds for those intentions which he made them for?  Jesus chose to offer himself as a sacrifice for us so that we could offer ourselves as a sacrifice for him.  Should we not set our face toward that as he set his face toward Jerusalem?",
            "download": "https:\/\/sermonindex.info\/SID0552-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Turtle God's Handiwork",
            "url": "https:\/\/sermonindex.info\/SID0549",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Science",
            "description": "Smith here explains that our worship to God is the product of understanding.  When we begin to understand how he made creation, it will cause us to recognize his power, authority and capabilities.  Using the magnetic compass of a sea turtle as an example, Smith discusses how it would not be able to exist were it not that it had been designed to work with its natural compass.  The turtle would not be able to make it to the ocean as a hatchling, neither would it be able to breed by making it back to its home breeding grounds later in life.  It is out of knowledge that God makes us to enjoy the necessities of consumption (food that is).  When we realize that God is a hedonist by nature, and we are going to enjoy him forever, we will worship with a greater knowledge and fervency.",
            "download": "https:\/\/sermonindex.info\/SID0549-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}