{
    "name": "Seasons",
    "description": "",
    "sermons": [
        {
            "title": "A Season and a Time",
            "url": "http:\/\/api.sermonindex.net\/SID27538",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Seasons",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27538-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        },
        {
            "title": "The Times and the Seasons",
            "url": "http:\/\/api.sermonindex.net\/SID15239",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Seasons",
            "description": "If the people of God would live in the expectancy of His return it would have a sanctifying affect. Works and self righteousness will not do; only the sacrificial blood of Jesus Christ applied to our lives will prepare us for that day. A warning and a blessing from I Thes. 5 as the church prepares to \"multiply\".",
            "download": "http:\/\/api.sermonindex.net\/SID15239-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "There Is a Time for Every Purpose",
            "url": "http:\/\/api.sermonindex.net\/SID15229",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Seasons",
            "description": "Good things done at the wrong time will not turn out right. God calls us to be sensitive to Him and know His timing. Are we in tune with what He is asking us to do today, whether it be joyous or difficult? He will make everything beautiful in His time.",
            "download": "http:\/\/api.sermonindex.net\/SID15229-download",
            "preacher_name": "Aaron Hurst",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}