{
    "name": "Secret Prayer",
    "description": "",
    "sermons": [
        {
            "title": "The Necessity of Secret Prayer",
            "url": "http:\/\/api.sermonindex.net\/SID4311",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 6: 5-7,Genesis 21:33",
            "topic": "Secret Prayer",
            "description": "It is essential that Christians spend time daily shut in with the Lord, giving him quality time. A praying woman who spends time regularly with the Lord has an orderly home. If there is chaos, and confusion, it is because of a lack of prayer, most of the time. This is a firm, but loving rebuke to those who do not pray as they know they are supposed to. Issues as to why the lack of prayer are addressed in a helpful way.",
            "download": "http:\/\/api.sermonindex.net\/SID4311-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "21"
                },
                {
                    "book": "Matthew",
                    "chapter": "6"
                }
            ]
        }
    ]
}