{
    "name": "Self Reliance",
    "description": "",
    "sermons": [
        {
            "title": "When God Asks too Much",
            "url": "http:\/\/sermonindex.net\/SID16708",
            "size": "0",
            "format": "mp3",
            "scripture": "Galatians 4:29",
            "topic": "Self Reliance",
            "description": "Don’t be too quick to comes to God 's defense and say God never asks too much. This message suggests that God ALWAYS asks too much and it is never God's design or desire that we should ever be in a place where we think that what God is requiring is something that we can bring about in our own strength or by our own power. When God first speaks His promises to us there is strong expectancy for the fulfillment of that promise. But as time passes on and we are still waiting the possible begins to seem impossible. It is in these times of delay that our flesh will begin to think that we can make things happen in our own time and our own way. God in His mercy will bring us through the refiner's fire so we can let go of all that we think we are and what we think we are supposed to do. He will refine our gifts and our calling until He has complete ownership and lordship over them.",
            "download": "http:\/\/sermonindex.net\/SID16708-download",
            "preacher_name": "William Carrol",
            "preacher_image": "",
            "preacher_description": "William Carrol ( - )\r\nListen to freely downloadable audio sermons by the speaker William Carrol in mp3 format. Pastor William Carrol is an associate pastor and longtime “spiritual son” of the Times Square Church family. Shortly after his salvation, Pastor David Wilkerson, recognized the strong call of God on his life and sent him to Bible college and seminary for ministerial training.\r\nWhile completing his studies, Pastor William served as a co-pastor and later as senior pastor of Denver Fellowship in Colorado. He holds a masters degree in philosophy of religion. In 2005, Pastor William was invited to “come home” and serve on the pastoral staff of Times Square Church.",
            "_scripture": [
                {
                    "book": "Galatians",
                    "chapter": "4"
                }
            ]
        }
    ]
}