{
    "name": "Selling The Gospel",
    "description": "",
    "sermons": [
        {
            "title": "The Violent Overthrow of God's House",
            "url": "http:\/\/sermonindex.net\/SID4218",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 21",
            "topic": "Selling The Gospel",
            "description": "You have never heard the tabernacle of the Lord explained as you will here. From Matthew 21 where Jesus overthrew the tables and ran the moneychangers out of the temple, to 2nd Chronicles 6 and 7 when Solomon built the temple and dedicated it, the purpose of the temple is explained in depth. This is a real eye-opener on prayer. Just as the religious Pharisees were ineffective and uncaring for the lost, with no real compassion, today many Christians are caught up in worldly things, while their family and friends are lost,  too busy to pray as they should. Jesus said his house should be a house of prayer and we are the temple of God. Are we houses of prayer? Do we pray as we should?",
            "download": "http:\/\/sermonindex.net\/SID4218-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "21"
                }
            ]
        }
    ]
}