{
    "name": "Seventy Weeks",
    "description": "",
    "sermons": [
        {
            "title": "(Daniel) Daniel's Seventy Weeks",
            "url": "https:\/\/sermonindex.info\/SID13849",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9:20-27",
            "topic": "Seventy Weeks",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13849-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Daniel) The 70 Weeks of Daniel",
            "url": "https:\/\/sermonindex.info\/SID10750",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9: 20-27, Nehemiah 2:1, Luke 19:37-40",
            "topic": "Seventy Weeks",
            "description": "After Daniels great intercession for the nation of Israel the angel Gabriel appears to him and tells him that he is about to be shown a great prophecy.  This is amazingly characteristic of the abundance with which the Lord gives to His people, Daniel has been asking the Lord to show mercy to the nation of Israel yet the Lord does that and more, He answers Daniel's prayer but goes so much further.  Gabriel reveals to Daniel that there will be a period of 490 years that will concern the Jews and particularly the city of Jerusalem.  The prophecy began to be fulfilled in 445BC at the decree of Cyrus to rebuild the city of Jerusalem.  483 Jewish years (360 days) later was the exact that the Lord Jesus rode into Jerusalem on the donkey, but as predicted the Messiah was executed and the temple destoyed.  So we await the fulfillment of Daniels 70th week, when the Antichrist will confirm a covenant with the jews, his people destroyed the temple and Jerusalem before he even came to the world, many believe he will probably be European.",
            "download": "https:\/\/sermonindex.info\/SID10750-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "19"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                },
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Seventy Weeks of Daniel",
            "url": "https:\/\/sermonindex.info\/SID10675",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9",
            "topic": "Seventy Weeks",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10675-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        }
    ]
}