{
    "name": "Silence",
    "description": "",
    "sermons": [
        {
            "title": "(Revelation) No Trumpets Sounding",
            "url": "http:\/\/sermonindex.net\/SID7060",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 10",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7060-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "A Time To Be Silent",
            "url": "http:\/\/sermonindex.net\/SID28052",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28052-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": []
        },
        {
            "title": "Silence of Jesus In Suffering",
            "url": "http:\/\/sermonindex.net\/SID21912",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21912-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        },
        {
            "title": "Silence, inwardness, and “love unto all the saints”",
            "url": "http:\/\/sermonindex.net\/SID23059",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23059-download",
            "preacher_name": "Hans R. Waldvogel",
            "preacher_image": "\/images\/hans_r_waldvogel.gif",
            "preacher_description": "Hans R. Waldvogel (1893 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Hans R. Waldvogel in mp3 format. A powerful preacher who ministered as a pentecostal minister. He did not believe in sectarian groups but rather saw the Church as a whole who have the person of Christ in them.  Brother Waldvogel gleamed from many different men of God including A.B. Simpson.\r\n\r\nHis preaching was centred around the very person of Jesus Christ and the work of the Holy Spirit. He spoke much of the rest of the Lord in Christian work and experience and the Spirit-filled life.",
            "_scripture": []
        },
        {
            "title": "The Sin Of Silence",
            "url": "http:\/\/sermonindex.net\/SID18894",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Silence",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18894-download",
            "preacher_name": "Jack Hyles",
            "preacher_image": "",
            "preacher_description": "Jack Hyles (1926 - 2001)\r\nListen to freely downloadable audio sermons by the speaker Jack Hyles in mp3 format. Dr. Hyles was Pastor of First Baptist Church from August, 1959 until his death in February, 2001.  In the last five years of his ministry, this church had an average weekly attendance of over 15,000 with approximately 10,000 baptisms each year.  For many years, the church has been acclaimed to have the \"World's Largest Sunday School.\"\r\nDr. Hyles is the author of 49 books and pamphlets.  Many of his sermons are available on audio and video tape.  Dr. Hyles' experience covers numerous evangelistic campaigns, Bible conferences, etc.  He preached in virtually every state of the Union and in many foreign countries.  He hosted 37 annual Pastors' Schools, which have attracted thousands of preachers from all over the world.",
            "_scripture": []
        }
    ]
}