{
    "name": "Slander",
    "description": "",
    "audio_sermons": [
        {
            "title": "(Judging - Part 2) Saying No To Slander",
            "url": "http:\/\/sermonindex.net\/SID22233",
            "size": "0",
            "format": "mp3",
            "scripture": "James 4:11",
            "topic": "Slander",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22233-download",
            "preacher_name": "Alistair Begg",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Don't Slander Your Heavenly Father",
            "url": "http:\/\/sermonindex.net\/SID4245",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 78:18-41",
            "topic": "Slander",
            "description": "This is about how to get and maintain the blessing of the Lord. Thinking wrong in our hearts hinders our praise, and we might not even realize we slander the Lord by negative thoughts. Most of us would say we haven't slandered God. Every Christian should listen to this message, and find out for sure. You know God worked for you in the past but do you wonder if he's going to help you this time? That is one example of slandering your heavenly Father. This message will challenge and enlighten all who listen with an open heart.",
            "download": "http:\/\/sermonindex.net\/SID4245-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "78"
                }
            ]
        }
    ]
}