{
    "name": "Snare",
    "description": "",
    "sermons": [
        {
            "title": "The Snare of the Folwer",
            "url": "http:\/\/api.sermonindex.net\/SID5396",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124:7, Romans 6:14, Romans 7:5",
            "topic": "Snare",
            "description": "This Psalm depicts Israel escaping the snare of the fowler, which is a figure of the redeemed being freed from the entrappings of sin by the gracious hand of the Lord Jesus.  The power of sin over the christian, or anyone, is it's ability to condemn and maintain our guilt before the law of God, we can go on for years under the power of a sin that we may only have commited once, this is the sanre designed by Satan himself and the more we try and work our way free the tighter it becomes and the more condemned we feel trying to live up to the law in order to please God.  But praise God for the Lord Jesus who took upon Himself the wieght of sin and not only that but became my sin and yours for us, He alone could have exhausted the power of sin and the law over us and so He alone can free us from it's grasp.",
            "download": "http:\/\/api.sermonindex.net\/SID5396-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "7"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                },
                {
                    "book": "Psalms",
                    "chapter": "124"
                }
            ]
        }
    ]
}