{
    "name": "Son Of God",
    "description": "",
    "sermons": [
        {
            "title": "God's Eternal Son",
            "url": "https:\/\/sermonindex.info\/SID1609",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Son Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1609-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": []
        },
        {
            "title": "Reflect the Light of the Son",
            "url": "https:\/\/sermonindex.info\/SID17120",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Son Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID17120-download",
            "preacher_name": "Arno Stegen",
            "preacher_image": "",
            "preacher_description": "Arno Stegen ( - )\r\nListen to freely downloadable audio sermons by the speaker Arno Stegen in mp3 format. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church.\r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit.",
            "_scripture": []
        },
        {
            "title": "Unto Us A Son Is Given",
            "url": "https:\/\/sermonindex.info\/SID8747",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Son Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8747-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}