{
    "name": "Soul",
    "description": "",
    "sermons": [
        {
            "title": "Are You Well",
            "url": "https:\/\/sermonindex.info\/SID3959",
            "size": "0",
            "format": "mp3",
            "scripture": "3 John 1-2",
            "topic": "Soul",
            "description": "In 3 John 1-2, the Apostle John greets Gaius \"whom I love in truth.\" He continues: \"I wish above all that thou mayest prosper and be in health, even as thy soul prospereth.\" Is your body as healthy as  your soul? Major Thomas explains that human beings are composed of two basic parts -- that which can be seen (the  body) and that which cannot be seen (the spirit and soul). That part no one sees constitutes the real you and the actions of the body often mirrors our true spiritual health.",
            "download": "https:\/\/sermonindex.info\/SID3959-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "3 John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "How do you value your Soul",
            "url": "https:\/\/sermonindex.info\/SID23681",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Soul",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID23681-download",
            "preacher_name": "Peter Orasuk",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Oh My Soul",
            "url": "https:\/\/sermonindex.info\/SID13504",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Soul",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13504-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "Price of Your Soul",
            "url": "https:\/\/sermonindex.info\/SID17973",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 31:11, Proverbs 31:23-31",
            "topic": "Soul",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID17973-download",
            "preacher_name": "Steve Mays",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "The Soul of a Man",
            "url": "https:\/\/sermonindex.info\/SID3340",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Soul",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID3340-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": []
        },
        {
            "title": "The Voice of the Soul",
            "url": "https:\/\/sermonindex.info\/SID0244",
            "size": "2957312",
            "format": "mp3",
            "scripture": "Luke 12:16-21",
            "topic": "Soul",
            "description": "The Parable of the Rich Fool illustrates the inestimable worth of the soul as compared to everything else. Dr. Tozer uses Our Lord’s story to warn of covetness. It is the voice of the soul which cries out, “Don’t be so concerned with the things of the world that you forget me.” “I am not a body containing a soul,” Dr. Tozer says, “I am a soul contained in a body.”",
            "download": "https:\/\/sermonindex.info\/SID0244-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "12"
                }
            ]
        }
    ]
}