{
    "name": "Soulish",
    "description": "",
    "sermons": [
        {
            "title": "Soulish or Spiritual",
            "url": "http:\/\/sermonindex.net\/SID26319",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Soulish",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26319-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Soulish religion",
            "url": "http:\/\/sermonindex.net\/SID24368",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Soulish",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24368-download",
            "preacher_name": "Joshua Daniel",
            "preacher_image": "",
            "preacher_description": "Joshua Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Joshua Daniel in mp3 format. Mr. Daniel leads a large number of missionaries and Christian workers in various parts of the globe.   God has used him in a revival ministry in many congregations.  Mr. Daniel is a man of prayer who believes that God will abundantly bless people who seek the Lord with an honest and open heart.\r\n\r\nThe Laymen's Evangelical Fewllowship International was founded by Joshua Daniel's Father. Now internationally, wherever people really desire a change and are willing to conform to God's condition to 'humble themselves', God is visiting and changing people of various religions and backgrounds. Instead of 'intellectual bat-chasing in the dark' which men oft-times call religion today, people are meeting the Lord Jesus and God is speaking to men and women. They have television, radio and website broadcasts today that are touching thousands with the life-changing Gospel.",
            "_scripture": []
        }
    ]
}