{
    "name": "Speech",
    "description": "",
    "sermons": [
        {
            "title": "Gracious Speech",
            "url": "http:\/\/api.sermonindex.net\/SID13440",
            "size": "0",
            "format": "mp3",
            "scripture": "James 3:1-9",
            "topic": "Speech",
            "description": "\"The Body of Christ is being ripped apart by a bunch of truth speakers,\" laments Alan Martin.  Our report and observations of others around us may be accurate, but are they missing hope and faith?  Like Aaron our job is stand and bless not curse, and like Jesus to bear long with the infirmities of others, not accuse.  (NOTE: \"A Pure Heart\" is a follow-on to this sermon.)",
            "download": "http:\/\/api.sermonindex.net\/SID13440-download",
            "preacher_name": "Alan Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "James",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Purity of Speech As Believers in Christ",
            "url": "http:\/\/api.sermonindex.net\/SID28128",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 4:29",
            "topic": "Speech",
            "description": "In this message, Pastor Cymbala teaches about how important words are. Words can benefit and encourage those that listen. He shares how many christians grieve the Holy Spirit continually through the day with their speech. For believers we should not have unwholesome speech, anger, slander, wrath or critical talk. God can purify our hearts and tongues so that they are pleasing in His sight.",
            "download": "http:\/\/api.sermonindex.net\/SID28128-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Speechless",
            "url": "http:\/\/api.sermonindex.net\/SID9209",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 7:18-20",
            "topic": "Speech",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9209-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Samuel",
                    "chapter": "7"
                }
            ]
        }
    ]
}