{
    "name": "Spiritual Famine",
    "description": "",
    "sermons": [
        {
            "title": "Spiritual Famine",
            "url": "http:\/\/api.sermonindex.net\/SID5397",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Samuel 21, 1 Peter 2:24",
            "topic": "Spiritual Famine",
            "description": "\"Our experience in Christ is supposed to be a land that flows with milk and honey,\" says Roy Hession.  Hession illustrates God's ways in revival by looking at the famine that took place in David's reign and seeing the resolution, ultimately bringing our sins to Calvary and realizing that Christ has been made a curse for us by hanging upon the tree.",
            "download": "http:\/\/api.sermonindex.net\/SID5397-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                },
                {
                    "book": "2 Samuel",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "When Spiritual Famine Invades the Church",
            "url": "http:\/\/api.sermonindex.net\/SID25149",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Spiritual Famine",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID25149-download",
            "preacher_name": "Brad Allen",
            "preacher_image": "",
            "preacher_description": "Brad Allen ( - )\r\nListen to freely downloadable audio sermons by the speaker Brad Allen in mp3 format. Brad Allen served for 42 years as a Baptist Pastor. then retired from the pastorate on May 1, 1999. He had a passion in my heart to see true, authentic spiritual awakening in the local church. Since 1999, preaching Spiritual Awakening Conferences in fourteen different states, and in Scotland. The time for great spiritual awakening for America is here. God is beginning to do a \"new thing.\" The time of the \"latter rain\" is fast approaching.\r\nBrad Allen founded Spiritual Awakening Ministries. Churches in America have had enough \"revival meetings\" where no one is revived, enough evangelistic campaigns where no one is converted to Christ. It is time to call the church to account for true spiritual awakening. When Brad is invited to a church, he makes no demands on that church. He will go anywhere he is invited.",
            "_scripture": []
        }
    ]
}