{
    "name": "Spiritual Battle",
    "description": "",
    "sermons": [
        {
            "title": "Be Strong in the Lord",
            "url": "https:\/\/sermonindex.info\/SID27553",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 6:10-13",
            "topic": "Spiritual Battle",
            "description": "In the world people are fighting against flesh and blood, one race against another race, one nation against another nation. But we do not fight against flesh and blood but rather against principalities and rulers of the darkness of this age. The Word tells us, finally, be strong in the Lord and in the power of His might. The power of the Lord Jesus is great. However, the devil and demons have power too but limited. But God's power is the greatest, and He has commanded us to go into all the world and make disciples of all nations and teach them to keep all that He has commanded us (Matt 28:19-20). You do not get salvation through education. Education without Christ just produces clever devils. Jesus commanded us to teach the nations, not just to know, but to keep all that He has taught us.",
            "download": "https:\/\/sermonindex.info\/SID27553-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Spiritual Battle and Love of God",
            "url": "https:\/\/sermonindex.info\/SID28064",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 10:4",
            "topic": "Spiritual Battle",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID28064-download",
            "preacher_name": "Gary Henderson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "10"
                }
            ]
        }
    ]
}