{
    "name": "Struggling",
    "description": "",
    "sermons": [
        {
            "title": "Where Do I Stand With God",
            "url": "https:\/\/sermonindex.info\/SID1747",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 33:11, Exodus 17-23",
            "topic": "Struggling",
            "description": "God does not yell at us when we are struggling. It is His desire to see us \"strengthened in the inner man\" that we might walk \"in the Light\" as He is in the Light. This message is a rebuke to those who viciously thunder condemning messages to those struggling with sin. If listened to out of context, and with a wrong spirit, one might think Brother Wilkerson is saying that \"it doesn't matter if you sin.\"  He is not. Brother Wilkerson emphasizes the importance of delivering the FULL counsel of God - that although there is great \"severity\" if one does not surrender their life to Jesus, the Lord is also full of forgiveness and loving-kindness.  \"By lovingkindness and truth iniquity is atoned for, And by the fear of the LORD one keeps away from evil.\" Proverbs 16:6",
            "download": "https:\/\/sermonindex.info\/SID1747-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "17"
                },
                {
                    "book": "Exodus",
                    "chapter": "33"
                }
            ]
        }
    ]
}