{
    "name": "Supernatural Life",
    "description": "",
    "audio_sermons": [
        {
            "title": "Hear the Voice of God and Live",
            "url": "http:\/\/sermonindex.net\/SID26061",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Supernatural Life",
            "description": "We must realize that without the presence and power of God in our lives we are dead. There is good news for you if you open your heart to Jesus He will raise you out of the power of death and sin and bring you into a supernatural life. Today Jesus offers you His life and a new beginning.",
            "download": "http:\/\/sermonindex.net\/SID26061-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "The Supernatural Life",
            "url": "http:\/\/sermonindex.net\/SID3562",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Supernatural Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3562-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": []
        }
    ]
}