{
    "name": "Supremacy of Christ",
    "description": "",
    "sermons": [
        {
            "title": "The Supremacy of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID20763",
            "size": "0",
            "format": "mp3",
            "scripture": "Colossians 1:9-19",
            "topic": "Supremacy of Christ",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20763-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Colossians",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Supremacy of Christ in Suffering",
            "url": "http:\/\/api.sermonindex.net\/SID20114",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Supremacy Of Christ",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20114-download",
            "preacher_name": "John Piper",
            "preacher_image": "",
            "preacher_description": "John Piper (1946 - Present)\r\nListen to freely downloadable audio sermons by the speaker John Piper in mp3 format. is a Calvinistic Baptist Christian preacher and author currently serving as Pastor for Preaching and Vision of Bethlehem Baptist Church in Minneapolis, Minnesota. His books include ECPA Christian Book Award winners Spectacular Sins, What Jesus Demands from the World, Pierced by the Word, and God's Passion for His Glory, and bestsellers Don't Waste Your Life and The Passion of Jesus Christ. The evangelical organization Desiring God is named for his book Desiring God: Meditations of a Christian Hedonist (1986).\r\n\r\nIn 1980, after what he described as an \"irresistible call of the Lord to preach\", Piper became Pastor of Bethlehem Baptist Church in Minneapolis, Minnesota, where he has been ministering ever since. Piper hit the evangelical scene after the publication of his book Desiring God: Meditations of a Christian Hedonist (1986) and has continued to publish dozens of other books further articulating this theological perspective. In 1994, he founded Desiring God Ministries, which provides all of Piper's sermons and articles from the past three decades, and most of his books online free of charge, as well as offering for sale books, CDs, and DVDs and regularly hosting conferences.",
            "_scripture": []
        }
    ]
}