{
    "name": "Take Heed",
    "description": "",
    "sermons": [
        {
            "title": "(Awake! Series): Take Heed how Ye Hear",
            "url": "http:\/\/api.sermonindex.net\/SID1987",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 8:16-18",
            "topic": "Take Heed",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID1987-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Take Heed to Yourself",
            "url": "http:\/\/api.sermonindex.net\/SID0120",
            "size": "4272640",
            "format": "mp3",
            "scripture": "",
            "topic": "Take Heed",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID0120-download",
            "preacher_name": "J. Oswald Sanders",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "Take Heed, Lest You Fall",
            "url": "http:\/\/api.sermonindex.net\/SID20765",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 16:13-16",
            "topic": "Take Heed",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20765-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "16"
                }
            ]
        }
    ]
}