{
    "name": "Tears",
    "description": "",
    "sermons": [
        {
            "title": "A World Without Tears",
            "url": "http:\/\/sermonindex.net\/SID24285",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Tears",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24285-download",
            "preacher_name": "Steve Mays",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "No Tears",
            "url": "http:\/\/sermonindex.net\/SID27763",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 8:6",
            "topic": "Tears",
            "description": "Brother Edward Miller shares about the breaking of God in the life of the Christian. He speaks of how God needs to break saints in all areas of their live so that the Spirit of God can have full sway and power in our life. Tears are the response to God that we have been broken, sensitive to His work and will. A challenging message for personal revival and Holy Spirit surrender.",
            "download": "http:\/\/sermonindex.net\/SID27763-download",
            "preacher_name": "R. Edward Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Tears",
            "url": "http:\/\/sermonindex.net\/SID19859",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Tears",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19859-download",
            "preacher_name": "Tim Keller",
            "preacher_image": "",
            "preacher_description": "Tim Keller ( - )\r\nListen to freely downloadable audio sermons by the speaker Tim Keller in mp3 format.  Is an American Christian apologist, author, speaker, and the founding pastor of Redeemer Presbyterian Church in New York City, New York. He is the author of several books, including The Reason for God: Belief in an Age of Skepticism, which garnered awards from World Magazine and Christianity Today and was No. 7 on The New York Times Best Seller list for non-fiction in March 2008.\r\nHe was ordained by the Presbyterian Church in America (PCA) and served as a pastor in Virginia for nine years, while serving as director of church planting for the PCA. He also served on the faculty of Westminster Theological Seminary, in Philadelphia, Pennsylvania, where he and his wife Kathy were involved in urban ministry and he continues as an adjunct professor of practical theology. Keller is a co-founder of The Gospel Coalition, a group of Reformed leaders from around the United States.",
            "_scripture": []
        },
        {
            "title": "Tears Before The Altar",
            "url": "http:\/\/sermonindex.net\/SID24322",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Tears",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24322-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": []
        },
        {
            "title": "The Power of Tears",
            "url": "http:\/\/sermonindex.net\/SID24932",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Tears",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24932-download",
            "preacher_name": "Al Whittinghill",
            "preacher_image": "",
            "preacher_description": "Al Whittinghill ( - )\r\nListen to freely downloadable audio sermons by the speaker Al Whittinghill in mp3 format. Al was called to join the worldwide ministry of Ambassadors for Christ International. AFCI is a fellowship of preachers and teachers of God’s Word who seek to serve the Church of Jesus Christ as catalysts for genuine spiritual revival and world evangelism, primarily through itinerant preaching ministries. Al works with AFCI out of its office in Atlanta, Georgia having an extensive preaching\/teaching ministry that reaches around the world. His ministry in the local churches encompasses many denominations across the United States and in other countries, where he has presented the unsearchable riches of Christ from God’s Word in more than 50 countries. For more than thirty five years Al has been privileged to preach, teach, and minister across the USA, Europe, India, Canada, Africa, Asia, Australia, the Pacific nations, and in countries behind the former Iron Curtain.\r\n\" I perceive that this man is a prophet who has a word for this generation….\" - Vance Havner  \/ \"My friend and brother Al Whittinghill has been touched with a live coal. He truly points the way and also leads the way. \"A man whose heart the Lord has touched\" 1 Sam.10:26. Hear him.\" - Leonard Ravenhill",
            "_scripture": []
        },
        {
            "title": "The Tears Of God",
            "url": "http:\/\/sermonindex.net\/SID22796",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Tears",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22796-download",
            "preacher_name": "Edgar Reich",
            "preacher_image": "",
            "preacher_description": "Edgar Reich ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Edgar Reich in mp3 format. The former business man is Reverend Edgar Reich. He has been called by the Lord to teach and preach in Revival. He is a devoted Christian teacher, leading adult Bible study groups at his Church, his former business and his community. God has called him into fulltime Christian Ministry to preach and teach in Revival. \r\n\r\nHe became a Reverend under the leadership of Rev. Dr. R. L. Curry in July 2008.  The Lord has had brother Edgar start Revival Canada USA which is a ministry believing God for revival in North America. \"God has promised to bring a Nation wide Revival to the United States of America and Canada prior to the return of the Lord Jesus Christ. Fires of Revival will break out all over the United States and Canada in many cities and spread from African American Churches to White Churches.\"",
            "_scripture": []
        }
    ]
}