{
    "name": "Trouble",
    "description": "",
    "sermons": [
        {
            "title": "Bull, Lions & Dogs",
            "url": "http:\/\/sermonindex.net\/SID24083",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 22",
            "topic": "Trouble",
            "description": "\"Do not be far from me. Trouble is near. No one to help.\" A simple, yet powerful prayer by David gives us insight into how to pray. Psalm 22",
            "download": "http:\/\/sermonindex.net\/SID24083-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "22"
                }
            ]
        },
        {
            "title": "Ever-Present Help In The Time Of Trouble",
            "url": "http:\/\/sermonindex.net\/SID3942",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 46:1",
            "topic": "Trouble",
            "description": "Ps. 46:1 says our God is our refuge and strength, an ever present help in time of trouble. He is available to us any time, day or night. He's continually watching over his own, willing to speak to us and guide us. THe Bible tells us that Christ himself is in us, and we are in him. We have been given great and precious promises that we might partake of his divine nature (2 Pet. 1:4). In trouble, God is there, and in peaceful times, God is there. What comfort in these perilous times! An uplfting message for those in trials and tribulation.",
            "download": "http:\/\/sermonindex.net\/SID3942-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "46"
                }
            ]
        },
        {
            "title": "If God Could Keep Me From Trouble, Then Why Doesn't He?",
            "url": "http:\/\/sermonindex.net\/SID3529",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 125:1-5",
            "topic": "Trouble",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3529-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "125"
                }
            ]
        },
        {
            "title": "Prayer In the Time of Trouble",
            "url": "http:\/\/sermonindex.net\/SID25862",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Trouble",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25862-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        },
        {
            "title": "The Cure for Trouble",
            "url": "http:\/\/sermonindex.net\/SID26883",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Trouble",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26883-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        }
    ]
}