{
    "name": "True Vine",
    "description": "",
    "sermons": [
        {
            "title": "Christ, The True Vine",
            "url": "https:\/\/sermonindex.info\/SID24228",
            "size": "0",
            "format": "mp3",
            "scripture": "John 15:1-7",
            "topic": "True Vine",
            "description": "Are our hearts focused on Christ alone or other things? Paul Washer shares the ultimate important goal of Christian life is to experience and know God Himself. We should never allow ministry or gifts or other experiences to take away from our devotion to God Himself. Christ is the true vine, He is our source of life, fulfillment and joy.",
            "download": "https:\/\/sermonindex.info\/SID24228-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Vine Branches",
            "url": "https:\/\/sermonindex.info\/SID5419",
            "size": "0",
            "format": "mp3",
            "scripture": "John 15:1-11, Psalm 80:8, Isaiah 5:2",
            "topic": "True Vine",
            "description": "The Lord is the True Vine, and we are to be the branches, the Vine displays the fruit it produces through it's branches and so should we bear the fruit of the Lord Jesus.  If we do not bear the fruit of the Spirit though we will compensate for it by manifesting the works of the flesh in an attempt to cover over our seperation from the True Vine.  The basic fruit of the Spirit is love it is at the heart of all the other fruits, the basis for the works of the flesh is self. A great truth is revealed in this message that we do not bear fruit by asking for it but by confessing and dealing with our sin then the Lord will help us to bear fruit.",
            "download": "https:\/\/sermonindex.info\/SID5419-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                },
                {
                    "book": "Psalms",
                    "chapter": "80"
                },
                {
                    "book": "John",
                    "chapter": "15"
                }
            ]
        }
    ]
}