{
    "name": "True Revival",
    "description": "",
    "sermons": [
        {
            "title": "The Marks of True Revival",
            "url": "http:\/\/sermonindex.net\/SID3814",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "True Revival",
            "description": "When God answers sincere, desperate prayers for revival, He restores the life and reality that was once there. You will understand in a deeper way the depravity of man and the wages of sin. As you break your heart before Him, God will perform a sanctifying work in your life, you will find yourself overwhelmed with a true joy, and you will begin to be burdened for and to reach out to others.",
            "download": "http:\/\/sermonindex.net\/SID3814-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": []
        },
        {
            "title": "True Revival - The Presence of the Lord",
            "url": "http:\/\/sermonindex.net\/SID20761",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 4:1-6",
            "topic": "True Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20761-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "4"
                }
            ]
        }
    ]
}