{
    "name": "Unction",
    "description": "",
    "sermons": [
        {
            "title": "The Unction From the Holy One",
            "url": "https:\/\/sermonindex.info\/SID18529",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 2:19-28",
            "topic": "Unction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18529-download",
            "preacher_name": "Aaron Dunlop",
            "preacher_image": "",
            "preacher_description": "Aaron Dunlop ( - )\r\nListen to freely downloadable audio sermons by the speaker Aaron Dunlop in mp3 format. Mr. Dunlop who is originally from Northern Ireland, graduated from the Geneva Reformed Seminary, SC. and is currently pioneering a Free Presbyterian Church in Victoria, British Columbia.\r\nReformed in Doctrine, believing in the divine authority and verbal inspiration of the Bible, and the great fundamental doctrines of grace it contains. The Scriptures alone are the supreme authority in matters of faith and practice. Separatist in Practice, believing and practicing the doctrine of Biblical separatism. In accordance with this, the Free Presbyterian Church has no association with the modern Ecumenical or Charismatic movements, nor will it fellowship with any church which has departed from the fundamental doctrines of the Word of God.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Unction Of The Holy Spirit",
            "url": "https:\/\/sermonindex.info\/SID18358",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 4:16-32",
            "topic": "Unction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID18358-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Unction In Preaching",
            "url": "https:\/\/sermonindex.info\/SID24645",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Unction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID24645-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": []
        },
        {
            "title": "Under the Unction and Anointing of the Holy Spirit",
            "url": "https:\/\/sermonindex.info\/SID9414",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 4:16-32",
            "topic": "Unction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9414-download",
            "preacher_name": "Gerhard Du Toit",
            "preacher_image": "",
            "preacher_description": "Gerhard Du Toit ( - )\r\nListen to freely downloadable audio sermons by the speaker Gerhard Du Toit in mp3 format. Originally from South Africa, Gerhard was brought up in the Dutch Reformed Church and trained as an evangelist there. He has had extensive evangelistic experience in South Africa, where his ministry is greatly appreciated. He has also been engaged in convention and evangelistic ministry in the British Isles.\r\nGerhard has resided in Canada, with his wife and daughter, since 1987. He is a coveted speaker in conferences around the world. His powerful preaching and authoritative, biblical message greatly bless and move the hearts of those who hear him. He also has a deep burden to see a revival of praying men. Like the prophet Jeremiah, his heart burns for an elevated standard of godliness in our day. He know is part of Life Action in Canada serving with that ministry.",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "We Need a Double Portion",
            "url": "https:\/\/sermonindex.info\/SID12067",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Kings 2",
            "topic": "Unction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12067-download",
            "preacher_name": "Alan Cairns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Kings",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Where Is The Fire?",
            "url": "https:\/\/sermonindex.info\/SID17402",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 17",
            "topic": "Unction",
            "description": "This is a powerful burdened message preached at a Baptist Conference in Texas around 1990. Ravenhill shares on the burden for a unction, anointing and power from above to rest upon the Church. He speaks for 2 whole hours sharing his burden for revival. Do we have the fire of God in our life's?",
            "download": "https:\/\/sermonindex.info\/SID17402-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "17"
                }
            ]
        }
    ]
}