{
    "name": "Unfaithfulness",
    "description": "",
    "sermons": [
        {
            "title": "Have You Been Unfaithful to God?",
            "url": "https:\/\/sermonindex.info\/SID1543",
            "size": "10392064",
            "format": "mp3",
            "scripture": "Isaiah 7:14, John 7:5",
            "topic": "Unfaithfulness",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID1543-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "7"
                },
                {
                    "book": "Isaiah",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Israel's Unfaithfulness",
            "url": "https:\/\/sermonindex.info\/SID25785",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Unfaithfulness",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25785-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": []
        }
    ]
}