{
    "name": "Unforgiveness",
    "description": "",
    "audio_sermons": [
        {
            "title": "When Unforgiveness Begs for Mercy",
            "url": "http:\/\/sermonindex.net\/SID14662",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 2:28-34",
            "topic": "Unforgiveness",
            "description": "January 28, 2007 - The human heart has the ability to take something evil and refashion it in our thinking and call it good. The fear of the Lord is the beginning of wisdom and this wisdom is understanding that God means what God says. We can not alter His standard. The Bible clearly says if we forgive each other He will forgive us, but if we will not forgive others neither will He forgive us. Many of us will never grow in Grace because we are not willing to forgive those who have wounded us. Forgiveness is not an option it is a commandment from God. Jesus Christ has provided everything we need to forgive.",
            "download": "http:\/\/sermonindex.net\/SID14662-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "2"
                }
            ]
        }
    ]
}