{
    "name": "Unsaved",
    "description": "",
    "sermons": [
        {
            "title": "(1 Peter - Part 22): Our Walk in the Presence of the Unsaved",
            "url": "http:\/\/api.sermonindex.net\/SID2075",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:12",
            "topic": "Unsaved",
            "description": "1 Peter 2:12 addresses the question A. W. Tozer declares every earnest Christian should ask: “What should be my attitude toward the gentiles?” As he sheds light on this subject, the pastor utilizes his superb observational skills to explain why the twice born love the presence of Christians, while the once born hate it. He also propounds an important point about what it takes to rightly divide the Word of Truth, and what it doesn’t: “God never tells us anything that will enable us to get along without him.” The 22nd sermon in a series of 34 concerning the first epistle of Peter, “Our Walk in the Presence of the Unsaved” was preached in Chicago, Illinois, on February 28, 1954. Its length is 35 minutes and 14 seconds.",
            "download": "http:\/\/api.sermonindex.net\/SID2075-download",
            "speaker_name": "A.W. Tozer",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Things Which Must Be Hereafter",
            "url": "http:\/\/api.sermonindex.net\/SID13012",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:9",
            "topic": "Unsaved",
            "description": "July 09, 2006 – When heaven is revealed to us we will begin to notice the tradgedy that awaits the unsaved and a cry comes into our heart for every lost soul. Jesus Christ wil write a testimony is us that wil cause men to be turned from hell to heaven.God will allow trials and seasons of loneliness to produce a depth of Christ in us. We must see the things that must be. We must see Jesus as the absolute victor over every enemy that comes against us. We must see Him as Faithful and True. He is King of King and Lord of Lords.",
            "download": "http:\/\/api.sermonindex.net\/SID13012-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        }
    ]
}