{
    "name": "Unsaved",
    "description": "",
    "audio_sermons": [
        {
            "title": "(1 Peter - Part 22): Our Walk in the Presence of the Unsaved",
            "url": "http:\/\/sermonindex.net\/SID2075",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Peter 2:12",
            "topic": "Unsaved",
            "description": "1 Peter 2:12 addresses the question A. W. Tozer declares every earnest Christian should ask: “What should be my attitude toward the gentiles?” As he sheds light on this subject, the pastor utilizes his superb observational skills to explain why the twice born love the presence of Christians, while the once born hate it. He also propounds an important point about what it takes to rightly divide the Word of Truth, and what it doesn’t: “God never tells us anything that will enable us to get along without him.” The 22nd sermon in a series of 34 concerning the first epistle of Peter, “Our Walk in the Presence of the Unsaved” was preached in Chicago, Illinois, on February 28, 1954. Its length is 35 minutes and 14 seconds.",
            "download": "http:\/\/sermonindex.net\/SID2075-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Things Which Must Be Hereafter",
            "url": "http:\/\/sermonindex.net\/SID13012",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 1:9",
            "topic": "Unsaved",
            "description": "July 09, 2006 – When heaven is revealed to us we will begin to notice the tradgedy that awaits the unsaved and a cry comes into our heart for every lost soul. Jesus Christ wil write a testimony is us that wil cause men to be turned from hell to heaven.God will allow trials and seasons of loneliness to produce a depth of Christ in us. We must see the things that must be. We must see Jesus as the absolute victor over every enemy that comes against us. We must see Him as Faithful and True. He is King of King and Lord of Lords.",
            "download": "http:\/\/sermonindex.net\/SID13012-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        }
    ]
}