{
    "name": "Venture Of Faith",
    "description": "",
    "audio_sermons": [
        {
            "title": "Breaking New Ground: Capernaum and Beyond",
            "url": "http:\/\/sermonindex.net\/SID18611",
            "size": "0",
            "format": "mp3",
            "scripture": "Luke 4:31-44",
            "topic": "Venture Of Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18611-download",
            "preacher_name": "Clayton Dougan",
            "preacher_image": "",
            "preacher_description": "Clayton Dougan ( - )\r\nListen to freely downloadable audio sermons by the speaker Clayton Dougan in mp3 format. Following 20 years of full time ministry in evangelism and Bible teaching based in the south of England Clayton and Isobel Dougan followed God's call to Canada in 1984. Evangelism International was incorporated as a charitable society in 1986 to provide a support base and accountability structure for ministry in their new base, Victoria, B.C. Clayton has travelled to about a dozen countries of the world preaching the gospel and teaching God's word.\r\nClayton's calling is, as our Vision Statement says, to preach the gospel of our Lord Jesus Christ worldwide. He still feels strongly the call of God to be a preaching evangelist. The various ministries of E.I. include: Guest preaching interdenominationally, Bible teaching in conferences and church retreats, A four hour seminar on evangelism - \"Evangelism is Not a Fatal Disease\".",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Launchout into the deep",
            "url": "http:\/\/sermonindex.net\/SID21050",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Venture Of Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21050-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        },
        {
            "title": "Moving Out Of Our Comfort Zone",
            "url": "http:\/\/sermonindex.net\/SID18435",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Venture Of Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID18435-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": []
        },
        {
            "title": "Taking risks with God",
            "url": "http:\/\/sermonindex.net\/SID3247",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Venture Of Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3247-download",
            "preacher_name": "Albu van Eeden",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}