{
    "name": "Victory Over Sin",
    "description": "",
    "sermons": [
        {
            "title": "Denying God's Power For Revival And Victory",
            "url": "http:\/\/api.sermonindex.net\/SID24808",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 7:14",
            "topic": "Victory Over Sin",
            "description": "Brother Edgar delivers a powerful message giving a personal testimony of his victory over sin. He shows how Christians can practice besetting sins and can not walk in true victory over them. He then gives powerful testimonies of sins in the past who realized Jesus Christ as their victory over sins in practical reality in their lives.",
            "download": "http:\/\/api.sermonindex.net\/SID24808-download",
            "preacher_name": "Edgar Reich",
            "preacher_image": "",
            "preacher_description": "Edgar Reich ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Edgar Reich in mp3 format. The former business man is Reverend Edgar Reich. He has been called by the Lord to teach and preach in Revival. He is a devoted Christian teacher, leading adult Bible study groups at his Church, his former business and his community. God has called him into fulltime Christian Ministry to preach and teach in Revival. \r\n\r\nHe became a Reverend under the leadership of Rev. Dr. R. L. Curry in July 2008.  The Lord has had brother Edgar start Revival Canada USA which is a ministry believing God for revival in North America. \"God has promised to bring a Nation wide Revival to the United States of America and Canada prior to the return of the Lord Jesus Christ. Fires of Revival will break out all over the United States and Canada in many cities and spread from African American Churches to White Churches.\"",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Purity - Victory Over Sin",
            "url": "http:\/\/api.sermonindex.net\/SID3642",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Victory Over Sin",
            "description": "Call to purity in the last days. Parable of the Ten Virgins discussed.",
            "download": "http:\/\/api.sermonindex.net\/SID3642-download",
            "preacher_name": "Martin Geehan",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}