{
    "name": "Walking With God",
    "description": "",
    "audio_sermons": [
        {
            "title": "(So Great A Salvation) Walking In the Light",
            "url": "http:\/\/sermonindex.net\/SID16704",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 1",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16704-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Can Two Walk Together Except They Be Agreed",
            "url": "http:\/\/sermonindex.net\/SID0767",
            "size": "13587968",
            "format": "mp3",
            "scripture": "Amos 3:3",
            "topic": "Walking With God",
            "description": "\"Is there anything in my life,\" asks Duncan Campbell, \"in disagreement with God?\"  He shares four major principles (like the sister sermon, \"Walking With God\") that we must be in agreement with God for revival.  There is a price to pay for revival--absolute yieldedness to God.  \"Are your souls thirsty that you're prepared for an absolute surrender in every department of your life?\"",
            "download": "http:\/\/sermonindex.net\/SID0767-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Our Walk With God",
            "url": "http:\/\/sermonindex.net\/SID17311",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17311-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        },
        {
            "title": "Walking In the Light",
            "url": "http:\/\/sermonindex.net\/SID21957",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21957-download",
            "preacher_name": "J. Glyn Owen",
            "preacher_image": "\/images\/j_glyn_owen.gif",
            "preacher_description": "J. Glyn Owen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker J. Glyn Owen in mp3 format. A welshman, Dr. Glyn Owen pastored many congregations with solid biblical exposition of the Holy Scriptures. He took over the pastorate from Martyn Lloyd-Jones after his retirement for 3 years. His preached in some Keswick convention meetings in England and has a heart for Biblical revival.\r\n\r\nDuring his pastorate at Knox Presbyterian Church in downtown Toronto, his preaching ministry attracted many young people who had come to Christ in the counter-culture Jesus Movement, and who were longing for solid biblical teaching.",
            "_scripture": []
        },
        {
            "title": "Walking In the Light",
            "url": "http:\/\/sermonindex.net\/SID21926",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21926-download",
            "preacher_name": "Corrie Ten Boom",
            "preacher_image": "\/images\/corrie_ten_boom.gif",
            "preacher_description": "Corrie Ten Boom (1892 - 1983)\r\nListen to freely downloadable audio sermons by the speaker Corrie Ten Boom in mp3 format. Known for the book the \"Hiding Place\" where she smuggled Jewish people during the great World Wars under the Nazi regime. She had a vibrant faith in the Lord Jesus Christ and that showed in her love for others especially the people of Israel. She ended up going to a concentration camp where she suffered greatly and survived to share the story of faith. \r\n\r\nCorrie's faith story and testimony was shared in many settings especially in the 60-70's where she toured all across North America encouraging Christians of how to endure coming persecution. Her ministry was to encourage faith and love in the hardest circumstances.",
            "_scripture": []
        },
        {
            "title": "Walking With God",
            "url": "http:\/\/sermonindex.net\/SID0557",
            "size": "11158528",
            "format": "mp3",
            "scripture": "Amos 3:1-8",
            "topic": "Walking With God",
            "description": "Campbell remarked, “The reality of the divine Presence is not the dominating feature of much that goes under the name of Christian experience.”  We should be agreed on four things in walking with God: the place we meet, the purpose, the pace and the cost, which is absolute surrender to the will of God.  The place of blessing and price of revival comes through devotion to Jesus, waiting upon God and personal sacrifice.  Is He real?",
            "download": "http:\/\/sermonindex.net\/SID0557-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Walking with God",
            "url": "http:\/\/sermonindex.net\/SID22201",
            "size": "0",
            "format": "mp3",
            "scripture": "Amos 3:3",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22201-download",
            "preacher_name": "James A. Stewart",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Amos",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Walking with God Gen.8v1-22 24.3.8 ",
            "url": "http:\/\/sermonindex.net\/SID21632",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Walking With God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21632-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": []
        }
    ]
}