{
    "name": "Watchmen",
    "description": "",
    "sermons": [
        {
            "title": "Beware of the Angry Watchmen",
            "url": "http:\/\/sermonindex.net\/SID16289",
            "size": "0",
            "format": "mp3",
            "scripture": "Song of Solomon 2:1-10, James 1:14, Song of Solomon 5:6-7",
            "topic": "Watchmen",
            "description": "October 28, 2007 - There is a false revival on the rise. It is the rise of the angry watchman who will cast stones at those who have gone astray from the Lord. This false revival consists of ministers who have led people away from the truth through legalism and a misguided prosperity gospel. They will forbid and command prodigals not to come into the presence of God until you work your way back into His favor through human effort and religion. We must not remove the veil from the bride of Christ. We have a righteousness that can not be taken away from us because Jesus is our veil.",
            "download": "http:\/\/sermonindex.net\/SID16289-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Song of Solomon",
                    "chapter": "2"
                },
                {
                    "book": "Song of Solomon",
                    "chapter": "5"
                },
                {
                    "book": "James",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Do Watchman Roar Or Meow",
            "url": "http:\/\/sermonindex.net\/SID19314",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Watchmen",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19314-download",
            "preacher_name": "Scott Hynds",
            "preacher_image": "",
            "preacher_description": "Scott Hynds (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Scott Hynds in mp3 format. Through a man of God, witnesses and the inner witness of Gods Spirit, he heard the call to the ministry of preaching the gospel around the world. As John Wesley said \"the world is my parish\" and Scott believes this vision has been passed on to him. In the providence of Almighty God Scott had the great Joy of working in the Roman Catholic community with the elderly. He made sure that these old men and women received the Gospel of the Lord Jesus Christ. He found this experience overwhelming through the love of his master and rejoices in that Christ can set you free from any bondage including deep hatred.\r\nScott recently returned home to Northern Ireland after a few years in Australia as an itinerant Evangelist and Pastor.The Lord has led Scott to plant a church in his home town of Portadown and Pillar Christian Church belongs to the Assemblies of God in Ireland.",
            "_scripture": []
        },
        {
            "title": "Watchmen, Who Are Not Watchmen",
            "url": "http:\/\/sermonindex.net\/SID12053",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Watchmen",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12053-download",
            "preacher_name": "Jacob Prasch",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}