{
    "name": "Wealth",
    "description": "",
    "sermons": [
        {
            "title": "(Romans) Wonders And Wealth",
            "url": "http:\/\/sermonindex.net\/SID6899",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 4:23-25,Romans 5:1-5",
            "topic": "Wealth",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6899-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Romans",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Fake Wealth",
            "url": "http:\/\/sermonindex.net\/SID28371",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Wealth",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28371-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": []
        },
        {
            "title": "Our World and Our Wealth",
            "url": "http:\/\/sermonindex.net\/SID25992",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Wealth",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25992-download",
            "preacher_name": "John D. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}