{
    "name": "Wedding",
    "description": "",
    "sermons": [
        {
            "title": "Let God always be your strength - wedding",
            "url": "https:\/\/sermonindex.info\/SID14315",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 17:7-8",
            "topic": "Wedding",
            "description": "A life that has God's blessing, is truly a blessed life. God is a blessed God. We read numerous times in the Bible phrases such as \"blessed be the Lord God ...\". Those whose God He is, they are blessed as well. This blessed man is contrasted with the man that is cursed, in the verses just before these. Here we see clearly the two possible ways that exist in life. Either a blessed or cursed life. There is no middle way. The man that is blessed prospers spiritually. He will bear fruit and his leaf will stay green, even in drought. We do not know our lives ahead. Difficult times might come, but if we are of this blessed kind, we will continue to bear sweet fruit and prosper. It is a great blessing if this life is your desire, and not on your lips only, but a reality in your life. The fruit of such a blessed person is love, joy, peace, longsuffering, gentleness, goodness, faith, etc.",
            "download": "https:\/\/sermonindex.info\/SID14315-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "Wedding of Zac & Annie Poonen in June 1968",
            "url": "https:\/\/sermonindex.info\/SID21661",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 30:21",
            "topic": "Wedding",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID21661-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Weddings",
            "url": "https:\/\/sermonindex.info\/SID9803",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 1:26-27",
            "topic": "Wedding",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9803-download",
            "preacher_name": "Lawrence Chambers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Genesis",
                    "chapter": "1"
                }
            ]
        }
    ]
}