{
    "name": "Weeping",
    "description": "",
    "sermons": [
        {
            "title": "Going Weeping- Coming Rejoicing",
            "url": "http:\/\/api.sermonindex.net\/SID16215",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Weeping",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID16215-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": []
        },
        {
            "title": "How Many Christians Weep On Sunday Night?",
            "url": "http:\/\/api.sermonindex.net\/SID28598",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Weeping",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID28598-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": []
        },
        {
            "title": "Start Weeping Before You Go to Church",
            "url": "http:\/\/api.sermonindex.net\/SID19056",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Weeping",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19056-download",
            "preacher_name": "Brad Allen",
            "preacher_image": "",
            "preacher_description": "Brad Allen ( - )\r\nListen to freely downloadable audio sermons by the speaker Brad Allen in mp3 format. Brad Allen served for 42 years as a Baptist Pastor. then retired from the pastorate on May 1, 1999. He had a passion in my heart to see true, authentic spiritual awakening in the local church. Since 1999, preaching Spiritual Awakening Conferences in fourteen different states, and in Scotland. The time for great spiritual awakening for America is here. God is beginning to do a \"new thing.\" The time of the \"latter rain\" is fast approaching.\r\nBrad Allen founded Spiritual Awakening Ministries. Churches in America have had enough \"revival meetings\" where no one is revived, enough evangelistic campaigns where no one is converted to Christ. It is time to call the church to account for true spiritual awakening. When Brad is invited to a church, he makes no demands on that church. He will go anywhere he is invited.",
            "_scripture": []
        },
        {
            "title": "Walking Through the Valley of Weeping",
            "url": "http:\/\/api.sermonindex.net\/SID1436",
            "size": "7305216",
            "format": "mp3",
            "scripture": "Numbers 32:20-23, John 15:12-17, 1 Corinthians 11:22-30",
            "topic": "Weeping",
            "description": "Be ready to write down the many other scriptures Pastor Conlon goes through in this message about what it really means to be part of the Body of Christ, and follow the example of Christ, denying ourselves and taking up our cross. The heart of Christ is to minister to and serve others, and he wants us to share his heart. The devil is trying to destroy the Body, going after the weak and the young. We are to watch for our brothers and sisters, and if we see them in a battle, we must be willing to fight for them. To go into the secret closet and war against this thing on their behalf, to love not just in word, but in deed. Selfishness has disastrous consequences. Take heed.",
            "download": "http:\/\/api.sermonindex.net\/SID1436-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "11"
                },
                {
                    "book": "John",
                    "chapter": "15"
                },
                {
                    "book": "Numbers",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Weeping Between Porch and the Altar",
            "url": "http:\/\/api.sermonindex.net\/SID0348",
            "size": "8720384",
            "format": "mp3",
            "scripture": "Joel 2:17",
            "topic": "Weeping",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID0348-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Joel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Why Jesus Wept",
            "url": "http:\/\/api.sermonindex.net\/SID27181",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Weeping",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID27181-download",
            "preacher_name": "G.W. North",
            "preacher_image": "",
            "preacher_description": "G.W. North (1913 - 2003)\r\nListen to freely downloadable audio sermons by the speaker G.W. North in mp3 format.  G. W. North was born in London England in 1913. As a young man he became aware that the Lord was calling him into the work of the ministry. At timely stages the Lord placed folk in his path who were able to direct him into the truth of heart purity and a more expansive understanding of the ministry of the Holy Spirit. He held pastorates in Kent and Bradford. By the late 1960s, following a significant period of ministry in Liverpool, he began a more itinerant ministry. This led him to many parts of the world, and occupied him until well into his eighties. His powerful preaching and the unique sense of the Lord's presence, which seemed to brood over his meetings, were always intensely challenging.\r\nThe true secret of his remarkable ministry stemmed from his personal communion with the Lord Jesus. To him, 'entering the holiest' was not merely a theological concept; it was a distinct spiritual reality - and the central feature of his spiritual life. It was here, in the place of worship, that his revelatory ministry found its source. He preached from understanding and conviction. He was never the echo of another, nor did he take on board the ebb and flow of various contemporary emphases. He was not a man of 'books'; he soaked himself in Scripture and allowed it to saturate his heart and mind. Truly, this is a man who has lifted up a standard for the people. Mr North went to be with the Lord on 29th April 2003, shortly after his ninetieth birthday.",
            "_scripture": []
        }
    ]
}