{
    "name": "Welfare",
    "description": "",
    "audio_sermons": [
        {
            "title": "Welfare Christianity",
            "url": "http:\/\/sermonindex.net\/SID19242",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Welfare",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19242-download",
            "preacher_name": "Derek Melton",
            "preacher_image": "",
            "preacher_description": "Derek Melton ( - )\r\nListen to freely downloadable audio sermons by the speaker Derek Melton in mp3 format. Pastor Derek and Stacey Melton planted Pryor ON Fire Teen Ministries in 1991, having a deep burden to reach the troubled youth of our generation with the saving gospel of Jesus Christ. This burden soon gave birth to an opportunity for teens to begin meeting in a small classroom south of Pryor. This was the birth of Pryor ON Fire Teen Ministries. After a short time that small classroom was packed and overflowing so the meetings were moved to two different locations, both of which were outgrown. The ministry continued to expand and grow as Thunderbird Youth Academy began to bus their cadets to the services weekly to join with local youth. In January of 1999, Pastor Derek and Stacey once again, felt the undeniable burden of the Lord to plant a church for adults who had began to attend these teen services. Grace Life Church was born out of this burden. The ministry was then moved to 110 E. Graham, where the ministry has purchased two properties giving the ministry 14,000 sq. ft., and a sanctuary that will seat over 250. The ministry resides in this location today.\r\nToday, Pastor Derek and Stacey continue to experience a deep burden for at-risk youth struggling in our generation, ministering Jesus Christ and His love to hurting teens several times per week. Grace Life Church is also a godly presence in our city, as many families have found their place in this Christ exalting body of believers. These members are maturing in Christ from glory to glory.",
            "_scripture": []
        }
    ]
}