{
    "name": "Work",
    "description": "",
    "sermons": [
        {
            "title": "Gods Purpose for Work",
            "url": "http:\/\/sermonindex.net\/SID28723",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Work",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28723-download",
            "preacher_name": "Keith Hartsell",
            "preacher_image": "",
            "preacher_description": "Keith Hartsell\r\nListen to freely downloadable audio sermons by the speaker Keith Hartsell in mp3 format. God has called Fr. Keith to be the senior pastor in the parish and the pastor of catechists and leaders, building the church and multiplying churches to bring hope and healing into every life at Redeemer Anglican Church.\r\n\r\nOur service at Redeemer Anglican is traditional Anglican worship that unites us with our fellow believers around the world. Liturgical elements include singing, reading of scripture, a sermon, prayer, communal time of confession, giving, and the Eucharist.",
            "_scripture": []
        },
        {
            "title": "Our Work For God",
            "url": "http:\/\/sermonindex.net\/SID17309",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Work",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17309-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": []
        }
    ]
}