{
    "name": "Work Of God",
    "description": "",
    "sermons": [
        {
            "title": "God's Intention For This Midnight Hour",
            "url": "http:\/\/sermonindex.net\/SID15496",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 3:9",
            "topic": "Work Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15496-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "God's Work In The Life Of His Servants",
            "url": "http:\/\/sermonindex.net\/SID27491",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Work Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27491-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": []
        },
        {
            "title": "The Surprising Ways of God",
            "url": "http:\/\/sermonindex.net\/SID28390",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Work Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID28390-download",
            "preacher_name": "Otto Koning",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        },
        {
            "title": "The Two Great Works of God",
            "url": "http:\/\/sermonindex.net\/SID24707",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Work Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24707-download",
            "preacher_name": "Roy Daniel",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": []
        }
    ]
}