{
    "name": "Wrath Of God",
    "description": "",
    "sermons": [
        {
            "title": "(Revelation) The Wrath Of God",
            "url": "http:\/\/sermonindex.net\/SID7070",
            "size": "0",
            "format": "mp3",
            "scripture": "Revelation 16",
            "topic": "Wrath Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7070-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "God's Wrath Satisfied",
            "url": "http:\/\/sermonindex.net\/SID15912",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 27:45-56",
            "topic": "Wrath Of God",
            "description": "The topic of this sermon deals with God's wrath being satisfied on the Cross. People do not take their sins seriously. Because many do not take sin seriously, they do not take the cross seriously and therefore the wrath of God seriously. This is a very practical, clear, strong exhortation and teaching to understand the wrath of God in Scriptures.",
            "download": "http:\/\/sermonindex.net\/SID15912-download",
            "preacher_name": "David Downs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "Kiss The Son",
            "url": "http:\/\/sermonindex.net\/SID18526",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 2:12, 1 Kings 19:18, Job 31:24",
            "topic": "Wrath Of God",
            "description": "Throughout the Scriptures the Kiss is found in different relationships all of which are to be applied to Christ and none of which stand alone. The Kiss of Worship (I Kings 19:18; Job 31:24-27). The Kiss of Allegiance (I Samuel 10:1; Hosea 13:2). The Kiss of Love (Song of Solomon 1:2). The kiss of love without shame (Song of Solomon 8:1).",
            "download": "http:\/\/sermonindex.net\/SID18526-download",
            "preacher_name": "Aaron Dunlop",
            "preacher_image": "",
            "preacher_description": "Aaron Dunlop ( - )\r\nListen to freely downloadable audio sermons by the speaker Aaron Dunlop in mp3 format. Mr. Dunlop who is originally from Northern Ireland, graduated from the Geneva Reformed Seminary, SC. and is currently pioneering a Free Presbyterian Church in Victoria, British Columbia.\r\nReformed in Doctrine, believing in the divine authority and verbal inspiration of the Bible, and the great fundamental doctrines of grace it contains. The Scriptures alone are the supreme authority in matters of faith and practice. Separatist in Practice, believing and practicing the doctrine of Biblical separatism. In accordance with this, the Free Presbyterian Church has no association with the modern Ecumenical or Charismatic movements, nor will it fellowship with any church which has departed from the fundamental doctrines of the Word of God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "2"
                },
                {
                    "book": "1 Kings",
                    "chapter": "19"
                },
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "The Outpoured Wrath Of A Long-Provoked God",
            "url": "http:\/\/sermonindex.net\/SID25002",
            "size": "0",
            "format": "mp3",
            "scripture": "Zephaniah 1:14-18",
            "topic": "Wrath Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID25002-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Zephaniah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Wrath Of God",
            "url": "http:\/\/sermonindex.net\/SID22251",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1:18",
            "topic": "Wrath Of God",
            "description": "This message was preached on August 30th, 2009, at Valley Church in Smithfield, Utah. \"For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men.\" (Romans 1:18) Foundational to the gospel as well as to the whole Bible, the reality of the wrath of God has almost become a thing of embarrassment for many Christians, but if we do not know God as the God revealed in Scripture - a God of wrath - then we really do not know God at all. God's wrath is as much a divine perfection as His love, and therefore it is something marvelous for us to rejoice in.",
            "download": "http:\/\/sermonindex.net\/SID22251-download",
            "preacher_name": "Eli Brayley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Wrath Of God Lessons From Scripture",
            "url": "http:\/\/sermonindex.net\/SID12778",
            "size": "0",
            "format": "mp3",
            "scripture": "",
            "topic": "Wrath Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12778-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": []
        }
    ]
}