[
    {
        "title": "(1 Kings) A Great Victory, and the Aftermath of It",
        "url": "http:\/\/api.sermonindex.net\/SID10726",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 18:20-19:21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10726-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(1 Kings) Building Temples",
        "url": "http:\/\/api.sermonindex.net\/SID10719",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 5-7",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10719-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "(1 Kings) Dedicating the Temple",
        "url": "http:\/\/api.sermonindex.net\/SID10720",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 8",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10720-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "(1 Kings) Elijah's Early Ministry",
        "url": "http:\/\/api.sermonindex.net\/SID10725",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 17:1-18:19",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10725-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "17"
            }
        ]
    },
    {
        "title": "(1 Kings) Signs of Danger",
        "url": "http:\/\/api.sermonindex.net\/SID10721",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 9-10",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10721-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(1 Kings) Solomon Receives the Throne",
        "url": "http:\/\/api.sermonindex.net\/SID10717",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 1-2",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10717-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(1 Kings) The End of King Ahab",
        "url": "http:\/\/api.sermonindex.net\/SID10728",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 21-22",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10728-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "21"
            }
        ]
    },
    {
        "title": "(1 Kings) The Fall of Solomon and the United Monarchy",
        "url": "http:\/\/api.sermonindex.net\/SID10722",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 11-12",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10722-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "(1 Kings) The Wisdom of Solomon",
        "url": "http:\/\/api.sermonindex.net\/SID10718",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 3-4",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10718-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "(1 Kings) The Work of Unknown Prophets",
        "url": "http:\/\/api.sermonindex.net\/SID10727",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 20",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10727-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "20"
            }
        ]
    },
    {
        "title": "(1 Kings) Wasted Potential",
        "url": "http:\/\/api.sermonindex.net\/SID10723",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 13-14",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10723-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "(1 Kings) Why Dynasties Come and Go",
        "url": "http:\/\/api.sermonindex.net\/SID10724",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Kings 15-16",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10724-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Kings",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "(1 Samuel) A Foolish Oath and Consequences",
        "url": "http:\/\/api.sermonindex.net\/SID10637",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 14:24-52",
        "topic": "",
        "description": "It was critical that Israel pursued thye retreating Philistines after what the Lord had done but king Saul placed the people under a forced forced fast in order that he would appear spiritual before them, thus he did it for his own glory and not the glory of God.  This day the Israelite army needed their physical strength to totally wipe out the oppresive Philistines but they had none due to Sauls fast.  Jonathan however had not taken the oath to fast because he had been off fighting the Philistines with his armour bearer, so he came back and ate some honey, which was when he was challenged by one of the people, and when he heard this he said how wrong his father had been and told of how if it wasn't for his fathers fast they would have defeated the Philistines in a mighty way.  Saul had sinned greatly against the Lord in this and thus when he went to enquire of the Lord what he should do the Lord would not answer him.",
        "download": "http:\/\/api.sermonindex.net\/SID10637-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "14"
            }
        ]
    },
    {
        "title": "(1 Samuel) A Good Start for Saul",
        "url": "http:\/\/api.sermonindex.net\/SID10631",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 10",
        "topic": "",
        "description": "Here is the time in history of the nation of Israel when they are about to receive their first king.  Samuel the prophet takes Saul, the future king, and anoints him king privately and in a way that shows how the Lord wants to anoint every believer with the Holy Ghost, how He should fill our lives.  The Lord then confirms that Saul is to be made king by giving Saul 3 very specific signs.  The last sign was that thje Holy Ghost would come upon Saul and change him into a new man as spiritual confirmation of the physical anointing that Saul had received.  So Saul was turned into another man, Samuel gathered all the people of Israel together and revealed Saul as their future king and the people rejoiced because he 'looked the part' but Samuel knew that Saul had very little spiritual subsatnce.",
        "download": "http:\/\/api.sermonindex.net\/SID10631-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "(1 Samuel) A Prophet Speaks to the Nation",
        "url": "http:\/\/api.sermonindex.net\/SID10633",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 12:1-12",
        "topic": "",
        "description": "Samuel, the man of God, comes before the people to publically pass the torch on to Saul as the new ruler of the people of Israel.  He stands before the people and asks them to declare if he has ever wronged them or defrauded them or let them down in any way, which is a challenging thing for a leader to do before their people.  The people respond and say that Samuel has not wronged them at any time.  By this public challenge Samuel confirmed that he was passing on a good legacy to Saul and that if the nation went downhill from their it was not Samuels fault.  He declares to them all the righteous acts that the Lord has done to them how He brought them out of Egypt, raised up judges to rule over them and taught them discipline through affliction.  He recalls the events that effected the nation of Israel right up to the battle with Nahash in the previous chapter and shows the people the big picture of how the Lord has been faithful to them.",
        "download": "http:\/\/api.sermonindex.net\/SID10633-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "(1 Samuel) Attacked, but Blessed",
        "url": "http:\/\/api.sermonindex.net\/SID10646",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 18:17-30",
        "topic": "",
        "description": "Saul in trying to bring about Davids death offers his daughters hand in mnarriage knowing that David will not be able to pay the dowery due to coming from a rural family.  David however does not approach Saul to discuss a dowery and so Saul offers his daughter to another man in order that he might make David jelous.  But David keeps a pure heart before the Lord and actually wins a victory by being submissive and humble before the Lord.  David also did not suspect that Saul had ulterior motives in offering his daughter to David. Then Sauls youngest daughter Michal fell in love with David and this pleased Saul as he could again manipulate this situation for David's hurt, so Saul proposes a price for his daughter, 100 Philistine foreskins, knowing that it was highly likely that David would be killed in meeting the price, however the Lord was with David and delivered him 200 Philistine foreskins.  This extra effort is straight out of the teaching of the Lord Jesus who commanded to 'go the second mile' and thus show a humility and a servants heart, which David surely had.",
        "download": "http:\/\/api.sermonindex.net\/SID10646-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "18"
            }
        ]
    },
    {
        "title": "(1 Samuel) Blessed Sons and Wicked Sons",
        "url": "http:\/\/api.sermonindex.net\/SID10621",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 2:1-21",
        "topic": "",
        "description": "Hannah gave Samuel back to the Lord with a song of joy in her heart, she was full of joy even though she had to give up her 3 year old son, she praised God but also explains how we should humble ourselves before God, or He will humble us, the Lord resists the proud but gives grace to the humble and lifts them up and out of their dire situations just as he did with Hannah.  She exalts the King, the Anointed One, the Messiah and was the first person to proclaim the God would be the Messiah a theme that was later shwon through all the prophets but Hannah saw it first.  There isw a shift in this passage though in the form of the corrupt sons of the high priest Eli, who didn't know the Lord and by their actions were causing the people of God to hate offering to God as the people knew that the priesthood was so corrupt.  Samuel however served the Lord as a small child and was dressed in priests clothes that his mother would make for him and bring to Shiloh every year, and the Lord further blessed her with 3 more sons and 2 daughters.",
        "download": "http:\/\/api.sermonindex.net\/SID10621-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "(1 Samuel) Blessings to a Bold Faith",
        "url": "http:\/\/api.sermonindex.net\/SID10636",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 13:15-14:23",
        "topic": "",
        "description": "Israel were vastly outnumber and had no adequate militray equipment to fight the Philistine army that amassed against them.  However this did not concern Jonathan and his armour bearer one bit, they saw a big enemy but a bigger God and with one of the Bibles great faith exercises went up against the local philistine garrison believing that God could deliver them into their hand.  Jonathan as a man of God knew that the Lord could save wether by many or by few, He was not hindered in the least by numbers.  Jonathans armour bearer was loyal to his master and went all the way with him believing the Lord the same way.  Jonathan just before going up to the philistines asked the Lord for one last sign that this was of Him, and he received confirmation and declared victory before even meeting his foe.  This is a mighty lesson for us to learn that truelly if God is for us then who dare be against us.  The Lord delivered just 20 men into their hand but the whole became afraid and started turning on each other.",
        "download": "http:\/\/api.sermonindex.net\/SID10636-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(1 Samuel) Blessings to the Barren",
        "url": "http:\/\/api.sermonindex.net\/SID10620",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 1",
        "topic": "",
        "description": "The Bible is a real book with stories about real people and this is seen here in 1 Samuel in the life of Hannah, her husband Elkanah and Peninnah his second wife.  Hannah is greived because she is barren, a situation which was possibly the worst place a woman could be in the Old Testament.  Every year Elkanah and his two wives would go up to Shiloh to the feast and Peninnah would mock Hannah becasue she had not children and Peninnah did.  This caused incredible sorrow in the heart of Hannah, but she did the right thing and poured out her grief before the Lord.  She made a vow to the Lord that if He would give her a son she would dedicate him to the Lord in a deeper and stronger way be seperating him as a Nazerite to the Lord, the remarkable moment came when after she had grieved before the Lord her sorrow left her and her faith in God was restored, did she concieve that moment? no, but God's word was just as sure and she praised Him for it. The Lord opened her womb and she gave birth to one of the most remarkable men in the Bible, Samuel.",
        "download": "http:\/\/api.sermonindex.net\/SID10620-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(1 Samuel) Bottomed Out and Starting to Rise",
        "url": "http:\/\/api.sermonindex.net\/SID10661",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 29:1-30:6",
        "topic": "",
        "description": "David and his men are preparing to fight a war, against Israel and with the Philistines, he was in a place where he never thought he'd be fighting against the people of God with the enemies of God, but the Philistine rulers were suspicious of him, they hadn't forgotten who David was even if he had, so they would not allow him to fight with them and wanted him to leave.  David discouraged by this went, with his men, back to their home in Ziklag, but when thy get in sight of the city they see smoke coming up out of it and not smoke from cooking, so they rush home to find the city totally empty, all their families had been taken by the Amalekites, then men began to dispair and turned on David desiring that they might stone him to death.  David also deeply concerned did the only thing he could do in the situation, strengthened himself in the Lord his God.",
        "download": "http:\/\/api.sermonindex.net\/SID10661-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "29"
            }
        ]
    },
    {
        "title": "(1 Samuel) David on the Decline",
        "url": "http:\/\/api.sermonindex.net\/SID10650",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 21 1-9, Leviticus 24:5-9",
        "topic": "",
        "description": "David is on the run from king Saul, he is afraid, hasnt eaten or slept properly for days, he is confused and had just had to bid farewell to his closest friend Jonathan, but it was here that the Lord would train David to be a king.  David goes to the tabernacle of God at Nob, to Ahimelech the priest, this was th right thing to for David to do to go to the house of the Lord.  But when he is asked what is going on by Ahimelech David lies to him several times in order to protect himself and maybe also Ahimelech from Saul.  David asks the priest for food, and all that is available is the shew bread which was used in the tabernacle to symbolize how the Lord desires to have fellowship with us.  So Ahimelech gives David the shewbread even though it was usually eaten by the priests, this shows that serving a human need is of greater importance than observing priestly traditions.  Does the Edomite, a servant of Saul was there and witnessed what was happening.  Finally David asks for a weapon from Ahimelech and he gioves him Goliaths sword, which David takes, the Lord was probably reminding David that the last time he held that sword he won a great victory as he was in the will of God and didn't need to resort to the flesh to deliver him.",
        "download": "http:\/\/api.sermonindex.net\/SID10650-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "21"
            },
            {
                "book": "Leviticus",
                "chapter": "24"
            }
        ]
    },
    {
        "title": "(1 Samuel) Discouraged and Running Away",
        "url": "http:\/\/api.sermonindex.net\/SID10659",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 27",
        "topic": "",
        "description": "David was disparing that one day Saul would kill him and so made up his mind to escape, leave the people of God and go and live amongst the ungodly Philistines.  t this point David was so low that he had forgotten the promises of the Lord towards him how he would one day be king and that Saul would not take his life.  However David did not go alone to Gath in Philistia but took all his men and their families with him,  so much depends upon godly leaders walking with the Lord that when they depart from the way many folow them.  David goes to the king of Gath and asks for a city to dwell in and the king gives him Ziklag, for this David declared himself to be a servant of the king, what a sad time this must have been, that the champion of the armies of Israel was now the servant of the king of the philistines.  During this time David leared to play the instrument of Gath as ssen in the titels of Psalm 8, 84 and 87 but he didn't write any Psalms to the Lord during this time, sadly he became a marauder and attacked cities and robbed their dead.",
        "download": "http:\/\/api.sermonindex.net\/SID10659-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "27"
            }
        ]
    },
    {
        "title": "(1 Samuel) God Blesses When We Get Right",
        "url": "http:\/\/api.sermonindex.net\/SID10628",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 7",
        "topic": "",
        "description": "The Ark is brought to the men of Kirjathjearim who consecrate a priest to look after it and the Ark stays there for 20 years.  After this time the people begin to lament, yes they have the Ark back but the prescence of the Lord is still absent and they know this so they began at last to seek the God of the Ark.  The Lord sends Samuel to them who speaks to them what is in the heart of God, they should turn away from their idolatry and worship of Baal and Ashtaroth, who are the modern gods of money and sex.  The people heeded the word of the Lord and put away the idolatry and repented and lamented over their sin before to Lord.  The Philistines saw this as a sign of weakness and decided they would finally defeat the Israelites.  But the Lord was on their side now and the Philistines couldn't even get to the battle before the Lord struck them with fear and the Israelites won without even going into battle.",
        "download": "http:\/\/api.sermonindex.net\/SID10628-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(1 Samuel) God Guides the Unknowing",
        "url": "http:\/\/api.sermonindex.net\/SID10630",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 9",
        "topic": "",
        "description": "Here we are introduced to one of the main characters in the book, a tall dark and hansome man from a wealthy family, by the name of Saul.  He was a man with all the right looks and yet had very little susbstance.  Saul here is helping out his father who has lost his donkeys, so Saul and his servant head out to find the donkeys, with no knowledge of what is about to befall them.  They wander from town to town asking and looking after the donkeys until they get to a certain town and decide to ask the prophet who is their if he knows where the donkeys are.  This shows Saul had little spiritual substance as he doesn't even recongise Samuel the prophet, and has no intention of asking him about his own spiritual condition, but is only interested inthe location of the lost donkeys.  The first thing Samuel tells Saul is that he will reveal to Saul what God has planned for his life, and then straight after tells him where the lost donkeys are,without Saul even asking.  So Samuel invites Saul to a feast and puts him in the place of most prominence and tells him that he is the future king of Israel!!",
        "download": "http:\/\/api.sermonindex.net\/SID10630-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(1 Samuel) God Helps the Undeserving",
        "url": "http:\/\/api.sermonindex.net\/SID10651",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 21:10 - 22:1, Psalm 56, Psalm 34, Psalm 142",
        "topic": "",
        "description": "David, still on the run from Saul, heads to the Philistines to take refuge, and ends up in Gath the hometown of Goliath!  This was a very strange thing for David to do as he has also killed thousands of Philistines, as well as Goliath.  So David is captured by them and imprisoned.  David knowing he has done wrong does the right thing and cries out to God, this is when he wrote Psalm 56 and it can be seen in this Psalm how David's heart is turned back to the Lord as he cries out for mercy.  He is then brought before Achish the king, David pretends to be mad which must have taken great humility to act that way before his enemies so Achish releases David and on his way from Gath David praises the Lord mightily, Psalm 34.  The Lord showed His love to David even though David did not deserve it, which shows the great love and mercy of God.  David then heads for the cave of Adullam from which you can see the valley where David slew Goliath and David lamented and wrote Palm 142.",
        "download": "http:\/\/api.sermonindex.net\/SID10651-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "21"
            },
            {
                "book": "Psalms",
                "chapter": "56"
            },
            {
                "book": "Psalms",
                "chapter": "34"
            },
            {
                "book": "Psalms",
                "chapter": "142"
            }
        ]
    },
    {
        "title": "(1 Samuel) God’s Idea of a Team",
        "url": "http:\/\/api.sermonindex.net\/SID10652",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 22  Psalm 52, Ruth 4:17",
        "topic": "",
        "description": "David is know in hiding in the cave of Adullam, he's tired and afraid and doesn't know what to do, but he cries out to the Lord and the Lord meets his every need.  Th ifrst thing the Lord did was to give David Himkself, and David was filled with a great sense of the Lord's power and glory.  The second thing the Lord gave to David was the support of his family, who in times past had been harsh towards David.  Then the Lord brough the needy and discouraged to David, and he became their leader, he took care of his parents by taking them to the Moabites, who were David's ancestors.  King saul in the meentime is plotting against David and accusing all his military commanders of being against him, one steps forward, Doeg the Edomite and informs Saul that he saw David being helped by Ahimelech the priest, Sauls is furiuos and goes to Ahuimelech and accueses him of aiding the enemies of the king, Ahimelech had no idea that David was on the run from Saul due to Davids lies, but Saul didn't care and commanded all the priests and their families to be slaughtered, Sauls servants wouldn't do it but Doeg would and massacred a great number of people, when David heard of this he mourned and wrote Psalm 52.",
        "download": "http:\/\/api.sermonindex.net\/SID10652-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "22"
            },
            {
                "book": "Ruth",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(1 Samuel) God’s Kind of King",
        "url": "http:\/\/api.sermonindex.net\/SID10640",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 16:1-13",
        "topic": "",
        "description": "Samuel is mournig the failure of Saul as the first king of Israel, but the Lord is looking to the future and what He is going to do, so He tells Samuel to get up, fill his horn with oil and head out to anoint the next king of Israel, a king whom the Lord had chosen, not the people, a boy from among the sons of Jesse of Bethlehem, David.  So Samuel arrives in Bethlehem to meet the new king, Jesse brings all of his sons before Samuel but Samuel says that the Lord has chosen none of them, then finally Jesse brings David, the youngest, from looking after the sheep, and Samuel is surprised for David is just a boy probably between 10 and 15, but the Lord knows Davids heart.  Dabid had spent his life thus far being obedient out in the fields looking after the sheep and drawing close to God, he had also been in a few fights with wild animals from which the Lord had delivered him, thus David trusted in the Lord.  Samuel anoints David but oil but the Lord anointed him then with the Holy Spirit.",
        "download": "http:\/\/api.sermonindex.net\/SID10640-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "(1 Samuel) God’s Worship Leader",
        "url": "http:\/\/api.sermonindex.net\/SID10641",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 16:14-23",
        "topic": "",
        "description": "The Spirit of the Lord comes upon David and leaves Saul, and an evil spirit comes and distresses him.  This was due to Saul's resistence to the the Holy Spirit, he had spent so long rebelling against the Spirit of the Lord that he no longer wanted to have the Spirit so He left him, and the vacuum was filled by an evil spirit which Saul wanted as was shown by his actions.  The servants of Saul knew what had happened to him and asked if they should bring someone to worship the Lord before the king and lift his mood.  So they went out and found David who was a skillful player of the harp and was already described as a man of war both in the sphere of physical and spiritual warfare.  Pastor Guzik tells of how worship is indeed a battleground, and espescially music as it is so powerful in speaking to our inner man either for good or for evil.",
        "download": "http:\/\/api.sermonindex.net\/SID10641-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "(1 Samuel) Great Things God Has Done for Us",
        "url": "http:\/\/api.sermonindex.net\/SID10634",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 12:13-25",
        "topic": "",
        "description": "Samuel addresses the people and shows them how that wanting a king beofre the Lord's time was a sin and a wrond thing to do, but he reassures them that the Lord is rich in mercy and that if they will turn to the Lord and worship and serve Him from that day on that the Lord will bless them.  This is like us in our christian walk how it does not matter what wrong we have done or sin we have committed that if we will turn to the Lord and worship Him now He will send blessing.  The people of Israel had a head knwoledge of God but no heart knwoledge they knew all about the Lord but did not know Him.  Despite the behavior of the people in the past Samuel promises to continue to interceed for the people and instruct them in the way of the Lord and encourages them to serve Him because of all the good He has done to them.",
        "download": "http:\/\/api.sermonindex.net\/SID10634-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "(1 Samuel) Has the Glory Departed?",
        "url": "http:\/\/api.sermonindex.net\/SID10625",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 4:12-5:12",
        "topic": "",
        "description": "This was a time of national calamity for the people of Israel, the Ark of God was taken, Israel had been brutally defeated  and the two sons of the High Priest had been slain.  The wife of Phinehas one of the dead priests was so destressed by the news that she went into labour and gave birth to a son and yet this could not lift her spirits and shortly after naming him Ichabod (the glory has deoarted) she died, having given up all hope.  The glory of God had deprated but not when they lost the battle but when they had put their trust in the Ark of God and not the God of the Ark.  But The Lord was not worried that the Ark had been taken and this is shown in the mighty events that followed...  The Ark was brought into the temple of the Philistine god Dagon, but after just one day the statue of Dagon was found prostrate before the Ark of the Lord as if it were worshipping God.  Depsite this mighty sign the Philistines would not turn to God so he afflicted them with tumours, probably hemeroids, as the Lord wanted them to repent and turn to him, but they didn't and they tried to push God away by moving the Ark from them but the Lord would not leave because He is great and mercy and persistence.",
        "download": "http:\/\/api.sermonindex.net\/SID10625-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(1 Samuel) How God Protects",
        "url": "http:\/\/api.sermonindex.net\/SID10648",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 19:11-24",
        "topic": "",
        "description": "Michal, David's wif ans Sauls dughter, warns David that Saul has sent men to their house to kill him, and that if he doesn't escape he will die.  The men from Saul come to the house and demand of Michal that they bring out David, but Michal tells them that David is sick and in bed.  Just before this David had escaped from his house and Michal had put the household idol in his bed to make it look like David was there.  So the men from Saul look in and think David is sick so they return to Saul, to tell him David is sick, Saul deosn't care and wants him killed anyway.  So the servants head back and discover David has escaped.  David in the meentime has gone to see Samuel, who is overseeing a 'prayer meeting'  David get into the prescence of the Lord and the servants of Saul turn up to kill him, but they get involved in the prayer meeting too and head back to Saul empty handed, so Saul send more men to get David but the same thing happens twice.  So Saul goes himself to kill David and is also overcome by the Holy Spirit, as the Lord shows Saul that He is in control of the whole situation.",
        "download": "http:\/\/api.sermonindex.net\/SID10648-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "(1 Samuel) How NOT to Respond to an Insult",
        "url": "http:\/\/api.sermonindex.net\/SID10656",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 25:1-22",
        "topic": "",
        "description": "Samuel the prophet and last judge of Israel dies at the beginning of this chapter and all Israel laments his passing, it is notable that he probably recveived more appreciation when he died than when he was alive.\r\nThere was a man of Carmel whose name was Nabal (which in the hebrew means fool) and he was a rich and very successful sheep farmer, and he had a wifie, Abigail, who was very beautiful and wise and completely different to Nabal.  David and his men had been protecting Nabal and his possessions for some time from bands of marauders and theives, and so when the sheep shearing season started, which was the best and most prosperous time of the year, David requests a gift from Nabal for services rendered, Nabal not only says no but 'no' in the most insulting way possible, and when David hears of this he is enraged and vows to kill Nabal and al his household.  Now when Abigail hears what Nabal has done she collects as much food as she can and heads out to meet David knowing he is intent on massacre.",
        "download": "http:\/\/api.sermonindex.net\/SID10656-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "25"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Be Free From Bitterness",
        "url": "http:\/\/api.sermonindex.net\/SID10663",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 31",
        "topic": "",
        "description": "The final day of king Sauls life finally arrives, the day the Lord warned him about probably 15-20 years before,  Saul goes into battle with the armies of Israel against the Philistines.  The battle goes very badly for Saul and he finds himself in the heat of the fight due to his army retreating, Saul sons including Jonathan Davids close beloved friend are killed and Saul is pierced with arrows.  Knowing that he is going to die he asks his armour bearer to kill him so that he will not be captured and ridiculed by the philistines, but his amrour bearer doesn't and so Saul falls upon his own sword and takes his own life, even here on the last day of his life knowing how soon he will stand before almighty God Saul doesn't repent.  The people of Israel in the surrounding area hear of what has happened and abandon their homes and flee.  The Philistines take Sauls body and cut off his head and use it as a grisly trophy to show their victory.  But the men of Jabesh Gilead go to the city where the philistines have chained up the bodies of Saul and his sons and take them back and give them proper burial and mourne for the loss.  David mourns when he hears that his king has been killed he shows no bitterness or rejoicing but calls Saul the beauty of Israel.",
        "download": "http:\/\/api.sermonindex.net\/SID10663-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "31"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Be Rejected by God",
        "url": "http:\/\/api.sermonindex.net\/SID10639",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 15:17-35",
        "topic": "",
        "description": "Samuel rebukes Saul for his and his pride, but Saul argues that he has indeed followed the Word of God, but this is because he was self deceived and goes even furhter as to blame the people for bringing back the animals for sacrifice.  If these animals would have been sacrificed to the Lord as Saul desired it would have been a sacrifice of disobedience and the Lord would not have accepted it anyway, as to obey is better than sacrifice.  The Lord could see Saul's heart in all this and saw how rebellious and stubborn he was for this the Lord had to reject Saul from being king over Israel, but even through all this Saul did not repent but begged for Samuel to honor him before the people, Samuel turned and worshipped the Lord as he knew that the Lord would deal with Saul and he no longer had anything to say to Saul.  Agag king of the Amalekites was then brought before Samuel, but Samuel hacked him to pieces before the Lord and was unmerciful towards him as the Lord had commanded.",
        "download": "http:\/\/api.sermonindex.net\/SID10639-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Get an Answer from God",
        "url": "http:\/\/api.sermonindex.net\/SID10653",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 23:1-13",
        "topic": "",
        "description": "David is told to go to the city of Keilah, because the Philistines are attacking it.  So David enquires of the Lord what he souls do and the Lord tells him to go, David's men however dont want to go as they are afraid, so David enquires of the Lord a second time, and the Lord tells him to go to Keilah and he will deliver the Philistines into his hand.  Saul hears that David is on his way to Keilah and seizes the chance to capture David, so he assembles the armies of Israel to attack David and his band of men.  David then enquires of the Lord again as to whether the people of Keilah will deliver him into the hand of Saul and the Lord tells David that they will, this is probably due to the fact that previously Saul had had a whole town wiped out for not delivering David to him.  David therefore humbles himself and retreats, even though he coudl have probably fought Saul and maybe killed him, again David left him to the Lord, and diverted needless slaughter from another place.",
        "download": "http:\/\/api.sermonindex.net\/SID10653-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "23"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Kill a Giant",
        "url": "http:\/\/api.sermonindex.net\/SID10643",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 17:31-58",
        "topic": "",
        "description": "David is brought before Saul because of his willingness to challenge Goliath, but Saul see the battle from an earthly perspective, and purely in the flesh, he thought there was no way that David could win, but David knew that the Lord was with him and that there was no way he could lose!  So David told Saul how the Lord had delivered a lion and a bear into his hand and that he had killed them when they came to attack the sheep he looked after, this was the Lord training David to fight Goliath.  Saul tried to put his fleshly armour on David but it didn't and David renounced it for his trust was in the armour of God.  So David took 5 stones from the brook and drew near to Goliath to challenge him, Goliath mocked him but David filled with the Spirit charged at Goliath hurled a stone at him and killed him in one hit, then David took Goliaths sword and cut off his head.  The Philistines were shocked and fled but the army of Israel chased after them led by David.",
        "download": "http:\/\/api.sermonindex.net\/SID10643-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "17"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Not Fight Back",
        "url": "http:\/\/api.sermonindex.net\/SID10645",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 18:10-16",
        "topic": "",
        "description": "Saul returns to his palace and the evil spirit comes upon him, so David is sent for to play some soothing music to the king.  David arrives and plays and worships the Lord before Saul, but this time Saul is not pacified and responds with violence and attempts to kill David by throwing a spear at him.  Somehow either by Saul's bad aim or by David's quickness the spear misses him, and David esacpes, this amazingly he does twice, how many of us would have gone back into that environment knowing that the second time it could mean our very lives.  David though even though he was a mighty warrior who could have retaliated and killed Saul, did not fight back but instead escaped knowing that the Lord would avenge him of Saul.  So Saul then made David leader of an elite group of men thinking that David would be killed on the battle field by the Philistines, but David remained wise before the Lord and He kept him, and David, to Sauls great dismay, grew even more popular with the people as the Lord blessed him.",
        "download": "http:\/\/api.sermonindex.net\/SID10645-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "18"
            }
        ]
    },
    {
        "title": "(1 Samuel) How to Overcome Evil with Good",
        "url": "http:\/\/api.sermonindex.net\/SID10655",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 24",
        "topic": "",
        "description": "Saul, after his battle with Philistines, resumes his pursuit of David.  So David and his men go to hide in the wilderness on Engedi, but the sscouts see Saul coming towards them with 3000 men.  So David and his band hide deep in the back of one of the caves, Saul and his men are about to pass by the cave when they stop and Saul comes into the cave alone.  David's men compel him to kill Saul, so David quietly sneeks up to where Saul is and cuts of a piece of his robe and returns to his men.  Saul leaves the cave and Davids men cannot believe that he didn't kill Saul.  But David because of his tender heart before the Lord goes even further and, walks out of the cave and crys to Saul in great humility.  He declares that he does not want to kill Saul as some people think and as proof shows Saul the piece of the robe he cut off, Saul seeing this repents for wanting to kill David and goes home, but David returns to his stronghold, in case Saul changes his mind again.",
        "download": "http:\/\/api.sermonindex.net\/SID10655-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "24"
            }
        ]
    },
    {
        "title": "(1 Samuel) Little Things Mean a Lot",
        "url": "http:\/\/api.sermonindex.net\/SID10649",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 20:1-42",
        "topic": "",
        "description": "David goes to Jonathan and asks advise on why Saul, Jonathans father, wants to kill him.  Jonathan desiring to help David offers him a deal that if Jonathan goes and asks Saul why he wants to kill David and discovers what his intentions are for David then David, when he becomes king of Israel, will not wipe out all the remaining memebers of Jonathans family.  David agrees, so Jonathan heads of to Sauls monthly metting for his leaders and David stays in hiding, as David is abscent the first day Saul presumes he is unclean and thus cannot attend the feast, but Jonathan informs Saul that David has gone to a feast at his families house.  Then when David doesn't turn up the second day Saul is enraged and demands to know where David is that he might kill him.  Jonathan at that point knows full well the intentions of Sauls heart towards David and so goes to warn David in the way they have devised.  Jonathan heads out into the field with a boy to take some target practice, Jonathan told David that when he fires the arrows that if he instructs the boy that they are near then David is safe but if he instructs the boy that they are far then David must knowing that the Lord has sent him away.  So jonathan fires the arrow a great distance and yells to the boy that he should go further and be quick, thus informing David to flee for his life.",
        "download": "http:\/\/api.sermonindex.net\/SID10649-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "20"
            }
        ]
    },
    {
        "title": "(1 Samuel) Measure for Measure",
        "url": "http:\/\/api.sermonindex.net\/SID10658",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 26",
        "topic": "",
        "description": "Saul again is in pursuit of David even though the last time they met he swore to cease from his quest for Davids life.  The army  come to halt to rest for the night and David sends out scouts to find where they are, when he knows David personally goes into the very midst of the sleeping camp right to where Saul is asleep next to Abner his personal bodyguard and captain of Israels armies.  Abishai who is with David in the midst of the camp requests that David give him permission to plunge Saul's own spear, which is stuck in the ground near his head, through his heart, Abishai says he only needs one chance and he will kill Saul there and then.  But David still shows great mercy to Saul, in that he wont allow Abishai to do it, so they take the spar and the jug that is near Saul and leave the camp.  David then when he is a long way away cries to Abner, and accuses him of not being vigilent for his king and shows the spear and the jug.  Saul again realising that David could have easily killed him realises his wrong again and asks for David to forgive him, which David does, showing the principle that the Lord Jesus laid down that if someone sins against us we are to forgive everytime.  Saul again leaves off his pursuit of David and this was the last time that they ever met.",
        "download": "http:\/\/api.sermonindex.net\/SID10658-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "26"
            }
        ]
    },
    {
        "title": "(1 Samuel) Patching Things Up",
        "url": "http:\/\/api.sermonindex.net\/SID10647",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 19:1-10",
        "topic": "",
        "description": "Saul openly commands all his servants, including his own son Jonathan to kill David.  Jonathan of course goes to David to warn him of his fathers intentions to have David killed, in this Jonathan submitted to the authority of the Lord more than the authority of his own father and king.  The word of God instructs us to obey those in authority but when a command coms that is directly against the will of the Lord we must not obey as this would be sin.  Jonathan defended David before Saul, just as the Lord Jesus defends us when Satan attacks and accuses us, sometimes correctly, but the Lord will not allow Satan to prevail over us so long as we are in His will.  Jonathan gives a good account of David to Saul and Saul repents of the wrong that he wanted to do to David,  Saul voowes that David shall not be kiled, which ironically was true as he wouldn't be killed by Saul.  Then war returned to Israel and the evil spirit came upon Saul again and again he tried to kill David, this time David fled and did not return to the palace.",
        "download": "http:\/\/api.sermonindex.net\/SID10647-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "(1 Samuel) Saul’s Wise Early Years",
        "url": "http:\/\/api.sermonindex.net\/SID10632",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 11",
        "topic": "",
        "description": "Nahash king of the Ammonites comes against the people of Jabesh Gilead a city of Israel and threaten to kill the them and take all the possessions from their city, so the people offer to make him a deal in exchange for their lives, Nahash agrees and demands all their right eyes in exchange for their lives.  So the people of jabesh Gilead ask for one week to ask for help of the rest of Israel, Nahash agrees.  So the men of Jabesh Gilead send out messengers to ask for help, one of which come to Saul and tells him all that is going on, Saul is infuriated and the Spirit of the Lord comes upon him and he calls upon all Israel to come and fight the Ammonites with him, so Saul amasses and army of 330,000 people and the make their way to Jabesh Gilead.  Where Nahash is utterly defeated by the armies of Israel and the people hail Saul as their new king, but thankfully Saul gives all the glory to the Lord who fought for them, so both outward and inward battles were won.",
        "download": "http:\/\/api.sermonindex.net\/SID10632-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "(1 Samuel) Strengthening Your Hand In God",
        "url": "http:\/\/api.sermonindex.net\/SID10654",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 23:14-29, Psalm 54",
        "topic": "",
        "description": "Saul was obsessed with capturing David and sought him daily but the Lord delievered David out of the hand of Saul every time.  David was oppressed in the heart of his trial so the Lord sent Jonathan to him to strenthen him. Jonathan remind David of the Lord's promises to him how David will be king of Israel and that even Saul knows this, but Jonathan goes to far in what he is saying to David and says that he will be next to David when he is king, this sadly wouldn't come to pass as Jonathan would be killed in battle beofre David even came to the throne.  When Jonathan leaves David the Ziphites go and betray David into the hand of Saul, it was then that David wrote Psalm 54 and as seen in the psalm David puts his whole trust in the Lord and his heart is filled with praise to God.  Sauls army is just about to encircle David when a messanger comes to Saul and informs him that the philistines are invading and the Israel is under attack so Saul has to leave off from David and defend Israel.",
        "download": "http:\/\/api.sermonindex.net\/SID10654-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "23"
            },
            {
                "book": "Psalms",
                "chapter": "54"
            }
        ]
    },
    {
        "title": "(1 Samuel) The Battle after the Battle",
        "url": "http:\/\/api.sermonindex.net\/SID10644",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 18:1-9",
        "topic": "",
        "description": "David comes before Saul after killing Goliath and tells the king all about the batle with Goliath and the Philistines and testifies to the glory of God how the the Lord delivered Israel's enemies into their hands.  It was here that the soul of Jonathan the heir to the throne was knit to the soul of David, youngest son of a sheep farmer, why? becuase of their love of the Lord.  Jonathan takes off all his princely apparel and gives it to David as he knows that David, not himself, is going to be the next king of Israel.  This is a picture of our relationship with the Lord Jesus who, laid aside His glory and dwelt amongst us so that He could array in His robe of righteousness.  This was the high point of David and Sauls relationship, Saul sent David out to fight the Philistines, and David won a resounding victory, becaue the Lord was with him, but the people began to love David more than Saul and this caused Saul to become Jealous and he became suspicious of David from that day on, David on the other hand did not get proud but acted wisely before the Lord.",
        "download": "http:\/\/api.sermonindex.net\/SID10644-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "18"
            }
        ]
    },
    {
        "title": "(1 Samuel) The Holiness of God",
        "url": "http:\/\/api.sermonindex.net\/SID10627",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 6:13-21",
        "topic": "",
        "description": "The Ark of the Lord returns to Israel and the people rejoice to see it in much the same way the dicsciple must have rejoiced to see the risen Lord Jesus, they offered a sacrifice unto the Lord using the wood from the cart and the cows that had pulled the cart back, these were expensive commodities in those days.  However it wasn't long before the men of Bethshemesh became curious to know what was actually in the Ark, so they opened it and the Lord kiled them for it.  This shows that there are some things that God has chosen not to reveal to us and it is sin to press God to try an find out things that He does not want to reveal to us.  This judgement lead to a great fear spreading over the people as they realized the holiness of God, that God is not man and is far beyond us and thus is seperate from us.  This is what attracts people to God because He is beyond us, but when people come to know Him and see his holiness and 'otherness' we become fearful as we are not holy before a holy God.  But praise God there is someone who can stand between us and God, the Lord Jesus.",
        "download": "http:\/\/api.sermonindex.net\/SID10627-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "(1 Samuel) The Raiding of the Ark",
        "url": "http:\/\/api.sermonindex.net\/SID10624",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 4:1-11",
        "topic": "",
        "description": "Here the Israelites are at war with their neighbours the Philistines, who had superior military technology for that time due to their widespread trade routes.  After suffering a crushing defeat of 4000 men the leaders of Israel tried to persuade god to fight for them by bringing the Ark of the Covenant, this was a great mistake as they put their faith in the Ark of God and not in the God of the Ark.  This displayed the vain superstitions the people of Israel were embracing at the time.  The priests that brough the Ark tio the camp were the two sons of Eli who the Lord had already declared were under judgement.  When the Ark arrived their was a great shout in the camp and the Philistines became afraid as they knew that the Ark represented the God of Israel and that He was mightier than their gods, but despite this they did not submit to Him but fought the more viciously against the Israelites.  Becasue God was not with Israelites they not only lost awefully but the Ark was taken and the sons of Eli were killed in the smae day, just as the Lord had said would happen.",
        "download": "http:\/\/api.sermonindex.net\/SID10624-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(1 Samuel) The Training of a Prophet",
        "url": "http:\/\/api.sermonindex.net\/SID10623",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 3:11-3:21",
        "topic": "",
        "description": "The first message that God gave to Samuel was a message of judgeement for the the house of Eli, Eli had not heeded the Lord's warning and so judgement was pronounced becasue Eli had not restrained his sons.  Samuel of course was afraid to deliver this message to the spiritual leader of Israel, but Eli desired to hear what the Lord had to say to him.  Therefore Samuel at Eli's request told him everything and when Eli heard the message he knew it was from the Lord and submitted to the word.  From that time on Samuel's' fame began to spread as prophet and messenger of God and God revealed Himself to Samuel by His Word.  But Samuel did not get proud or arrogant of the fact that God would use him but insteawd was humble before the Lord and thius the Lord could use him mightily.",
        "download": "http:\/\/api.sermonindex.net\/SID10623-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(1 Samuel) Various Passages - Three Lives, Three Choices",
        "url": "http:\/\/api.sermonindex.net\/SID10664",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 3:18, 1 Samuel 13:11-12, 1 Samuel 16:12",
        "topic": "",
        "description": "Samuel, Saul and David, three of the most memorable people to appear in the scriptures made choices early on in their lives that would influence their entire lives from then on. As a child Samuel served in the house of the Lord at Shiloh under Eli the High priest, Eli had chosen not to rebuke his sons for their wickedness and for this the Lord held him responsible, one night the Lord told Samuel, still a child, to tell Eli that he would take the priesthood from Eli.  Eli asked Samuel what the Lord had said and Samuel told him everything.  He chose to obey the Lord over popularity.  Saul was anointed king over Israel but in a moment of panic offered a sacrifice to the Lord which was forbidden to do, when Samuel, now the prophet of God, challenged him Saul chose to make excuses for his actions instead of repenting.  David was a man after God's own heart and chose to love the Lord when he was alone with the sheep in the fields where there were none to see him, David still a boy became and man of God and most likely in this time wrote Psalm 23.",
        "download": "http:\/\/api.sermonindex.net\/SID10664-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "3"
            },
            {
                "book": "1 Samuel",
                "chapter": "13"
            },
            {
                "book": "1 Samuel",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "(1 Samuel) What God Regrets",
        "url": "http:\/\/api.sermonindex.net\/SID10638",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 15:1-16",
        "topic": "",
        "description": "Samuel comes to Saul and gives him a message from the Lord, the command was simple, 'Go and wipe out all the Amalekites, every single one of the including all their livestock'  this was due to what they had done in the past in that as the children of Israel were on their way into the promised land from egypt, Amalek had come up behind them and started to attack the very weakest of them.  This was over 400 years ago but shows us that time does not erase sin beofre the Lord and He had given the Amalekites all this time to repent but they didn't so the Lord pronounced judgement on them.  So Saul went and attacked the Amalekites and killed some of them but kept Agag, their king alive, and also some of their best livestock.  This grieved the Lord and Samuel and when Saul told Samuel what he had done Samuel rebuked him fopr his pride as it had led to self deception.  Saul tried to blame everyone else and that he was being actually being spiritual but Samuel gave him a word from the Lord...",
        "download": "http:\/\/api.sermonindex.net\/SID10638-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "(1 Samuel) What Happens by Chance",
        "url": "http:\/\/api.sermonindex.net\/SID10626",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 6:1-12",
        "topic": "",
        "description": "After an amazing 7 months of affliction because of the Ark of God, the Philistines finally decide to send the Ark back to the people of Israel with an offering to show their humility towards the Lord.  They had learned lesson from their Biblical history in that would no longer harden their hearts towards the Lord as the Egyptians had done inb the time of Moses.  But before sending the Ark back they decided to perform on last test to see if what had happened was at the hand of the Lord or all the events had just happened by chance.  They placed the Ark on a cart pulled by 2 milk cows, which had never pulled anything before in their lives, they took the cows from their calves, set them on a road they had never been on and sent them away with no driver.  The philistines had 'stacked the deck' against God to see if it was actually Him who had punished them for these 7 months.  So they stood back and watched in amazement as the cows took the exact route to Bethshemesh guided by the invisible hand of Almighty God, God will get His glory even if He has to glorify Himself.",
        "download": "http:\/\/api.sermonindex.net\/SID10626-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "(1 Samuel) What Submission Is and Is Not",
        "url": "http:\/\/api.sermonindex.net\/SID10657",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 25:23-44",
        "topic": "",
        "description": "David is on his way to Nabals house to massacre everone there when, suddenyl a woman leading a large company meets him on his way, she gets off her mount and bows herself down to the ground before him, this is quite a surprise for David as Abigail was a woman of great status and so to see her humbling herself in this way is very odd.  She asks David for mercy and to lay the blame on herself, she reminds David that he is the one who goes out and fights the Lord's battles, this must have pricked Davids heart as he surely knew that what he was intending to do was not in the heart of the Lord, David by the grace of God realises what he is doing and departs praising the Lord for sending Abigail.  Nabal on the other hand is totally unaware of what could have happened and is throwing a party when Abigail returns, the morning after she tells him of the previous days events and he is so shocked that he dies 10 days later.  David sends fo Abigail and takes her and Ahinoam for his wives as Sauls daughter had been given to someone else.",
        "download": "http:\/\/api.sermonindex.net\/SID10657-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "25"
            }
        ]
    },
    {
        "title": "(1 Samuel) When God Announces Judgment",
        "url": "http:\/\/api.sermonindex.net\/SID10622",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 2:22-3:10",
        "topic": "",
        "description": "The sons of Eli were a corrupt priesthood who took from the people what they wanted and didn't give them what they should, their father, and boss, Eli didn't discipline them for this but instead lectured them as to how what he had heard about them had saddened him.  Because they went unpunished by their father the Lord had to judge them for their actions.  On day a man sent from God came to the house of Eli and confronted him about his sons behaviour because God held him responsible for what his sons were doing, the man of God gave Eli, and his sons and invitation to repent before judgement came but they didn't thus judgement had to come in the deaths of Eli's sons adn the removal of Eli's family from the preisthood in the days of Zadok about 70 years later.  During this time Samuel was growing in favour of God and man and thus the Lord spoke to him even though Samuel didn't know it was the Lord, he went to Eli and Eli told him it was the Lord and Samuel recieved the word with gladness.",
        "download": "http:\/\/api.sermonindex.net\/SID10622-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(1 Samuel) When God Rejects a Leader",
        "url": "http:\/\/api.sermonindex.net\/SID10635",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 13:1-14",
        "topic": "",
        "description": "Here we are introduced to one of the great men in this book of 1 Samuel, Jonathan who was a remarkable military leader and also son of Saul the king.  Jonathan leads an army against the local philistine garrison and wins a resounding victory, even though Saul his father took the credit for it, but the philistines didn't like this at all and decided to amass an army to put down this 'rebellion' in the people of Israel who they oppessed.  the people of Israel were fearful before going into battle and realised they need the Lord to fight for them, so Saul calls for Samuel to offer a sacrifice and bless them before the battle.  After a few days of Samuel not coming to offer the sacrifice Saul decides to off the sacrifice himself, which was a major sin as he was a king not a priest, and just after the sacrifice is offered Samuel comes over the hill to find to his horror Saul has not waited for him, and thus not waited for the Lord's timing.  Samuel offers Saul an opportunity to repent but instead he makes excuses, so Samuel tells him that the Lord has rejected him as king and has found a man after His own heart to rule the people.",
        "download": "http:\/\/api.sermonindex.net\/SID10635-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "(1 Samuel) When God Won’t Talk to You",
        "url": "http:\/\/api.sermonindex.net\/SID10660",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 28",
        "topic": "",
        "description": "The Philistines again attack Israel in a very aggresive way, reaching right into the heart of the land.  So Saul not knowing what to do goes to enquire of the Lord, but the Lord wouldn't answer him either by dreams, Urim or prophets, this is because Saul had been in open rebellion to the Lord for years now andhad departed from Him.  So Saul panics and seeks a medium who would give him advice.  So the servants of Saul tell him of a woman in Endor, so Saul disguises himself and goes to her and asks her to bring up Samuel the prophet from the dead, and when Samuel comes the medium is terrified and realises who Saul is.  Samuel asks Saul why he has brought him up and Saul says that the Lord has departed from him, when really Saul had departed from the Lord, and he doesn't know what to do, but Samuel reminds Saul that the Lord had promised to tear the kingdom out of his hands and that is just what is going to happen because the time that had elapsed had not atoned for Saul's sin.  So Samuel tells Saul that the day after he would die and gave Saul one last chance to repent, but he didn't.",
        "download": "http:\/\/api.sermonindex.net\/SID10660-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "28"
            }
        ]
    },
    {
        "title": "(1 Samuel) When We Know Better Than God",
        "url": "http:\/\/api.sermonindex.net\/SID10629",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 8",
        "topic": "",
        "description": "Samuel raised his sons up to be his succesors and to judge Israel after his death, but they did not walk in the way of the Lord as he did.  So the Israelites came to him and told him that they rejected his sons from ruling over them because of their ungodly lives, however instead of his sons they wanted a king to rule over them instead, the reason for this lay in their desire to be just like the surrounding nations, it is very dangerous for the people of God to want to be like the those in the world around them.  Samuel was saddened by this decision from the people and poured out his complaint before the Lord, as we should do.  But the Lord reassured Samuel and told him that that it wasn't him they were rejecting but the Lord Himself.  This was prophetic of the rejection of the Lord Jesus by the the people of Israel before Pilate.  So the Lord told Samuel to tell the people of Israel what kind of king they would have, and he did, but the people still demanded a king and so the Lord gave them the king they deserved.",
        "download": "http:\/\/api.sermonindex.net\/SID10629-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "(1 Samuel) Where the Battle Is Won",
        "url": "http:\/\/api.sermonindex.net\/SID10642",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 17:1-30",
        "topic": "",
        "description": "This is the account of Davids fight with Goliath.  Goliath was mountain of a man some say he was aroung 9ft tall, and this is reflected in the size and weight of his armour, he was a man of war from his youth and was in the philistine army army for one reason, to instill fear into their enemies.  On the first day of battle Goliath headed out and stood before the army of Israel and challenged them to send out one man to fight with him, one on one, and this terrified the Israelites and their king Saul, who was the tallest in their army.  Satan today uses the exact same tactics as Goliath did in that he roars at us and makes us afraid when God is on our side and there is no reason to fear what he or man might do to us.  David arrives at the battle to bring supplies to his brothers who were in the army at the time and hears Goliath's challenge, but David instead of seeing Goliaths size and armour saw an uncircumsized idolater who was defying the living God, David knew this was a cause worth fighting for so he accepted Goliaths challenge.",
        "download": "http:\/\/api.sermonindex.net\/SID10642-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "17"
            }
        ]
    },
    {
        "title": "(1 Samuel) Winning Back More than You Lost",
        "url": "http:\/\/api.sermonindex.net\/SID10662",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Samuel 30:7-31",
        "topic": "",
        "description": "David arrives back home in Ziklag to find that everything has gone, all his family and his mens families too, but he strengthened himself in the Lord his God and asks the Lord what He wants him to do, the Lord tells David to go after the Amalekites who had taken all their families, and that he will recover all that he had lost.  David recieved the promise from the Lord and heads off with his 600 men.  But 200 of them were too weary to cross the river so David instructs them to wait there and look after the supplies, a little further and the find an Egyptian alone, David gives him food and water and asks where he has come from, the Egyptian tells him that he is one of the servants of the Amalekites and that if David will spare him he will lead him to them.  When David and his men find the Amalekites they are throwing a party so David and his men wait till the morning after win a great victory, and recover all they had before and the spoil of battle too.  David being the great leader that he was gives an equal portion to the men who stayed behind at the river.",
        "download": "http:\/\/api.sermonindex.net\/SID10662-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Samuel",
                "chapter": "30"
            }
        ]
    },
    {
        "title": "(2 Kings) A Prophet and His Protégé",
        "url": "http:\/\/api.sermonindex.net\/SID10729",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 1-2",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10729-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(2 Kings) How to Prepare for Blessing",
        "url": "http:\/\/api.sermonindex.net\/SID10730",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 3-4",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10730-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "(2 Kings) Jehu: Zealous, but Not Enough",
        "url": "http:\/\/api.sermonindex.net\/SID10733",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 9-10",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10733-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(2 Kings) Outcasts and Kings",
        "url": "http:\/\/api.sermonindex.net\/SID10732",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 7-8",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10732-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(2 Kings) The Queen of Judah and the Boy King",
        "url": "http:\/\/api.sermonindex.net\/SID10734",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 11-12",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10734-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "(2 Kings) Two Lepers and the Blind Men",
        "url": "http:\/\/api.sermonindex.net\/SID10731",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Kings 5-6",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10731-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Kings",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "(2 Samuel) A Not-So-Sudden Fall",
        "url": "http:\/\/api.sermonindex.net\/SID10702",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 11:1-5",
        "topic": "",
        "description": "This is one of the saddest chapters in the whole of the Old Testament.  David again sent his army out to do battle without going with them himself, and while they were away David took a strole one afternoon on the balcony of his palace.  He probably had no idea thet Bathsheba would be washing herself at that time and yet when he saw her he was transfixed, he had for years indulged in this forbidden passion in marrying more than one wife and that had laid the groundwork for what was about to take place.  He asked his servants who this woman was only to be told that not only was she the daughter and granddaughter of some of Davids closest advisers, but was also married to one of the mighty men in Davids army.  So he knew that her husband was away and thought he could get away with adultery, so they had a 'one night stand' but Bathsheba became pregnant.",
        "download": "http:\/\/api.sermonindex.net\/SID10702-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "(2 Samuel) A Tale of Two Houses",
        "url": "http:\/\/api.sermonindex.net\/SID10698",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 7",
        "topic": "",
        "description": "David wanted to bless the Lord by building a house for Him, so he consulted the prophet Nathan who agreed, but Nathan was then told by the Lord to tell David that He did not him to build Him a house, the Lord later revealed to David that it was because he was a man of war.  David loved the Lord so much that he wanted to give more to the Lord than the Lord asked of him, the Lord told David that he would be the father of the men who would build His house, the first would Solomon who built the temple in Jerusalem, but the second Son of David would build a house for God that would last forever, and this is of course the Lord Jesus, Who is at this time building His church.  David humbled himself and blessed the Lord for his promises.  He accepted the promises of the Lord and asked only that the Lord would carry out His promises to build His house with his descendants.",
        "download": "http:\/\/api.sermonindex.net\/SID10698-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(2 Samuel) Amnon, Tamar, and Absalom",
        "url": "http:\/\/api.sermonindex.net\/SID10705",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 13",
        "topic": "",
        "description": "After the incident with David and the wife of Urriah, Davids family life beamce very disfunctional, thre of Davids children were Amnon, his eldest and the next in line to the throne, Tamar, who some say was Davids only daughter, and Absalom who was brother to Tamar.  Amnon was used to getting everything he wanted, and he wanted Tamar his sister, so much that he became lovesick over her.  So Amnon was advised of a plan to get alone with Tamar, he pretended to be sick and asked the king to send his sister Tamar to serve him whilst he was ill, David of course sent her.  But when she arrived Amnon took her into the bedroom demanded everyone leave and then raped her, giving in totally to his lust.  Tamar was devestated by this as after he had done this wicked act he wanted nothing more to do with her.  Tamar left and went to the house of Absalom her brother who found out what had happened.  David too found out but didn't chastise his son Amnon.  From that day on Absalom hated Amnon, and waited 2 whole years before inviting him to a feast and having hiom killed for what he had done.",
        "download": "http:\/\/api.sermonindex.net\/SID10705-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "(2 Samuel) Believing and Living",
        "url": "http:\/\/api.sermonindex.net\/SID10694",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 3",
        "topic": "",
        "description": "David took many wives to himself over the course of his life, and yet this was wrong in the eyes of God and is reflected in the trouble that came to him from his family.  Ishbosheth, the pretender to the throne, accuses Abner, his military commander, of taking Sauls concubine for himself, this enrages Abner and he deicdes to no longer support Ishbosheth but defect to Davids side.  When Abner comes to him David asks for Michal, his first wife, to be returned to him, so Abner went and took Michal from where she was and brought her back to David.  Abner then went aroung Israel declaring that everyone should recognise David as being the rightful king and there was peace, but only for a short time.  Joab, Davids military commander, returns from a campaign to hear that Abner, who had killed Joabs brother Asahel on the field of battle, has made peace with David.  So he requests to see Abner and when he came Joab killed him, because of his brother, but when David heard about this he was greatly saddened and condemned Joab and all his house for this.",
        "download": "http:\/\/api.sermonindex.net\/SID10694-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "(2 Samuel) Bringing Back the Banished",
        "url": "http:\/\/api.sermonindex.net\/SID10706",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 14:1-17",
        "topic": "",
        "description": "Absalom the son of David was in exhile, by his own choice and also by the decision of his father.  But Joab, David's chief general was suspicious of Absalom and wanted him back in Jerusalem so he could keepa close eye on him.  Joab got a woman to come before David and pretend to be a poor widow and tell him a story that was almost exactly the sameas the situation the king was in with Absalom.  So after hearing the story David deicdes  to pardon the womans son who was in the place of Absalom, at this the woman confronts David as to why he has suspended justice for her son but not for his own.  In this is a great lesson that we should be forgiving of those who have personally wronged us.  But the justice of the Lord towards mankind was not suspended for the sake of reconcilliation as our punishment was laid upon the shoulder of the Lord Jesus when He was on the cross, thus justice was satisfied and not suspended.",
        "download": "http:\/\/api.sermonindex.net\/SID10706-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "14"
            }
        ]
    },
    {
        "title": "(2 Samuel) Bringing Back the King",
        "url": "http:\/\/api.sermonindex.net\/SID10711",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 19:9-43",
        "topic": "",
        "description": "With Absalom now dead David has every right to return to his throne and impose his rule upon the people of Israel again, but he did not, in a way that is akin to how the Lord Jesus enters our hearts and becomes King there, David would not return until he was invited back. So he turned the hearts of the people back to him as if they were one person and it was only at this that David returned to the throne.  The first person to meet him at his return was the repentant Shimei who had cursed David and throne rocks at him when he was fleeing from Jerusalem. But now Shimei begged Davids forgiveness for what he had done, and David mercifully granted him a pardon.  The Mephibosheth came to David and told him of how Ziba had tricked him and lied to David about him, David told Mephibosheth that he copuld divide the land with Ziba but Mephibosheth only wanted to be with his king he wasn't interested in the land. But at the end of this chapter the seeds were sown for a great dispute between Judah and Israel.",
        "download": "http:\/\/api.sermonindex.net\/SID10711-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "(2 Samuel) Caught in the Trap of Sin",
        "url": "http:\/\/api.sermonindex.net\/SID10703",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 11:6-27",
        "topic": "",
        "description": "Bathsheba was now pregnant by an adulterous relationship with David, and David knew it so he endeavoured to hide his sin by calling Bathsheba's husband Uriah back from the war.  David asked Uriah how the battle was going and told him to go home and relax with his wife, but Uriah was a man of great integrity and refused to go home to be comfortable with his wife while Israel was at war.  So David sent him back to the front with a note for Joab his commander to place Uriah in the heat of the battle and withdraw from him, sentencing Uriah to death.  Joab obeyed the command of David and Uriah was killed in battle, David later took Bathsheba to be his wife in order to cover up what he had done but this displeased the Lord.  David had ignored the warnings of the Lord and temptation had turned to lust, lust to adultery, adultery to deception and finally into murder, this is how our sin if unchecked can uncontollably accumulate until it utterly blinds us and only the Lord can save us.",
        "download": "http:\/\/api.sermonindex.net\/SID10703-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "11"
            }
        ]
    },
    {
        "title": "(2 Samuel) Counselors and Comfort",
        "url": "http:\/\/api.sermonindex.net\/SID10709",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 16:15-17:29",
        "topic": "",
        "description": "David send Hushai the Archite to spy on his son Absalom who had set himself up as king in David's place.  Absalom in the meatime is asking advise from Ahithophel who was the wisest man in Israel at the time, Ahithophel advises Abslaom to burn his bridges with his father the king by systematically raping 10 of the kings concubines whom David had left behind, but not only this but to do it on the roof of the palace so everyone knew what he was doing.  Absalom followed this advice.  Ahithophel, who hated David due to the fact that he was Bathsehba's grandfather, then asked Absalom if he could lead a band of men immediately and go after David and kill him, this was a brilliant plan and had it not been for the intervention of the Lord would surely have meant the end of David.  Amazingly though Absaom asked for a second oppinion from Hushai the Archite, he appealed to Absalom's vanity and advised him to amass a great army and lead them out to battle, thus buying the king time, Absalom agreed with Hushai's plan and Ahithophel knowing it would lead to ruin returned home and hanged himself as he knew David would succeed and come after him.",
        "download": "http:\/\/api.sermonindex.net\/SID10709-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "(2 Samuel) David's Triumph",
        "url": "http:\/\/api.sermonindex.net\/SID10699",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 8",
        "topic": "",
        "description": "David wrought great victories against the enemy nations around him, as he was a man afte Gods own heart he was at peace with the people of God and at war with the enemies of God, unlike Saul before him.  He defeated the Philistines who were an old and stubborn enemy, just as Satan is an old and stubborn enemy of ours, but the Lord will win the resounding victory.  He defeated Moab with great severity as much severity as we are, through Christ, to defeat the sin that is in our lives.  He also defeated the Syrian alliance who had come against him and so Christ shall one day utterly defeat the alliance of sin, the flesh and the devil.  We can learn from this passage of scripture that David defeated his enemies that were all around him just as the Lord desires to defeat all the enemies that surround us.",
        "download": "http:\/\/api.sermonindex.net\/SID10699-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "(2 Samuel) Doing Things God's Way",
        "url": "http:\/\/api.sermonindex.net\/SID10697",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 6",
        "topic": "",
        "description": "David, now established as king over Israel, decides to bring the Ark of the Covenant to Jerusalem.  So they get together a large group of worshippers and put the Ark on a brand new cart pulled by oxen and head for Jerusalem.  On the way the cattle stumble and the Ark almost falls to the ground, but is stopped by the hand of Uzzah who is escorting the cart.  The Lord is furious and strikes Uzzah dead on the spot.  David sends the Ark to the house of Obededom and the Lord blesses the house.  David seeks the Lord on how He wants the Ark to be brought back Jerusalem and the Lord instructs him the correct way.  So David brought the Ark back no leaving anything to chance and dances before the Lord with all his might.  But he is despised by his wife Michal for wearing a linen ephod and dancing and she rebukes him when he returns home for this the Lord caused her to be barren for the rest of her life.",
        "download": "http:\/\/api.sermonindex.net\/SID10697-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "(2 Samuel) Fighting to Keep Unity",
        "url": "http:\/\/api.sermonindex.net\/SID10712",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 20",
        "topic": "",
        "description": "Rebellion started in Israel when Sheba declared that he would not have David as a king over him, and managed to lead away all Israel except the tribe of Judah who reminaed loyal to the king.  This is a testament to how fallen man will rebel against God-ordained authority at every opurtunity he can get.  So David aksed his new chief general Amasa to amas an army in three days and pursue Sheba, but Amasa had trouble amasing the army so David sent Abishai and the palace guard with Joab to pursue Sheba.  As they were pursuing Amasa caught up with them but Joab killed him, probably due to Amasa being Absaloms chief commander when he was alive.  So the guards carried on and came to the city of Abel where Sheba now was thinking himself to be safe. Joab and all the men laid seige to the city, but a wise woman from the city asked Joab why he was laying seige to the city, JOab told her tha he would leave once he knew Sheba was dead so she consulted the people of the city and they killed Sheba and threw his head over the wall and Joab and the army returned to Jerusalem.",
        "download": "http:\/\/api.sermonindex.net\/SID10712-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "20"
            }
        ]
    },
    {
        "title": "(2 Samuel) Free From Bitterness",
        "url": "http:\/\/api.sermonindex.net\/SID10692",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 1",
        "topic": "",
        "description": "David was in Ziklag, a city in Philistia, when an Amalekite comes from the battle between Israel and the Philistines, he tells David that Saul and his sons are dead on the field of battle and that Israel has retreated from before them, David enquires how he knows Saul is dead and the Amalekite tells him that while he was in the battle he saw Saul fall upon his own sword and call him over to him and ask that he would kill him, so the Amalekite stands over Saul and kills him, this was a lie to gain favour with David.  But he showed David the crown and bracelet that he had taken from Saul after his death, David was very grieved to hear the news and wrote a lamentation about Saul and Jonathan, this shows how David was free from the bitterness that would have ensnared his heart had he dwelt upon how Saul had wronged him. But David asks the Amalekite why he was not afraid to kill the anointed king of Israel and when the he didn't answer David had him killed for boasting over the dead.",
        "download": "http:\/\/api.sermonindex.net\/SID10692-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(2 Samuel) How to Love an Enemy",
        "url": "http:\/\/api.sermonindex.net\/SID10695",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 4",
        "topic": "",
        "description": "When Ishbosheth hears that Abner is dead he gets very afraid and panics, and rightly so as two assasins come to his house and kill him whilst he is still in bed. They took his head and went to David to show him how they had kiled his 'enemy' and sought a reward from him.  But David was sickened by what they had done and because of the evil in their hearts, so he rebuked them for killin Ishbosheth, calling Saul 'David's enemy' and claiming they had carried out the will of the Lord. But David did not consider Saul his enemy so he commanded that the two assains should be killed, as a statement that no one should attack the house of Saul anymore.  David then went and took the head of Ishbosheth and buried it with Abner.  This showed how David was a man after the heart of the Lord as he forgave his enemies and even loved them.",
        "download": "http:\/\/api.sermonindex.net\/SID10695-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(2 Samuel) In God's Hands",
        "url": "http:\/\/api.sermonindex.net\/SID10716",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 24:10-25",
        "topic": "",
        "description": "After he had counted the people David's heart convicted him of this sin, so he repented before the Lord , the Lord then sent Gad the prophet to him with a choice, David was going to be judged for his sin but he had a choice what that judgement was to be, famine, war or plague.  It was highly likely that the famine and the war would not have touched David directly so he chose the punishment of the plague.  Famine and war would also have meant that he would have to rely on man for help but he chose to fall into the hands of the Lord as His mercy is great.  In the plague which lasted 3 days 70,000 people died but thatnks to the mercy of God the plague was stopped when the Angel of the Lord was at the threshing floor of  Araunah the Jebusite.  David bought the threshing floor and errected an altar on it as the Lord commanded, this was the same land where Abraham offered Isaac, Solomon built the temple and the Lord Jesus bled and died for us.",
        "download": "http:\/\/api.sermonindex.net\/SID10716-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "24"
            }
        ]
    },
    {
        "title": "(2 Samuel) King David in Triumph",
        "url": "http:\/\/api.sermonindex.net\/SID10696",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 5",
        "topic": "",
        "description": "Ishbosheth, the pretender to the throne, was dead and all the tribes of Israel now came to accept David as king over them.  David was a man of the people, he was already recognised as a great leader and a man anointed of the Lord, and thus he set his sights on capturing Jerusalem for his capital, the people in Jerusakem mocked and taunted him, but David and his men heroically captured the city.  David was recognised as a great ruler by the surrounding nations and they sent skilled craftsmen to work for him.  But during this time of great success David took more wives and concubines to himself which would lead to great problems later.  The Philistines then came and invaded Israel, so David enquired of the Lord what he should do and the Lord told him to meet them head on, so David won a great victory.  But they came again and this time the Lord told David to go behind them and wait for Him to go out before them, which David did and again won a great victory.",
        "download": "http:\/\/api.sermonindex.net\/SID10696-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "(2 Samuel) More Anointing, More War",
        "url": "http:\/\/api.sermonindex.net\/SID10693",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 2-3:1",
        "topic": "",
        "description": "David enquires of the Lord as to what he should do, so the Lord tells David to go up to Hebron, when David got there he was anointed king over the tribe of Judah, and he blessed the people of Jabesh Gilead for retreiving the body of Saul and his sons.  But the people of Israel anointed Ishbosheth, one of Sauls sons, king over Israel, Abner, commander of Sauls army, then led the army of Israel against Davids men who were led by Joab, Joab won the fight and the army of Israel had to flee.  Asahel, who was very quick, chased after Abner as they retreated, but after several warning to stop Abner killed himand carried on retreating.  The army of Israel gathered for one last stand and Abner cried to Joab to end the fighting, Joab agreed and they all left peacably, but this agreement only meant that the war between the house of Saul and the house of David went on for a long time instead of being ended quickly.",
        "download": "http:\/\/api.sermonindex.net\/SID10693-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "(2 Samuel) Repentance and Restoration",
        "url": "http:\/\/api.sermonindex.net\/SID10704",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 12",
        "topic": "",
        "description": "Nathan the prophet come to king David and tells him a story of a rich man who had much wealth, the rich man even though he had many flocks of sheep went and took the only lamb from a poor man.  David is enraged when he hears the story and demands that the man be put to death and restore 4 times what he took from the poor man.  Nathan however responds that David himself is the man in the story, in that he took Bathsheba the wife of Uriah and had an adulterous relationship with her, Nathan confronted David with his sin and tells him what the Lord is going to do now because of Davids sin.  David in performing this act had shown his own despite for the commandments of the Lord, and thus from then on he had great trouble within his family.",
        "download": "http:\/\/api.sermonindex.net\/SID10704-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "(2 Samuel) Settling an Old Debt",
        "url": "http:\/\/api.sermonindex.net\/SID10713",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 21:1-14",
        "topic": "",
        "description": "There was a famine, probably caused by drought, in the land of Israel, David enquired of the Lord as to why, and the Lord revealed to him that it was a judgement because of Saul's massacre of the Gibeonites 40 years previously.  In the days of Joshua Israel had made a covenant with the Gibeonites not to wipe them out as they were going through Canaan, and the Lord expected Israel to keep this promise.  So David met with the Gibeonites and asked them how this could be put right, the Gibeonites asked for 7 men from the house of Saul that they might execute them.  David agreed and delivered to them 7 men whom the Gibeonites hung together to show they were accursed of God.  But the mother of 2 of the men would not allow their bodies to be desecrated by being eaten by the wild animals, so she kept a vigil over them until the rains came and she knew that their deaths had not been in vain.",
        "download": "http:\/\/api.sermonindex.net\/SID10713-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "21"
            }
        ]
    },
    {
        "title": "(2 Samuel) The Army of Mighty Men",
        "url": "http:\/\/api.sermonindex.net\/SID10701",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 10",
        "topic": "",
        "description": "David hears that the king of Amon has died, so he sends a diplomatic envoy to the new king Amon in order to offer the hand of friendship, this is not weel received.  The ambassadors are humilitaed and abused and thrust out of Amon, this was an act of war and the Amon knew it, so they amases their army and an army of mercinaries from Syria, to make war with Israel.  David send out his whole army of mighty men led by Joab to fight the battle, but the army become surrounded.  Joab though instead of surrendering as was usually the case in these type of encounters, gives the army a rousing speech, reminds them of what they are fighting for and that the Lord is with them, thus they attacked and the Amonites and Syrians retreated.  Joab led the army back home instead of wiping them out, but the enemy re-assembled and came against Israel again, this time however David personally led the army and the Syrians were utterly defeated.",
        "download": "http:\/\/api.sermonindex.net\/SID10701-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "(2 Samuel) The Death of Absalom",
        "url": "http:\/\/api.sermonindex.net\/SID10710",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 18:1-19:8",
        "topic": "",
        "description": "David and Absalom prepaired to go to war against each other, David as we know was an extremely experienced and war tested military leader, Absalom was not.  They went out to battle and Absalom lost in a terrible way, he tried to wage war against the man after God's own heart and by implication God Himself and failed totally.  As he fled the battle on a donkey Absalom was caught in the branches of a tree in the forest nearby and hung their helpless, until one of Davids men found and returned to Joab to tell him he had found Absalom, Joab went straight there and piereced him through, despite David's command to leave Absalom alone,  Joab knew that David would not punish Absalom even for all he had done and so disobeyed a direct order.  Messengers came to David with knews of the war but David was only concerned with whether Absalom was alive or not and when he found out that he was slain he mourned deeply.",
        "download": "http:\/\/api.sermonindex.net\/SID10710-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "18"
            }
        ]
    },
    {
        "title": "(2 Samuel) The Grateful Retrospect",
        "url": "http:\/\/api.sermonindex.net\/SID10714",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 21:15-22:51",
        "topic": "",
        "description": "David now in his latter years could no longer go out to battle in the way he once could, but the lord blessed the slayer of Goliath by raising up 4 more 'giant killers' after him.  Chapter 22 is a psalm of David written at the end of his life much like Psalm 18, here we can see Davids heart overflowing with adoration and praise to God, he exaults the Lord with magestic title after magestic title, my Rock, my Fortress, my Deliverer... He priases God for His protection and how He would not allow David to be distressed and called all of creation to he him, for he knew that He delighted in him.  Even though he had sinned greatly in his life, David knew that the Lord had put away and forgiven his sin, and that before the Lord he was righteous because of God's great mercy.",
        "download": "http:\/\/api.sermonindex.net\/SID10714-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "21"
            }
        ]
    },
    {
        "title": "(2 Samuel) The Kindness of God",
        "url": "http:\/\/api.sermonindex.net\/SID10700",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 9",
        "topic": "",
        "description": "David asks if there is anyone left frm the house of Saulthat he might show to them the kindness of God, so he calls a servant of Saul to him and aks if there is anyone, the servant informs him of Mephibosheth who was the son of Jonathan, David's close friend, but the servant also informs David that Mephibosheth is lame in both his feet thus posing no threat to David's rule over Israel.  David send for Mephibosheth anyway, and he must have been terrified that David would kill him as he had been in hiding for years, but David did indeed show to him the kindness of God as he gave him back all Saul's land, said that he would not kill him, and told him that from that day on he would be welcome to eat at the table of the king.  This of course is a wonderful picture of our relationship to the Lord Jesus who has forgiven us, given us back more than we lost in Adam and invites us always to dine at His table, with Him.  What a God we serve.",
        "download": "http:\/\/api.sermonindex.net\/SID10700-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(2 Samuel) The Sweet Psalmist and the Mighty Men",
        "url": "http:\/\/api.sermonindex.net\/SID10715",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 23:1-24:9",
        "topic": "",
        "description": "David was the sweet psalmist of Israel and instructs in the passage how a leader must be just and live in the fear of the Lord.  He reflected on how the Lord had blessed him so abundantly throughout his life, and shows how close David was to the Lord, how the Lord delighted in him and how he delighted in the Lord.  To David God was the Goal not a Way to the goal as He so often is today.  David also had around him his mighty men who had first joined him in the cave of Adullam when they were weak afraid and in debt, but now the they were mighty through God, as they had learned to love the Lord and had gone out and won great victories.  In chapter 24 Satan tempted David to number all of Israel in order to see how strong he was in the natural but this was a thing which the Lord had expressly forbidden.",
        "download": "http:\/\/api.sermonindex.net\/SID10715-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "23"
            }
        ]
    },
    {
        "title": "(2 Samuel) Treachery and Loyalty",
        "url": "http:\/\/api.sermonindex.net\/SID10707",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 14:18-15:37",
        "topic": "",
        "description": "David brought Absalom his exhiled son back to Jerusalem but on the condition that he wasn't allowed to see David.  Absalom was in Jerusalem for 2 years before finally his patience ran out and he burned Joabs field in order to get attention.  So the king and his wayward son finally met, but Absalom was unrepentant for killing his brother Amnon.  Absalom then set about slowely turning the heart of the people away from David and towards himself, it was only a matter of time before the people began to follow him.  A few years after Absalom went to Hebron where he decalred himself to be the new king of Israel, when David heard about this he did not defend his throne but was happy to let the things of this world go.  But he had to flee because he knew Absalom would be intent on killing him.  The only people that were with David at this time were a group of loyal foreigners, whome he cared for and the preist of the Lord led by Zadok.",
        "download": "http:\/\/api.sermonindex.net\/SID10707-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(2 Samuel) Trusting in Adversity",
        "url": "http:\/\/api.sermonindex.net\/SID10708",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 16:1-14",
        "topic": "",
        "description": "David is on the run again in his life but this time from his own son Absalom.  A servant of Mepibosheth, called Ziba comes to David with vital provisions for him, but the servant lies to David and tells him the Mephiboseth has betrayed him in order to get a reward off David.  The if this wasn't bad enough for David to be fleeing from his own son and to hear, wrongfully, that one of his most trusted friends has betrayed him a distant relation of Saul comes to him called Shimei, and starts cursing David and saying all this has come upono him because of what he did to the Saul when he was still alive.  Davids men who are with him ask for permission to kill Shimei but David is merciful towards him saying, that Absalom is what they should be concerned with and not the misguided insults of some distant relation of Saul, thus David again showed great mercy to the house of Saul and triumphed wonderfully in the face of adversity",
        "download": "http:\/\/api.sermonindex.net\/SID10708-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "(Amos) Raising Up the Ruins",
        "url": "http:\/\/api.sermonindex.net\/SID11038",
        "size": "0",
        "format": "mp3",
        "scripture": "Amos 7-9",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11038-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Amos",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(Amos) The Logic of God's Judgment",
        "url": "http:\/\/api.sermonindex.net\/SID11036",
        "size": "0",
        "format": "mp3",
        "scripture": "Amos 1-3",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11036-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Amos",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(Amos) Yet You Have not Returned to Me",
        "url": "http:\/\/api.sermonindex.net\/SID11037",
        "size": "0",
        "format": "mp3",
        "scripture": "Amos 4-6",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11037-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Amos",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(Christian History) 1. The Early Church –Daily Life and Persecution",
        "url": "http:\/\/api.sermonindex.net\/SID18556",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18556-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 10. The Flagellants",
        "url": "http:\/\/api.sermonindex.net\/SID18565",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18565-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 11. Foundations of the Reformation",
        "url": "http:\/\/api.sermonindex.net\/SID18566",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18566-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 12. Martin Luther, Early Years",
        "url": "http:\/\/api.sermonindex.net\/SID18567",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18567-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 13. The Reformation in Germany",
        "url": "http:\/\/api.sermonindex.net\/SID18568",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18568-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 14. The Reformation Beyond Germany",
        "url": "http:\/\/api.sermonindex.net\/SID18569",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18569-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 15. The Anabaptists, Radical Reformers",
        "url": "http:\/\/api.sermonindex.net\/SID18570",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18570-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 16. The Counter-Reformation & Thirty Years’ War",
        "url": "http:\/\/api.sermonindex.net\/SID18571",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18571-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 17. Christianity in a More Modern World",
        "url": "http:\/\/api.sermonindex.net\/SID18572",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18572-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 18. The Modern Missions Movement",
        "url": "http:\/\/api.sermonindex.net\/SID18573",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18573-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 19. The Historical Phenomenon of Revival",
        "url": "http:\/\/api.sermonindex.net\/SID18574",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18574-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 2. The Spread of the Gospel & the Apologists",
        "url": "http:\/\/api.sermonindex.net\/SID18557",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18557-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 20. The Welsh & Worldwide Revival of the Early 20th Century",
        "url": "http:\/\/api.sermonindex.net\/SID18575",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18575-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 3. The Montanists",
        "url": "http:\/\/api.sermonindex.net\/SID18558",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18558-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 4. The Conversion of Constantine & Its Aftermath",
        "url": "http:\/\/api.sermonindex.net\/SID18559",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18559-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 5. The Roman Catholic Church & the Papacy",
        "url": "http:\/\/api.sermonindex.net\/SID18560",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18560-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 6. Important Events and Challenges",
        "url": "http:\/\/api.sermonindex.net\/SID18561",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18561-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 7. Important People and Writings",
        "url": "http:\/\/api.sermonindex.net\/SID18562",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18562-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 8. The Need for Reformation & the Pilgrim Church",
        "url": "http:\/\/api.sermonindex.net\/SID18563",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18563-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Christian History) 9. Ideas of Reform and an Early Example of Reform",
        "url": "http:\/\/api.sermonindex.net\/SID18564",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID18564-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Daniel) A Survey of Five World Empires",
        "url": "http:\/\/api.sermonindex.net\/SID10747",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 7",
        "topic": "Vision",
        "description": "Daniel's vision in chapter 7 was probably chronologically between Daniel chaoters 4 and 5.  In this vision the lion depicts the empire of Babylon that overwhelmed it's enemies like a lion overwhelms it's prey, but this lion was brought low and humbled just like Nebuchadnezzar king of Babylon.  The bear depicts the Medo-Persian empire that was slower in conquest than the Babylonian empire but was very crushing in the way it dominated it's enemies, inerestingly Daniel says this beast was raised up on one side and this is because the Persians were more dominant than the Medes' in the alliance.  The third beast is a four winged leopard which shows speed this beast depicts the greek empire under Alexander the great that conquered most of the known world in just 12 years, the beast also has 4 heads and Alexander divided his kingdom between his 4 generals.  The forth beast is different to all other beasts and represents the roman empire, however this beast hasn't been completely destroyed and is still around in the form of the European Union from which David Guzik believes the anitchrist (little horn in this chapter) will arise.  The final empire is the reign of Christ after his scond coming, this kingdom Jesus will give to his saints, notice it is given to them not earned by them.",
        "download": "http:\/\/api.sermonindex.net\/SID10747-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(Daniel) Antiochus and Antichrist",
        "url": "http:\/\/api.sermonindex.net\/SID10748",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 8",
        "topic": "",
        "description": "the Eigth chapter of Daniel is a passage in the Bible so outstanding in it's historical fulfillment that many liberal scholars think that it could not possibly have been written by Daniel because it reveals future events in such detail.  The ram's horns represent the kings of Media and Persia.  The goat represents the grecian empire and it's one mighty horn Alexander the great, who split his kingdom into 4 parts at his death at the age of only 32 years old. Out of these 4 rulers arose 1 called Antiochus Epiphanes who behaved abhorently towards the jews, he defiled the temple by erecting a statue of Zeus and slaughtering a pig on the altar, he was also responsible for the murder of possibly 100,000 Jews, and is called by many comentators'the antichrist of the Old Testament'.  The cultural influence of the greek empire was massive though, and still greatly influences modern thought even more than 2000 years later.  The hand of the Lord was in this huge influence of greek thinking though in that by the time Jesus came to the world the whole of civilization spoke one language, greek, and hence Paul could go anywhere in the civilized world and preach in greek and be understood.",
        "download": "http:\/\/api.sermonindex.net\/SID10748-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "(Daniel) Antiochus and Antichrist Revisited",
        "url": "http:\/\/api.sermonindex.net\/SID10751",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 10-11, Revelation 1:12-16",
        "topic": "Antichrist",
        "description": "Daniel saw a great vision of a man clothed very much like the Lord Jesus at the start of Revelation. In this passage we read of an angel coming to Daniel to answer his prayer on the very day that Daniel lifted his hands up to the Lord God , yet this angel was resisted and hindered by demonic forces within the spirit realm, thus the answer didn't get through to Daniel till the 21st day, this is a great lesson in persistent and prevailing prayer as the answer would not have come to Daniel if he had given up on the 19th day, the angelic messenger was of course helped by Micheal who seems to have a protective role over the nation of Israel.  In the prophetic vision that is revealed to Daniel the king of the north is the king of Syria and the king of the south the king of Egypt, historically these 2 kings were 2 of Alexander the greats generals which have been mentioned before, and Israel was caught inbetween their disputes, this was just before the reign of Antiochus, the antichristn of the Old Testament.",
        "download": "http:\/\/api.sermonindex.net\/SID10751-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Revelation",
                "chapter": "1"
            },
            {
                "book": "Daniel",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "(Daniel) Daniel the Intercessor",
        "url": "http:\/\/api.sermonindex.net\/SID10749",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 9:1-19, Jeremiah 25:11-13, Jeremiah 29:10",
        "topic": "Intercession",
        "description": "Daniel 9 is one of the most incredible prophecies in the whole of the Bible because of it's accuracy in fulfillment, Daniel in this passge is reading his Bible, specifically Jeremiah, he reads about how the people of Israel will go into captivity for 70 years and realises he is living in the fullfilment of that prophecy, Daniel believed the Bible literally and thus the 70 years he read about in the book of Jeremiah he believed was 70 years in reality.  Daniel is moved by what he reads and begins to intercede for the his people, he prays that the Lord would take this 70 years from the first move into captivity in 605BC and not 597BC.  Daniel was the 'chief of staff' for Babylon and still had time to pray in this incredible way, he set his face to seek the Lord and begn to repent for the sins of Israel and he begged the Lord to turn away His anger from His people and for the sake of His own righteousness restore His people.  The Lord answered Daniel's prayer.",
        "download": "http:\/\/api.sermonindex.net\/SID10749-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Jeremiah",
                "chapter": "29"
            },
            {
                "book": "Jeremiah",
                "chapter": "25"
            },
            {
                "book": "Daniel",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(Daniel) In the Lion's Den",
        "url": "http:\/\/api.sermonindex.net\/SID10746",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 6",
        "topic": "Daniel",
        "description": "Darius the Mede was the leader of the army that captured Babylon and killed Belshazzar, he became regent over Babylon under the rule of Cyrus king of Persia. By this time Daniel was probably around 80 years old and yet still had faultless integrity to the degree that the enemies of this man of God couldn't find any skeletons in his closet even after more than 50 years in civil service.  They came to the conclusion that they would only trap Daniel because of his faithfulness to God, so they got Darius to pass a decree that no one should pray to any god except him for 30 days. In the face of this Daniel did the safest thing he could.. exactly what he had always done and stayed faithful to God.  For this Daniel was condemned to be cast into the den of lions, the night he was in the den Darius neither slept nor ate, Daniel prayed as it was his custom to pray 3 times a day.  We find that in this remarkable occasion Daniel was kept due to his habitual lifestyle, he remained faithful to God and the Lord blessed him for it.",
        "download": "http:\/\/api.sermonindex.net\/SID10746-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "(Daniel) Israel's Time of Trouble",
        "url": "http:\/\/api.sermonindex.net\/SID10752",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 12, Revelation 12:13-17",
        "topic": "Jacobs Trouble",
        "description": "The time known as 'Jacobs trouble' will be the worst persecution that has ever befallen the jewish people, which is saying a lot considering they have been the target of satanic persecution all along, and we know the reason for this is due to the fact that the jews are so wrapped up in God's eternal plan.In the midst of this time of persecution there will be a great opportunity to spread the gospel though.  The prophecy laid out here will have it's fulfillment in the end times, it will be a period of 3 and a half years and will be so intense that it will cause the people of Israel to cry out to their Messiah and He will return and defend them from the last onslaught.  Interestingly Pastor Guzik says that 'running to and fro and knowledge shall increase' speaks of the huge explosion in understanding of Biblical prophecy that has occured in the past 100 years.",
        "download": "http:\/\/api.sermonindex.net\/SID10752-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Revelation",
                "chapter": "12"
            },
            {
                "book": "Daniel",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "(Daniel) Nebuchadnezzar's Dream",
        "url": "http:\/\/api.sermonindex.net\/SID10742",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 2",
        "topic": "Nebuchadnezzar",
        "description": "In this chapter of scripture Nebuchadnezzar, king of Babylon, has a dream that deeply disturbs him, and calls for his wisemen to council him about it,  however he wisely also asks them to describe the dream to him then he will know that their interpretation is correct.  The wisemen couldn't answer so the king orders for all his councilers to be executed.  When the captain of the guard arrives at Daniels house, Daniel bravely asks for time to seek the God of Heaven in order to tell the king what he desires to know, the king gives him time and the Lord gives Daniel the answer, so Daniel reveals the dream and interpretation to the king. The gold head represents the Babylonian empire, the silver arms and chest represent the Medo-Persian empire, the bronze belly represents the Greek empire, the Iron legs the Roman empire and the iron and clay feet are yet to be revealed.  One thing is for sure though the Stone not cut with hands that destroys the image is the Lord Jesus whose kingdom will be established forever.",
        "download": "http:\/\/api.sermonindex.net\/SID10742-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "(Daniel) Purity in the Face of Adversity",
        "url": "http:\/\/api.sermonindex.net\/SID10741",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 1",
        "topic": "Adversity",
        "description": "The book of Daniel begins around the year 605BC, the people of Judah are taken captive by Nebuchadnezzar as he is on his way back to Babylon from defeating Necho king of Egypt at the battle of Carchemish. Daniel was amongst these taken as he was one of the young shining lights of the people of Israel, they were taken so that they might be indctrinated into the Babylonian way of thinking and work for the king in his civil service, of course they were also taken as hostages.  The young men of Israle were given new names, each to do with a Babylonian god, a good education and meat from the kings table, this last thing daniel politely refused as eating such things would have made him spiritually impure.  The refusal to eat the food offered could have carried with it a death sentence but Daniel took the responsability upon himself so as not to endanger the chief eunuch, Daniel and his companions gave themselves to the Lord in a remarkable way and the Lord blessed them in return in a remarkable way.",
        "download": "http:\/\/api.sermonindex.net\/SID10741-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(Daniel) The 70 Weeks of Daniel",
        "url": "http:\/\/api.sermonindex.net\/SID10750",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 9: 20-27, Nehemiah 2:1, Luke 19:37-40",
        "topic": "Seventy Weeks",
        "description": "After Daniels great intercession for the nation of Israel the angel Gabriel appears to him and tells him that he is about to be shown a great prophecy.  This is amazingly characteristic of the abundance with which the Lord gives to His people, Daniel has been asking the Lord to show mercy to the nation of Israel yet the Lord does that and more, He answers Daniel's prayer but goes so much further.  Gabriel reveals to Daniel that there will be a period of 490 years that will concern the Jews and particularly the city of Jerusalem.  The prophecy began to be fulfilled in 445BC at the decree of Cyrus to rebuild the city of Jerusalem.  483 Jewish years (360 days) later was the exact that the Lord Jesus rode into Jerusalem on the donkey, but as predicted the Messiah was executed and the temple destoyed.  So we await the fulfillment of Daniels 70th week, when the Antichrist will confirm a covenant with the jews, his people destroyed the temple and Jerusalem before he even came to the world, many believe he will probably be European.",
        "download": "http:\/\/api.sermonindex.net\/SID10750-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "19"
            },
            {
                "book": "Nehemiah",
                "chapter": "2"
            },
            {
                "book": "Daniel",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(Daniel) The Fall and Rise of Nebuchadnezzar",
        "url": "http:\/\/api.sermonindex.net\/SID10744",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 4",
        "topic": "Nebuchadnezzar",
        "description": "Daniel chapter four is unique within the Bible as it is the only portion that was written by a gentile king, and thus could almost be renamed, 'The testimony of Nebuchadnezzar' as it bears witness to what God had done in the life of this great king.  Again he has a disturbing dream and calls for his councillors and yet calls Daniel last, and how is this a type of us today, when trouble comes we go to all the ends of the earth seeking council without asking what God has to say about the situation.  In his dream he sees a great tree that provides everything that the world needs, he then sees an angelic being saying 'cut it down'. Everyone knew what this dream meant yet only Daniel probably with a heavy heart and tears in his eyes would tell the king, Daniel implured him to repent yet even through this he didn't and thus fell mightily he probably went mad and for seven years ate grass like an ox.  Interestingly in secular Babylonian history there is a seven year preiod where there were no royal decrees. This passage teaches us that if we do not humble ourselves then God will do it because He will not share His glory with anyone.",
        "download": "http:\/\/api.sermonindex.net\/SID10744-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(Daniel) The Writing on the Wall",
        "url": "http:\/\/api.sermonindex.net\/SID10745",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 5",
        "topic": "Belshazzer",
        "description": "During the reign of Belshazzar the king, Darius the Mede laid seige to the city of Babylon, Belshazzar though was so unconcerned about this seige that he decided to hold a party for all his friends, this is so common today how the world is teetering on the brink of destruction and eveyone, in the west at least, is partying and concerned with what is on the television.  But God decides to 'crash' this party  and manifests a disembodied hand to write on the wall, this terrifies the king and he calls for Daniel to interpret the writing.  This is a type of how the world seek out the children of God when 'the writing is on their walls'.  Belshazzar offers Daniel riches and power but Daniel isn't interested and rebukes Belshazzar saying that he should have humbled himself like Nebuchadnezzar, but because he hadn't the kingdom would be taken from him and divided, and this was fullfilled that very night when Darius' army stormed Babylon",
        "download": "http:\/\/api.sermonindex.net\/SID10745-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "(Daniel) Wouldn't Bow, Wouldn't Bend, Wouldn't Burn",
        "url": "http:\/\/api.sermonindex.net\/SID10743",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 3",
        "topic": "",
        "description": "The image rasied up by Nebuchadnezzar, was most likely, due to it's dimensions, and obelisk like shape, it was used by the king to test the allegiance of his servants and was most likely a political rather than spiritual device.  The three Hebrew men Shadrach, Meshach and Abednego would not bow to the image as it violated the second commandment, they knew the penalty would probably have resulted in their death yet they obeyed God and not man.  They faced tremendous pressure when brought before the king himself and asked if the allegations of their 'betrayel' were true, they stuck to their ground and told him they wouldn't bow and that God could deliver them even out of Nebuchadnezzars hand.  For this they were cast into the firey furnace, here the original text implies that they began to sing and praise the Lord and Nebuchadnezzar saw the Lord Jesus with them in the midst of the fiery trial, there is nothing in the text to shwo that they saw the Lord there, but He was there and the trial only served to release them from their bondage.",
        "download": "http:\/\/api.sermonindex.net\/SID10743-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "(Hosea) Come, Let Us Return to the Lord",
        "url": "http:\/\/api.sermonindex.net\/SID11030",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 4-6",
        "topic": "Repentance",
        "description": "Israel had sinned greatly against the Lord, they had forsaken the knowledge of God and thus truth and mercy had been lost from them, they thought they knew God and had becom familiar with him but they were wrong and had forgotten His laws and abandonded His ways and no longer submitted to Him.  The priest, whose charge it was to instruct the people in the ways of the ways of the Lord, had neglected their duty and no longer taught the people, for this God held them accountable.  The people of Israel had pushed God away so much that He would no longer warn them of their errors and He acctually departed from them in order to leave them their own devices. God's desire was that Israel would return to Him, and so Hosea wanted to lead the people in repentance towards the Lord for he knew that if the people would seek Him then He would be found of them.",
        "download": "http:\/\/api.sermonindex.net\/SID11030-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "(Hosea) Drawn with Gentle Cords",
        "url": "http:\/\/api.sermonindex.net\/SID11032",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 10-12",
        "topic": "Israel",
        "description": "God had blessed Israel with an abundance of wealth and prosperity but they had squandered His blessing on themselves.  But the LOrd desired to draw Israel back to Himself with His love for them.  The Lord was like a parent to Israel who lovingly draws a child in their first uneasy steps.  Israel however did not want this and kept willfully backsliding away from God, they refused to repent of the sin they were now openly comitting before Him.  But despite this the Lord would not give up on them, He allowed them to go their own way but all the time was patient and longsuffering towards the nation.  This is a great illustration of the mercy and forgiveness of the Lord a thing we should be ever thankful for as He has also shown His great love for us in the death of His Son the Lord Jesus.",
        "download": "http:\/\/api.sermonindex.net\/SID11032-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "(Hosea) Reaping the Whirlwind",
        "url": "http:\/\/api.sermonindex.net\/SID11031",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 7-9",
        "topic": "",
        "description": "The Lord pronounced judgement against the nation of Isral and against it's capital city Samaria.  Hosea likened the nation to an unturned pancake, burnt on one side towards the world and undone or unprepared toward the Lord, hence they were good for nothing neither hot nor cold like the church of Laodicea in Revelation 3.  By this time in their history Israel had become established in their sin and had set up their own ungodly rulers.  Even though they continued to sacrifice to the Lord the Lord no longer accepted the sacrifices as they were given from an unrepentant heart. The southern nation of Judah now tursted in their fortified cities but these cities could not save them from the judgement of God.  These prophecies were given at a time of great material prosperity in the nation of Israel when the people must have thought that the Lord was blessing them but didn't care that their hearts were foul towards Him.",
        "download": "http:\/\/api.sermonindex.net\/SID11031-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "(Hosea) The Prophet and the Prostitute",
        "url": "http:\/\/api.sermonindex.net\/SID11029",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 1-3",
        "topic": "Hosea",
        "description": "Hosea lived in the nation of Judah but his message was to the kings of the northern nation of Israel.  The Lord instructed Hosea to do a very difficult thing, to marry a woman who was a known prostitute, God commanded this because of Israels adultery against Him and He desired to work His word into the life of the prophet.  Hosea was the instructed by the Lord what to name each of his children the first was Jezreel (scattered), the second was Lo-ruhamah (no mercy) the third was Lo-ammi (not my people)  each of these childens names was reminder to all around them that the Lord would scatter the nation of Israel and would not show mercy to them as they no longer wanted to be His people. The Lord showed His love for the people in the life of Hosea in that when his adulterous wife was living with another man Hosea still povided for her, such is the Lord attitude of grace towards us in that even though we go astray He still mercifully provides for us.",
        "download": "http:\/\/api.sermonindex.net\/SID11029-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(Hosea) True Wisdom Turns Us Back to God",
        "url": "http:\/\/api.sermonindex.net\/SID11033",
        "size": "0",
        "format": "mp3",
        "scripture": "Hosea 13-14",
        "topic": "",
        "description": "Israel had been greatly blessed by the Lord and yet as is the way with fallen man at times when the Lord is blessing us most our heart is far from Him, they had engaged in Baal worship and had even gone far enough as to worship Molech, which involved child sacrifice.  They had sent the Lord a message with their actions by showing they would only turn to Him when times where bad, so the Lord promised judgement so they would cry out to Him to save them once more.  The Lord makes great promises of deliverence to Israel even going so far as to say He will conquer death but if they would not turn to Him then they would go into exhile. The book of Hosea ends though not with judgement but with a great proclamation of the grace of God and that how if we would turn to Him with our whole hearts then He will shower us with His great mercies.",
        "download": "http:\/\/api.sermonindex.net\/SID11033-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hosea",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "(Isaiah) A Nation Ripe for Judgment",
        "url": "http:\/\/api.sermonindex.net\/SID10755",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 5-6:7",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10755-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "(Isaiah) All About Satan",
        "url": "http:\/\/api.sermonindex.net\/SID10761",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 14",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10761-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "14"
            }
        ]
    },
    {
        "title": "(Isaiah) Conviction, Cleansing, and Call",
        "url": "http:\/\/api.sermonindex.net\/SID10756",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 6-7",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10756-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "(Isaiah) God’s Word to Drinkers",
        "url": "http:\/\/api.sermonindex.net\/SID10767",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 28",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10767-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "28"
            }
        ]
    },
    {
        "title": "(Isaiah) Hope In the Midst of Judgment",
        "url": "http:\/\/api.sermonindex.net\/SID10753",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 1-2",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10753-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(Isaiah) How to Have Perfect Peace",
        "url": "http:\/\/api.sermonindex.net\/SID10766",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 26-27",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10766-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "26"
            }
        ]
    },
    {
        "title": "(Isaiah) How to Prepare for God’s Judgment",
        "url": "http:\/\/api.sermonindex.net\/SID10757",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 8",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10757-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "(Isaiah) Judgment and Praise in the Great Tribulation",
        "url": "http:\/\/api.sermonindex.net\/SID10765",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 24-25",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10765-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "24"
            }
        ]
    },
    {
        "title": "(Isaiah) Judgment of the Nations",
        "url": "http:\/\/api.sermonindex.net\/SID10763",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 19-21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10763-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "(Isaiah) Our Beautiful King",
        "url": "http:\/\/api.sermonindex.net\/SID10770",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 32-33",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10770-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "32"
            }
        ]
    },
    {
        "title": "(Isaiah) Sin’s Judgment and God’s Restoration",
        "url": "http:\/\/api.sermonindex.net\/SID10754",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 3-4",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10754-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "(Isaiah) The Blessing of Looking to the Lord",
        "url": "http:\/\/api.sermonindex.net\/SID10769",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 30-31",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10769-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "30"
            }
        ]
    },
    {
        "title": "(Isaiah) The Cause & Cure of Spiritual Blindness",
        "url": "http:\/\/api.sermonindex.net\/SID10768",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 29",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10768-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "29"
            }
        ]
    },
    {
        "title": "(Isaiah) The Glory of the Messiah’s Character",
        "url": "http:\/\/api.sermonindex.net\/SID10759",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 10-11",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10759-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "(Isaiah) The Glory of the Messiah’s Reign",
        "url": "http:\/\/api.sermonindex.net\/SID10758",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 9-10:4",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10758-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "(Isaiah) The Highway of Holiness",
        "url": "http:\/\/api.sermonindex.net\/SID10771",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 34-35",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10771-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "34"
            }
        ]
    },
    {
        "title": "(Isaiah) The Pain of the Prophet",
        "url": "http:\/\/api.sermonindex.net\/SID10762",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 15-18",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10762-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "(Isaiah) The Words of a Worshipper",
        "url": "http:\/\/api.sermonindex.net\/SID10760",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 12-13",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10760-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "12"
            }
        ]
    },
    {
        "title": "(Isaiah) What to Hang Your Life On",
        "url": "http:\/\/api.sermonindex.net\/SID10764",
        "size": "0",
        "format": "mp3",
        "scripture": "Isaiah 22-23",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10764-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Isaiah",
                "chapter": "22"
            }
        ]
    },
    {
        "title": "(Joel) Come, Let Us Return to the Lord",
        "url": "http:\/\/api.sermonindex.net\/SID11035",
        "size": "0",
        "format": "mp3",
        "scripture": "Joel 2:21-3:21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11035-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "(Joel) The Day of the Lord Brings Judah Low",
        "url": "http:\/\/api.sermonindex.net\/SID11034",
        "size": "0",
        "format": "mp3",
        "scripture": "Joel 1:1-2:20",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11034-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Joel",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "(Obadiah) How God Deals with Pride",
        "url": "http:\/\/api.sermonindex.net\/SID11039",
        "size": "0",
        "format": "mp3",
        "scripture": "Obadiah 1",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11039-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Obadiah",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "A Confident Answer to An Agonized Plea",
        "url": "http:\/\/api.sermonindex.net\/SID10740",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 6",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10740-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "A Danger Signal: Unanswered Prayer",
        "url": "http:\/\/api.sermonindex.net\/SID6749",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6749-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "A Morning Prayer",
        "url": "http:\/\/api.sermonindex.net\/SID10739",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 5",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10739-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "A Prayer for Revival",
        "url": "http:\/\/api.sermonindex.net\/SID6747",
        "size": "0",
        "format": "mp3",
        "scripture": "Habakkuk 3:2",
        "topic": "",
        "description": "Guzik illustrates how conversion of sinners follows transformation of life, which follows conviction of sin as the Spirit is poured out on the Church.  It is an immensely practical teaching encouraging self-examination and personal restoration to broadening one's prayer life for others.  He tackles theological debates on how revival comes, \"Is it just a soverign work of God?\" or \"Is it the right use of appropriate means?\"  Guzik cited a number of fascinating examples from J. Edwin Orr's book about the Second Great Awakening in Britain.",
        "download": "http:\/\/api.sermonindex.net\/SID6747-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Habakkuk",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "About the Antichrist",
        "url": "http:\/\/api.sermonindex.net\/SID10678",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10678-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Amos 9:13",
        "url": "http:\/\/api.sermonindex.net\/SID11533",
        "size": "0",
        "format": "mp3",
        "scripture": "Amos 9:13",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11533-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Amos",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "Are the Gifts of the Spirit for Today?",
        "url": "http:\/\/api.sermonindex.net\/SID6845",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6845-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "As Secure as You Know How",
        "url": "http:\/\/api.sermonindex.net\/SID10688",
        "size": "0",
        "format": "mp3",
        "scripture": "Matthew 27:65",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10688-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Matthew",
                "chapter": "27"
            }
        ]
    },
    {
        "title": "Break Up Your Fallow Ground",
        "url": "http:\/\/api.sermonindex.net\/SID10691",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10691-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Broken Vows",
        "url": "http:\/\/api.sermonindex.net\/SID6744",
        "size": "0",
        "format": "mp3",
        "scripture": "Acts 5",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6744-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Acts",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Broken Vows",
        "url": "http:\/\/api.sermonindex.net\/SID6844",
        "size": "0",
        "format": "mp3",
        "scripture": "Acts 5",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6844-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Acts",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Caesar and Jesus",
        "url": "http:\/\/api.sermonindex.net\/SID10683",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 2:1-3",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10683-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Christian Combat - God's Armor: What to Have",
        "url": "http:\/\/api.sermonindex.net\/SID6825",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 6:14-15",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6825-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Christian Combat - God's Armor: What to Take",
        "url": "http:\/\/api.sermonindex.net\/SID6826",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 6:16-17",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6826-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Christian Combat - God's Strength and How to Get It",
        "url": "http:\/\/api.sermonindex.net\/SID6822",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians  6:10-11",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6822-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Christian Combat - The Fact and Foe of  Christian Combat",
        "url": "http:\/\/api.sermonindex.net\/SID6823",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 6:12",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6823-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Christian Combat - The Goal of Christian Combat: Stand",
        "url": "http:\/\/api.sermonindex.net\/SID6824",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 6:13",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6824-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Christian Combat - What to do with God's Armor",
        "url": "http:\/\/api.sermonindex.net\/SID6827",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 6:18-20",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6827-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Church Government: Jesus Style and Moses Style",
        "url": "http:\/\/api.sermonindex.net\/SID6841",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6841-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - 19th and 20th Centuries",
        "url": "http:\/\/api.sermonindex.net\/SID6821",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "In this final session David Guzik deals with different trends and movements that have effected the church in tha past 2 centuries, Revival is characterised by 3 main evidences, the church is awakened, sinners are saved in great number and society is impacted, to the extent that jails have closed due to the lack of crime.  Philosophical challenges arose in the enlightenment, which was very man centred, people began to ask how man could improve the world and rationalism became popular and placed mans powers of reason above the Bible.  In this time there was also the rise of scientism, secularism and also theological liberalism which is almost now dead in it's original form as it substitutes feelings for truth.  There were also great social reforms the abolition of slavery, prohibtion and womens rights, the missionary movement really took off in the 19th century as transportation was revolutionised and this lead to the idea that the 20th century would be known as the 'christain century'.",
        "download": "http:\/\/api.sermonindex.net\/SID6821-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - Lutheranism after Luther",
        "url": "http:\/\/api.sermonindex.net\/SID6819",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "After Luther came a man name Phillip Melanchton he differed greatky from Luther in both style and doctrine, Melanchton like Zwingli believed that there was nothing sacred about the bread and wine used in the communion service, Luther was horrified at this a declared the Melanchton was a secret calvinst.  The reformation lead to revolutions in the way people thought and the diea they had but had little initial impact on the way people lived it was because of this the Luther sadly died a discouraged man. The rise of the Anglican church was instigated by Henry VIII in England, who previously had actually written tracts against Luther and reformed thinking and for this reaons was given the Title of 'Defender of the Faith' by the Pope!  However for politcial not theological reasons Henry broke from the chutch of Rome and became head of the Anglican church which was Protestant in theology yet Roman Catholic in ceremony.",
        "download": "http:\/\/api.sermonindex.net\/SID6819-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - Martin Luther & the Anabaptists",
        "url": "http:\/\/api.sermonindex.net\/SID6817",
        "size": "0",
        "format": "mp3",
        "scripture": "1 Timothy 2:5",
        "topic": "",
        "description": "During the reformation Luther revived the doctrine of the priesthood of all believers, and empasised that every man was his own priest and that there is only Jesus Christ between man and God, this inturn lead to the foundations for modern democracy.  While Luther was abscent from his church in Wittenberg he was replaced by his co-pastor who was zealous for reform and implimented the ordinances he read about in the Bible, such as communion.  When Luther returned he rebuked his co-pastor who was only following in Luthers own steps but a bit to energetically for Luther.  The Anabaptists were radical reformers who wanted to reform the quickly they read in the scriptures that the church was a called out peple and thus opposed the movemnts of the time that called for church and state to be united.",
        "download": "http:\/\/api.sermonindex.net\/SID6817-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "1 Timothy",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Church History - Martin Luther & the German  Reformation",
        "url": "http:\/\/api.sermonindex.net\/SID6816",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Luther expected the pope to agree with what he wrote in his 95 Theses and did not expect in the least to break from the church of Rome.  But the Church came and challenged Luther and his beliefs but the more the pushed against him and his theology the more Luther resisted and became convinced of it's truth.  Because of this coubts crept into Luthers mmind, not about what he found in the scriptures but about the pope and the doctrine that were coming out of the church.  In 1521 a council was assembled called 'The Diet of Worms' it was presided over by Emperor Charles V and gave Luther the opertunity to recant what he had written, he didn't.  Luther was released but the Emperor decreed that anyone who helped Luther from then on would be excomunicated, when he returned to Germany he translated the Bible into German, a version which is still used today, a german KJV if you will.  In 1530 Luther was given one last chance to recant he didn't and the division between Catholocism and Lutherism was finalized.",
        "download": "http:\/\/api.sermonindex.net\/SID6816-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - Martin Luther & the Problem of Indulgences",
        "url": "http:\/\/api.sermonindex.net\/SID6815",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 31:1, Romans 1:17",
        "topic": "",
        "description": "Martin Luther was born in Germany to a poor mining family, Luther though excelled at school and studied law at university, he was set to be one of the top legal minds in Europe.  However due to a vow to Saint Barbara, patron saint of miners, he became a monk and applied his legal mind to theology, he saw the Lord as righteous Judge of the whole creation and thus was zealous to live a holy life.  In 1510 he went to Rome, as he was disillusioned with the way the church was in Germany, there he became even more concerned and left declaring that the city was built over Hell itself! He returned to Germany where he became a Bible teacher it was here in preparing for a lesson one day that he read Psalm 31:1 and later Romans 1:17 and realised by faith man can not only be deemed 'not guilty' but actually be seen as righteous before a perfect God.",
        "download": "http:\/\/api.sermonindex.net\/SID6815-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "31"
            },
            {
                "book": "Romans",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Church History - The Apostolic Church (33-100)",
        "url": "http:\/\/api.sermonindex.net\/SID6805",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 1:1-4, Ephesians 2:20",
        "topic": "",
        "description": "Christianity is more a religion based on factual eventsrather than philosophical supposition.  The death and ressurection of the Lord Jesus, the centre point of christianity, were factual events and these are the basis for our faith.  An ancient secular roman historian called Talus confirms the darkness that covered the earth following the death of the Lord Jesus, because he was alive at the time.  F.F. Bruce said that 'Anyone who propagates the idea that Jesus was a myth is neither a historian nor unbiased.' The distice features of the apostolic church were 1: the prescence of the foundational apostles 2:The unprecidented problems and victories of the church 3:The speed with which the Gospel spread 4:The transition of christianity from a branch of judaism to a seperate religion.",
        "download": "http:\/\/api.sermonindex.net\/SID6805-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "1"
            },
            {
                "book": "Ephesians",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Church History - The Christian Empire Part 1 (312-1500)",
        "url": "http:\/\/api.sermonindex.net\/SID6809",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Between the years of 250 and 300ADThere was severe persecution of the church under Diocletian, and yet in 311AD the edict of toleration was put forth that stated that christians now had a right to practice their religion like all other faiths.  Just before he became emperor of Rome Constantine became a christian,  it is told that he saw a cross in the sky and heard a voice saying 'in this sign conquer' he adopted the symobol and won the battle he was facing, whether he was born again or not is still disputed.  He granted religious freedom to all faiths and became personally involved in church controversiessuch as the Arian controversy, which states that Jesus is not equal to God.  Because of Constantines influence christianity became a privileged religion and thus people became 'christian' for social and political gain, this lead to a great problem in the church.",
        "download": "http:\/\/api.sermonindex.net\/SID6809-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Christian Empire Part 2 (312-1500)",
        "url": "http:\/\/api.sermonindex.net\/SID6810",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "After Constantine became emperor of Rome in 313AD, christianity went from being persecuted to prefered among the roman people, this led to the church being diluted as there were now social and political advantages to being a 'christian'.  This influx on non-christians into christian circles led to 'true' christians seeking seperation from the church which led to the beginning of monasticism, but this in turn led to a false sense of spirituality, however there were some monastic movements that were very evangelistic. Another 'movement' that arose in the church at this time was the Roman Catholic church, this denomination came about when the bishop of Rome (which was the most powerful and influential city at the time) was declared by the emperor to have more spiritual authority than all other bishops.  Later in 590AD Pope Gregory I was not only the spiritual leader of Rome but also the political leader this came about when the Roman empire fell the pope stepped into the vacuum left. This was when the church of Rome began to gain more and more power.",
        "download": "http:\/\/api.sermonindex.net\/SID6810-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Christian Empire Part 3 (312-1500)",
        "url": "http:\/\/api.sermonindex.net\/SID6811",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "This session deals with some of the hersies that arose in the church before 500AD, in the early 4th century Arius, a respected theologian, taught that Jesus was actually the highest created being and not equal to God, this lead to the council of Nicaea in 325AD, which involved 300 bishops from around the known world gathering to discuss the ideas of Arius. The concil voted 298 - 2 against Arius and Nicene creed was established, declaring Jesus to be God. In 450AD the council of Chalcedon was held to discuss the human nature of Jesus, this council determined correcvctly that Jesus was both fully God and fully man. Islam arose in the 7th century and within 100 years of Muhammad's death Islam streched across much of what was the roman empire, the christian empire had been split in 2 by this time with 2 centre, Rome and Constantinople, eventually Constantinople fell to Islam.  In 1095 Pope Urban II launched the first crusade to retake the holy land from islamic turks.",
        "download": "http:\/\/api.sermonindex.net\/SID6811-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Early Church Part 1 (100-312)",
        "url": "http:\/\/api.sermonindex.net\/SID6806",
        "size": "0",
        "format": "mp3",
        "scripture": "Titus 1:5",
        "topic": "",
        "description": "In this period of church history there were no church buildings as we know them, the early christians met in houses, not because it was more spiritual, but becuase of necessity, interestingly the reason they met in the catacombs of Rome was most likely to remember those who were martyred.  Their meetings were presided over by an elder or pastor who in turn was presided over by a local 'bishop', literally overseer, who would preside over all the church gatherings an example of a bishop would have been Titus who was told by Paul to appoint elders.  Again in this age of the church there was rapid church growth and the gosepl went as far as India Ethiopia and England. But these were times where the church was under great pressure as persecution was rife and suspicion and fear everywhere.",
        "download": "http:\/\/api.sermonindex.net\/SID6806-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Titus",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Church History - The Early Church Part 2 (100-312)",
        "url": "http:\/\/api.sermonindex.net\/SID6807",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "This session deals with what the early church believed, the early church believed what the early church fathers believed, this can be seen in several different sources, first the apostles creed is very good way of discovereing what the church believed.  The early church also believed what was written in the new testament writtings and around the year 220AD there arose a need, because of the arising heresies for a collection of writings that was to be authorative above all other christain writings, these writings were detrermined by three factors. 1: It had to have been written by an apostle or someone in direct contact with one of the apostles. 2: It had to have inherent character and worthiness that was in line with accepted scriptures. 3: I must have been widely recognised by the church at large.",
        "download": "http:\/\/api.sermonindex.net\/SID6807-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Early Church Part 3 (100-312)",
        "url": "http:\/\/api.sermonindex.net\/SID6808",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "This session deals with the effect of geography on church government and theology and some of the prominent people at the time; There were 4 prominent or 'Patriarchal' churches that arose in this era of history, these were the church of Rome, Antioch, Jerusalem and Alexandria, when ever a problem arose in a local church that church would seek council from one of these prominent churches.  Church theology was also influenced by geography for example the church at Alexandria was largely influenced by greek thinking. Some prominent figures were: Clement of Rome who believed in apostolic succession.  Hermas who wrote 'The Shepherd' which was a very popular book of the time.  Polycarp who was a disciple of the apostle John and fiercely confronted heretics, he was martyred.  Justin Martyr was an early apologist and of course was martyred.  Origen who actually mutilated his own body due to fanatacism, although he was a good man his method of interpretting scripture did a lot of damage.",
        "download": "http:\/\/api.sermonindex.net\/SID6808-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Early Reformers Part 1 (Waldo & Wycliffe)",
        "url": "http:\/\/api.sermonindex.net\/SID6813",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "There are two different types of reform, the first is prophetic reform which is forward looking where a man of God will arrive on the scene to proclaim a new era of God,s working with humanity, an example of this would be John the baptist.  The second type of reform is apostolic reform which is backward looking and looks at how the church used to be and then get back to that way of things, this was the type of reform that the Reformation was. Peter Waldo in France paid a priest to translate the latin Bible into french so he could read it easier, this revolutionised his life as he finally could understand what the Bible was saying, because of this though reading of the Bible was outlawed for all non-clergy. John Wycliffe in England taught at Oxford university and supported the king of England against the pope. He disagreed greatly with transubstantiation and believed the Bible to be the ultimate authority, for this reason he translated the Bible into english.",
        "download": "http:\/\/api.sermonindex.net\/SID6813-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Early Reformers Part 2 (Hus &  Erasmus)",
        "url": "http:\/\/api.sermonindex.net\/SID6814",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "John Hus was greatly influenced by John Wycliffe, he was a roman catholic preist but was impacted by two cartoons he saw that compared the Lord Jesus to the pope, he preached in his church in Prague in the common language that the avereage person could understand and not in latin.  He had disagreements with the church over not giving the cup of communion to the laity, he believed the Bible to be the hiehest authority and not the pope, he condemned the idols adorning churches and the selling of indulgences.  For these beliefs he was excommunicated and brought to Rome under the pretence that he woudl recieve a fair hearing, he didn't and was condemned to death and burnt at the stake. Desiderius Erasmus was a scholar who wanted to reform the church for moral and schollarly reasons, he lived around the same time as Luther and translated the new testament back into it's original language of greek.",
        "download": "http:\/\/api.sermonindex.net\/SID6814-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - The Need for Reformation",
        "url": "http:\/\/api.sermonindex.net\/SID6812",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Over the centuries a great schism grew between the ruling kings and power hungry popes, eventually it got the point where disgruntled kings set up their own pope who was excomunicated by the first but the new pope excomunicated the other pope in return, eventually everyone involved became sick of the fighting and set up a coucil to determine who was the true pope, but to no avail, the great schism showed up the political nature of the papacy. In 1492 King Ferdinand of Spain established the spanish inquisition, one of the first things the inquisition did was to expel all jews and muslims out of Spain thus meaning everyone left was 'christian' and therefore under their jurisdiction. The popes by now also reigned as emperors but were corrupt an immoral, more interested in political power and wealth than spirituality, an example of this was that people could pay to be made bishops and cardinals.  The 'church' at this time was so corrupt that something had to happen.",
        "download": "http:\/\/api.sermonindex.net\/SID6812-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Church History - Zwingli, Calvin, & the  Counter-Reformation",
        "url": "http:\/\/api.sermonindex.net\/SID6818",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Ulrich Zwingli was a swiss reformer before the time of John Clavin, he was a priest and a co-reformer with Luther, like Luther, Zwingli also persecuted the Anabaptists and then later died in the protestant \/ catholic wars that began. John Calvin was a second generation reformer, he was schollarly and an excellent organiser, although he was french in origin Calvin pastored a church in Geneva which is still there today, the Geneva that Calvin lived in was amazing as the majority of people living there were born again christians. In 1564 at the Council of Trent the counter-reformation began it was an ecumenical council where the Roman Catholic church invited the portestants to attend, but they were'nt invited to debate doctrine but to repent for their abandoning the the church Church of Rome, the Council declared that that Church of Rome was infallible and that they were the only body who were allowed to interpret the BIble.",
        "download": "http:\/\/api.sermonindex.net\/SID6818-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Confession and Fellowship",
        "url": "http:\/\/api.sermonindex.net\/SID6752",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6752-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Confession: Giving Glory to God",
        "url": "http:\/\/api.sermonindex.net\/SID6754",
        "size": "0",
        "format": "mp3",
        "scripture": "Joshua 7:1-21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6754-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Joshua",
                "chapter": "7"
            }
        ]
    },
    {
        "title": "Do Good People Go to Heaven?",
        "url": "http:\/\/api.sermonindex.net\/SID10665",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10665-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Drawing Near or Drawing Back?",
        "url": "http:\/\/api.sermonindex.net\/SID6843",
        "size": "0",
        "format": "mp3",
        "scripture": "Hebrews 10",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6843-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hebrews",
                "chapter": "10"
            }
        ]
    },
    {
        "title": "Enemies in Ministry",
        "url": "http:\/\/api.sermonindex.net\/SID6840",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Samuel 1",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6840-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Samuel",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Fellowship Facts",
        "url": "http:\/\/api.sermonindex.net\/SID6753",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6753-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Forgiveness",
        "url": "http:\/\/api.sermonindex.net\/SID6758",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6758-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "From Genesis to Jesus",
        "url": "http:\/\/api.sermonindex.net\/SID6839",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6839-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "He Tabernacled Among Us",
        "url": "http:\/\/api.sermonindex.net\/SID10681",
        "size": "0",
        "format": "mp3",
        "scripture": "John 1:14",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10681-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "John",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "His Poverty, Our Riches",
        "url": "http:\/\/api.sermonindex.net\/SID10684",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Corinthians 8:9",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10684-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Corinthians",
                "chapter": "8"
            }
        ]
    },
    {
        "title": "How Could God Allow This?",
        "url": "http:\/\/api.sermonindex.net\/SID10668",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10668-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "How to Pray for Revival",
        "url": "http:\/\/api.sermonindex.net\/SID6745",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 85:1-6,Acts 2:1-4",
        "topic": "",
        "description": "Guzik teaches not only how to pray for revival but when and what to pray.  In addition his careful handling of God's Word, he cites pertinent and interesting examples from revivals from the not-so-distant past such as James McGrady in 1800, the American revival of 1858 and the Welsh revival in early 1900's.  He deals with misconceptions of praying only for leaders and not whole congregations, pointing out from Acts how the Holy Spirit fills both individuals and entire congregations.  Guzik appeals to let go of the 'machinery' of men to earnestly seek God in prayer for 'a unique stirring of the Spirit of God' in our day!",
        "download": "http:\/\/api.sermonindex.net\/SID6745-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "85"
            },
            {
                "book": "Acts",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Is Jesus the Only Way?",
        "url": "http:\/\/api.sermonindex.net\/SID10666",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10666-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Jesus Before Bethlehem",
        "url": "http:\/\/api.sermonindex.net\/SID10682",
        "size": "0",
        "format": "mp3",
        "scripture": "Micah 5:2",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10682-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Micah",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Jesus Of Nazareth",
        "url": "http:\/\/api.sermonindex.net\/SID19029",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Nazareth",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID19029-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Jesus in the Center",
        "url": "http:\/\/api.sermonindex.net\/SID10687",
        "size": "0",
        "format": "mp3",
        "scripture": "John 19:16-17",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10687-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "John",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "Mark 8:34-9:13 - The Cross & the Glory",
        "url": "http:\/\/api.sermonindex.net\/SID13010",
        "size": "0",
        "format": "mp3",
        "scripture": "Mark 8:34-9:13",
        "topic": "",
        "description": "Do you know the difference between denying self and self-denial?  You can live the Christian life in such a way of depriving yourself of certain things yet all the while so that your own self can be just as exalted as ever.  \"Cross-bearers,\" affirms David Guzik, \" will be glory-receivers.\"  This taking up of our cross does not necessary mean a martyr's death, but it is a calling to a martyr's life.",
        "download": "http:\/\/api.sermonindex.net\/SID13010-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Master of the House",
        "url": "http:\/\/api.sermonindex.net\/SID10690",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 24:13-35",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10690-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "24"
            }
        ]
    },
    {
        "title": "Opening the Closed Heart",
        "url": "http:\/\/api.sermonindex.net\/SID6757",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Corinthians 6:11-13",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6757-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "2 Corinthians",
                "chapter": "6"
            }
        ]
    },
    {
        "title": "Outside the Gate",
        "url": "http:\/\/api.sermonindex.net\/SID10685",
        "size": "0",
        "format": "mp3",
        "scripture": "Hebrews 13:12-14",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10685-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Hebrews",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "Peace in the Midst of the Storm",
        "url": "http:\/\/api.sermonindex.net\/SID10737",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 3",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10737-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "Question and Answer Evening - 7\/31\/02",
        "url": "http:\/\/api.sermonindex.net\/SID6847",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6847-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Revelation - Chapter 1",
        "url": "http:\/\/api.sermonindex.net\/SID19066",
        "size": "0",
        "format": "mp3",
        "scripture": "Revelation 1",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID19066-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Revelation",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Ruth - Chapter 1",
        "url": "http:\/\/api.sermonindex.net\/SID19067",
        "size": "0",
        "format": "mp3",
        "scripture": "Ruth 1",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID19067-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ruth",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Sanctification Three Ways",
        "url": "http:\/\/api.sermonindex.net\/SID6750",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6750-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Talking to God and Men",
        "url": "http:\/\/api.sermonindex.net\/SID10738",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 4",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10738-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "4"
            }
        ]
    },
    {
        "title": "The Battle for Grace and Graciousness",
        "url": "http:\/\/api.sermonindex.net\/SID6837",
        "size": "0",
        "format": "mp3",
        "scripture": "Acts 15",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6837-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Acts",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "The Call to Faith",
        "url": "http:\/\/api.sermonindex.net\/SID10670",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10670-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Call to Faithfulness",
        "url": "http:\/\/api.sermonindex.net\/SID10672",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10672-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Call to Follow",
        "url": "http:\/\/api.sermonindex.net\/SID10671",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10671-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Call to Fruitfulness",
        "url": "http:\/\/api.sermonindex.net\/SID10673",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10673-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Defeated Christian Life",
        "url": "http:\/\/api.sermonindex.net\/SID6755",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6755-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Essential Work of the Holy Spirit",
        "url": "http:\/\/api.sermonindex.net\/SID6748",
        "size": "0",
        "format": "mp3",
        "scripture": "John 16:7-11",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6748-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "John",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "The First Word of the Gospel",
        "url": "http:\/\/api.sermonindex.net\/SID6756",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6756-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Man of the Millennium",
        "url": "http:\/\/api.sermonindex.net\/SID10689",
        "size": "0",
        "format": "mp3",
        "scripture": "John 19:5",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10689-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "John",
                "chapter": "19"
            }
        ]
    },
    {
        "title": "The Meaning of the Millennium",
        "url": "http:\/\/api.sermonindex.net\/SID10679",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10679-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Prince of Life",
        "url": "http:\/\/api.sermonindex.net\/SID10686",
        "size": "0",
        "format": "mp3",
        "scripture": "Acts 3:15",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10686-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Acts",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "The Reign of the Lord's Anointed",
        "url": "http:\/\/api.sermonindex.net\/SID10736",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 2",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10736-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "The Sense of Salvation",
        "url": "http:\/\/api.sermonindex.net\/SID6746",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6746-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Seventy Weeks of Daniel",
        "url": "http:\/\/api.sermonindex.net\/SID10675",
        "size": "0",
        "format": "mp3",
        "scripture": "Daniel 9",
        "topic": "Seventy Weeks",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10675-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Daniel",
                "chapter": "9"
            }
        ]
    },
    {
        "title": "The Story of Esther",
        "url": "http:\/\/api.sermonindex.net\/SID11715",
        "size": "0",
        "format": "mp3",
        "scripture": "Esther",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID11715-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Truth of the Pre-Tribulation Rapture (1)",
        "url": "http:\/\/api.sermonindex.net\/SID10676",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10676-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Truth of the Pre-Tribulation Rapture (2)",
        "url": "http:\/\/api.sermonindex.net\/SID10677",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10677-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "The Way of the Righteous & the Way of the Ungodly",
        "url": "http:\/\/api.sermonindex.net\/SID10735",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 1",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10735-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "Two Kings",
        "url": "http:\/\/api.sermonindex.net\/SID10680",
        "size": "0",
        "format": "mp3",
        "scripture": "Luke 2:1-3",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10680-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Luke",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "Understanding Marriage - Oneness in Marriage",
        "url": "http:\/\/api.sermonindex.net\/SID6835",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:28-32",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6835-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - Reasons for a Wife's Submission",
        "url": "http:\/\/api.sermonindex.net\/SID6832",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:22-24",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6832-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - Spiritual Preparation for Marriage",
        "url": "http:\/\/api.sermonindex.net\/SID6829",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:14-21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6829-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - Submission in Marriage",
        "url": "http:\/\/api.sermonindex.net\/SID6831",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:22-24",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6831-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - The Transformed Marriage",
        "url": "http:\/\/api.sermonindex.net\/SID6836",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:33",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6836-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - Two Big Ideas",
        "url": "http:\/\/api.sermonindex.net\/SID6828",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6828-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Understanding Marriage - What Love Is",
        "url": "http:\/\/api.sermonindex.net\/SID6833",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:25",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6833-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "Understanding Marriage - What Submission Is",
        "url": "http:\/\/api.sermonindex.net\/SID6830",
        "size": "0",
        "format": "mp3",
        "scripture": "Ephesians 5:21",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6830-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Ephesians",
                "chapter": "5"
            }
        ]
    },
    {
        "title": "What About Those Who Never Hear?",
        "url": "http:\/\/api.sermonindex.net\/SID10667",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10667-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "What is the Baptism of the Holy Spirit?",
        "url": "http:\/\/api.sermonindex.net\/SID10669",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10669-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Wholly Following the Lord",
        "url": "http:\/\/api.sermonindex.net\/SID6751",
        "size": "0",
        "format": "mp3",
        "scripture": "Numbers 32:11-12",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6751-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Numbers",
                "chapter": "32"
            }
        ]
    },
    {
        "title": "Why I Believe Jesus is Coming Soon",
        "url": "http:\/\/api.sermonindex.net\/SID10674",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID10674-download",
        "speaker_name": "David Guzik",
        "_scripture": []
    },
    {
        "title": "Why You Were Saved (a brief devotional)",
        "url": "http:\/\/api.sermonindex.net\/SID6842",
        "size": "0",
        "format": "mp3",
        "scripture": "Psalm 27",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID6842-download",
        "speaker_name": "David Guzik",
        "_scripture": [
            {
                "book": "Psalms",
                "chapter": "27"
            }
        ]
    }
]