[
    {
        "title": "A Little Bit of Egypt",
        "url": "http:\/\/api.sermonindex.net\/SID10124",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Brother Robert shares on the life of Lot and how he had a taste of Egypt and that turned his focus from seeking God in the mountains to living in Sodom. Which way is your tent facing, Egypt or the tabernacle? A solemn warning that your children can't survive if you are living a lukewarm life.",
        "download": "http:\/\/api.sermonindex.net\/SID10124-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "An Introduction to Charles G. Finney",
        "url": "http:\/\/api.sermonindex.net\/SID4034",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Neither of his parents were religious, and among his neighbors there were very few religious people. He seldom heard a sermon unless it was from some unlearned preacher whom the people would leave with irrepressible laughter after enduring his sermons. It was from this setting that God raised up a root out of a dry ground. A man that would later coin these compelling words; “Revival comes from heaven when heroic souls enter the conflict determined to win or die- or if need be, to win and die!",
        "download": "http:\/\/api.sermonindex.net\/SID4034-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Getting Back to Basics: Fishers of Men",
        "url": "http:\/\/api.sermonindex.net\/SID3769",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "When Jesus passes by the disciples he said to them \"Follow me and I will make you to become fishers of men.\" This means that we forsake the plans that we have for our lives and turn everything over to Christ. In this section we discuss serving the god of Mammon. What does it mean to make mammon serve God? What is one of the greatest characteristics of genuine compassion? Through this lesson you will be challenged to rethink your attitude as a Christian and especially as it pertains to the way in which you handle GOD's money- as you are bought with a price and are now HIS possession.",
        "download": "http:\/\/api.sermonindex.net\/SID3769-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Getting Back to Basics: Genuine Repentance",
        "url": "http:\/\/api.sermonindex.net\/SID3915",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "What does it mean to truly repent? How much 'light' are we accountable for before God? How many times has God reminded us to repent in our lifetime? There was never a nation that has had as much light as we have in the West. Churches on every hand, Christians TV, radio, billboards, bumper stickers, etc. The reminders to REPENT are everywhere. Have we taken heed to these warnings? What will God do to a generation that knew as much about God as this one- yet they refuse to repent?",
        "download": "http:\/\/api.sermonindex.net\/SID3915-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Getting Back to Basics: Survival of the Revival",
        "url": "http:\/\/api.sermonindex.net\/SID3768",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "What do we want to see in a revival in modern times? What are the excesses of revivals of past generations? What will it take to keep a revival fire sustained? In this section we will explore various areas that threaten a revival. We will discuss what the anointing of God is for. Does God anoint His people so they can \"feel good\" or other types of manifestations? What happens when a person refuses to take the revival fires out into the fields for work? What is the 'diet' of a revivalist? What is the lifestyle of a revivalist? These and other like issues are discussed in this message.",
        "download": "http:\/\/api.sermonindex.net\/SID3768-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Getting Back to Basics: The Love We Had At First",
        "url": "http:\/\/api.sermonindex.net\/SID3795",
        "size": "42934272",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "Do you remember the love you had for God when you first saved? Do you remember how much you thought about God? How often would you read your Bible and talk to others about God? This 'first love' experience in God begins to die down when we stop doing the things we did at first. Jesus commands the church at Ephesus to repent. It was not enough to have the this church love doctrine or hate sin. The church at Ephesus was taught the love of God more than any other church bar none. Paul wrote I Corinthians 13 from Ephesus and John the Revelator spent much time their also. So what should we make of the words of Christ \"They have left their first love.\" In this message we discuss getting back to the love we had at FIRST for God.",
        "download": "http:\/\/api.sermonindex.net\/SID3795-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Memoirs of the Revivalist",
        "url": "http:\/\/api.sermonindex.net\/SID4040",
        "size": "4513792",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "When men and women prevail in prayer to God and preach with eternity in their eyes revival often follows. What are the results of a man who preached as if He loved the Lord His God with all his heart and his neighbor as himself? Charles Finney accounts of one of his meetings, “At first they looked angry. Some of them said later that they were on the point of getting up and leaving. But I followed them up on the track of their prayers and confessions, until the leading elder burst into tears and exclaimed, \"Brother Finney, it's all true!\" He fell to his knees and wept aloud. This was the signal for a general breaking. Every man and woman went down on their knees.“",
        "download": "http:\/\/api.sermonindex.net\/SID4040-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Overwhelming Conviction",
        "url": "http:\/\/api.sermonindex.net\/SID4174",
        "size": "5595136",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "How ought men to react to the revelation of their sin before God? What horror comes upon the mind when one realizes they have been trodding Christ under foot? When God pours out of His Spirit upon the people- there are times when even the lightest mention of these things will drive men and women to their knees before God. Charles Finney writes, “I arose and was making some remarks to the people, when an unconverted man, a merchant, came into the meeting. He had sat but a few moments, when he fell from his seat as if he had been shot. He writhed and groaned in a terrible manner. I stepped to the pew door, and saw that it was altogether an agony of mind.” These and many other accounts of the revival at Rome will we discuss in this session.",
        "download": "http:\/\/api.sermonindex.net\/SID4174-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "The 7 Myth's of Repentance - Part III",
        "url": "http:\/\/api.sermonindex.net\/SID4021",
        "size": "4998656",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "When you think about repentance what are some of the evidences you should look for? Are tears a good indicator that a person has repented? What happens if I am ‘repenting’ to avoid the consequences of my sins? What if I do a whole bunch of good deeds after I sinned; does that mean I repented? In this discussion we will discover that repentance is more than tears, penitence, or any other outward expression. There are many misconceptions about repentance. In this session we will examine 7 myths concerning repentance.",
        "download": "http:\/\/api.sermonindex.net\/SID4021-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "The Conviction We Need",
        "url": "http:\/\/api.sermonindex.net\/SID4046",
        "size": "6728704",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "If we are ever to see revival in our lands we must pray for an outpouring of Holy Ghost conviction. We need conviction of sin the likes of which has not been felt in decades. Charles G. Finney recounts such conviction. He writes, “After a few moments, I requested the congregation to sit still, while I should go down and speak with the man. I found him to be this Mr. E, of whom I have been speaking. The Spirit of the Lord had so powerfully convicted him, that he was unable to sit on his seat. He was weeping aloud like a child confessing his sins, and accusing himself in a terrible manner. I said a few words to him, to which he seemed to pay but little attention.“",
        "download": "http:\/\/api.sermonindex.net\/SID4046-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "The Dangers Of Irreverence Before God",
        "url": "http:\/\/api.sermonindex.net\/SID26006",
        "size": "0",
        "format": "mp3",
        "scripture": "2 Timothy 2:10-22, Numbers 16",
        "topic": "Irreverence",
        "description": "This sermon explores the danger of irreverence towards God in our associations and in ministry. There will always be people among us who desire to go back to \"Egypt.\" To them it is the land flowing with milk and honey. We must avoid their irreverant and profane words. We must avoid them and their influence. That is, we must \"purge ourselves of these\" in order to be pure and useful to God. In fact, Paul references the rebellion of Korah in 2 Timothy 2:19ff. as an example of God's estimate of this type of sin and rebellion.",
        "download": "http:\/\/api.sermonindex.net\/SID26006-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "2 Timothy",
                "chapter": "2"
            },
            {
                "book": "Numbers",
                "chapter": "16"
            }
        ]
    },
    {
        "title": "The Dispensation of the Gospel - Lesson 1",
        "url": "http:\/\/api.sermonindex.net\/SID6761",
        "size": "0",
        "format": "mp3",
        "scripture": "John 3:3",
        "topic": "",
        "description": "THE GENUINE BORN AGAIN EXPERIENCE, TEXT. Jesus answered and said unto him, Verily, verily, I say unto thee, Except a man be born again, he cannot see the kingdom of God. (John 3:3 KJV) Salvation is the process by which a person is gloriously transformed from being a child of disobedience to a child of God. The children of disobedience are lost and have a different spirit than the saved. The lost live according to the ways of this world and according to the Prince of the Power of the Air (Ephesians 2:2). Those who have been born of water only are fleshly (carnal); but those who have been born of the Holy Spirit are spiritual. Unless a person is born again of the Spirit they cannot see the Kingdom of God, neither in this world or the world to come.",
        "download": "http:\/\/api.sermonindex.net\/SID6761-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "John",
                "chapter": "3"
            }
        ]
    },
    {
        "title": "The Dispensation of the Gospel - Lesson 2",
        "url": "http:\/\/api.sermonindex.net\/SID6779",
        "size": "0",
        "format": "mp3",
        "scripture": "Galatians 2:20",
        "topic": "",
        "description": "TEXT. I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me. (Gal. 2:20) The natural state of man apart from the born again experience is pure selfishness. It is selfishness without mixture. Charles G. Finney defined selfishness as “regarding one's own happiness supremely, and seeking one's own good because it is his own.” The selfish places his\/her happiness above all other interests and especially the glory of God. This selfishness is at the core of sin and must be crucified with Christ. Being crucified with Christ renders one free from sin and dead to sin.",
        "download": "http:\/\/api.sermonindex.net\/SID6779-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "Galatians",
                "chapter": "2"
            }
        ]
    },
    {
        "title": "The Dispensation of the Gospel - Lesson 3",
        "url": "http:\/\/api.sermonindex.net\/SID6804",
        "size": "0",
        "format": "mp3",
        "scripture": "Matthew 1:21",
        "topic": "",
        "description": "TEXT. And she shall bring forth a son, and thou shalt call his name JESUS: for he shall save his people from their sins. (Matthew 1:21) There is a change of heart that accompanies the genuine born again experience in which sin is no longer viewed as a means to gratification or happiness. Sin is seen as the means of death that is the source of all evil, pain, and suffering. Unrepentant sinners are proficient in sin through their own vain imaginations coupled with the various inventions of others. In contrast, the born again understand that they cannot be saved from hell until they are first saved from sin. Sin is not their friend. Satan is not their friend. The world is not their friend. They realize that sin is forgiven when it is repented of and not while persisted in. The purpose of God in saving man was not to abolish the law and allow man to sin with impunity; that would be antinomianism (lawlessness). The purpose was to establish the absolute Lordship of Jesus Christ as we walk in the Spirit in harmony with the personality of God.",
        "download": "http:\/\/api.sermonindex.net\/SID6804-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "Matthew",
                "chapter": "1"
            }
        ]
    },
    {
        "title": "The Dispensation of the Gospel - Lesson 4",
        "url": "http:\/\/api.sermonindex.net\/SID7096",
        "size": "0",
        "format": "mp3",
        "scripture": "Matthew 15:9-10",
        "topic": "",
        "description": "At the root of all spiritual declension (backsliding) is an inaccurate and unworthy conception of the character of God and an over estimate of man. Matthew 15:9,10 is a reference to Isaiah 29:13, which tells of a time when the leaders in Israel were teaching the fear of the LORD by the precept of men. In our times, like in the days of Israel, something has been lost in the Body of Christ and it is the reverence for a Holy God. Many do not fear Him. They have a Satanic pride and arrogance birthed from a Gospel of Humanism. Men worship a ‘God’ of their own making; a God who they feel is a means to their own end.",
        "download": "http:\/\/api.sermonindex.net\/SID7096-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "Matthew",
                "chapter": "15"
            }
        ]
    },
    {
        "title": "The Life that pleases God",
        "url": "http:\/\/api.sermonindex.net\/SID7841",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID7841-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": []
    },
    {
        "title": "Victory 101",
        "url": "http:\/\/api.sermonindex.net\/SID4223",
        "size": "0",
        "format": "mp3",
        "scripture": "Hebrews 5:14,Hebrews 12:1,Galatians 6:7-8",
        "topic": "",
        "description": "How serious are you about VICTORY over sin? Are you tired of falling to temptation? Are you tired of the horrible feeling of failing God over and over again? Have you removed the stepping-stones to sin? Have you burned the plow and the oxen? Or are you telling yourself you can handle certain weights in your life? When you see sin as God sees it you will hate it and be repulsed by it. You will do whatever it takes to keep sin from gaining an advantage over you. In this message we explore an essential key to achieving victory in your life.",
        "download": "http:\/\/api.sermonindex.net\/SID4223-download",
        "speaker_name": "Robert Wurtz II",
        "_scripture": [
            {
                "book": "Hebrews",
                "chapter": "5"
            },
            {
                "book": "Hebrews",
                "chapter": "12"
            },
            {
                "book": "Galatians",
                "chapter": "6"
            }
        ]
    }
]