[
    {
        "title": "God's Truth About Alliances",
        "url": "http:\/\/api.sermonindex.net\/SID9347",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Alliance",
        "description": "What is meant by an alliance relationship? We cannot and should not align ourselves with those who are not Christians. God gives us specific reasons for this. If we become unequally yoked with an unbeliever, we are stepping outside of the will of God and God's power will no longer be with us. Another reason is that we cannot walk in two different directions at once. We cannot follow Satan and God. We need to ask ourselves who we are aligned with.",
        "download": "http:\/\/api.sermonindex.net\/SID9347-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Alliances (Part 2)",
        "url": "http:\/\/api.sermonindex.net\/SID9348",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Alliance",
        "description": "Unequal yoking is a principle God presents throughout both the Old and New Testaments. As we look at some of the consequences of unequal yoking, we will see why God has warned his people against it. What does it mean to be in an alliance with marriage partners, business partners and as nations? We must be careful to acquaint ourselves with God's Word concerning these binding relationships, lest we enter into a partnership that is not pleasing to God.",
        "download": "http:\/\/api.sermonindex.net\/SID9348-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Alliances: Dating",
        "url": "http:\/\/api.sermonindex.net\/SID9349",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Dating",
        "description": "The Scripture lays out principles for us to follow concerning the dating relationship. As we go through this lesson, we are reminded that God's goals for relationships are spiritual in nature. As parents we are to teach our children about relationships, starting with godly friendship. We, as parents, are also responsible for controlling who our children date. What questions ought we to ask concerning the ones our children are interested in dating? How do we go about giving our children a road map of conviction they can follow during their teen years? What is the parent's responsibility? What is the child's responsibility? We will see that God has many principles regarding dating.",
        "download": "http:\/\/api.sermonindex.net\/SID9349-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About God's Word",
        "url": "http:\/\/api.sermonindex.net\/SID9344",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Word Of God",
        "description": "The objective of this lesson is to examine seven basic truths bout the Scripture which make Satan's lie, that God's Word is not infallible, the most unbelievable lie yet. What convictions should we have concerning the Word of God? How can spending time in the Word of God change our lives? The rest of our lives can be the best of our lives, if for the whole of our lives, we build it around the only three things that last. What are they? The Word of God, the Word of God, the Word of God.",
        "download": "http:\/\/api.sermonindex.net\/SID9344-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Heroes",
        "url": "http:\/\/api.sermonindex.net\/SID9346",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Heroes",
        "description": "Every generation has its heroes. Who are this generation's heroes? In this lesson we will look at Satan's lie and God's truth about the heroes of our generation. It seems that Satan's heroes prove that their is something supernatural apart from God. He wants to glorify that which is physical; he tries to get us to believe in new heroes whose moral conduct is not acceptable in God's sight.",
        "download": "http:\/\/api.sermonindex.net\/SID9346-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Marriage And Divorce",
        "url": "http:\/\/api.sermonindex.net\/SID9339",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Divorce",
        "description": "In this study of Satan's lies and God's truths, we look at what God has to say concerning marriage and divorce. The world has bombarded us with messages that tell us that sex outside of marriage is fine, that marriage isn't always lasting, and that divorce is an option. God, however, has laid down principles in His Word that we must agree upon. God has a plan for marriage and He did not design divorce as an option.",
        "download": "http:\/\/api.sermonindex.net\/SID9339-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Responsibility",
        "url": "http:\/\/api.sermonindex.net\/SID9345",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Responsibility",
        "description": "Who is to blame for our problems? How much can we blame on society? How much can we blame on our parents? How much can we blame on God? As we seek to answer these questions, we will also look at what it means to be held personally accountable. We will look at examples from the lives of Joseph, Paul, and Job as to what our response should be when difficult circumstances arrive. We will learn God's truth about responsibility.",
        "download": "http:\/\/api.sermonindex.net\/SID9345-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About Satan's Lies",
        "url": "http:\/\/api.sermonindex.net\/SID9350",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Satans Lies",
        "description": "This is the last in a mini-series about God's truths about Satan's lies. As the time gets closer for Christ's return, Satan is becoming more up front with his lies. In this lesson we will review the nine areas of conflict in which Satan has declared war on the truth of God. Within those nine areas are twenty-six lies that we must reflect on as Christians. If we learn of Satan's lies, we will be able to hold fast to God's truth and not be deceived.",
        "download": "http:\/\/api.sermonindex.net\/SID9350-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth About The Home",
        "url": "http:\/\/api.sermonindex.net\/SID9340",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Home Life",
        "description": "Once again, God's picture book comes into focus as we look at the portrait of the home as the training school for spiritual education. We catch a glimpse of the Father, the perfect gather, and how He love us. He serves as the perfect example of what it means for parents to love their children well. As we take a look at the characteristics of the perfect Father, may we follow His example in such a way that our children will see Him.",
        "download": "http:\/\/api.sermonindex.net\/SID9340-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth: Authority and Discipline",
        "url": "http:\/\/api.sermonindex.net\/SID9342",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Discipline",
        "description": "In this lesson, we will discuss Satan's lies about parents, authority and discipline. We will look at the need for discipline and how God, through His example, gives us a pattern for discipline. God gave children parents to direct them and to protect them, but also to correct them. From the Scripture we will find 13 different principles concerning how to discipline our children. As an aside, Russell also gives us some thoughts on the subject of Halloween.",
        "download": "http:\/\/api.sermonindex.net\/SID9342-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth: Rebellion and Patriotism",
        "url": "http:\/\/api.sermonindex.net\/SID9343",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Patriotism",
        "description": "In this lesson, we continue our study of Satan's lies and God's truths concerning three basic areas: authority, rebellion and patriotism. Satan has fostered basic lies in each of these three areas, but we want to take a look at what it means to be under authority, and we will also take a test to find out about our rebellion quotient. Finally, we will take a brief look at what our duty is concerning our country.",
        "download": "http:\/\/api.sermonindex.net\/SID9343-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "God's Truth: The Roles of Men and Women",
        "url": "http:\/\/api.sermonindex.net\/SID9341",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Marriage Problems",
        "description": "Satan's strategy is to destroy or reverse the Scriptural roles of men and women. If this world can be made to believe there is no difference between men and women, no distinctive, no authority in the male-female relationship, then he is able to tear down the stronghold of the family. However, God does have a design; there are roles for men and women. They can be equal, yet different at the same time. Only God could design the perfect balance and He did.",
        "download": "http:\/\/api.sermonindex.net\/SID9341-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "Have You Ever Heard of Asa?",
        "url": "http:\/\/api.sermonindex.net\/SID9337",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Humble Yourself",
        "description": "And Asa did good and right in the sight of the Lord His God. He did it God's way. He realized it wasn't his kingdom, it was God's. He humbled himself before God, and he stood tall before men and did what had to be done. Here was a man who believed that God was who He said He was, and could do what He said He could. He called an entire nation to repentance. How can we discover the power of Asa's God? What were the secrets of Asa's victory?",
        "download": "http:\/\/api.sermonindex.net\/SID9337-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "He Did Not Set His Heart",
        "url": "http:\/\/api.sermonindex.net\/SID9336",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Rehoboam",
        "description": "Rehoboam was a man destined for greatness simply by virtue of who his father was, and yet a man who missed greatness, simply because he forgot who His Heavenly Father was. He did evil, because he did not set his heart to seek the Lord. He wanted to enjoy the fruits of the kingdom without surrendering to the disciplines of the King, so he missed it, and his name goes down in history, simply as one of the king's kids who missed his claim to greatness. Has there ever been a time when, by an act of your will, you simply handed over the reigns of your life to a Sovereign God who has an incredible plan for that life that will both honor Him and make you what you were intended to be?",
        "download": "http:\/\/api.sermonindex.net\/SID9336-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "How to Rejoice When the Battle's Over",
        "url": "http:\/\/api.sermonindex.net\/SID9338",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Rejoicing",
        "description": "This is the final of a four-part series outlining a \"Blueprint For Battle\" from the life of Jehoshaphat. As we saw the enemy bearing down upon Israel, we saw Jehoshaphat pray, surrendering his will to God's. We saw him stand in the midst of battle and watch to see what God would do. This lesson is about what to do when God has handed us even the smallest of victories. We need to stop and praise Him as God gives us rest. It may be for only a day or a long while, but it is imperative that we take the holiday with Him.",
        "download": "http:\/\/api.sermonindex.net\/SID9338-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "Is Today Just Like The Days Of Noah?",
        "url": "http:\/\/api.sermonindex.net\/SID20368",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Days Of Noah",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID20368-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    },
    {
        "title": "Rehoboam: If You Will Be Kind",
        "url": "http:\/\/api.sermonindex.net\/SID9335",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Rehoboam",
        "description": "Have you ever looked back on your life, or on the life of someone you have studied about in history, and thought to yourself, \"how different it all would have turned out, had it not been for that one major mistake? The difference between the greats of the ages and the goats of the ages has often been told in the story of one simple wrong decision. Instead of following the advice of his father's counselors, Rehoboam did the opposite, and with that decision destroyed his people. How does a godly leader lead his people? See how one decision can affect so many.",
        "download": "http:\/\/api.sermonindex.net\/SID9335-download",
        "speaker_name": "Russell Kelfer",
        "_scripture": []
    }
]