[
    {
        "title": "Gimmie Some Sugar",
        "url": "http:\/\/api.sermonindex.net\/SID20783",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Christian Life",
        "description": "Gimme Some Sugar is a serious message delivered out of a direct mandate from the Lord, where Steve exposes the devastating results of slipping away from proclaiming the basic fundamentals of the gospel - the blood and the cross. A trumpet call to every believer, this message will cause you to examine your spiritual diet to see if you've strayed from the simplicity of the gospel of Jesus Christ. It will also arm you to help others who are being led astray by the many winds of doctrine blowing around in the Body of Christ.",
        "download": "http:\/\/api.sermonindex.net\/SID20783-download",
        "speaker_name": "Steve Hill",
        "_scripture": []
    },
    {
        "title": "Hell To Pay",
        "url": "http:\/\/api.sermonindex.net\/SID20782",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Hell",
        "description": "No doubt about it, serial killers, pedophiles, rapists and all who commit heinous crimes deserve to spend an eternity in hell. The truth of the matter is, so does every single person who’s ever walked this planet. One day, you will stand before the Righteous Judge to give an account of your life. On that day in the courtroom of heaven, no one will stand beside you. There will be no vote, no jury, no possibility of getting off on a technicality. You will stand alone before God Almighty. What will He say about you? Will you be ready? Steve delivers a timely warning for all to make sure you’re ready to stand before God on judgment day.",
        "download": "http:\/\/api.sermonindex.net\/SID20782-download",
        "speaker_name": "Steve Hill",
        "_scripture": []
    },
    {
        "title": "Judgment Day",
        "url": "http:\/\/api.sermonindex.net\/SID24490",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Judgment Day",
        "description": "",
        "download": "http:\/\/api.sermonindex.net\/SID24490-download",
        "speaker_name": "Steve Hill",
        "_scripture": []
    },
    {
        "title": "Keep A Closed Mind",
        "url": "http:\/\/api.sermonindex.net\/SID20781",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Christian Life",
        "description": "It's good to have open mind. But not when it comes to the fundamentals of the faith. In this age of moral relativism, political correctness, and situational ethics, there is truth and there is error. There is right and wrong. In this vital message, Steve share about the devastating consequences when we move away from the central truths of the Gospel, and the importance of being firmly established in the Faith, no matter what.",
        "download": "http:\/\/api.sermonindex.net\/SID20781-download",
        "speaker_name": "Steve Hill",
        "_scripture": []
    },
    {
        "title": "The Call For The Church To Leave The Plains Of Sodom And Gomorrah",
        "url": "http:\/\/api.sermonindex.net\/SID24857",
        "size": "0",
        "format": "mp3",
        "scripture": "Genesis 13:5-13",
        "topic": "Repentance",
        "description": "Brother Steve shares a powerful burdened message from the Lord particularly to the Church in America. He shares a prophetic call to repentance for believers to leave Sodom and Gomorrah in their hearts. There is a great need for preaching on sin, powerful prophetic messages that will lay hearts bare before a Holy God. Judgment day will come for all, we must live in light of it.",
        "download": "http:\/\/api.sermonindex.net\/SID24857-download",
        "speaker_name": "Steve Hill",
        "_scripture": [
            {
                "book": "Genesis",
                "chapter": "13"
            }
        ]
    },
    {
        "title": "The Days Of Our Flesh",
        "url": "http:\/\/api.sermonindex.net\/SID20784",
        "size": "0",
        "format": "mp3",
        "scripture": "",
        "topic": "Christian Life",
        "description": "How much time do you have on this earth? No one knows for sure. The Word of God instructs us to number our days. Why? So when you stand before the Lord, you’ll have crowns to lay at His feet. So you’ll hear the words, “Well done!” Are you living for temporal things that will one day pass away? Or for the eternal which lasts for ever? The days of your flesh are numbered, but the days of your spirit are without end. Make sure to invest your life on that which truly matters: eternity!",
        "download": "http:\/\/api.sermonindex.net\/SID20784-download",
        "speaker_name": "Steve Hill",
        "_scripture": []
    }
]