{
    "name": "2 Chronicles 19",
    "book": "2 Chronicles",
    "chapter": 19,
    "sermons": [
        {
            "title": "(Through The Bible) 2 Chronicles 19-27",
            "url": "https:\/\/sermonindex.info\/SID6364",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 19-27",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6364-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "The Watchtower in the Wilderness",
            "url": "https:\/\/sermonindex.info\/SID1401",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 19:20",
            "topic": "Wilderness",
            "description": "The account of Jehosophat in 2 Chronicles 20 is skillfully used to encourage the listener who is in a battle with the enemy and in fear. A hopeful message on the power of God to remove those doubts and fears and to see a defeated enemy.",
            "download": "https:\/\/sermonindex.info\/SID1401-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "19"
                }
            ]
        }
    ]
}