{
    "name": "2 Chronicles 6",
    "book": "2 Chronicles",
    "chapter": 6,
    "sermons": [
        {
            "title": "Revival Series 6",
            "url": "http:\/\/sermonindex.net\/SID0787",
            "size": "10115584",
            "format": "mp3",
            "scripture": "2 Chronicles 6:1",
            "topic": "Revival",
            "description": "\"Now when Solomon had made an end of praying, the fire came down from heaven...and the glory of the LORD filled the house.\" Revival fire falls on an altar prepared by intercessory prayer. But beware of wildfire, which substitutes human ingenuity for the Holy Spirit's energies.",
            "download": "http:\/\/sermonindex.net\/SID0787-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Glory Of God And The Image Of Jealousy",
            "url": "http:\/\/sermonindex.net\/SID3650",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 6:16-17, Ezekiel 9:4, Ezekiel 10",
            "topic": "Jealously",
            "description": "This is a message about how God will not compete with idolatry for the hearts and minds of his people. Instead he will lift his glory from their lives. He reluctantly took his glory from Israel as illustrated in Ezekiel, and nobody even noticed, for the priests were busy with their secret things. Whatever you give your time and attention to the most is what is influencing your character and is becoming your idol. Too many go to church, going through the motions on Sunday and the rest of the week devote themselves to their own pursuits and pleasures and wonder why they can't feel God's presence. God desires to dwell among his people. But when they don't like to retain the knowledge of God, when they prefer an appearance of godliness with no power it will lead to destruction.",
            "download": "http:\/\/sermonindex.net\/SID3650-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "10"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "9"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "To Late To Cancel Judgment by John Franklin",
            "url": "http:\/\/sermonindex.net\/SID22969",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 6:36",
            "topic": "Refine Conference",
            "description": "The message by John Franklin  was about expectations if we repent .  He starts out with II Chronicles 6:36 . He says that we need to know how judgment functions and works and how to respond correctly.  He then goes to II Samuel 12:7  where Nathan confronts David.  David confesses - repents but it did not cancel the judgment.  John Franklin's expectations of the coming days is if we come to the place of revival, he believes we can be forgiven and restored to God, but it is too late to cancel our judgment.",
            "download": "http:\/\/sermonindex.net\/SID22969-download",
            "preacher_name": "Refine Conference 2011",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        }
    ]
}