{
    "name": "2 Chronicles 6",
    "book": "2 Chronicles",
    "chapter": 6,
    "sermons": [
        {
            "title": "Revival Series 6",
            "url": "http:\/\/api.sermonindex.net\/SID0787",
            "size": "10115584",
            "format": "mp3",
            "scripture": "2 Chronicles 6:1",
            "topic": "Revival",
            "description": "\"Now when Solomon had made an end of praying, the fire came down from heaven...and the glory of the LORD filled the house.\" Revival fire falls on an altar prepared by intercessory prayer. But beware of wildfire, which substitutes human ingenuity for the Holy Spirit's energies.",
            "download": "http:\/\/api.sermonindex.net\/SID0787-download",
            "speaker_name": "Leonard Ravenhill",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Glory Of God And The Image Of Jealousy",
            "url": "http:\/\/api.sermonindex.net\/SID3650",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 6:16-17, Ezekiel 9:4, Ezekiel 10",
            "topic": "Jealously",
            "description": "This is a message about how God will not compete with idolatry for the hearts and minds of his people. Instead he will lift his glory from their lives. He reluctantly took his glory from Israel as illustrated in Ezekiel, and nobody even noticed, for the priests were busy with their secret things. Whatever you give your time and attention to the most is what is influencing your character and is becoming your idol. Too many go to church, going through the motions on Sunday and the rest of the week devote themselves to their own pursuits and pleasures and wonder why they can't feel God's presence. God desires to dwell among his people. But when they don't like to retain the knowledge of God, when they prefer an appearance of godliness with no power it will lead to destruction.",
            "download": "http:\/\/api.sermonindex.net\/SID3650-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Ezekiel",
                    "chapter": "10"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "9"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "To Late To Cancel Judgment by John Franklin",
            "url": "http:\/\/api.sermonindex.net\/SID22969",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 6:36",
            "topic": "Refine Conference",
            "description": "The message by John Franklin  was about expectations if we repent .  He starts out with II Chronicles 6:36 . He says that we need to know how judgment functions and works and how to respond correctly.  He then goes to II Samuel 12:7  where Nathan confronts David.  David confesses - repents but it did not cancel the judgment.  John Franklin's expectations of the coming days is if we come to the place of revival, he believes we can be forgiven and restored to God, but it is too late to cancel our judgment.",
            "download": "http:\/\/api.sermonindex.net\/SID22969-download",
            "speaker_name": "Refine Conference 2011",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "6"
                }
            ]
        }
    ]
}