{
    "name": "Psalms 100",
    "book": "Psalms",
    "chapter": 100,
    "sermons": [
        {
            "title": "(The Royal Psalms) Part 3",
            "url": "http:\/\/api.sermonindex.net\/SID15010",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 99, Psalm 100",
            "topic": "",
            "description": "\"The climax of the Christian experience of knowing Christ as King,\" says Ed, \"has to do with a revelation of God Himself.\"  The royal psalms progress from the song of rest to the song of victory to this song of service.  The King has stepped down from His throne to shepherd His sheep, a great principle that serving the Lord with gladness comes from letting Him serve you.",
            "download": "http:\/\/api.sermonindex.net\/SID15010-download",
            "speaker_name": "Ed Miller",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "99"
                },
                {
                    "book": "Psalms",
                    "chapter": "100"
                }
            ]
        },
        {
            "title": "Be Thankful Unto Him",
            "url": "http:\/\/api.sermonindex.net\/SID10177",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 100",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10177-download",
            "speaker_name": "Welcome Detweiler",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "100"
                }
            ]
        },
        {
            "title": "Don't Forget",
            "url": "http:\/\/api.sermonindex.net\/SID3656",
            "size": "646656",
            "format": "mp3",
            "scripture": "Psalm 100:2",
            "topic": "Classic Recordings",
            "description": "Don't forget. Recorded by VTM 1910. An address by the late General Booth founder of the Salvation Army. \r\n\r\n[b]Audio Transcription:[\/b]\r\n[i]NOTE: it is very hard to hear the audio I recommend highly you read this transcription and listen along at the same time![\/i]\r\n\r\nI am glad you are enjoying yourself. The salvation business is a friend of happiness. Making heaven on earth is our business. Serve the Lord with gladness is one of our favorite mottos. So I am pleased that you are pleased! But amidst all your joys don't forget the sons and daughters of misery. Do you ever visit them?  Come away and let us make a call or two. Here is a home, six in family, they eat and drink and sleep and sick and die in the same chamber. Here is a drunkard hovel, void of furniture, wife a skeleton, children in rags; father now sleeping, the victims of his neglect. Here are the unemployed, wandering about, seeking work and finding none. Yonder are the wretched criminals cradled in crime passing in and out of the prisons all the time. There are the Daughter of shame deceived and wronged and ruined.  Traveling down the dark and blind to an early grave. There are the children, fighting in the gutter, going hungry to school. Growing up to fill their parents places.  Brought it all on themselves, you say?  Perhaps so.  But that does not excuse our assisting them. You don?t demand a certificate of virtue before you drag some drowning creature out of the water.  Nor the assurance in a man of faded grace before you deliver him from the burning building.  But what shall we do?  Content ourselves by singing a hymn? Offering a prayer? Or giving a little good advice?  NO!  Ten thousand times no!  We will forgive them.  Feed them! Reclaim them.  Employ them!Perhaps we shall fail with many.   Quite likely.  But our business is to help them all the same.  And that in the most practical, economical and Christlike manner.  So let us hasten to the rescue for the sake of our own peace, the poor wretches themselves, ____ (dean?) of these children, and the danger(Savior?) of us all.  But you must help with the means.  And there is nothing like the present.  Who in this company will lend a hand by taking up the gauntlet?",
            "download": "http:\/\/api.sermonindex.net\/SID3656-download",
            "speaker_name": "William Booth",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "100"
                }
            ]
        },
        {
            "title": "The Humility Of Jesus Christ",
            "url": "http:\/\/api.sermonindex.net\/SID18419",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 100:13",
            "topic": "Humility",
            "description": "Bill McLeod shares a powerful message on the humility of Jesus Christ and the ascending of satan in pride.  He shows the greatness of God and how powerful it is that He came in flesh in Jesus to save humanity. The challenge is issued against pride and choosing the way of humility of Christ as a disciple.",
            "download": "http:\/\/api.sermonindex.net\/SID18419-download",
            "speaker_name": "Bill McLeod",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "100"
                }
            ]
        }
    ]
}