{
    "name": "Psalms 106",
    "book": "Psalms",
    "chapter": 106,
    "audio_sermons": [
        {
            "title": "(basics) 25. Faith And Praise",
            "url": "http:\/\/sermonindex.net\/SID8135",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 106:11-12, Hebrews 2:12-13, Psalm 22:3",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8135-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "106"
                },
                {
                    "book": "Psalms",
                    "chapter": "22"
                },
                {
                    "book": "Hebrews",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Doubt, The Sin God Hates the Most",
            "url": "http:\/\/sermonindex.net\/SID3596",
            "size": "14377984",
            "format": "mp3",
            "scripture": "Psalms 106:6-7",
            "topic": "Doubt",
            "description": "Using the children of Israel, wandering in the desert, Wilkerson explains how it is that doubt in God is the sin that He hates the most.  Even though the cloud of God was present and miracles aboundedÂ…  the children of Israel sinned often by simply doubting what God can do.",
            "download": "http:\/\/sermonindex.net\/SID3596-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        },
        {
            "title": "Jonah #3: Work Beneath the Surface",
            "url": "http:\/\/sermonindex.net\/SID11411",
            "size": "0",
            "format": "mp3",
            "scripture": "Jonah 2, Psalm 106:4",
            "topic": "",
            "description": "Ed Miller shows how God putting Jonah in the same shoes as the heathen for him to see they both needed the undeserved mercy of God.  God delivered Jonah FROM the storm and BY the storm to show Himself as the God who delivers.",
            "download": "http:\/\/sermonindex.net\/SID11411-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Jonah",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        },
        {
            "title": "The Ultimate Test Of Faith",
            "url": "http:\/\/sermonindex.net\/SID13921",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 106:7",
            "topic": "",
            "description": "October 31, 2004 - There is no way that God can produce faith in us except through testing.. The only way God can build us up in faith is taking us through fires and seasons of testing.. Without faith we can not be a testimony to the world of God’s keeping power and deliverance.",
            "download": "http:\/\/sermonindex.net\/SID13921-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        },
        {
            "title": "When God Sends Leanness Into The Soul",
            "url": "http:\/\/sermonindex.net\/SID2789",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 106:15",
            "topic": "Rest Of God",
            "description": "This sermon speaks of how God sends leanness into the lives of Christians when they won’t rest in what his direction is for their lives.  Carter illustrates, through various scriptures, how Christians find themselves in dry places because they are not content in the station that God has put them in.  An illustration that Carter used was the complaining that the children went through in the wilderness when they weren’t content with the manna. The scripture that this sermon was built around was Psalm 106:15  And he gave them their request; but sent leanness into their soul.",
            "download": "http:\/\/sermonindex.net\/SID2789-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "106"
                }
            ]
        }
    ]
}