{
    "name": "Psalms 109",
    "book": "Psalms",
    "chapter": 109,
    "audio_sermons": [
        {
            "title": "A Call To Prayer",
            "url": "http:\/\/sermonindex.net\/SID14230",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 109:4",
            "topic": "Prayer",
            "description": "As the title suggests Michael Brown gives an earnest call to prayer which inspires zeal and identifies godly character with a life of prayer. There is a needed renewed call for prayer in our day.",
            "download": "http:\/\/sermonindex.net\/SID14230-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "109"
                }
            ]
        },
        {
            "title": "Confronting the Homosexual Agenda",
            "url": "http:\/\/sermonindex.net\/SID14243",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 109:4",
            "topic": "Homosexuality",
            "description": "Dr. Brown gives a strong encouragement to be light and salt in the world, revolutionizing society and impacting the nature of our culture. He gives frightening facts about the progressing homosexual revolution, including its aims and successes while maintaining a compassionate heart for their lives.",
            "download": "http:\/\/sermonindex.net\/SID14243-download",
            "preacher_name": "Michael L. Brown",
            "preacher_image": "",
            "preacher_description": "Michael L. Brown ( - )\r\nListen to freely downloadable audio sermons by the speaker Michael L. Brown in mp3 format.  Michael L. Brown is the founder and president of FIRE School of Ministry in Concord, North Carolina, director of the Coalition of Conscience, and host of the daily, nationally, syndicated talk radio show, The Line of Fire, as well as the host of the Jewish-outreach, documentary TV series, Think It Thru, which airs internationally on the INI network. He became a believer in Jesus 1971 as a sixteen year-old, heroin-shooting, LSD-using Jewish rock drummer. Since then, he has preached throughout America and around the world, bringing a message of repentance, revival, reformation, and cultural revolution.\r\nDr. Brown is a national and international speaker on themes of spiritual renewal and cultural reformation, and he has debated Jewish rabbis, agnostic professors, and gay activists on radio, TV, and college campuses. He is widely considered to be the world's foremost Messianic Jewish apologist. He and his wife Nancy, who is also a Jewish believer in Jesus, have been married since 1976. They have two daughters and four grandchildren.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "109"
                }
            ]
        },
        {
            "title": "Hold Not Thy Peace, O God of My Praise",
            "url": "http:\/\/sermonindex.net\/SID1041",
            "size": "6762496",
            "format": "mp3",
            "scripture": "Psalm 109:1-4",
            "topic": "Storm Of Life",
            "description": "This is a stirring sermon to encourage us in the midst of a storm. From the Psalms and Hebrews Pastor Conlon shows us that the truth of God in our hearts will bring peace amidst the lying and hating voices around us. A wonderful exhortation against the attacks of the enemy.",
            "download": "http:\/\/sermonindex.net\/SID1041-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "109"
                }
            ]
        }
    ]
}