{
    "name": "Psalms 113",
    "book": "Psalms",
    "chapter": 113,
    "audio_sermons": [
        {
            "title": "The Unrelenting Humility of God",
            "url": "http:\/\/sermonindex.net\/SID13140",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 113:1-9, Revelation 4:5-8, 1 Samuel 6:12-19",
            "topic": "Humility",
            "description": "This message begins Scriptures on the holiness, power and might of God, and His requirement of worship of which He is worthy. From there, Pastor Conlon takes us on an incredible journey through the Old Testament and back to the New, illustrating through the Word the incredible humility this awesome God of unimaginable power has shown toward mankind. This is one of the best illustrations of the Lord Jesus Christ-it's not so much a sermon as a verbal portrait painted with love and care of our Lord that every Christian needs to hear. It will change how you deal with others and it will forever change how you see the Lord if you listen with an open and hungry heart. He goes through many Scriptures, so I'd recommend having a pencil and paper on hand.",
            "download": "http:\/\/sermonindex.net\/SID13140-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "6"
                },
                {
                    "book": "Revelation",
                    "chapter": "4"
                },
                {
                    "book": "Psalms",
                    "chapter": "113"
                }
            ]
        }
    ]
}