{
    "name": "Psalms 116",
    "book": "Psalms",
    "chapter": 116,
    "audio_sermons": [
        {
            "title": "Death Of George Whitefield",
            "url": "http:\/\/sermonindex.net\/SID24544",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 116:15",
            "topic": "Biography",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24544-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                }
            ]
        },
        {
            "title": "Return Unto Thy Rest",
            "url": "http:\/\/sermonindex.net\/SID14351",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 116:7",
            "topic": "",
            "description": "“Return unto thy rest, O my soul; for the Lord hath dealt bountifully with thee.”— Psalm 116:7. You, who have not believed in our Lord Jesus Christ, have no rest to which you can return, for you have never, found any. May God grant to you the grace to come unto Christ that you may find rest unto your souls! But we, who believe in him, do enter into rest. We are sometimes described as journeying through the wilderness towards Canaan, and the type is quite allowable; but, still, it must not be pressed, too far; for, in another sense, we have already entered into our rest. We have entered the Canaan which our Joshua has given unto us; Moses, by the law, could not lead us into this promised land; but Jesus has brought us into it, and we now have our portion and our inheritance in the covenant blessings which God has provided for his people in Christ Jesus his Son. God's people, when they are as they ought to be, are in a state of rest even now. I do not mean that they will have rest so far as this world is concerned, for this earth is not our rest, it is polluted; but I do mean that as the apostle Paul writes to the Romans, 'There is therefore now no condemnation to them which are, in Christ Jesus, who walk not after the flesh, but after the Spirit.'",
            "download": "http:\/\/sermonindex.net\/SID14351-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                }
            ]
        },
        {
            "title": "Return Unto Thy Rest O My Soul",
            "url": "http:\/\/sermonindex.net\/SID13956",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 116:1-2",
            "topic": "Rest",
            "description": "February 27,2005 - There is no measure of human strength to take us to the place that God has prepared for us. When we become utterly bankrupt and we exhausted from all self effort and our best attempts . there will be cry formed in our heart to say God I cant go another step without you. This is the cry that God waits for so that He can do for us what we cant do for ourselves and in that place we will find rest.",
            "download": "http:\/\/sermonindex.net\/SID13956-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                }
            ]
        },
        {
            "title": "Taking The Cup And Calling On Jesus",
            "url": "http:\/\/sermonindex.net\/SID16724",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 116:1-13, Psalm 27:12-14, 2 Timothy 1:11-12",
            "topic": "Affliction",
            "description": "God is calling us to drink the CUP of JESUS in its entirety. Many of us come to Christ and we want to drink from the cup of salvation, future authority, present power and healing but we don’t want to go the distance and drink the cup of suffering and affliction. If we are going to put the cup to our mouth we must come to the place where we cry like Jesus \"NOT MY WILL BUT THINE BE DONE\". This is a place where the only strength we have is to lift up the cup and call on the name of Jesus. In these times of darkness don't cast away your confidence in God because there is a great reward for those who drink this cup in faith and trust.",
            "download": "http:\/\/sermonindex.net\/SID16724-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                },
                {
                    "book": "Psalms",
                    "chapter": "27"
                },
                {
                    "book": "2 Timothy",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The Best Way To Say Thank You",
            "url": "http:\/\/sermonindex.net\/SID24046",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 116:12-13",
            "topic": "Thanksgiving",
            "description": "How can we repay the Lord for all His goodness toward us? There's  something God wants us to do which is  also His greatest gift. Psalm 116:12-13",
            "download": "http:\/\/sermonindex.net\/SID24046-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "116"
                }
            ]
        }
    ]
}