{
    "name": "Psalms 121",
    "book": "Psalms",
    "chapter": 121,
    "sermons": [
        {
            "title": "Escape to the Mountain",
            "url": "http:\/\/sermonindex.net\/SID4199",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 19:12-30,Luke 16:1-8,Psalm 121:1",
            "topic": "Overcoming",
            "description": "All through scripture, throughout the lives of various saints, the call to come up to the mountain to let him reveal his heart to you. Spiritual laziness and prayerlessness will lead to the loss of passion for Christ and the inability to feed the sheep from the treasure of the Word. We can't know the heart of God until we let God lead us to the place of crucifixion of self. Let him preserve you from selfishness, and settling for less than he has for you. We are called to overcome, to rise above the beggardly elements of this world and stand victorious.",
            "download": "http:\/\/sermonindex.net\/SID4199-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "121"
                },
                {
                    "book": "Luke",
                    "chapter": "16"
                },
                {
                    "book": "Genesis",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Preserved for a Purpose",
            "url": "http:\/\/sermonindex.net\/SID3601",
            "size": "19134464",
            "format": "mp3",
            "scripture": "Psalms 16:1, Psalms 121:1-8",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3601-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "16"
                },
                {
                    "book": "Psalms",
                    "chapter": "121"
                }
            ]
        }
    ]
}