{
    "name": "Psalms 124",
    "book": "Psalms",
    "chapter": 124,
    "sermons": [
        {
            "title": "ALLOWED TO PRAY-MY GREATEST HAPPINESS",
            "url": "http:\/\/api.sermonindex.net\/SID21371",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124:8",
            "topic": "Radio Show",
            "description": "God’s heart is a fatherly heart which is filled with love for His children. And His arm is a mighty arm that can be moved through His children’s prayers… Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/api.sermonindex.net\/SID21371-download",
            "speaker_name": "Basilea Schlink",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "124"
                }
            ]
        },
        {
            "title": "Freedom From Sin",
            "url": "http:\/\/api.sermonindex.net\/SID17136",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124, Revelation 21",
            "topic": "Freedom",
            "description": "There is a direct connection between understanding the deepest sufferings of Christ, and an abiding hatred for sin.  We cannot limit Jesus suffering to mere physical suffering, otherwise sin could be dealt with and atoned for with every human death, and that would be sufficient for entrance into heaven.  With a true understanding and acknowledgment of the spiritual and infinite sufferings of Christ should also come a truth which breaks us free from our love of sin.  If we only ever see God as a means to our physical need, then we are missing the point of the New Covenant entirely.  Brother Poonen also ties a heavy rock to the idea that Jesus suffered in Hell for three days while dead, and casts it into the deepest sea.",
            "download": "http:\/\/api.sermonindex.net\/SID17136-download",
            "speaker_name": "Zac Poonen",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "124"
                },
                {
                    "book": "Revelation",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "The Snare of the Folwer",
            "url": "http:\/\/api.sermonindex.net\/SID5396",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124:7, Romans 6:14, Romans 7:5",
            "topic": "Snare",
            "description": "This Psalm depicts Israel escaping the snare of the fowler, which is a figure of the redeemed being freed from the entrappings of sin by the gracious hand of the Lord Jesus.  The power of sin over the christian, or anyone, is it's ability to condemn and maintain our guilt before the law of God, we can go on for years under the power of a sin that we may only have commited once, this is the sanre designed by Satan himself and the more we try and work our way free the tighter it becomes and the more condemned we feel trying to live up to the law in order to please God.  But praise God for the Lord Jesus who took upon Himself the wieght of sin and not only that but became my sin and yours for us, He alone could have exhausted the power of sin and the law over us and so He alone can free us from it's grasp.",
            "download": "http:\/\/api.sermonindex.net\/SID5396-download",
            "speaker_name": "Roy Hession",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "7"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                },
                {
                    "book": "Psalms",
                    "chapter": "124"
                }
            ]
        }
    ]
}