{
    "name": "Psalms 124",
    "book": "Psalms",
    "chapter": 124,
    "audio_sermons": [
        {
            "title": "ALLOWED TO PRAY-MY GREATEST HAPPINESS",
            "url": "http:\/\/sermonindex.net\/SID21371",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124:8",
            "topic": "Radio Show",
            "description": "God’s heart is a fatherly heart which is filled with love for His children. And His arm is a mighty arm that can be moved through His children’s prayers… Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21371-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "124"
                }
            ]
        },
        {
            "title": "Freedom From Sin",
            "url": "http:\/\/sermonindex.net\/SID17136",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124, Revelation 21",
            "topic": "Freedom",
            "description": "There is a direct connection between understanding the deepest sufferings of Christ, and an abiding hatred for sin.  We cannot limit Jesus suffering to mere physical suffering, otherwise sin could be dealt with and atoned for with every human death, and that would be sufficient for entrance into heaven.  With a true understanding and acknowledgment of the spiritual and infinite sufferings of Christ should also come a truth which breaks us free from our love of sin.  If we only ever see God as a means to our physical need, then we are missing the point of the New Covenant entirely.  Brother Poonen also ties a heavy rock to the idea that Jesus suffered in Hell for three days while dead, and casts it into the deepest sea.",
            "download": "http:\/\/sermonindex.net\/SID17136-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "124"
                },
                {
                    "book": "Revelation",
                    "chapter": "21"
                }
            ]
        },
        {
            "title": "The Snare of the Folwer",
            "url": "http:\/\/sermonindex.net\/SID5396",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 124:7, Romans 6:14, Romans 7:5",
            "topic": "Snare",
            "description": "This Psalm depicts Israel escaping the snare of the fowler, which is a figure of the redeemed being freed from the entrappings of sin by the gracious hand of the Lord Jesus.  The power of sin over the christian, or anyone, is it's ability to condemn and maintain our guilt before the law of God, we can go on for years under the power of a sin that we may only have commited once, this is the sanre designed by Satan himself and the more we try and work our way free the tighter it becomes and the more condemned we feel trying to live up to the law in order to please God.  But praise God for the Lord Jesus who took upon Himself the wieght of sin and not only that but became my sin and yours for us, He alone could have exhausted the power of sin and the law over us and so He alone can free us from it's grasp.",
            "download": "http:\/\/sermonindex.net\/SID5396-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "7"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                },
                {
                    "book": "Psalms",
                    "chapter": "124"
                }
            ]
        }
    ]
}