{
    "name": "Psalms 130",
    "book": "Psalms",
    "chapter": 130,
    "sermons": [
        {
            "title": "Israel's Hope or The Centre of the Target",
            "url": "http:\/\/api.sermonindex.net\/SID14349",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130:7",
            "topic": "",
            "description": "“Let Israel hope in the Lord: for with the Lord there is mercy, and with him is plenteous redemption.” — Psalm 130:7. When he penned this psalm, the writer, David, was in deep distress, if not of circumstances, yet of conscience. He constantly mentions iniquities, and begs forgiveness. He felt like a shipwrecked mariner, carried overboard into the raging sea. Thus he reviews the situation - 'Out of the depths have I cried unto thee, O Lord.' Yet he lived to tell the tale of deliverance. His prayer from among the waves was a memory worth preserving, and he does preserve it. The mercy of God to him he weaves into a song for us; and in this our text is found. Two things the rescued sufferer tells us. First, that, as God delivered him from the power of sin, so he will deliver all his praying, wrestling, believing people. That is the last verse of the psalm - He shall redeem Israel from all his iniquities.' The argument is - He delivered me. What am I more than others? The gracious Lord who saved me will save all those who call upon him in truth. He delivered me, though laden with iniquities, and his pardoning mercy is unfailing; and therefore he can and will rescue others from their uttermost distresses. This is a good line of reasoning, for the Lord's ways are constant, and he will do for all believers what he...",
            "download": "http:\/\/api.sermonindex.net\/SID14349-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "Psalm 130",
            "url": "http:\/\/api.sermonindex.net\/SID8033",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130",
            "topic": "Psalms",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID8033-download",
            "speaker_name": "Carl Armerding",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "THE KINGDOM OF HEAVEN IS AT HAND",
            "url": "http:\/\/api.sermonindex.net\/SID22850",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130:3",
            "topic": "Radio Show",
            "description": "God is at work to build the Kingdom of Heaven in our midst. But perhaps you’re one of those people who don’t think much about heaven. This meditation takes another look at heaven and shares how each one of us can become a part of the Kingdom which begins right now.",
            "download": "http:\/\/api.sermonindex.net\/SID22850-download",
            "speaker_name": "Basilea Schlink",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "Understanding God's Forgiveness",
            "url": "http:\/\/api.sermonindex.net\/SID24077",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 1:9, Psalm 130:4",
            "topic": "Forgiveness",
            "description": "What makes God great is not that He is all powerful, but that he forgives our sins. 1John 1:9, Psalm 130:4, Isiah 43:25, Acts 13:38, Ephesians 1:7",
            "download": "http:\/\/api.sermonindex.net\/SID24077-download",
            "speaker_name": "Jim Cymbala",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        }
    ]
}