{
    "name": "Psalms 130",
    "book": "Psalms",
    "chapter": 130,
    "sermons": [
        {
            "title": "Israel's Hope or The Centre of the Target",
            "url": "https:\/\/sermonindex.info\/SID14349",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130:7",
            "topic": "",
            "description": "“Let Israel hope in the Lord: for with the Lord there is mercy, and with him is plenteous redemption.” — Psalm 130:7. When he penned this psalm, the writer, David, was in deep distress, if not of circumstances, yet of conscience. He constantly mentions iniquities, and begs forgiveness. He felt like a shipwrecked mariner, carried overboard into the raging sea. Thus he reviews the situation - 'Out of the depths have I cried unto thee, O Lord.' Yet he lived to tell the tale of deliverance. His prayer from among the waves was a memory worth preserving, and he does preserve it. The mercy of God to him he weaves into a song for us; and in this our text is found. Two things the rescued sufferer tells us. First, that, as God delivered him from the power of sin, so he will deliver all his praying, wrestling, believing people. That is the last verse of the psalm - He shall redeem Israel from all his iniquities.' The argument is - He delivered me. What am I more than others? The gracious Lord who saved me will save all those who call upon him in truth. He delivered me, though laden with iniquities, and his pardoning mercy is unfailing; and therefore he can and will rescue others from their uttermost distresses. This is a good line of reasoning, for the Lord's ways are constant, and he will do for all believers what he...",
            "download": "https:\/\/sermonindex.info\/SID14349-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "Psalm 130",
            "url": "https:\/\/sermonindex.info\/SID8033",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130",
            "topic": "Psalms",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID8033-download",
            "preacher_name": "Carl Armerding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "THE KINGDOM OF HEAVEN IS AT HAND",
            "url": "https:\/\/sermonindex.info\/SID22850",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 130:3",
            "topic": "Radio Show",
            "description": "God is at work to build the Kingdom of Heaven in our midst. But perhaps you’re one of those people who don’t think much about heaven. This meditation takes another look at heaven and shares how each one of us can become a part of the Kingdom which begins right now.",
            "download": "https:\/\/sermonindex.info\/SID22850-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        },
        {
            "title": "Understanding God's Forgiveness",
            "url": "https:\/\/sermonindex.info\/SID24077",
            "size": "0",
            "format": "mp3",
            "scripture": "1 John 1:9, Psalm 130:4",
            "topic": "Forgiveness",
            "description": "What makes God great is not that He is all powerful, but that he forgives our sins. 1John 1:9, Psalm 130:4, Isiah 43:25, Acts 13:38, Ephesians 1:7",
            "download": "https:\/\/sermonindex.info\/SID24077-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 John",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "130"
                }
            ]
        }
    ]
}