{
    "name": "Psalms 133",
    "book": "Psalms",
    "chapter": 133,
    "sermons": [
        {
            "title": "(Remnant Meeting 2013) Sebastian Ombima and Frank Mceleny",
            "url": "http:\/\/api.sermonindex.net\/SID24998",
            "size": "0",
            "format": "mp3",
            "scripture": "John 17, Psalm 133",
            "topic": "Remnant",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24998-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "17"
                },
                {
                    "book": "Psalms",
                    "chapter": "133"
                }
            ]
        },
        {
            "title": "A Last Day Return to the Power of Unity",
            "url": "http:\/\/api.sermonindex.net\/SID19511",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 133:1-3",
            "topic": "Unity",
            "description": "December 6, 2009 - God has a desire to walk among His people and display His power. The power of life, virtue and the anointing of the almighty God is released through a people who choose to walk in unity. There is a unity that is found in the body of Christ that is not found anywhere else in the world. Unity is the gathering together in agreement with the Word and will of God. Believers walking in unity for the purpose of Christ will experience Jesus Himself walking in their midst. When God's people choose to be one with Him and one with each other He commands a blessing!",
            "download": "http:\/\/api.sermonindex.net\/SID19511-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "133"
                }
            ]
        },
        {
            "title": "How Satan Destroys a Church - Part 6 (THE ROAD HOME)",
            "url": "http:\/\/api.sermonindex.net\/SID17297",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 133",
            "topic": "Spiritual Warfare",
            "description": "It is impossible for two to walk together without agreement and the oneness of the Holy Spirit.  We need leaders who are led by the Holy Spirit.  Satan will seek to destroy through envy and will use a wolf spirit to undermine authority.  The qualifications of a man, used by God, are a sense of inadequacy, weakness, poor and needy, he doesn't see himself as humble but as he really is, he has total dependence on God, there is no confidence in self, and he has total reliance on the Holy Spirit.",
            "download": "http:\/\/api.sermonindex.net\/SID17297-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "133"
                }
            ]
        }
    ]
}