{
    "name": "Psalms 21",
    "book": "Psalms",
    "chapter": 21,
    "audio_sermons": [
        {
            "title": "Bringing The Power Of God Into Prayer",
            "url": "http:\/\/sermonindex.net\/SID3388",
            "size": "10829824",
            "format": "mp3",
            "scripture": "Acts 4:23-31,Acts 3:1-6,Psalm 21:8",
            "topic": "Corporate Prayer",
            "description": "It's a sad statement about affairs of the church when a crippled man lays near the gate outside the sanctuary, expecting only spare change. When you know the heart of God, why he came to die for sinners, you will boldly be able to speak the truth, with real spiritual authority into the lives of others. The world around us is lost and dying, and we as the church need to pray the power of God down into the homes and hearts of people who so desperately need God.",
            "download": "http:\/\/sermonindex.net\/SID3388-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "21"
                },
                {
                    "book": "Acts",
                    "chapter": "3"
                },
                {
                    "book": "Acts",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The King Will Be Exalted in Strength",
            "url": "http:\/\/sermonindex.net\/SID26368",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 21",
            "topic": "Exalted",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26368-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "21"
                }
            ]
        }
    ]
}