{
    "name": "Psalms 24",
    "book": "Psalms",
    "chapter": 24,
    "audio_sermons": [
        {
            "title": "Personal Preparation for Spiritual Awakening",
            "url": "http:\/\/sermonindex.net\/SID19768",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 20, Psalms 24",
            "topic": "Spiritual Awakening",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19768-download",
            "preacher_name": "Ale Leiding",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "24"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "The Sin of Going to Church Unprepared",
            "url": "http:\/\/sermonindex.net\/SID4188",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 15,Psalms 24,Matthew 7",
            "topic": "",
            "description": "God only visits a prepared people who come into his sanctuary and his presence with a heart prepared to hear from him, with grateful reverence for who He is and readily acknowledging the authority of his word. They are prepared to receive and obey his word. How do you make sure you are prepared? Bro. Wilkerson gives a very simple but necessary answer to this. A must hear message for every Christian before you go to church again, listen, and let the Holy Spirit examine you.  ",
            "download": "http:\/\/sermonindex.net\/SID4188-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "15"
                },
                {
                    "book": "Psalms",
                    "chapter": "24"
                },
                {
                    "book": "Matthew",
                    "chapter": "7"
                }
            ]
        }
    ]
}