{
    "name": "Psalms 25",
    "book": "Psalms",
    "chapter": 25,
    "audio_sermons": [
        {
            "title": "Set Free From Shame",
            "url": "http:\/\/sermonindex.net\/SID4308",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 25:1-22",
            "topic": "Freedom",
            "description": "Have a pen and pad handy to take down the other scriptures Pastor Conlon goes through during this liberating message. He takes you through the Word of God and helps you see how when you came to Jesus, all your sins are forgiven, and you don't have to take it when the devil tries to remind you of  your sins. You don't have to bear the shame of your sin, for Jesus bore it all at Calvary. Many in the Body of Christ are weighted down, heavy with the shame of feeling unworthy. Wonderful spiritual medicine.",
            "download": "http:\/\/sermonindex.net\/SID4308-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "The Calmness Of The Trusting Believer Pt 1",
            "url": "http:\/\/sermonindex.net\/SID12057",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 25",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12057-download",
            "preacher_name": "Aeron Morgan",
            "preacher_image": "",
            "preacher_description": "Aeron Morgan (1934 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Aeron Morgan in mp3 format. Aeron Morgan is a Welshman, born in Aberaman in the Aberdare Valley, South Wales. Raised in a Christian home, his godly parents had a great influence on his life, and he was converted at a very early age in the local Pentecostal Mission. The assembly was truly a 'sending church,' privileged to see many go forth as missionaries, pastors, and evangelists to different parts of the world. \r\nFrom his parents, and a through steady stream of others touched by God,  brother Morgan's early life was enriched by redeemed drunkards, itinerant preachers who would stay with the Morgans when Aeron was young, ( one of whom would lead him into personal, devotional Bible studies,\"We will just study the book of Colossians this week, alright Aeron?\"), and devout Pentecostal christians of all walks of life who stamped their impression on this man of God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "25"
                }
            ]
        }
    ]
}