{
    "name": "Psalms 26",
    "book": "Psalms",
    "chapter": 26,
    "sermons": [
        {
            "title": "The Saint's Horror at the Sinner's Hell",
            "url": "http:\/\/api.sermonindex.net\/SID13738",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 26:9",
            "topic": "",
            "description": "“Gather not my soul with sinners.” — Psalm 26:9. WE must all be gathered in due course. When time shall have ripened the fruit, it must hang no longer upon the tree, but be gathered into the basket; when the summer's sun has perfectly matured the corn, the sickle must be brought forth, and the harvest must be reaped; to everything there is a season and an end. There shall be a gathering-time for every one of us. It may come to-morrow; it may be deferred another handful of years; it may come to us by the long process of consumption or decline; it may advance with more rapid footsteps, and we may in a moment be gathered to our people. Sooner or later, to use the expressive words of Job, the Almighty shall set his heart upon each of us, and gather unto himself our spirit and our breath. That gathering rests with God! - the prayer of the Psalmist implies it, and many Scriptures affirm it. As Young sings in his Night Thoughts – “An angel's arm can't hurl me to the grave.” Accidents are but God's arrangements; diseases are his decrees; fevers his servants, and plagues his messengers. Our mortality is immortal, till the Eternal wills its death. “Return, ye children of men” can be spoken by none but our heavenly Father, and when he gives the word, return we must without delay...",
            "download": "http:\/\/api.sermonindex.net\/SID13738-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "26"
                }
            ]
        }
    ]
}