{
    "name": "Psalms 30",
    "book": "Psalms",
    "chapter": 30,
    "audio_sermons": [
        {
            "title": "Getting Ready To Light Your Lamp And Dance",
            "url": "http:\/\/sermonindex.net\/SID21670",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 30:1-12",
            "topic": "End Times",
            "description": "December 5, 2010 - Weeping may endure for the night but joy comes in the morning. There are seasons in our life when God will allow forms of sorrow into our heart for His own purpose. Sometimes God will allow times of isolation so we can stop and think about His ways in order to get an eternal perspective. If you are feeling alone this message reminds us that it was the shepherds that were isolated out in the field who got the revelation of Jesus. It was Simeon a lonely man who waited for the comfort of Christ. And it was Anna, a widow who was no stranger to sorrow. Has it ever occurred to you that isolation and loneliness might be mandatory for us to see Christ in the midst of crisis. In the last days it talks about a bride filled with oil who will see Him in calamity. Those who have suffered will be filled with oil so they see the nearness of Christ and His power. Get ready to light your lamp and dance!",
            "download": "http:\/\/sermonindex.net\/SID21670-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Shall the Dust Praise Thee?",
            "url": "http:\/\/sermonindex.net\/SID17748",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 30:1-12",
            "topic": "Fallen Nature",
            "description": "November 30, 2008 - Those who are governed by their fallen nature make attempts to be spiritual apart from the enablement of the life of Christ. Satan convinces man that it is of value to live life by self effort. It is this kind or reasoning that leads us into despair. The way out of despair is understanding that Jesus Christ was brought into the deepest places of sin and darkness yet He has triumphed over them. When Jesus Christ went into the grave and resurrected from the dead He broke the power over the devil and despair. We must choose to let God be God in us. This is the finest hour for the Church of Jesus Christ. God is calling us to get up and shake ourselves out of the dust.",
            "download": "http:\/\/sermonindex.net\/SID17748-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "30"
                }
            ]
        }
    ]
}