{
    "name": "Psalms 31",
    "book": "Psalms",
    "chapter": 31,
    "sermons": [
        {
            "title": "(Through The Bible) Psalms 31-40",
            "url": "https:\/\/sermonindex.info\/SID6412",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 31-40",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID6412-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "Church History - Martin Luther & the Problem of Indulgences",
            "url": "https:\/\/sermonindex.info\/SID6815",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 31:1, Romans 1:17",
            "topic": "",
            "description": "Martin Luther was born in Germany to a poor mining family, Luther though excelled at school and studied law at university, he was set to be one of the top legal minds in Europe.  However due to a vow to Saint Barbara, patron saint of miners, he became a monk and applied his legal mind to theology, he saw the Lord as righteous Judge of the whole creation and thus was zealous to live a holy life.  In 1510 he went to Rome, as he was disillusioned with the way the church was in Germany, there he became even more concerned and left declaring that the city was built over Hell itself! He returned to Germany where he became a Bible teacher it was here in preparing for a lesson one day that he read Psalm 31:1 and later Romans 1:17 and realised by faith man can not only be deemed 'not guilty' but actually be seen as righteous before a perfect God.",
            "download": "https:\/\/sermonindex.info\/SID6815-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "31"
                },
                {
                    "book": "Romans",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Marvelous Kindness In A Strong City",
            "url": "https:\/\/sermonindex.info\/SID21280",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 31:21-24, Psalm 31:9-13, 1 Corinthians 10:13",
            "topic": "Kindness",
            "description": "November 7, 2010 - Are you in a tight or distressful place? A place where you feel hemmed in? In this time of trial the devil will come at you with the lie that your life has no purpose. Don’t give in to the voice of the enemy, because you have the power of God in you, and you don’t have to believe those lies. Jesus Christ went through everything you are going through and His voice is the only voice that counts. God will never allow your enemies to triumph over you. Sometimes it is as simple as hearing a Word from God. There is a point when God quiets every voice and calls you to be silent before Him so He can calm the storm. When God speaks you will have peace in your inner man. You will hear Him say, “Peace be still!” Keep silent before Him and let Him renew your strength.",
            "download": "https:\/\/sermonindex.info\/SID21280-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "31"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Thou hast set my Feet in a Large Place",
            "url": "https:\/\/sermonindex.info\/SID15747",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 31:7-8",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15747-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "31"
                }
            ]
        }
    ]
}