{
    "name": "Psalms 32",
    "book": "Psalms",
    "chapter": 32,
    "audio_sermons": [
        {
            "title": "Stubbornness",
            "url": "http:\/\/sermonindex.net\/SID15704",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 16:26-28, Psalms 32:9, 1 Samuel 15:23",
            "topic": "Stubbornness",
            "description": "May 27, 2007 - A stubborn person is a person who is fixed in purpose or condition, resistant to change and unreasonably obstinate. A stubborn person has an inner flaw and this inner flaw doesn't show until they are called to put all they are in the hands of God and walk in obedience. A stubborn person can appear humble, zealous and even excercise spiritual gifts, but there comes a certain point they can't get passed. They can't lay down their inner thoughts of the way things should be done and surrender to God's ways. God will allow a sense of emptiness come into our souls to get our attention. He is looking for a sincere heart to submit to the authority of His Word. When we choose to obey Him the power of sin and decay is cancelled in our lives. The only way out of stubbornness is to HUMBLE ourselves before God.",
            "download": "http:\/\/sermonindex.net\/SID15704-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Exodus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "Terrible Convictions and Gentle Drawings",
            "url": "http:\/\/sermonindex.net\/SID13277",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 32:3-4",
            "topic": "",
            "description": "David here describes a very common experience amongst convinced sinners. He was subjected to extreme terrors and pangs of conscience. These terrors were continual; they scared him at night with visions, they terrified him all day with dark and gloomy forebodings. “Day and night thy hand was heavy upon me.” His pain was so extreme, that when he resorted to prayer he could scarcely utter an articulate word. There were groanings that could not be uttered within his spirit; and hence he calls his prayer roaring — a “roaring all the day long.” Wherever he was, his spirit seemed to be always sighing, sending a full torrent of melancholy groans upwards towards God; a “roaring all the day long.” So far did this groaning proceed, that at last his bodily frame began to show evidences of it. He grew old, and that not merely in the lines of the countenance and the falling in of the cheeks, but his very bones seemed as if they partook of the suffering. He became like an old man before his time. We have heard of some who through severe trouble have had their hair blanched in a single night.",
            "download": "http:\/\/sermonindex.net\/SID13277-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "The Happy Radiant Christian Psalm 32:",
            "url": "http:\/\/sermonindex.net\/SID10098",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 32",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10098-download",
            "preacher_name": "Welcome Detweiler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "What Christ Means To Me!",
            "url": "http:\/\/sermonindex.net\/SID10438",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 32:7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10438-download",
            "preacher_name": "Stan Ford",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "32"
                }
            ]
        },
        {
            "title": "Worship",
            "url": "http:\/\/sermonindex.net\/SID5209",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Chronicles 29:11, Psalm 32, Jeremiah 32:40",
            "topic": "",
            "description": "Worship is something we give our life, strengthe and heart to and it satisfies. God created human beings to worship and they will worship something. David is a great example of a true worshipper. His life illustrates the value of worshipping God in spirit and in truth",
            "download": "http:\/\/sermonindex.net\/SID5209-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                }
            ]
        }
    ]
}