{
    "name": "Psalms 34",
    "book": "Psalms",
    "chapter": 34,
    "sermons": [
        {
            "title": "(1 Samuel) God Helps the Undeserving",
            "url": "http:\/\/sermonindex.net\/SID10651",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21:10 - 22:1, Psalm 56, Psalm 34, Psalm 142",
            "topic": "",
            "description": "David, still on the run from Saul, heads to the Philistines to take refuge, and ends up in Gath the hometown of Goliath!  This was a very strange thing for David to do as he has also killed thousands of Philistines, as well as Goliath.  So David is captured by them and imprisoned.  David knowing he has done wrong does the right thing and cries out to God, this is when he wrote Psalm 56 and it can be seen in this Psalm how David's heart is turned back to the Lord as he cries out for mercy.  He is then brought before Achish the king, David pretends to be mad which must have taken great humility to act that way before his enemies so Achish releases David and on his way from Gath David praises the Lord mightily, Psalm 34.  The Lord showed His love to David even though David did not deserve it, which shows the great love and mercy of God.  David then heads for the cave of Adullam from which you can see the valley where David slew Goliath and David lamented and wrote Palm 142.",
            "download": "http:\/\/sermonindex.net\/SID10651-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Psalms",
                    "chapter": "56"
                },
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "142"
                }
            ]
        },
        {
            "title": "Christian Growth The Life of Brokenness",
            "url": "http:\/\/sermonindex.net\/SID7834",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:18, James 4:6, Judges 7:18-19, Matthew 14:19",
            "topic": "Brokenness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7834-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "James",
                    "chapter": "4"
                },
                {
                    "book": "Judges",
                    "chapter": "7"
                },
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Overcoming The Voices Of Fear",
            "url": "http:\/\/sermonindex.net\/SID2777",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:1-10",
            "topic": "Fear",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID2777-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "Psalm 34:1",
            "url": "http:\/\/sermonindex.net\/SID26104",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:1",
            "topic": "Praise",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID26104-download",
            "preacher_name": "Bakht Singh",
            "preacher_image": "\/images\/bakht_singh.gif",
            "preacher_description": "Bakht Singh (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Bakht Singh in mp3 format. He is often regarded as one of the most well-known bible teachers and preachers and pioneers of the Indian Church movements. He was India's foremost evangelist, preacher and indigenous church planter who founded churches based on New Testament principles. He began a worldwide indigenous church-planting movement in India that eventually saw more than 10,000 local churches. Norman Grubb missionary statesman, author and teacher: \"In all my missionary experience I think these churches on their New Testament foundations are the nearest I have seen to a replica of the early church and a pattern for the birth and growth of the young churches in all the countries which we used to talk about as mission fields.\"\r\nLife of prayer. Brother Bakht Singh was a man of prayer. He spent hours upon his knees in communion with the Lord seeking the Lord's mind regarding His will concerning the work and ministry. Therefore, the Lord also honored him and blessed him beyond any human understanding. This is one of the reasons why the Lord has used him so mightily for the edification of His Body and for the extension of His glorious kingdom both in India and abroad.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                }
            ]
        },
        {
            "title": "Religiosity or Spirituality #2 - The Two Streams",
            "url": "http:\/\/sermonindex.net\/SID4108",
            "size": "8315904",
            "format": "mp3",
            "scripture": "Genesis 3 - 4, Psalm 34:18",
            "topic": "Religiosity",
            "description": "When Adam fell, he not only gained a gravitation towards sin but also towards being religious.  Brother Zac contrasts these two streams--religiosity vs. spirituality--as it threads its way through the Bible, starting with Cain and Abel, to the Pharisees and Jesus, to the end times in Revelation with Babylon and Jerusalem.  Externally these can appear so similar, but the underlying spirit is as different as heaven is from hell.",
            "download": "http:\/\/sermonindex.net\/SID4108-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Genesis",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "The Life Of Brokenness ",
            "url": "http:\/\/sermonindex.net\/SID12763",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 34:18, Matthew 14:19",
            "topic": "Brokenness",
            "description": "William MacDonald ministers on the subject of brokenness. God has great purposes for broken people and cannot resist the humble. Broken things are honoured by the Word of God. God's ways are not mens ways. This is a challenging message on this vital subject for Christian living.",
            "download": "http:\/\/sermonindex.net\/SID12763-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Matthew",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "The Lord Has Promised to Deliver You",
            "url": "http:\/\/sermonindex.net\/SID13878",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 34:4",
            "topic": "",
            "description": "February 19, 2006. The most heart wrenching prayers are silent utterances and a simple help. God hears and responds to the faintest cry of His people. Before you get into your situation, God already has a plan to bring you through. The whole battle is against our faith. The determination to deliver us was displayed on the cross. Jesus Christ is our personal deliverer and in Him we have the victory over our sin and temptations.",
            "download": "http:\/\/sermonindex.net\/SID13878-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "34"
                }
            ]
        }
    ]
}