{
    "name": "Psalms 37",
    "book": "Psalms",
    "chapter": 37,
    "audio_sermons": [
        {
            "title": "Four Steps to a Fruitful Christian Life",
            "url": "http:\/\/sermonindex.net\/SID23505",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 37",
            "topic": "Fruitfulness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23505-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "Keeping Your Spirit Focused",
            "url": "http:\/\/sermonindex.net\/SID27896",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 37:1-4 ",
            "topic": "Discouragement",
            "description": "Listen carefully to this message. Pastor Cymbala teaches how to handle the days discouraging news. Psalms 37:1-4 (NIV & GNB)",
            "download": "http:\/\/sermonindex.net\/SID27896-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "Revival - God's Finger Pointing",
            "url": "http:\/\/sermonindex.net\/SID13605",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 37:28, Isaiah 61:8",
            "topic": "",
            "description": "Revival is simply God's finger pointed at me; it is like lifting the lid off my heart and letting God look inside.  Lou Sutera shows how though the end results of revival may be joy and gladness, it begins in judgment.  \"Revival,\" he says, \"is surgery, not a Band-Aid.\"",
            "download": "http:\/\/sermonindex.net\/SID13605-download",
            "preacher_name": "Lou Sutera",
            "preacher_image": "",
            "preacher_description": "Lou Sutera ( - )\r\nListen to freely downloadable audio sermons by the speaker Lou Sutera in mp3 format. Twin brothers Used of God in revival since 1971. Single and joint church revival ministries usually two and one-half weeks in length. Characterized by straight-forward preaching, visual presentations, follow-through teaching, personal counselling by lay-team workers, etc. Crusades include sessions for men, ladies, youth, children, church leaders and pastoral staffs.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                },
                {
                    "book": "Isaiah",
                    "chapter": "61"
                }
            ]
        },
        {
            "title": "Stand Still and See the Salvation of the Lord",
            "url": "http:\/\/sermonindex.net\/SID4183",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 37:23, Exodus 14:13",
            "topic": "",
            "description": "February 12, 2006 – Very often we are driven by the enemy into places where fear and we allow this spirit to take control of us. Fear always produces wrong reasoning. Wrong reasoning leads to wrong conclusions which lead us to wrong actions and we end up on a wrong pathway. We must refuse to be led by fear and begin to aloe faith to lead us. Faith in Jesus always parts the waters of impossibilities and causes us to stand still and see Yeshua our Way maker.",
            "download": "http:\/\/sermonindex.net\/SID4183-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                },
                {
                    "book": "Exodus",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Sunshine in the Heart",
            "url": "http:\/\/sermonindex.net\/SID5063",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 37:4",
            "topic": "",
            "description": "THERE are two teachings in our text which must be very surprising to those who are strangers to vital godliness; to sincere believers these marvels are recognised facts, but to the outside world they will appear passing strange. We have here, first of all, the life of a believer described as a delight in God; and thus we are certified of the great truth that true religion overflows with happiness and joy. Ungodly persons and mere professors never look upon religion as a joyful thing, to them it is service, duty, or necessity, but never pleasure and delight.",
            "download": "http:\/\/sermonindex.net\/SID5063-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "The Devil's Twins - Fret and Fear",
            "url": "http:\/\/sermonindex.net\/SID4264",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 37:1,1 Samuel 25,Psalm 46:1-11",
            "topic": "",
            "description": "Scripture says in the last days evil men will wax worse and worse, and often the righteous are enflamed with anger when they see and hear of the wickedness perpetrated against the innocent, such as abortion. Bro. Wilkerson illustrates through the life of David in the scriptures how not to react to the wickedness of men when you are angry, in the flesh. We need to learn to stand in the gap in intercession and not fear what is coming on the earth in these last days, because the Lord will keep his own secure.",
            "download": "http:\/\/sermonindex.net\/SID4264-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                },
                {
                    "book": "Psalms",
                    "chapter": "46"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        }
    ]
}