{
    "name": "Psalms 38",
    "book": "Psalms",
    "chapter": 38,
    "audio_sermons": [
        {
            "title": "Depression - It's Cause and Cure ",
            "url": "http:\/\/sermonindex.net\/SID19777",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 38, Genesis 4:1-6",
            "topic": "Depression",
            "description": "God's explanation of why people are depressed and the Biblical way of deliverance. Four things that can cause depression. First, ordinary burdens of life that are handled Biblically. Second, actual physical problems. Third, demonic oppression. Fourth, Sin which is what this message mainly teaches.",
            "download": "http:\/\/sermonindex.net\/SID19777-download",
            "preacher_name": "Richard Sipley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "38"
                },
                {
                    "book": "Genesis",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "God Doesn't Give Up on Children Who Fall",
            "url": "http:\/\/sermonindex.net\/SID4299",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 37:32-33,Psalm 38",
            "topic": "Failure",
            "description": "The devil monitors your life and walk with God. He watches for any compromise that he can accuse or condemn you with, to your conscience, and to God. This is a message of hope and help for the backslidden, or for those who have grown lukewarm or cold. It is a sobering reality that believers have an enemy who will not be satisfied until they are dead. But greater is He that is in us, than he that is in the world.!!! (1 John 4:4)",
            "download": "http:\/\/sermonindex.net\/SID4299-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "38"
                },
                {
                    "book": "Psalms",
                    "chapter": "37"
                }
            ]
        },
        {
            "title": "Seeing Through the Hands of Jesus",
            "url": "http:\/\/sermonindex.net\/SID16291",
            "size": "0",
            "format": "mp3",
            "scripture": "Mark 8:22-26, Psalm 38:10",
            "topic": "Compassion Of Christ",
            "description": "November 18, 2007 - When we intermingle with the ways of the world, we lose sight of God's ways. We are not called to have the earth bless us, we are called to bless the earth. Our cry has to be \"Jesus, touch us and cause us to see what you see and feel what you feel! Lord, cause us to have something deeper than sporadic bursts of kindness.\" Our eyes should be opened to the compassion of Christ and our hands should be committed to make a difference in society. When we move out in this direction, there is a divine power imputed to us for the work of the Lord.",
            "download": "http:\/\/sermonindex.net\/SID16291-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Mark",
                    "chapter": "8"
                },
                {
                    "book": "Psalms",
                    "chapter": "38"
                }
            ]
        },
        {
            "title": "The Heaviness of Sin",
            "url": "http:\/\/sermonindex.net\/SID4292",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 38:1-6,Ezekiel 8",
            "topic": "",
            "description": "Two issues, both serious are addressed. If you feel the heaviness of sin it is the mercy of God trying to draw you back to the cross so you can be saved from your sin. There are those who respond with remorse and repentance to this and those we do not because they have made peace with it. If you are sick of your sin, and weary of it, there is hope for God will never refuse a sincere heart. But if you are cold, and have no urgency to pray or read the word of God, no concern for the lost and are taking your sin lightly, you are on very dangerous ground. If you are being entertained by watching the sin of others on television, you are guilty of sin.",
            "download": "http:\/\/sermonindex.net\/SID4292-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "38"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "8"
                }
            ]
        }
    ]
}