{
    "name": "Psalms 48",
    "book": "Psalms",
    "chapter": 48,
    "audio_sermons": [
        {
            "title": "As We Have Heard, So Have We Seen",
            "url": "http:\/\/sermonindex.net\/SID14347",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 48:8",
            "topic": "",
            "description": "“As we have heard, so have we seen in the city of the Lord of hosts, in the city of our God: God will establish it for ever.”-Psalm 48:8. 'As we have heard, so have we seen': this is seldom true. In many places we see what we have not heard, and what we have heard we do not see. Time was when many simpletons believed that the streets of London were paved with gold. I am sure I do not know any part of London in which a single lump of that metal can be found in the footway. Ten thousand idle tales there are in every country, of mines where fortunes may be dug out of the earth, and plains where wealth forces itself on the immigrant; but how seldom do we hear the good news, 'As we have heard, so have we seen.' But when you come into the 'City of the Lord of hosts, in the city of our God,' the reports about it are true, and the truth exceeds the report; for, like the Queen of Sheba, we cry, 'The half was not told me.' When we speak of the privileges of the Church of God on earth it is impossible to exaggerate. 'Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God.' Behold, what blessings, what riches, what royalties the Lord Jesus bestows upon his chosen! How cleansed they are by his blood! How quickened by his life! How honored by his glorious enthronement at the right hand of the Father...",
            "download": "http:\/\/sermonindex.net\/SID14347-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "48"
                }
            ]
        },
        {
            "title": "The Liberation of Zion",
            "url": "http:\/\/sermonindex.net\/SID15868",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 48:1-2",
            "topic": "Zion",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15868-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "48"
                }
            ]
        }
    ]
}