{
    "name": "Psalms 50",
    "book": "Psalms",
    "chapter": 50,
    "sermons": [
        {
            "title": "Spiritual Authority",
            "url": "http:\/\/api.sermonindex.net\/SID3387",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 50:18,Nahum 1-3",
            "topic": "Spiritual Authority",
            "description": "You can stand up to the devil and say enough! Too many Christians go to church and read their Bibles, but lack the power that only comes through full submission to the Holy Ghost, and the Word of God, to combat the powers of the enemy. You can take back your family for God, take back what the enemy has stolen from you. Pray the Lord of the Harvest will send you forth into the field.  Don't be consenting when you behold the thief destroying and stealing the lives of your loved ones. Stand in the gap, and defy him. He is defeated already. Powerful preaching on an important issue!!",
            "download": "http:\/\/api.sermonindex.net\/SID3387-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        },
        {
            "title": "TO CALL UPON JESUS",
            "url": "http:\/\/api.sermonindex.net\/SID21472",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 50:15",
            "topic": "Radio Show",
            "description": "Have you experienced God’s power in your life?  Do you know the reality of His victory over your problems, over the sins which bind you and over your failures?  If not, this meditation can teach you how to call upon Jesus in present circumstances as well as in difficult times ahead.",
            "download": "http:\/\/api.sermonindex.net\/SID21472-download",
            "speaker_name": "Basilea Schlink",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        },
        {
            "title": "TO CALL UPON JESUS",
            "url": "http:\/\/api.sermonindex.net\/SID25477",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 50:15",
            "topic": "Radio Show",
            "description": "God lives and works today! Have you experienced His power in your life? Do you know the reality of His victory over your problems, over the sins which bind you and over your failures? If not, today's meditation by Basilea Schlink can teach you how to call upon Jesus in present circumstances as will as in difficult times ahead.",
            "download": "http:\/\/api.sermonindex.net\/SID25477-download",
            "speaker_name": "Basilea Schlink",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        }
    ]
}