{
    "name": "Psalms 50",
    "book": "Psalms",
    "chapter": 50,
    "audio_sermons": [
        {
            "title": "Spiritual Authority",
            "url": "http:\/\/sermonindex.net\/SID3387",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 50:18,Nahum 1-3",
            "topic": "Spiritual Authority",
            "description": "You can stand up to the devil and say enough! Too many Christians go to church and read their Bibles, but lack the power that only comes through full submission to the Holy Ghost, and the Word of God, to combat the powers of the enemy. You can take back your family for God, take back what the enemy has stolen from you. Pray the Lord of the Harvest will send you forth into the field.  Don't be consenting when you behold the thief destroying and stealing the lives of your loved ones. Stand in the gap, and defy him. He is defeated already. Powerful preaching on an important issue!!",
            "download": "http:\/\/sermonindex.net\/SID3387-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nahum",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "50"
                }
            ]
        }
    ]
}