{
    "name": "Psalms 53",
    "book": "Psalms",
    "chapter": 53,
    "sermons": [
        {
            "title": "Living in Fear Where No Fear is",
            "url": "http:\/\/sermonindex.net\/SID14794",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 53:1-6",
            "topic": "Fear",
            "description": "February 13, 2007 - When we magnify the power of our enemies over the power of our God we place ourselves in a foolish position. God is more powerful then any enemy that comes our way. Magnifying the enemy over the greatness of our God is saying in our hearts that there is no God. There is a point in our lives when we have to face our fears and believe God to deliver us. God has already defeated every enemy we will ever face in Jesus Christ. We must understand the enemy is not defying us, but rather he is attempting to defy the Christ in us who has purchased us with His own Blood. We are called to be a compelling testimony to this generation and to show that Jesus Christ is alive.",
            "download": "http:\/\/sermonindex.net\/SID14794-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "53"
                }
            ]
        }
    ]
}