{
    "name": "Psalms 55",
    "book": "Psalms",
    "chapter": 55,
    "audio_sermons": [
        {
            "title": "The Glory of God in Awful Places",
            "url": "http:\/\/sermonindex.net\/SID16285",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 55:4-8, 2 Timothy 2:12, Luke 9:23-24",
            "topic": "Glory Of God",
            "description": "Have you ever found yourself in such a dark place that you don't see anything of God and it seems like there is no purpose for it? These awful places is where we meet God . Its where he works something very deep in us; something we cant learn from a text book. All of God's future deliverers are prepared in these awful places. These are a people who will emerge our of these valley of suffering with a testimony of the glory of God. The word of God declares that those who suffer with Christ will also reign with Him. Do you trust God to work all thing for the good and bring about a glorious victory?",
            "download": "http:\/\/sermonindex.net\/SID16285-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "55"
                },
                {
                    "book": "Luke",
                    "chapter": "9"
                },
                {
                    "book": "2 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Temptation to Run",
            "url": "http:\/\/sermonindex.net\/SID24257",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 55",
            "topic": "Temptation",
            "description": "Have you ever wanted to give up? We have all been tempted to run from a painful situation. Let's see how the even David in the bible dealt with the deep pain in his own life.",
            "download": "http:\/\/sermonindex.net\/SID24257-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "55"
                }
            ]
        }
    ]
}