{
    "name": "Psalms 56",
    "book": "Psalms",
    "chapter": 56,
    "sermons": [
        {
            "title": "(1 Samuel) God Helps the Undeserving",
            "url": "http:\/\/api.sermonindex.net\/SID10651",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21:10 - 22:1, Psalm 56, Psalm 34, Psalm 142",
            "topic": "",
            "description": "David, still on the run from Saul, heads to the Philistines to take refuge, and ends up in Gath the hometown of Goliath!  This was a very strange thing for David to do as he has also killed thousands of Philistines, as well as Goliath.  So David is captured by them and imprisoned.  David knowing he has done wrong does the right thing and cries out to God, this is when he wrote Psalm 56 and it can be seen in this Psalm how David's heart is turned back to the Lord as he cries out for mercy.  He is then brought before Achish the king, David pretends to be mad which must have taken great humility to act that way before his enemies so Achish releases David and on his way from Gath David praises the Lord mightily, Psalm 34.  The Lord showed His love to David even though David did not deserve it, which shows the great love and mercy of God.  David then heads for the cave of Adullam from which you can see the valley where David slew Goliath and David lamented and wrote Palm 142.",
            "download": "http:\/\/api.sermonindex.net\/SID10651-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Psalms",
                    "chapter": "56"
                },
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "142"
                }
            ]
        },
        {
            "title": "The Power of the Holy Ghost (1 of 2)",
            "url": "http:\/\/api.sermonindex.net\/SID4423",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 2:24,Psalms 16:1,Psalms 56",
            "topic": "",
            "description": "For anyone struggling with a besetting sin, needing deliverance, this is a must-hear message. Once you commit yourself, completely trusting the Holy Ghost to do what the Lord sent him to do the power of the Holy Ghost will work. He is a complete gentleman, he does not force himself on anyone. You must yield willingly.",
            "download": "http:\/\/api.sermonindex.net\/SID4423-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "16"
                },
                {
                    "book": "Psalms",
                    "chapter": "56"
                }
            ]
        }
    ]
}