{
    "name": "Psalms 57",
    "book": "Psalms",
    "chapter": 57,
    "sermons": [
        {
            "title": "Man's Chief End to Glorify God",
            "url": "http:\/\/api.sermonindex.net\/SID20216",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57",
            "topic": "Glorifying God",
            "description": "We need ever keep before us that we exist for the glory of God. He chose us in Christ and predestined us “according to the good pleasure of His will, to the praise of the glory of His grace, wherein He hath made us accepted in the Beloved.” Man is a fallen creature, spiritually leprous, ignorant, and blind, but ever subject to the Most High. While man will want to remonstrate against such an assertion, it is still true. Every created thing comes under the holy and sovereign jurisdiction of ‘The Most High God’. That right He never foregoes. He is going to call all beings to account to Him. This challenging message brings out the ways in which this can be practically achieved by us.",
            "download": "http:\/\/api.sermonindex.net\/SID20216-download",
            "speaker_name": "Aeron Morgan",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "The Alarm",
            "url": "http:\/\/api.sermonindex.net\/SID13786",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57:8",
            "topic": "",
            "description": "“I myself will awake early.” — Psalm 57:8. THE proper subject to treat upon with such a text as this would be the propriety and excellence of early rising, especially when we are desirous of praising or serving God. The dew of dawn should be consecrated to devotion. The text is a very remarkable expression, and might fitly be made the early-riser's motto. It is, in the original, a highly poetical phrase, and Milton and others have borrowed or imitated it. 'I will awaken the morning.' So early would the psalmist arise for the praise of God, that he would call up the day, and bid the sun arise from the chambers of the east, and proceed upon his journey. 'I will awaken the morning.' Early rising has the example of Old Testament saints to recommend it, and many modern saints having conscientiously practiced it, have been loud in its praise. It is an economy of time, and an assistance to health, and thus it doubly lengthens life. Late rising is too often the token of indolence, and the cause of disorder throughout the whole day. Be assured that the best hours are the first. Our City habits are to be deplored, because by late hours of retirement at night we find early rising difficult if not impossible. If we are able to escape the shackels of custom, and secure for devotion and contemplation the hour when the dew is on the grass, we may count ourselves thrice happy...",
            "download": "http:\/\/api.sermonindex.net\/SID13786-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "The Alarum",
            "url": "http:\/\/api.sermonindex.net\/SID14345",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57:8",
            "topic": "",
            "description": "“I myself will awake early.” — Psalm 57:8. THE proper subject to treat upon with such a text as this would be the propriety and excellence of early rising, especially when we are desirous of praising or serving God. The dew of dawn should be consecrated to devotion. The text is a very remarkable expression, and might fitly be made the early-riser's motto. It is, in the original, a highly poetical phrase, and Milton and others have borrowed or imitated it. 'I will awaken the morning.' So early would the psalmist arise for the praise of God, that he would call up the day, and bid the sun arise from the chambers of the east, and proceed upon his journey. 'I will awaken the morning.' Early rising has the example of Old Testament saints to recommend it, and many modern saints having conscientiously practiced it, have been loud in its praise. It is an economy of time, and an assistance to health, and thus it doubly lengthens life. Late rising is too often the token of indolence, and the cause of disorder throughout the whole day. Be assured that the best hours are the first. Our City habits are to be deplored, because by late hours of retirement at night we find early rising difficult if not impossible. If we are able to escape the shackels of custom, and secure for devotion and contemplation the hour when the dew is on the grass, we may count ourselves thrice happy...",
            "download": "http:\/\/api.sermonindex.net\/SID14345-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "The God of Glory - No Threat to His Children",
            "url": "http:\/\/api.sermonindex.net\/SID20215",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57",
            "topic": "Glory Of God",
            "description": "The Psalm has an incredible revelation of God in His personal glory, His providential care, His loving nature, His sovereign authority and just omnipotence – yet you must never allow your troubles to overwhelm you and keep you from freely reaching out to Him. God, with all His awesome glory, is no threat to His children. He is FOR THEM! Let us not doubt His goodness and grace, but CRY UNTO HIM TODAY.",
            "download": "http:\/\/api.sermonindex.net\/SID20215-download",
            "speaker_name": "Aeron Morgan",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "The God of Glory - The Delights of an Awakened Heart",
            "url": "http:\/\/api.sermonindex.net\/SID20218",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57",
            "topic": "Glory Of God",
            "description": "With the eyes of his heart opened, and the emotions of his heart stirred, David makes this incredible statement of intent: “My heart is fixed, O God, my heart is fixed; I will sing and give praise...” It was a heart fixed in hope, in purpose, in adoration, and in tranquil rest. David rouses himself in respect of every faculty of his God-touched and God-illumined being to be in the employ of worship. THIS is his delight. He stirs himself up so that all the powers of his soul, and every talent he was endowed with, was used to set forth God’s praises. His soul cannot be dormant, inactive, or silent. As in all true spiritual awakenings, it is not possible to feel God at work in your own heart and see Him at work in the Church, without it radically affecting your entire devotional life and your spiritual worship.",
            "download": "http:\/\/api.sermonindex.net\/SID20218-download",
            "speaker_name": "Aeron Morgan",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        },
        {
            "title": "The God of Glory - Worship in the Strangest Place",
            "url": "http:\/\/api.sermonindex.net\/SID20211",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 57",
            "topic": "Glory Of God",
            "description": "David is glaringly honest, never hiding his feelings – yet he does permit the adverse situations he faces destroy his faith or dampen his zeal for the honour of God. We are greatly helped to note how David addressed God in the midst of trials of his faith. The triumph of his trust is most conspicuous, such confidence in God as yields praiseful worship in the strangest place.",
            "download": "http:\/\/api.sermonindex.net\/SID20211-download",
            "speaker_name": "Aeron Morgan",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "57"
                }
            ]
        }
    ]
}