{
    "name": "Psalms 6",
    "book": "Psalms",
    "chapter": 6,
    "sermons": [
        {
            "title": "A Confident Answer to An Agonized Plea",
            "url": "https:\/\/sermonindex.info\/SID10740",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 6",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID10740-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Gods People Are Hurting",
            "url": "https:\/\/sermonindex.info\/SID16003",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 6:6",
            "topic": "Hurting",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID16003-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Hindrances to Prevailing Prayer",
            "url": "https:\/\/sermonindex.info\/SID4203",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 6:1-10,Romans 8:26",
            "topic": "Prevailing Prayer",
            "description": "There are many reasons Christians do not pray as they should, and this is one of the gentlest rebukes Pastor Wilkerson has given on this subject. He lovingly explains about the warfare we have to fight our way through to pray, and reveals even if we have neglected to pray as we should, God still wants us to come to him, and he will by the Holy Ghost teach us how to pray as we should. For that alone is how we learn. So stop beating yourself up and get alone with the Holy Spirit and ask him to teach you to pray.",
            "download": "https:\/\/sermonindex.info\/SID4203-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Psalms",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Deep Groanings of the Righteous",
            "url": "https:\/\/sermonindex.info\/SID15620",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 6:1-8",
            "topic": "Righteousness",
            "description": "May 20, 2007 - The moment we were saved the new nature of Christ was put within us. With this new nature of Christ came a deep inner longing and a groan that was put there by God. This inner groaning leads us into the depth of the life of Christ. We groan to become the new creation that God has intended us to be. Satan's most potent tactic against the righteous is to get us to feel that somehow we have fallen into disfavor with God in times of deep inner troubling, when in reality something more deep is going on inside of us. God by His grace will put a groaning in our heart to know Christ in His power and Truth and nothing but CHRIST will satisfy us.",
            "download": "https:\/\/sermonindex.info\/SID15620-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Your Enemies will Leave Suddenly and Ashamed",
            "url": "https:\/\/sermonindex.info\/SID13961",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 6:1-10",
            "topic": "Enemies",
            "description": "The devil will attempt to convince us that we have gone too far and we have sinned our way outside of the love of God. All these temptations are common to man and God will be FAITHFUL to bring us out. There is a sovereign move of God coming to the church of Jesus Christ and He will open up our hearts to the truth of His Word. Our enemies will be put to shame. They will leave suddenly and will not be able to fulfill the assignment they have over your life.",
            "download": "https:\/\/sermonindex.info\/SID13961-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "6"
                }
            ]
        }
    ]
}