{
    "name": "Psalms 60",
    "book": "Psalms",
    "chapter": 60,
    "sermons": [
        {
            "title": "Money, Mules and Travel",
            "url": "http:\/\/api.sermonindex.net\/SID17747",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 60:1-5, John 8:47, Amos 8:11-14",
            "topic": "Voice Of God",
            "description": "November 23, 2008 - In these last days we have to know the voice of God and the cry of God. Jesus longs to reveal Himself to His church and with that revelation will come the knowledge of His burden for the lost. If we desire to hear God's voice we have to hear the whole package, the provision of God and the cry of God for the helplessness of humanity. We must offer all that we are so that God's heart would be satisfied in the earth. If you are willing to be given for others you will know and hear the voice of Jesus. The question is, \"will you give your all for the glory of God\"?",
            "download": "http:\/\/api.sermonindex.net\/SID17747-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "60"
                },
                {
                    "book": "John",
                    "chapter": "8"
                },
                {
                    "book": "Amos",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Testimony of a Fixed Heart",
            "url": "http:\/\/api.sermonindex.net\/SID4217",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 60, Psalm 198",
            "topic": "Maturity",
            "description": "In this sermon, Carter compares Psalm 60 {a Psalm written early in his life} with Psalm 198 {a Psalm written later in his life}.  He points out there is a similarity in both Psalms except for the beginning verses.  Carter’s main point is that in David’s maturity he became a man of a fixed heart and is singing a song of victory in Psalm 108 instead of singing out a song of circumstances and difficulties in Psalm 60.  In this message, Carter brings out promises that are in types that were given to David and are of course given to us too.  We can wake up having a testimony of a fixed heart and singing a song of victory instead of waking up singing a song of our circumstances and having a testimony of the troubles around us.  We can sing a song of victory and have a testimony of a fixed heart if we can realize that we have promises that God will give us the victory through Jesus Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID4217-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "198"
                },
                {
                    "book": "Psalms",
                    "chapter": "60"
                }
            ]
        }
    ]
}