{
    "name": "Psalms 63",
    "book": "Psalms",
    "chapter": 63,
    "audio_sermons": [
        {
            "title": "Breaking Strongholds-When the Past is Your Teacher",
            "url": "http:\/\/sermonindex.net\/SID3192",
            "size": "9043968",
            "format": "mp3",
            "scripture": "1 Samuel 7-8,1 Samuel 12-13,Psalm 63:1-4",
            "topic": "",
            "description": "This is a message about the strongholds of fear and unbelief and the disastrous consequences it had on Israel, and Saul.  Even though the Lord gave them victories, they were not loyal, they rejected his rulership in favor of man's.  God warned them of the consequences. They wanted to have a man to fight their battles, someone they could see, like the world around them had, to go before them, rather than the undefeatable, Almighty God fighting for them. They didn't want to forsake their own ideals and let God be Lord of their life. Saul was representative of this rebellion and illustrates the danger of this kind of stronghold.",
            "download": "http:\/\/sermonindex.net\/SID3192-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "12"
                },
                {
                    "book": "Psalms",
                    "chapter": "63"
                }
            ]
        },
        {
            "title": "Glory of God in Dry Places",
            "url": "http:\/\/sermonindex.net\/SID1388",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 63:1-2, 2 Corinthians 7:5, Psalm 77:7-9",
            "topic": "Discouragement",
            "description": "This message is wonderful for those who are discouraged in their walk with Jesus. God wants to fill us with Himself so that we never run dry - even if our present circumstances seem overwhelming, He is faithful.",
            "download": "http:\/\/sermonindex.net\/SID1388-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "77"
                },
                {
                    "book": "Psalms",
                    "chapter": "63"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Psalm 63",
            "url": "http:\/\/sermonindex.net\/SID9689",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 63",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9689-download",
            "preacher_name": "James K. Boswell",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "63"
                }
            ]
        }
    ]
}