{
    "name": "Psalms 67",
    "book": "Psalms",
    "chapter": 67,
    "audio_sermons": [
        {
            "title": "When the Blessing of God Sends Fear Into the Earth",
            "url": "http:\/\/sermonindex.net\/SID12821",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 67:1-7, 1 Kings 8",
            "topic": "Peace",
            "description": "June 25, 2006 – There is a deep abiding inner peace that only comes from Jesus. This peace is deep within those who know and understan Christ and trust that God has everything under control. When God's word is intwined in our heart and mind we will be led down a pathway of peace. This peace is the mark of the work of God. However, when we begin to leave the single pursuit of gloriying God and begin to find pleasure in this world your heart will turn from truth. You wil find yourself being led away form the will of God , led away by a lust to satisfy self, and you will lose the desire to be a servant.",
            "download": "http:\/\/sermonindex.net\/SID12821-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "67"
                }
            ]
        }
    ]
}