{
    "name": "Psalms 68",
    "book": "Psalms",
    "chapter": 68,
    "audio_sermons": [
        {
            "title": "Changed Into Christ's Image #6",
            "url": "http:\/\/sermonindex.net\/SID11169",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 8:29, Ezekiel 1:16, Psalm 68:15-18",
            "topic": "",
            "description": "Dr. Thompson begins by discussing the fact that Jesus lives in the fire of God’s presence, and that if we are to be with Jesus where He is (John 14:3), we must be ready to live with Him in that Fire. Once we have been prepared to dwell in that fire, and for that fire to dwell in us, we can then go out and minister to lost mankind, bringing that fire and that life to people – it will flow out of us and bring life and light. Dr. Thompson says that is our eternal purpose in Christ – to be priests of God in His Kingdom forever. He discusses the unique unity that Adam and Eve shared, and the similarities with the unity that Christ and the Church are to have. This sermon will challenge you to look at your relationship with God in whole new ways (that sounds cliché, but it is very true in this case).",
            "download": "http:\/\/sermonindex.net\/SID11169-download",
            "preacher_name": "Robert B. Thompson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "8"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "68"
                }
            ]
        },
        {
            "title": "God Shall Arise and Scatter our Enemies",
            "url": "http:\/\/sermonindex.net\/SID15860",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 68:1",
            "topic": "Deliverance",
            "description": "In these last days a battle cry is coming up from those who are in their prayer closet, praying through until we touch the heart of God. God will put a triumphant praise in our heart, and show us that the strongholds of satan are nothing but wax that will melt in the presence of Jesus Christ. We are called to a triumphant faith that shouts with joy, knowing that God will arise and declare to the devil, 'IT IS ENOUGH'. He will scatter our enemies.",
            "download": "http:\/\/sermonindex.net\/SID15860-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "68"
                }
            ]
        }
    ]
}