{
    "name": "Psalms 7",
    "book": "Psalms",
    "chapter": 7,
    "audio_sermons": [
        {
            "title": "(John The Baptist Comes To Town) - Part 4 Turn or Burn!",
            "url": "http:\/\/sermonindex.net\/SID16822",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 7:11-12, Romans 5:1",
            "topic": "John The Baptist",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID16822-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "Psalms",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "An Awakening Sermon",
            "url": "http:\/\/sermonindex.net\/SID24862",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 7:11-12",
            "topic": "Gospel",
            "description": "We live in a day of a compromised gospel, a powerless pulpit and a worldly church. I can sum up the American church today as described by a recent visit of an Oriental pastor who came to America to see for himself what the churches were like. He said, “First, karaoke, then a lecture.” That sums it up friends. We have very little preaching in our pulpits today. It is mainly teaching, teaching informs, teaching transforms. The message you’re about to hear is not a politically correct gospel, rather it is a full presentation of the gospel of the Son of God preached in the full counsel of God.",
            "download": "http:\/\/sermonindex.net\/SID24862-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Setting Fire to Satan's Harvest",
            "url": "http:\/\/sermonindex.net\/SID12021",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 77:3, Psalms 7-9",
            "topic": "Satan",
            "description": "May 21, 2006 – Satan is the master complainerand his desire is to plant a seed of discontentment in our heart. When we are not sarisfied with where God has placed us in the body we will by into the lie of the devil and begiin to complain against God. There is a reward for those who choose to go God's way and learn to be content in whatever state we find ourselves in.",
            "download": "http:\/\/sermonindex.net\/SID12021-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "7"
                },
                {
                    "book": "Psalms",
                    "chapter": "77"
                }
            ]
        }
    ]
}