{
    "name": "Psalms 73",
    "book": "Psalms",
    "chapter": 73,
    "audio_sermons": [
        {
            "title": "Finishing the Course - 08 Being a nobody",
            "url": "http:\/\/sermonindex.net\/SID4140",
            "size": "65845248",
            "format": "mp3",
            "scripture": "1 Corinthians 15:47, Psalms 73:25, 2 Corinthians 12:11",
            "topic": "Finishing Well",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4140-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "12"
                },
                {
                    "book": "Psalms",
                    "chapter": "73"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Psalm 73",
            "url": "http:\/\/sermonindex.net\/SID7907",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 73",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7907-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "73"
                }
            ]
        },
        {
            "title": "The Value of a Righteous Man",
            "url": "http:\/\/sermonindex.net\/SID12799",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 73:13-14",
            "topic": "Righteous",
            "description": "June 18, 2006 – The restraing of evil is found in the presence of the Holy Spirit. We are the temple of thre Holy Spirit and God's presence in our life is a restrainer of evil. When we choose to walk in right relation with God distresses and judgments can be averted by the restraning power of God and this generation has a chance to hear His voice. We must never underestimate the restraing influence in a righteous man who chooses to walk in divine order with God.",
            "download": "http:\/\/sermonindex.net\/SID12799-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "73"
                }
            ]
        }
    ]
}