{
    "name": "Psalms 74",
    "book": "Psalms",
    "chapter": 74,
    "audio_sermons": [
        {
            "title": "(In The Word) 16 - The Adversary In The Church",
            "url": "http:\/\/sermonindex.net\/SID12626",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/sermonindex.net\/SID12626-download",
            "preacher_name": "Milton Green",
            "preacher_image": "\/images\/milton_green.gif",
            "preacher_description": "Milton Green ( - )\r\nListen to freely downloadable audio sermons by the speaker Milton Green in mp3 format. Milton Green was saved from a very hopeless situation of drugs, violence, he literally came to an end of his life almost and the Lord healed him and used him for His glory. He started to study the word of God and started to minister in many conventions including with James Robinson and Leonard Ravenhill.\r\nSome of his main Biblical burdens was to teach the whole counsel of God and to share how to be free from sin and carnality in Christian life. He clearly showed through his teachings on to recognize and have victory through Jesus Christ over the powers of darkness.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Lamentations",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Time To Cry",
            "url": "http:\/\/sermonindex.net\/SID10938",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74",
            "topic": "",
            "description": "\"A Time To Cry\" - a time to cry. Solomon said in Ecclesiastes chapter 3 and verse 4: 'There is a time to weep, and there is a time to laugh; there is a time to mourn, and there is a time to dance'. In some quarters of the church there is a great emphasis today on laughing and on dancing. Today it seems that the church, God's people, sleep instead of weep. They are merry instead of mourning. I do not believe that the church today, especially in the West, is living in a day of laughter and in a day of rejoicing. They might feel themselves to be, they might have been spellbound like those in Galatians chapter 3, where Paul could say to them: 'Who hath bewitched you', who has cast this spell, hypnotised you into believing something as it is not? I believe that, for the child of God today, our day should be a day of weeping and a day of mourning. I believe that it is a time to cry.\r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "http:\/\/sermonindex.net\/SID10938-download",
            "preacher_name": "David Legge",
            "preacher_image": "",
            "preacher_description": "David Legge ( - )\r\nListen to freely downloadable audio sermons by the speaker David Legge in mp3 format. David Legge is a Christian evangelist, preacher and Bible teacher. He served as Assistant Pastor at Portadown Baptist Church before taking up the Pastorate of the Iron Hall Assembly in Belfast, N. Ireland, where he ministered from 1999-2008. He knows has an internant ministry across the world you can access messages and request him as a speaker at the Preach The Word website.\r\n\"Like Israel, who are a type, I believe, in many respects of God's people today: we have been transferred from bondage, the kingdom of darkness, the kingdom of Satan, and we have been placed into the kingdom of light, the kingdom of God's dear Son... and yet many believing New Testament Christians never cross the Jordan. They settle for less than God intended for them. I have to say that there can even be resentment, or resistance, shown toward anyone who will try to get God's people over the Jordan and into their inheritance.\" - David Legge",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        }
    ]
}