{
    "name": "Psalms 74",
    "book": "Psalms",
    "chapter": 74,
    "sermons": [
        {
            "title": "(In The Word) 16 - The Adversary In The Church",
            "url": "http:\/\/api.sermonindex.net\/SID12626",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/api.sermonindex.net\/SID12626-download",
            "speaker_name": "Milton Green",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Lamentations",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Time To Cry",
            "url": "http:\/\/api.sermonindex.net\/SID10938",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74",
            "topic": "",
            "description": "\"A Time To Cry\" - a time to cry. Solomon said in Ecclesiastes chapter 3 and verse 4: 'There is a time to weep, and there is a time to laugh; there is a time to mourn, and there is a time to dance'. In some quarters of the church there is a great emphasis today on laughing and on dancing. Today it seems that the church, God's people, sleep instead of weep. They are merry instead of mourning. I do not believe that the church today, especially in the West, is living in a day of laughter and in a day of rejoicing. They might feel themselves to be, they might have been spellbound like those in Galatians chapter 3, where Paul could say to them: 'Who hath bewitched you', who has cast this spell, hypnotised you into believing something as it is not? I believe that, for the child of God today, our day should be a day of weeping and a day of mourning. I believe that it is a time to cry.\r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "http:\/\/api.sermonindex.net\/SID10938-download",
            "speaker_name": "David Legge",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "Casting Fire Into the Sanctuary",
            "url": "http:\/\/api.sermonindex.net\/SID17237",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74:1-8",
            "topic": "Sanctuary",
            "description": "June 15, 2008 - There are demonic voices and powers of darkness that attempt to turn us away from the power we have in Christ. These voices will say you can't go any farther with God. This message reminds us that it is the LORD who sets the boundaries in the Earth and the truth is that it is the devil who could only go as far as the bloodline of Jesus Christ. It is time to rise up in faith and tell whatever voice is telling us \"we can't\", that God can! God desires to stretch forth His hand and heal us so we can be agents of healing to the unsaved.",
            "download": "http:\/\/api.sermonindex.net\/SID17237-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "God's Hatchet",
            "url": "http:\/\/api.sermonindex.net\/SID15398",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74",
            "topic": "Defence",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15398-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "Oh God, How Long Shall the Enemy Reproach",
            "url": "http:\/\/api.sermonindex.net\/SID1042",
            "size": "7501824",
            "format": "mp3",
            "scripture": "Psalm 74:10",
            "topic": "Reproach",
            "description": "This message is very much for those who may feel that the \"enemy\" is attacking them on all sides. It especially deals with those who are walking about as though \"crushed\" by the enemy because of past hurts, etc.. It also deals with those who have had to leave certain churches because of false teaching. We need to stop blaming and focusing on the false, (though it is OK to recognize the problem) and instead focus on Christ and His faithfulness. He will see us through.",
            "download": "http:\/\/api.sermonindex.net\/SID1042-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        },
        {
            "title": "The Adversary In The Church by Milton Green",
            "url": "http:\/\/api.sermonindex.net\/SID16648",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 74, Ezekiel 34, Lamentations 1",
            "topic": "Podcast",
            "description": "Milton Green shares a very strong penetrating message about the state of the church in the modern day. The devil and the powers of darkness have been having much control and infiltration into the church in the modern day. A much needed message to hear of things to come.",
            "download": "http:\/\/api.sermonindex.net\/SID16648-download",
            "speaker_name": "SermonIndex.net Classics Podcast",
            "_scripture": [
                {
                    "book": "Lamentations",
                    "chapter": "1"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "74"
                }
            ]
        }
    ]
}