{
    "name": "Psalms 76",
    "book": "Psalms",
    "chapter": 76,
    "sermons": [
        {
            "title": "The Wrath of Satan Shall Praise God",
            "url": "http:\/\/api.sermonindex.net\/SID13871",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 76:4-10",
            "topic": "",
            "description": "August 13, 2006. The present wrath that is in the world today is beyond human nature. This wrath is a satanic rage of the powers of darkness against the Lamb of God.But the word of God promises that that the wrath of satan will have to praise God. When Jesus comes on the scene there is no power of hell that can stand against Him. Where sin abounds the grace of God much abounds in a greater measure. In these last days of darkness there is going to be an out pouring of divine grace on every nation.The gates of hell will not prevail against the church of Jesus Christ. The weapon for every child of God is the power of the promises of God.",
            "download": "http:\/\/api.sermonindex.net\/SID13871-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "76"
                }
            ]
        }
    ]
}