{
    "name": "Psalms 8",
    "book": "Psalms",
    "chapter": 8,
    "audio_sermons": [
        {
            "title": "(basics) 27. Praise Drives Satan Out",
            "url": "http:\/\/sermonindex.net\/SID8137",
            "size": "0",
            "format": "mp3",
            "scripture": "Isaiah 61:1-3, Psalm 8:2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8137-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "61"
                },
                {
                    "book": "Psalms",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Crowns",
            "url": "http:\/\/sermonindex.net\/SID17592",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 8",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17592-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "When I Consider The Heavens",
            "url": "http:\/\/sermonindex.net\/SID9882",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 8",
            "topic": "Man",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9882-download",
            "preacher_name": "Earl R. Clark",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "8"
                }
            ]
        }
    ]
}