{
    "name": "Psalms 80",
    "book": "Psalms",
    "chapter": 80,
    "sermons": [
        {
            "title": "A Revival Of Poverty by Derek Melton",
            "url": "http:\/\/api.sermonindex.net\/SID21006",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 5:3, Isaiah 57:15, Psalm 80:14-19",
            "topic": "Revival Conference",
            "description": "Brother Melton captures the essence of biblical\/historical revival and those who would seek it in this message. Drawing amply from the scriptures, he paints a portrait of the revival spirit in its simplicity and pureness. He delivers with passion and brokenness as he accurately identifies the single reason why we do not see revival in our day. Listen, find out, be transformed.",
            "download": "http:\/\/api.sermonindex.net\/SID21006-download",
            "preacher_name": "Revival Conference Texas 2010",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "5"
                },
                {
                    "book": "Isaiah",
                    "chapter": "57"
                },
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        },
        {
            "title": "Revival Prayer For America",
            "url": "http:\/\/api.sermonindex.net\/SID24532",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 80",
            "topic": "America",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24532-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        },
        {
            "title": "Revival Stories: Evan Roberts",
            "url": "http:\/\/api.sermonindex.net\/SID24549",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 80",
            "topic": "Biography",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID24549-download",
            "preacher_name": "E.A. Johnston",
            "preacher_image": "",
            "preacher_description": "E.A. Johnston ( - )\r\nListen to freely downloadable audio sermons by the speaker E.A. Johnston in mp3 format. E. A. Johnston lives in Memphis, Tennessee and is a fellow of the Stephen Olford Institute for Biblical Preaching. He is currently involved in Bible teaching and disciple making, as well as authoring books. Some of his titles include: Realities of Revival (series), Church in Revival (series), Call to Revival (series), Return to Me, No Turning Back, The Master’s Plan, Walking with God, etc.\r\n\"If the Church will not defend His holy Name then the Almighty must. God will either pour out His blessings in revival to defend His holy Name, or He will pour out His wrath upon mankind to avenge His holy Name. It will either be a defending or avenging to show forth His glory and remind mankind He alone is the Sovereign ruler of all.\"",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        },
        {
            "title": "Reviving the Righteous Root of Anabaptism",
            "url": "http:\/\/api.sermonindex.net\/SID12705",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 80:7",
            "topic": "Anabaptism",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12705-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        },
        {
            "title": "The Great Need Of Revival by Denny Kenaston",
            "url": "http:\/\/api.sermonindex.net\/SID16316",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 11:6, James 1:8-10, Psalm 80",
            "topic": "Revival Conference",
            "description": "Denny Kenaston opens the revival conference with a exhortation to seek the face of God, to see what God can do! He shares the burden and reason why revival is very needful in our day. Then he preaches verse by verse through psalm 80 asking God to restore his church to God.",
            "download": "http:\/\/api.sermonindex.net\/SID16316-download",
            "preacher_name": "Revival Conference Canton 2007",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                },
                {
                    "book": "James",
                    "chapter": "1"
                },
                {
                    "book": "Hebrews",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "Turn Us Again, O Lord God of Hosts",
            "url": "http:\/\/api.sermonindex.net\/SID2624",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 80",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID2624-download",
            "preacher_name": "Ian Paisley",
            "preacher_image": "",
            "preacher_description": "Ian Paisley (1926 - 2014)\r\nListen to freely downloadable audio sermons by the speaker Ian Paisley in mp3 format. Founder of the Free Presbyterian Movement with over 100 churches world-wide and bible colleges. This presbyterian renewal movement was started in light of compromise and apostasy in existing churches in Ireland, Scotland and England. These churches are clear biblical churches with a clear emphasis on preaching the Gospel of Jesus Christ and His death for sinners.\r\nIan Paisley also has been active in politics for many years and a leader of a political party. Leonard Ravenhill commented once that the Lord could have used paisley in a powerful way like Whitfield if he stayed away from politics. His preaching is expositional and biblical from a burdened heart to represent His Lord well.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "80"
                }
            ]
        },
        {
            "title": "Vine Branches",
            "url": "http:\/\/api.sermonindex.net\/SID5419",
            "size": "0",
            "format": "mp3",
            "scripture": "John 15:1-11, Psalm 80:8, Isaiah 5:2",
            "topic": "True Vine",
            "description": "The Lord is the True Vine, and we are to be the branches, the Vine displays the fruit it produces through it's branches and so should we bear the fruit of the Lord Jesus.  If we do not bear the fruit of the Spirit though we will compensate for it by manifesting the works of the flesh in an attempt to cover over our seperation from the True Vine.  The basic fruit of the Spirit is love it is at the heart of all the other fruits, the basis for the works of the flesh is self. A great truth is revealed in this message that we do not bear fruit by asking for it but by confessing and dealing with our sin then the Lord will help us to bear fruit.",
            "download": "http:\/\/api.sermonindex.net\/SID5419-download",
            "preacher_name": "Roy Hession",
            "preacher_image": "\/images\/roy_hession.gif",
            "preacher_description": "Roy Hession (1908 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Roy Hession was a famous post-war evangelist. He wrote many famous Christian classics including \"The Calvary Road.\" Which is currently have currently sold over 1 million copies world-wide. Although a British evangelist, Dr. Hession has spent considerable time ministering in the States under the sponsorship of Worldwide Evangelization Crusade (Ft. Washington, Pa.). This missionary organization was founded in 1914 by C.T Studd, and was directed for many years by his son-in-law, Norman Grubb.\r\n\r\nIn 1947 Hession met leaders of the East African Church which was then experiencing a sweeping revival, and recognized his deep personal need. It was like starting the Christian life over as he came humbly to the Cross. The principles which the Lord taught him were first published in 1950 as The Calvary Road and are now available in over 70 languages! Hession's other titles include We Would See Jesus and Be Filled Now.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "5"
                },
                {
                    "book": "Psalms",
                    "chapter": "80"
                },
                {
                    "book": "John",
                    "chapter": "15"
                }
            ]
        }
    ]
}