{
    "name": "Psalms 85",
    "book": "Psalms",
    "chapter": 85,
    "sermons": [
        {
            "title": "Canadian Revival Story",
            "url": "http:\/\/sermonindex.net\/SID13602",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:6-8",
            "topic": "Revival History",
            "description": "\"I had such a burden in my heart to see GOD do something that you couldn't attribute to men.\"  Bill McLeod recounts the glorious heaven-sent revival in Saskatoon, Canada in 1971, characterized by deep and powerful conviction of sin, much restitution and many moving testimonies of the power of God changing hearts!  (62 minutes)",
            "download": "http:\/\/sermonindex.net\/SID13602-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "How to Pray for Revival",
            "url": "http:\/\/sermonindex.net\/SID6745",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:1-6,Acts 2:1-4",
            "topic": "",
            "description": "Guzik teaches not only how to pray for revival but when and what to pray.  In addition his careful handling of God's Word, he cites pertinent and interesting examples from revivals from the not-so-distant past such as James McGrady in 1800, the American revival of 1858 and the Welsh revival in early 1900's.  He deals with misconceptions of praying only for leaders and not whole congregations, pointing out from Acts how the Holy Spirit fills both individuals and entire congregations.  Guzik appeals to let go of the 'machinery' of men to earnestly seek God in prayer for 'a unique stirring of the Spirit of God' in our day!",
            "download": "http:\/\/sermonindex.net\/SID6745-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                },
                {
                    "book": "Acts",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "If My People",
            "url": "http:\/\/sermonindex.net\/SID3591",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Chronicles 7:14, Malachi 3:6, Psalm 85:6",
            "topic": "Revival",
            "description": "The focus on this sermon is revival and how it is not brought about political or social means. Quotes and references to Billy Sunday, Charles Finney, the Welsh Revival, Maze Jackson, George Muller, F B Meyer, D L Moody, and the movement of the Holy Ghost during outpourings of revival. \"If you asked me the greatest need in America right now, I'd say revival. There's enough born-again believers to turn the world upside-down for Christ, if we had the right kind of Christians.\"",
            "download": "http:\/\/sermonindex.net\/SID3591-download",
            "preacher_name": "Curtis Hutson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                },
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Peace As God Sees It - Part 1",
            "url": "http:\/\/sermonindex.net\/SID1570",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 23:6, Psalm 85:8, Matthew 24:4-14",
            "topic": "Peace",
            "description": "“Peace As God Sees It - Part 1” is the first 22 minutes of a sermon that A. W. Tozer preached on the night of New Year’s Eve, 1961, in Toronto, Ontario. The pastor discusses the end of the world, the end of civilization, the difference between the two, why so many accuse Jesus of failing to keep a promise of world peace, and why they are wrong. “They create a Christianity of their own, and then they try to make Christ conform to their own, homemade Christianity. … It may surprise some of you to know that our Lord Jesus Christ never promised peace—world peace, peace among the nations—during this age.” Christians shouldn’t blame the church, either. Dr. Tozer addresses a range of other vital issues including the state of Israel in this excellent sermon, reading from Job 23:6, Psalm 85:8, and Matthew 24:4-14. ***Note: Both parts of this message can also be downloaded as one single sermon that is listed on sermonindex.net under the title, “The New Year As God Sees It.”",
            "download": "http:\/\/sermonindex.net\/SID1570-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                },
                {
                    "book": "Job",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Peace As God Sees It - Part 2",
            "url": "http:\/\/sermonindex.net\/SID1571",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 23:6, Psalm 85:8, Matthew 24:4-14",
            "topic": "Peace",
            "description": "“Peace As God Sees It - Part 2” is the second 20 minutes of a sermon that A. W. Tozer preached on the night of New Year’s Eve, 1961, in Toronto, Ontario. The pastor discusses the end of the world, the end of civilization, the difference between the two, why so many accuse Jesus of failing to keep a promise of world peace, and why they are wrong. “They create a Christianity of their own, and then they try to make Christ conform to their own, homemade Christianity. … It may surprise some of you to know that our Lord Jesus Christ never promised peace—world peace, peace among the nations—during this age.” Christians shouldn’t blame the church, either. Dr. Tozer addresses a range of other vital issues including the state of Israel in this excellent sermon, reading from Job 23:6, Psalm 85:8, and Matthew 24:4-14. ***Note: Both parts of this message can also be downloaded as one single sermon that is listed on sermonindex.net under the title, “The New Year As God Sees It.”",
            "download": "http:\/\/sermonindex.net\/SID1571-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                },
                {
                    "book": "Job",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Principles That Govern Spiritual Awakenings - Part 1",
            "url": "http:\/\/sermonindex.net\/SID17407",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85",
            "topic": "Spiritual Awakening",
            "description": "An exposition of the \"Revival Psalm\" that emphasizes the sovereignty of God in Revival and in salvation. \"Human faith\" cannot save the soul; faith unto salvation is a gift from God. Revival cannot be produced by human endeavor; only God Himself can do that. The Lord initiates Revival; but man must respond. But Campbell, a Highland Calvinist, warns against extreme doctrines of sovereignty that deny human responsibility.",
            "download": "http:\/\/sermonindex.net\/SID17407-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Principles That Govern Spiritual Awakenings - Part 2",
            "url": "http:\/\/sermonindex.net\/SID17408",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85",
            "topic": "Spiritual Awakening",
            "description": "In the second half of the message, Campbell supplements his exposition of Psalm 85 with several personal accounts of Revival, including the testimony of his seventeen \"wilderness years\" and his restoration.",
            "download": "http:\/\/sermonindex.net\/SID17408-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revival",
            "url": "http:\/\/sermonindex.net\/SID10941",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:4-7, 2 Chronicles 7:14",
            "topic": "Revival",
            "description": "Revival, says David Legge, 'is a message that burns on my heart continually...Revival is God's norm.'  Because revival has been 'one of the greatest stimulants' in his Christian life, the message is marked by stirring accounts of the past--Lewis, Wales, China and others.  Legge cries out against the sins of evangelicalism and unbelief, causing to search if we truly be filled with the Holy Spirit. \r\n\r\n[i]All material by Pastor Legge is copyrighted. However, these materials may be freely copied and distributed unaltered for the purpose of study and teaching, so long as they are made available to others free of charge, and the copyright is included. This does not include hosting or broadcasting the materials on another website, however linking to the resources on our site is permitted. These materials may not, in any manner, be sold or used to solicit 'donations' from others, nor may they be included in anything you intend to copyright, sell, or offer for a fee. This copyright is exercised to keep these materials freely available to all. Any exceptions to these conditions must be explicitly approved by preachtheword.com[\/i]",
            "download": "http:\/\/sermonindex.net\/SID10941-download",
            "preacher_name": "David Legge",
            "preacher_image": "",
            "preacher_description": "David Legge ( - )\r\nListen to freely downloadable audio sermons by the speaker David Legge in mp3 format. David Legge is a Christian evangelist, preacher and Bible teacher. He served as Assistant Pastor at Portadown Baptist Church before taking up the Pastorate of the Iron Hall Assembly in Belfast, N. Ireland, where he ministered from 1999-2008. He knows has an internant ministry across the world you can access messages and request him as a speaker at the Preach The Word website.\r\n\"Like Israel, who are a type, I believe, in many respects of God's people today: we have been transferred from bondage, the kingdom of darkness, the kingdom of Satan, and we have been placed into the kingdom of light, the kingdom of God's dear Son... and yet many believing New Testament Christians never cross the Jordan. They settle for less than God intended for them. I have to say that there can even be resentment, or resistance, shown toward anyone who will try to get God's people over the Jordan and into their inheritance.\" - David Legge",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revival - America's Only Hope",
            "url": "http:\/\/sermonindex.net\/SID16037",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 1, Psalm 85:1-6",
            "topic": "",
            "description": "No discerning Christian living in 21st century America can deny that this country needs revival. The breakdown of public morals and the break-up of the traditional home are well-documented. It is no longer that America merely needs revival. She must experience it! The question is: “Is it too late?” Are we desperate enough to hold on to God and plead, “Wilt thou not revive us again?” Are we impatient or importunate? Do we wish for revival or do we will it? The hour is late, but God's mercy is great!",
            "download": "http:\/\/sermonindex.net\/SID16037-download",
            "preacher_name": "Robert Vradenburgh",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "1"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revival Forum Interview",
            "url": "http:\/\/sermonindex.net\/SID25114",
            "size": "0",
            "format": "mp3",
            "scripture": "Jeremiah 2:13, Psalm 85:6",
            "topic": "Revival",
            "description": "This is a very jarring and powerful interview of Leonard Ravenhill. It occurred at a Life Action event in Canada with a group of pastors. Ravenhill shares his burden for revival in North America and clearly show the problem of lack of prayer, lack of burden for the lost and a loss of the conception of the majesty of God.",
            "download": "http:\/\/sermonindex.net\/SID25114-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Jeremiah",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revival On The Isle Of Lewis",
            "url": "http:\/\/sermonindex.net\/SID0355",
            "size": "10981888",
            "format": "mp3",
            "scripture": "Psalm 85:6",
            "topic": "Revival History",
            "description": "Listen to this first-hand account of the Lewis Revival during the early 1950s. Duncan Campbell was God's instrument in this extraordinary awakening. In this tape Campbell recounts point-by-point this three-year movement of the Holy Spirit over the Hebrides Islands. Thousands were converted, conviction overwhelmed villages, outward sin disappeared, and prayer meetings were packed! Your heart will be thrilled as you listen to this tape about this heaven-sent revival in Lewis.",
            "download": "http:\/\/sermonindex.net\/SID0355-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revival is Coming and What It Will Look Like",
            "url": "http:\/\/sermonindex.net\/SID21013",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:6-13",
            "topic": "Revival",
            "description": "October 10, 2010 - How is it possible for revival to come in such a Christ rejected nation? We as Christians have to make a choice to live in this world as a testimony of the keeping power of God. The cry of the church should be, “Lord, stretch forth you hand and heal through me. Use my life to bring healing and freedom to those who are lost.” What will revival look like? All people with a no name ministry will suddenly show up with the glory of God on them. Grandmothers who laid hold of the Cross will begin to speak to a younger generation. Young people like David in the Bible who will not cower under the pressure of this society will rise up with a cry that says, \"is there not a cause?\" There is coming a season when God will turn the people’s hearts back to Him and He will pour out His Spirit on all flesh.",
            "download": "http:\/\/sermonindex.net\/SID21013-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "Revive Us Again",
            "url": "http:\/\/sermonindex.net\/SID0119",
            "size": "11918848",
            "format": "mp3",
            "scripture": "Psalms 85, 2 Chronicles 7:14",
            "topic": "Revival",
            "description": "This is not so much a teaching as it is the groanings of a burdened heart to exalt God above man to His rightful place in revival.  Campbell shared several practical \"principles that govern spiritual quickening.\"  The differences between a God-sent revival and the man-centered evangelistic means of his day are truly heart-searching for anyone engaged in work to save men's souls.  Since God's sovereignty does not nullify man's responsibility, Campbell admonished his hearers to be \"agents of revival\" that take God up on \"His covenant engagement\" in prayer and staying close to the heart of the Shepherd.",
            "download": "http:\/\/sermonindex.net\/SID0119-download",
            "preacher_name": "Duncan Campbell",
            "preacher_image": "\/images\/duncan_campbell.gif",
            "preacher_description": "Duncan Campbell (1898 - 1972)\r\nListen to freely downloadable audio sermons by the speaker Duncan Campbell in mp3 format. Used of God in the Hebrides revival in Scotland in the 1950's where the presence of God was manifest in a powerful way. In this later years he became the principal of the Faith Mission Bible College. \r\n\r\nHis burden was for revival in the Church and also holiness in daily Christian experience. He clearly shared the burden of the Lord for His body to be purified in the last days. He preached the true baptism of the Spirit that makes men holy in light of a Holy God.",
            "_scripture": [
                {
                    "book": "2 Chronicles",
                    "chapter": "7"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "The New Year as God Sees It",
            "url": "http:\/\/sermonindex.net\/SID5794",
            "size": "0",
            "format": "mp3",
            "scripture": "Job 23:6, Psalm 85:8, Matthew 24:4-14",
            "topic": "New Years",
            "description": "A. W. Tozer discusses the end of the world, the end of civilization, the difference between the two, and why so many accuse Jesus of failing to keep a promise of world peace. “They create a Christianity of their own, and then they try to make Christ conform to their own, homemade Christianity. … It may surprise some of you to know that our Lord Jesus Christ never promised peace—world peace, peace among the nations—during this age.” Christians shouldn’t blame the church, either. The pastor addresses a range of other vital issues in this excellent sermon, reading from Job 23:6, Psalm 85:8, and Matthew 24:4-14. “The New Year As God Sees It” was preached the night of New Year’s Eve, 1961, in Toronto, Ontario. The length of the recording is 41 minutes and 7 seconds.",
            "download": "http:\/\/sermonindex.net\/SID5794-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Psalms",
                    "chapter": "85"
                },
                {
                    "book": "Job",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "The Urgent Question",
            "url": "http:\/\/sermonindex.net\/SID19891",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:1-13",
            "topic": "Revival",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID19891-download",
            "preacher_name": "Ronald Glass",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "When Wales Caught The Fire Of The Holy Ghost - The 1904 Welsh Revival",
            "url": "http:\/\/sermonindex.net\/SID14470",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85:4-7",
            "topic": "",
            "description": "A Wonderfully Moving and Living Account of how God moved in such a marvellous way during the 1904 Revival in Wales. The Spirit of God came down upon the entire nation for many years as God renewed all people to Himself. Over half the nation was converted to God within 1 year.",
            "download": "http:\/\/sermonindex.net\/SID14470-download",
            "preacher_name": "Brian Green",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        },
        {
            "title": "When do we need revival?",
            "url": "http:\/\/sermonindex.net\/SID19266",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 85",
            "topic": "Ulster Revival",
            "description": "When do we need revival? 1. When God's presence is withdrawn 2. When presumption is widespread 3. When contentedness prevails 4. When holiness is ignored 5. When prayer is anaemic 6. When soulwinning is neglected",
            "download": "http:\/\/sermonindex.net\/SID19266-download",
            "preacher_name": "Alan Bartley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "85"
                }
            ]
        }
    ]
}