{
    "name": "Psalms 88",
    "book": "Psalms",
    "chapter": 88,
    "audio_sermons": [
        {
            "title": "Finding the Hands of God",
            "url": "http:\/\/sermonindex.net\/SID16284",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 89:13-29, Psalm 89:38-45, Psalm 88:8-9",
            "topic": "Knowing God",
            "description": "We are living in a generation where the church at large has lost sight of the true purposes and power of God. Many are seeking God for personal gain as opposed to the feeding the hungry. God is calling His church to reach out and touch His heart so that we might be an extension of His heart and hands to a lost generation. He's calling us to be hope for the hopeless and freedom to the captives and food for every hungry heart. This power of God is extended to us through His crucified hands.",
            "download": "http:\/\/sermonindex.net\/SID16284-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                },
                {
                    "book": "Psalms",
                    "chapter": "88"
                }
            ]
        },
        {
            "title": "The Messianic Psalms - Psalm 88",
            "url": "http:\/\/sermonindex.net\/SID10473",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 88",
            "topic": "Psalms",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10473-download",
            "preacher_name": "Chip Brogden",
            "preacher_image": "",
            "preacher_description": "Chip Brogden ( - )\r\nListen to freely downloadable audio sermons by the speaker Chip Brogden in mp3 format.  Author, teacher, and former pastor, Chip and his wife Karla came out of the church in 1999 to serve those who are following Jesus outside of Organized Religion. Today, The School of Christ reaches many with a simple, consistent, and Christ-centered message\r\nSince 1997, the School of Christ has reached more than 145 nations with a simple, consistent, and Christ-centered message. Our mission is to bring healing to those hurt by religion, to provide for the spiritual growth and maturity of all believers, and to ensure the continuity of a Christ-Centered Faith.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "88"
                }
            ]
        }
    ]
}