{
    "name": "Psalms 89",
    "book": "Psalms",
    "chapter": 89,
    "sermons": [
        {
            "title": "Continue In Sin",
            "url": "http:\/\/api.sermonindex.net\/SID0249",
            "size": "7560000",
            "format": "mp3",
            "scripture": "Romans 6:1-2, Jeremiah 32:39-40, Psalms 89:28-34",
            "topic": "Continuing In Sin",
            "description": "Why do believers continue in sin?  Year after year after year they continue in some sort of sin and they never come into the fullness of the Covenant blessing of God.  Often times it may well just be one area that remains but nonetheless folks continue in that sin.  Wilkerson preaches a very personal message here and he shares his heart and shows his own weakness as an example.  The consequences for a Christian continuing in sin are sobering, but he gave us what we needed to overcome sin, if we want to. For those who are sick of their sin, and hate it, and cry out to God, there is wonderful news. He will empower you, and he wants to put his fear in your heart so you will not turn away from him, and then he can take you into the fullness of the new covenant. Powerful preaching, with a gentle compassion for those who are struggling.",
            "download": "http:\/\/api.sermonindex.net\/SID0249-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                },
                {
                    "book": "Jeremiah",
                    "chapter": "32"
                },
                {
                    "book": "Romans",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Finding the Hands of God",
            "url": "http:\/\/api.sermonindex.net\/SID16284",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 89:13-29, Psalm 89:38-45, Psalm 88:8-9",
            "topic": "Knowing God",
            "description": "We are living in a generation where the church at large has lost sight of the true purposes and power of God. Many are seeking God for personal gain as opposed to the feeding the hungry. God is calling His church to reach out and touch His heart so that we might be an extension of His heart and hands to a lost generation. He's calling us to be hope for the hopeless and freedom to the captives and food for every hungry heart. This power of God is extended to us through His crucified hands.",
            "download": "http:\/\/api.sermonindex.net\/SID16284-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                },
                {
                    "book": "Psalms",
                    "chapter": "88"
                }
            ]
        },
        {
            "title": "Taking Hold of the New Covenant",
            "url": "http:\/\/api.sermonindex.net\/SID3401",
            "size": "10709504",
            "format": "mp3",
            "scripture": "Psalms 89:34",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID3401-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                }
            ]
        },
        {
            "title": "The People's Christ",
            "url": "http:\/\/api.sermonindex.net\/SID11504",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 89:19",
            "topic": "",
            "description": "A SERMON DELIVERED ON SABBATH MORNING, FEBRUARY 25, 1855, BY THE REV. C. H. SPURGEON, AT EXETER HALL, STRAND. “I have exalted one chosen out of the people.” — Psalm 89:19. ORIGINALLY, I have no doubt, these words referred to David... However, in this sermon we shall not speak of David, but of the Lord Jesus Christ, for David, as referred to in the text, is an eminent type of Jesus Christ, our Lord and Savior, who was chosen out of the people; and of whom his Father can say “I have exalted one chosen out of the people.” Before I enter into the illustration of this truth I wish to make one statement, so that all objections may be avoided as to the doctrine of my sermon. Our Savior Jesus Christ, I say, was chosen out of the people; but this merely respects his manhood. As “very God of very God” he was not chosen out of the people, for there was none save him. He was his Father’s only-begotten Son, “begotten of the Father before all worlds.” He was God’s fellow, co-equal, and co-eternal; consequently when we speak of Jesus as being chosen out of the people, we must speak of him as a man. We are, I conceive, too forgetful of the real manhood of our Redeemer, for a man he was to all intents and purposes, and I love to sing, “A Man there was, a real Man Who once on Calvary died.” He was not man and God amalgamated — the two natures suffered no confusion — he was very God, without the diminution of his essence or attributes...",
            "download": "http:\/\/api.sermonindex.net\/SID11504-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "89"
                }
            ]
        }
    ]
}