{
    "name": "Psalms 9",
    "book": "Psalms",
    "chapter": 9,
    "audio_sermons": [
        {
            "title": "(Bible Analysis Of Man) Man's Memory",
            "url": "http:\/\/sermonindex.net\/SID7514",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 9:17-18",
            "topic": "Bible Analysis Of Man",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7514-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Creation-Providence-Redemption - Part 1",
            "url": "http:\/\/sermonindex.net\/SID7791",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 104:24, Isaiah 6:23, Psalm 9:1",
            "topic": "Redemption",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7791-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "104"
                },
                {
                    "book": "Psalms",
                    "chapter": "9"
                },
                {
                    "book": "Isaiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Creation-Providence-Redemption - Part 3",
            "url": "http:\/\/sermonindex.net\/SID7793",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 104:24, Isaiah 6:23, Psalm 9:1",
            "topic": "Redemption",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7793-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                },
                {
                    "book": "Psalms",
                    "chapter": "104"
                },
                {
                    "book": "Isaiah",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "God's Word To Our Nation (1)",
            "url": "http:\/\/sermonindex.net\/SID16047",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4:34-35, Job 12:23-25, Psalm 9:7",
            "topic": "America",
            "description": "A brief series of four messages addressing the moral condition of our nation in a focused way. The first message deals with the relationship of God to all the nations, including our own. In this introductory message we see: 1. the subjugation of all the nations to the sovereign rule of God. 2. the accountability of the nations to the just judgment of God. 3. the responsibility of the nations to hear the word of God.  4. the solidarity of believers with the nation in which they are found. Subsequent messages address more pointedly our nations’ sins of bloodguiltiness, sexual perversion and religious apostasy.",
            "download": "http:\/\/sermonindex.net\/SID16047-download",
            "preacher_name": "Albert N. Martin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                },
                {
                    "book": "Job",
                    "chapter": "12"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Paul's Gospel",
            "url": "http:\/\/sermonindex.net\/SID0671",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 9:17",
            "topic": "",
            "description": "Where has the offense of the gospel gone? Rolfe Barnard asks this interesting question that why the gospel has become so popular. The true gospel is foolish and scandal to the religious. It is a false gospel that does not transform and change men. The true gospel is a offense none other is the true gospel.",
            "download": "http:\/\/sermonindex.net\/SID0671-download",
            "preacher_name": "Rolfe Barnard",
            "preacher_image": "\/images\/rolfe_barnard.gif",
            "preacher_description": "Rolfe Barnard (1904 - 1969)\r\nListen to freely downloadable audio sermons by the speaker Rolfe Barnard in mp3 format. Was evidently a prophet from God for the 20th Century. With a profound sense of the absolute sovereignty and glory of Jesus Christ, he was able to preach a message that produced conviction of sin. He maintained through all his ministry what he himself called a \"sweetheart love for the Lord Jesus,\" and it is most surely apparent in his messages.\r\n\r\nHe was an acclaimed preacher of primarily the 1940's and 1950's.About 100,000 professed faith in Christ during his decades of preaching. He was initially associated with John R.Rice in the 1940's. However,after giving a scripturally based message on John 6 Before rice and some other fundamentalist leaders he was kicked out of the Fundamentalist camp. He then went on the independent circuit. His preaching tours as an evangelist were mainly in the American south.But he also ministered in the mid-west and Canada as well.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "The Expectations Of The Righteous",
            "url": "http:\/\/sermonindex.net\/SID3917",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 9:1-6",
            "topic": "Righteousness",
            "description": "April 11, 2004 - The Expectancy of the Righteous - Carter Conlon\r\nWhen we possess an experiential knowledge the we have the God of the Universe is living inside of us we will live our lives in a constant expectancy that God is going to do something great and powerful in and through our lives.",
            "download": "http:\/\/sermonindex.net\/SID3917-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                }
            ]
        }
    ]
}