{
    "name": "Psalms 90",
    "book": "Psalms",
    "chapter": 90,
    "sermons": [
        {
            "title": "4. What is God?",
            "url": "http:\/\/sermonindex.net\/SID22358",
            "size": "0",
            "format": "mp3",
            "scripture": "John 4:24, Psalm 90:2",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID22358-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "4"
                },
                {
                    "book": "Psalms",
                    "chapter": "90"
                }
            ]
        },
        {
            "title": "Liberty Not License",
            "url": "http:\/\/sermonindex.net\/SID3803",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalms 90:1-9",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID3803-download",
            "preacher_name": "Neil Rhodes",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "90"
                }
            ]
        },
        {
            "title": "MY LAST DAY",
            "url": "http:\/\/sermonindex.net\/SID21252",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 90:12",
            "topic": "Radio Show",
            "description": "God’s kingdom is an eternal kingdom. He wants to have us with Him there, to share in His glory. However, we have to prepare ourselves for that day! Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21252-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "90"
                }
            ]
        },
        {
            "title": "Numbering Our Days",
            "url": "http:\/\/sermonindex.net\/SID15290",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 90:1-12",
            "topic": "Brevity Of Life",
            "description": "Life is a vapor, which vanishes away. We don’t know when our time is up. Therefore, it is important that we pray along with Moses that the Lord would teach us to number our days. We need to break down our lives into small allotments. Number your days, not as though they are ending, but rather beginning.",
            "download": "http:\/\/sermonindex.net\/SID15290-download",
            "preacher_name": "Dean Stump",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "90"
                }
            ]
        },
        {
            "title": "The Waiter",
            "url": "http:\/\/sermonindex.net\/SID13143",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 90:7-8",
            "topic": "Evangelism",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13143-download",
            "preacher_name": "Ray Comfort",
            "preacher_image": "\/images\/ray_comfort.gif",
            "preacher_description": "Ray Comfort ( - )\r\nListen to freely downloadable audio sermons by the speaker Ray Comfort in mp3 format. Is a New Zealand-born Christian minister and evangelist. Comfort started Living Waters Publications and The Way of the Master in Bellflower, California and has written a number of books. Comfort says that evangelism is the main reason the Christian Church exists and that many of the evangelistic methods used over the last century have produced false conversions to Christianity. Comfort often uses the Ten Commandments to speak about sin before presenting the gospel of Jesus. In the mid-1980s he formulated two sermons entitled \"Hell's Best Kept Secret\" and \"True and False Conversions.\"\r\nComfort speaks professionally at churches and evangelism seminars, and preaches in Huntington Beach, California. As well as co-hosting the former The Way of the Master Radio with Kirk Cameron, he is co-host of The Way of the Master Television Show, and the \"Creationism Examiner\" on The Examiner.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "90"
                }
            ]
        }
    ]
}