{
    "name": "Psalms 97",
    "book": "Psalms",
    "chapter": 97,
    "audio_sermons": [
        {
            "title": "(Worship - Part 3): Worship the Lord in Glory and Meekness",
            "url": "http:\/\/sermonindex.net\/SID2190",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 45:3-4,Psalm 97,Philippians 2:5-11",
            "topic": "Worship",
            "description": "This is the third of five sermons on worshipping God by AW Tozer. Mr Tozer teaches on the need for the church to worship the Lord Jesus for what he is; not just a meek Jesus but the powerful Jesus of the Bible. Most of this sermon is unquoted scripture and is on the Glory of God.",
            "download": "http:\/\/sermonindex.net\/SID2190-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "Philippians",
                    "chapter": "2"
                },
                {
                    "book": "Psalms",
                    "chapter": "97"
                },
                {
                    "book": "Psalms",
                    "chapter": "45"
                }
            ]
        }
    ]
}