{
    "name": "1 Corinthians 13",
    "book": "1 Corinthians",
    "chapter": 13,
    "sermons": [
        {
            "title": "(1 Corinthians) Overview to Chapter 13",
            "url": "http:\/\/sermonindex.net\/SID11479",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-13",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11479-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Corinthians 13",
            "url": "http:\/\/sermonindex.net\/SID6581",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Through The Bible",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6581-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "1 Cor 13 (version 1)",
            "url": "http:\/\/sermonindex.net\/SID0478",
            "size": "11091968",
            "format": "mp3",
            "scripture": "1 Corinthians 13, Romans 5:5",
            "topic": "Love",
            "description": "This sermon focuses on God's kind of love from the verses written by Paul in 1 Corinthians 13 and Romans 5:5. The majority of the sermon discusses the first half of 1 Cor 13; specifically verses 1 through 8. There are many old hymns and writings quoted by Brother Len that focus on the person and love of God and His Christ intertwined in the message, quite a few from Wesley. There is also some time spent on some of the past saints that exemplified this love.",
            "download": "http:\/\/sermonindex.net\/SID0478-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "1 Cor 13 (version 2)",
            "url": "http:\/\/sermonindex.net\/SID0143",
            "size": "4808704",
            "format": "mp3",
            "scripture": "1 Corinthians 13, Romans 5:5",
            "topic": "Love",
            "description": "This sermon focuses on God's kind of love from the verses written by Paul in 1 Corinthians 13 and Romans 5:5. The majority of the sermon discusses the first half of 1 Cor 13; specifically verses 1 through 8. There are many old hymns and writings quoted by Brother Len that focus on the person and love of God and His Christ intertwined in the message, quite a few from Wesley. There is also some time spent on some of the past saints that exemplified this love.",
            "download": "http:\/\/sermonindex.net\/SID0143-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "5"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "A Certain Sound",
            "url": "http:\/\/sermonindex.net\/SID23301",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:8",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID23301-download",
            "preacher_name": "Manley Beasley",
            "preacher_image": "\/images\/manley_beasley.gif",
            "preacher_description": "Manley Beasley (1932 - 1990)\r\nListen to freely downloadable audio sermons by the speaker Manley Beasley in mp3 format. Brother Beasley was a powerful preacher of the Word of God who ministered mostly in southern Baptist churches in America. The Lord gave him a gift of faith to trust the Lord in impossible circumstances for God's glory. Even though Manley Beasley was not very old as we measure a life's span, he left behind a legacy of faith that was rarely seen in his generation. We pray that he will be honored and the Lord glorified by this attempt to share this legacy with all who would live a life of faith that is truly pleasing to God.\r\nThere came a time when Manley believed the Lord gave him a choice of complete healing or daily healing. Manley chose daily healing because for him it was an act of faith that each day the Lord had to heal him to the point that he could get out of bed. During those years there were more confinements in the hospital, as well as trips to Europe and revivals all over the United States. He led Bible Conferences, revivals, and shared his personal testimony with others dealing with illness.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Baptism Of Love",
            "url": "http:\/\/sermonindex.net\/SID15413",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-3",
            "topic": "Baptism Of Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15413-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Behaviors That Bind Us",
            "url": "http:\/\/sermonindex.net\/SID0875",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:11",
            "topic": "Behaviors",
            "description": "Why are people discontent, even though they are saved by the grace of God? What shackles are binding their behavior? In 1 Corinthians 13:11, Paul helps us understand the reasons for our discontent which often originates from the child still within us. Dr. Stanley discusses those childish things that may adversely influence our lives as an adult, including believing you must measure up to another's expectations, the need for instant gratification, and (believe it or not) throwing temper tantrums.",
            "download": "http:\/\/sermonindex.net\/SID0875-download",
            "preacher_name": "Charles Stanley",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Christ In Us by Erlo Stegen",
            "url": "http:\/\/sermonindex.net\/SID14355",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-8",
            "topic": "Podcast",
            "description": "Erlo Stegen delivers a heart searching message on the person of Christ. Woe to us who have God's Word and are not transformed to hear and obey it. Sundar Singh said that salt dissolved in water may disappear but it doesn't cease to exist. We may be sure of its presence by tasting the water. Likewise the indwelling Christ may be realised by His love He imparts to us.",
            "download": "http:\/\/sermonindex.net\/SID14355-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Christ in us",
            "url": "http:\/\/sermonindex.net\/SID14337",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-8",
            "topic": "Christ In Us",
            "description": "Woe to us who have God's Word and are not transformed to hear and obey it. Sundar Singh said that salt dissolved in water may disappear but it doesn't cease to exist. We may be sure of its presence by tasting the water. Likewise the indwelling Christ may be realised by His love He imparts to us. Jesus said that He is the Way, the Truth and the Life. When you have Him you've found the way. When you have Him you have the Truth and abundant life. If Christ is a reality to you He leads and guides you. Everybody who tastes you will experience Christ.",
            "download": "http:\/\/sermonindex.net\/SID14337-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Gifts of the Holy Spirit - Part 2",
            "url": "http:\/\/sermonindex.net\/SID12960",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13, 1 Corinthians 14:1-25",
            "topic": "",
            "description": "With careful attention to Biblical context, McGee shares some thought-provoking words about the gift of tongues, including his personal observations of the Charismatic movement.   He also explains what is the most important  and most needed gift today.",
            "download": "http:\/\/sermonindex.net\/SID12960-download",
            "preacher_name": "J. Vernon McGee",
            "preacher_image": "\/images\/j_vernon_mcgee.gif",
            "preacher_description": "J. Vernon McGee (1904 - 1988)\r\nListen to freely downloadable audio sermons by the speaker J. Vernon McGee in mp3 format. Brother McGee pastored an inter-denominational church, Church Of The Open Door in California. In 1967 he started the now famous \"Through The Bible\" radio program that airs on thousands of stations world-wide.\r\n\r\nHis burden has been to do systematic simple bible teaching to equip believers, protect them against false doctrines and share the whole counsel of God. He also has been a guest lecturer at the Dallas Theological Seminary.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Hope",
            "url": "http:\/\/sermonindex.net\/SID2553",
            "size": "0",
            "format": "mp3",
            "scripture": "Romans 15:13, 1 Corinthians 13:13",
            "topic": "",
            "description": "This one is a gem! Parkyns revives the power of HOPE, a word seen frequently in scripture.  Hope can strengthen a wavering faith. Hope is the path to healing. When combined with love, hope can restore the one near death. Hope keeps us from sinking into despair. Hope keeps us looking forward to a righteousness that we can never experience until the next life.",
            "download": "http:\/\/sermonindex.net\/SID2553-download",
            "preacher_name": "Edgar F. Parkyns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Romans",
                    "chapter": "15"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "How To Make This The Best Summer",
            "url": "http:\/\/sermonindex.net\/SID25687",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:4-5",
            "topic": "Summer",
            "description": "Want to make this the best summer ever? In this teaching Pastor Cymbala presents three Biblical instructions that can change your life.",
            "download": "http:\/\/sermonindex.net\/SID25687-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Love",
            "url": "http:\/\/sermonindex.net\/SID7672",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7672-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Love - I Corinthians 13",
            "url": "http:\/\/sermonindex.net\/SID11780",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11780-download",
            "preacher_name": "J. Oswald Sanders",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Love-Portrait of Christ and the Christian",
            "url": "http:\/\/sermonindex.net\/SID20625",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20625-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "NO LONGER LOVELESS",
            "url": "http:\/\/sermonindex.net\/SID21214",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:2",
            "topic": "Radio Show",
            "description": "We should all be able to see God at work in our lives - especially in our relationships with our family and at work. How many times our love and patience are tried during the day! And how many times do we fall flat on our faces! But God can transform everything. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21214-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "REDEEMED TO LOVE",
            "url": "http:\/\/sermonindex.net\/SID21112",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:2",
            "topic": "Radio Show",
            "description": "God transforms people who by nature only think about themselves and their advantages and welfare. He redeems them into loving, sympathetic people who make other people's lives rich and happy. Kanaan is the home of the Evangelical Sisterhood of Mary, an international, interdenominational organization founded in 1947 within the framework of the German Evangelical (Protestant) Church. Website: www.kanaan.org",
            "download": "http:\/\/sermonindex.net\/SID21112-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Studies In 1 Corinthians-11 1 Cor 13",
            "url": "http:\/\/sermonindex.net\/SID12605",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "1 Corinthians",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12605-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Greatest Thing In The World",
            "url": "http:\/\/sermonindex.net\/SID24147",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:1-4",
            "topic": "Love",
            "description": "God is love. Pastor Cymbala explores what this really means and how we should live out this life of love as a follower of Christ.",
            "download": "http:\/\/sermonindex.net\/SID24147-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Greatest Thing Is Love",
            "url": "http:\/\/sermonindex.net\/SID9379",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Love",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9379-download",
            "preacher_name": "Ernest Barker",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "The Reality Of The Love Of Jesus Christ",
            "url": "http:\/\/sermonindex.net\/SID0503",
            "size": "13784576",
            "format": "mp3",
            "scripture": "1 Corinthians 13:13",
            "topic": "Love",
            "description": "Corrie Ten Boom shares her testimony of walking with the Lord Jesus 75 for years. Her times of struggle in terrible persecutions and imprisonment. What joy and happiness she has recounting her life and walk with the Lord Jesus.",
            "download": "http:\/\/sermonindex.net\/SID0503-download",
            "preacher_name": "Corrie Ten Boom",
            "preacher_image": "\/images\/corrie_ten_boom.gif",
            "preacher_description": "Corrie Ten Boom (1892 - 1983)\r\nListen to freely downloadable audio sermons by the speaker Corrie Ten Boom in mp3 format. Known for the book the \"Hiding Place\" where she smuggled Jewish people during the great World Wars under the Nazi regime. She had a vibrant faith in the Lord Jesus Christ and that showed in her love for others especially the people of Israel. She ended up going to a concentration camp where she suffered greatly and survived to share the story of faith. \r\n\r\nCorrie's faith story and testimony was shared in many settings especially in the 60-70's where she toured all across North America encouraging Christians of how to endure coming persecution. Her ministry was to encourage faith and love in the hardest circumstances.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Through A Glass Darkly",
            "url": "http:\/\/sermonindex.net\/SID24879",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:12",
            "topic": "Faith",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24879-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "United in love",
            "url": "http:\/\/sermonindex.net\/SID14312",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13:13",
            "topic": "",
            "description": "Jesus said in John 13:35, “By this all will know that you are My disciples, if you have love for one another.” God's children have this mark upon them, that they have fervent love for one another. When one of the members suffers, the others have compassion on that person as if they are suffering themselves. We must be one in the things of the Lord; one in humility, accepting God's Word and applying it to our lives and obey it. We cannot claim to be of one heart when there is division and each one pulls his or her own way. If we are not united then there is something wrong in our midst. We must even be united in our thoughts, and in what we hate. If there is no hatred in your life towards sin and abhorrence for the world, you are rotten and good for nothing in God's Kingdom. You must hate the world and the things of the world – the lust of the eyes, the lust of the flesh and the pride and haughtiness of life.",
            "download": "http:\/\/sermonindex.net\/SID14312-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Week Of Meetings 03",
            "url": "http:\/\/sermonindex.net\/SID9384",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Bible Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9384-download",
            "preacher_name": "Morgan Bartlett",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "What Is Love? The Root of Self-Seeking",
            "url": "http:\/\/sermonindex.net\/SID24859",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 13",
            "topic": "Love",
            "description": "Brother Brian shares about the love of God. He defines it Biblically and gives many examples of how much love means to God and each believer. He exhorts us to seek and pursue love above all things. Love is not selfish, he shows clearly that the root of love is not self-seeking. A great challenging message to all of us.",
            "download": "http:\/\/sermonindex.net\/SID24859-download",
            "preacher_name": "Brian Long",
            "preacher_image": "",
            "preacher_description": "Brian Long ( - )\r\nListen to freely downloadable audio sermons by the speaker Brian Long in mp3 format. Brother Brian Long is the pastor of Cornerstone Community Church of Barnsdall. God has done a powerful work in this brothers life as he has served as a baptist pastor for a season and now God has called him out to a independent work under the Headship of Jesus Christ.\r\nHe has spoken at SermonIndex Conference as well as other revival meetings in Churches across America. His burden and passion for the glory of Jesus Christ alone is evident in his preaching. The emphasis on prayer and the prayer meeting in their fellowship has been the power behind the local church, you are welcome to visit locally for their prayer time on Wednesday.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "13"
                }
            ]
        }
    ]
}