{
    "name": "1 Thessalonians 3",
    "book": "1 Thessalonians",
    "chapter": 3,
    "audio_sermons": [
        {
            "title": "(1 Thessalonians) Paul's Concern For The Converts",
            "url": "http:\/\/sermonindex.net\/SID7139",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 3",
            "topic": "Concern",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7139-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "50 Principle 46- Meeting In Home Churches",
            "url": "http:\/\/sermonindex.net\/SID25395",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 20:20, Matthew 24:9, 1 Thessalonians 3:4",
            "topic": "Audio Books",
            "description": "Here is an example of how this can be accomplished. Recently, we heard of a pastor of a church in America who felt led of the Lord to appoint 12 pastors in his Church who would oversee 12 separate home Churches on Wednesday nights. They all still meet together on Sunday mornings to hear the main pastor teach, but these small groups also act as functioning Churches. These pastors of the small groups are perhaps not as well-trained or capable from a human perspective but this servant leader saw the heart of God to raise up brothers and sisters, to encourage and lead the body of Christ.",
            "download": "http:\/\/sermonindex.net\/SID25395-download",
            "preacher_name": "Principles For The Gathering of Believers",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "20"
                },
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Church History - Session 2 (Persecution From Rome)",
            "url": "http:\/\/sermonindex.net\/SID1360",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 3, Luke 21:12-24, 2 Thessalonians 2:1-7",
            "topic": "Church History",
            "description": "Parkyns keys upon God's agents of purifying the Church: the lordship of the Holy Spirit and persecution.  Ten major persecutions in the 1st and 2nd centuries, along with some key martyrs, are outlined.  Parkyns highlights major heresies that arose during that timeframe and how the 'official church' began branding Bible believing Christians as heretics.",
            "download": "http:\/\/sermonindex.net\/SID1360-download",
            "preacher_name": "Edgar F. Parkyns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "2 Thessalonians",
                    "chapter": "2"
                },
                {
                    "book": "Luke",
                    "chapter": "21"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Holiness of God",
            "url": "http:\/\/sermonindex.net\/SID20529",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 3:10-13, 1 Thessalonians 5:23",
            "topic": "Holiness",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20529-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Keeping the Faith",
            "url": "http:\/\/sermonindex.net\/SID27986",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 3:1-5",
            "topic": "Endurance",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27986-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                }
            ]
        }
    ]
}