{
    "name": "1 Thessalonians 5",
    "book": "1 Thessalonians",
    "chapter": 5,
    "sermons": [
        {
            "title": "(1 Thessalonians) Do Not Quench the Spirit",
            "url": "https:\/\/sermonindex.info\/SID11812",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:12-28",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11812-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(1 Thessalonians) Marked Differentiations And Exortations",
            "url": "https:\/\/sermonindex.info\/SID7141",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5, 2 Peter 3:8-11",
            "topic": "Exhoration",
            "description": "Willie Mullan clearly lays out the contents of this biblical chapter and expounds it with clarity and anointing. The recording quality is abit hard to hear at times but well worth the careful listen. The day of the Lord is a terrible, dreadful day, but also a hopeful day for the believer.",
            "download": "https:\/\/sermonindex.info\/SID7141-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "2 Peter",
                    "chapter": "3"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Godly Home) Part 19 - Children - a Dwelling Place for the Living God",
            "url": "https:\/\/sermonindex.info\/SID7424",
            "size": "0",
            "format": "mp3",
            "scripture": "2 Corinthians 6:16, 1 Thessalonians 5:23",
            "topic": "Godly Home Series",
            "description": "Have you ever wondered how child training in spiritual disciplines (i.e., prayer, Bible reading, fasting, and so on) works when the child is not yet born again?  Brother Denny shares how parents who diligently apply themselves in training the body and soul of their children do them such a favor and give them a headstart when the Spirit of God does come to indwell them.",
            "download": "https:\/\/sermonindex.info\/SID7424-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "2 Corinthians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "1 Thessalonians 5",
            "url": "https:\/\/sermonindex.info\/SID7868",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7868-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "1 Thessalonians 5:1-3",
            "url": "https:\/\/sermonindex.info\/SID26266",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:1-3",
            "topic": "Teaching",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26266-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "1 Thessalonians 5:12-15",
            "url": "https:\/\/sermonindex.info\/SID26366",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:12-15",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26366-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "1 Thessalonians 5:17",
            "url": "https:\/\/sermonindex.info\/SID26367",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:17",
            "topic": "Expositional",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26367-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "A Prayer & A Promise",
            "url": "https:\/\/sermonindex.info\/SID24062",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:23-24",
            "topic": "Holy Living",
            "description": "In and of ourselves, we aren't able to live a holy life, but the one who calls you is faithful, and He will do it! 1Thessalonians 5:23-24",
            "download": "https:\/\/sermonindex.info\/SID24062-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Be Ye Holy For I am Holy",
            "url": "https:\/\/sermonindex.info\/SID1537",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:23",
            "topic": "Practical Holiness",
            "description": "This message is a trumpet call to the church of Jesus Christ. The call for holy living is the call of Gods heart to his bride in our day. The unction that this man speaks from is very powerful and you will truly not be the same again after listening to this message. Let there be something of heaven in our lifes for truly that is the normal Christian life.",
            "download": "https:\/\/sermonindex.info\/SID1537-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Christ: Perfect Manhood",
            "url": "https:\/\/sermonindex.info\/SID17539",
            "size": "0",
            "format": "mp3",
            "scripture": "John 1:4, John 12:44, 1 Thessalonians 5:23",
            "topic": "Christ Manhood",
            "description": "Jesus’ life was the “Light” manifested. Maj. Thomas brings to light that God sanctifies the Spirit, Soul and Body.  He also uses Scripture to explain the difference between the “human soul” and the “animal soul”. Very interesting.",
            "download": "https:\/\/sermonindex.info\/SID17539-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "1"
                },
                {
                    "book": "John",
                    "chapter": "12"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Freedom From Soulishness",
            "url": "https:\/\/sermonindex.info\/SID17140",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 2:14-16, 1 Thessalonians 5:23, Hebrews 4:12",
            "topic": "Soulishness",
            "description": "Beginning with an explanation that soulishness is a topic many may not understand until later in their Christian walk, this sermon explains the dynamic of allowing biblical truth to hit the bedrock of the Christian’s will as opposed to the sandier extremes of dry intellect or meaningless emotionalism.   He offers a balanced view on how to determine what soulishness is, and says that we must learn to allow the sword of the spirit to divide that which is of the soul from that which is of the Spirit, in order that we may fly out of this snare.",
            "download": "https:\/\/sermonindex.info\/SID17140-download",
            "preacher_name": "Zac Poonen",
            "preacher_image": "\/images\/zac_poonen.gif",
            "preacher_description": "Zac Poonen ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Zac Poonen in mp3 format. God called brother Zac Poonen to a new work early on in his Christian experience. The movement is now called Christian Fellowship Churches where the New Covenant of New Testament Christianity is clearly preached. \r\n\r\nBrother Zac Poonen has written 25 books most of them being on the deeper Christian life. Many of these have been translated into a number of languages and have been circulated widely around the world. He clearly and passionately shares the  narrow way of Christian discipleship that is neglected by so many modern preachers.",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "2"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "Hebrews",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Getting Used to the Dark (alternate)",
            "url": "https:\/\/sermonindex.info\/SID9576",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5",
            "topic": "Apostasy",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9576-download",
            "preacher_name": "Vance Havner",
            "preacher_image": "\/images\/vance_havner.gif",
            "preacher_description": "Vance Havner (1901 - 1986)\r\nListen to freely downloadable audio sermons by the speaker Vance Havner in mp3 format. For over 70 years, the church was blessed and challenged by the prophetic ministry of Vance Havner. His style and burden was prophetic similar to the ministry of A.W. Tozer calling the Church to revival. His influence extended to a national level, but Dr. Havner's approach was always to minister where God directed, regardless of the size of the church.  His appeal and influence transcended denominational lines, and he spoke to many different groups of people.\r\n\r\nThroughout his ministry, Vance Havner lived and preached that a Christian should should exhibit faithfulness to Jesus in all areas of life.  He taught that the Christian should attend to, \"the outliving of the inliving Christ.\"  Havner wrote, \"To some, Christianity is an argument.  To many, it is a performance.  To a few, it is an experience.\"",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "He Will Soon Rejoice In His Love",
            "url": "https:\/\/sermonindex.info\/SID2573",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:1-6, Zephaniah 1:5-6",
            "topic": "God's Love",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID2573-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Zephaniah",
                    "chapter": "1"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Holiness of God",
            "url": "https:\/\/sermonindex.info\/SID20529",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 3:10-13, 1 Thessalonians 5:23",
            "topic": "Holiness",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID20529-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "3"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "In Everything Give Thanks",
            "url": "https:\/\/sermonindex.info\/SID26375",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:18",
            "topic": "Thanksgiving",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26375-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Life of Elijah - Part 5",
            "url": "https:\/\/sermonindex.info\/SID17548",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:9-10, 2 Peter 1:3-4, Galatians 3:13-14",
            "topic": "Elijah",
            "description": "This Elijah series is an excellent study on the life of Elijah. We see the blessings from his obedience and the results of his disobedience.  A perfect example for each of us to apply to our daily lives.",
            "download": "https:\/\/sermonindex.info\/SID17548-download",
            "preacher_name": "Major Ian Thomas",
            "preacher_image": "\/images\/major_ian_thomas.gif",
            "preacher_description": "Major Ian Thomas (1914 – 2007)\r\nListen to freely downloadable audio sermons by the speaker Major Ian Thomas in mp3 format. Evangelical writer, theological teacher and founder of the Torchbearers bible schools. These schools are now world-wide in many countries and provide a teaching base on the person of Christ in the believer and basic Biblical exposition of Bible books.\r\n\r\nAmong the many books that he wrote, the most influential have been: \"The Saving Life Of Christ\" , \"The mystery of godliness\" and \"If I perish, I Perish.\" His burden in ministry was to express and show the indwelling life of Christ in believers and the rest and power that life will have in us as we trust and have faith.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "2 Peter",
                    "chapter": "1"
                },
                {
                    "book": "Galatians",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "SEVERE TEMPTATIONS",
            "url": "https:\/\/sermonindex.info\/SID21466",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:24",
            "topic": "Radio Show",
            "description": "God lives and works today!  That is a fact which most of us can see - all we have to do is open our eyes and look around!  But let’s face it - times do come when we can’t see - times of SEVERE TEMPTATIONS!  This meditation,  gives some practical advice for just such times.",
            "download": "https:\/\/sermonindex.info\/SID21466-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "SEVERE TEMPTATIONS",
            "url": "https:\/\/sermonindex.info\/SID25471",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:24",
            "topic": "Radio Show",
            "description": "God lives and works today! That is a fact which most of us can see - all we have to do is open our eyes and look around! But let's face it - times do come when we can't see - times of SEVERE TEMPTATIONS! Today's meditation, by Basilea Schlink gives some practical advice for just such times.",
            "download": "https:\/\/sermonindex.info\/SID25471-download",
            "preacher_name": "Basilea Schlink",
            "preacher_image": "\/images\/basilea_schlink.gif",
            "preacher_description": "Basilea Schlink (1904 – 2001)\r\nListen to freely downloadable audio sermons by the speaker Basilea Schlink in mp3 format. She was used of the Lord to help found the Evangelical Sisterhood of Mary. The Lord has used her writings powerfully to help encourage the greater body of Christ of future sufferings for the Lord and how to endure them. Also one of the burdens of her ministry was to share in the sufferings of the Lord and share the sorrow that Jesus has for a lost world and a backslidden church.\r\n\r\n\"In heaven we will say, ‘Do you remember the time we celebrated a festival of heaven on earth with Mother Basilea?'\" - Corrie ten Boom. \"To visit one of the Kanaan sanctuaries that they have assembled around the world is to visit a taste of the kingdom on earth.\" - Greg Gordon",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Seeing Christ at the Hour of His Return",
            "url": "https:\/\/sermonindex.info\/SID18628",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 24:44-51, Matthew 25:1-8, 1 Thessalonians 5:4",
            "topic": "Second Coming Of Christ",
            "description": "March 8, 2009 - Those who have a lustful pursuit of God and affections for the world will not see the coming of Christ. The future of the true church of Jesus Christ will have a heavenly vision. Who then is the faithful and wise servant? The servant who is one in heart and one with the purposes of God. The wise servant will have their hands stretched out to heal and touch those around them with the supernatural power that can come only by God's Spirit. Those that will have spiritual sight in the last days will have a willingness to be sent by God as a vessel to be poured out and broken for lost humanity.",
            "download": "https:\/\/sermonindex.info\/SID18628-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Matthew",
                    "chapter": "24"
                },
                {
                    "book": "Matthew",
                    "chapter": "25"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Spiritual Treason",
            "url": "https:\/\/sermonindex.info\/SID13809",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:21",
            "topic": "New Experiences",
            "description": "Tozer speaks at a Alliance Conference on the a topic of discerning whether or not a experience or new doctrine is truly from God. He outlines and gives 5-6 reasons how we can surely know if it is from God: Does it glorify Christ? does it magnify Christ? Can it be found in the Bible? Does it promote unity and love for the brethren? This is a worthwhile teaching to hear and re-listen to.",
            "download": "https:\/\/sermonindex.info\/SID13809-download",
            "preacher_name": "A.W. Tozer",
            "preacher_image": "\/images\/aw_tozer.gif",
            "preacher_description": "A.W. Tozer (1897 - 1963)\r\nListen to freely downloadable audio sermons by the speaker A.W. Tozer in mp3 format. A \"20th-century prophet\" many called him during his lifetime. For 31 years A.W.Tozer was pastor of Southside Alliance Church in Chicago. He was involved in the missionary alliance movement for most of his pulpit life. A.W. Tozer lived in the presence of God he saw clearly and he spoke as a prophet to the church. He sought for God's honor with the zeal of Elijah and mourned with Jeremiah at the apostasy of God's people. \r\n\r\nLeonard Ravenhill was a close friend of pastor and writer A. W. Tozer and spoke of him as one of the most influential voices in the Church in America. A.W. Tozer's materials are a mainstay in Evangelical churches in our day and he is one of the most quoted authors. He was a prophet in his day and his writings are even more influential in our day. One of his books: The Pursuit of God, has had over 1 million copies sold world-wide.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Spiritual Treason by A.W. Tozer",
            "url": "https:\/\/sermonindex.info\/SID14597",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:21",
            "topic": "Podcast",
            "description": "Tozer speaks at a Alliance Conference on the a topic of discerning whether or not a experience or new doctrine is truly from God. He outlines and gives 5-6 reasons how we can surely know if it is from God: Does it glorify Christ? does it magnify Christ? Can it be found in the Bible? Does it promote unity and love for the brethren? This is a worthwhile teaching to hear and re-listen to.",
            "download": "https:\/\/sermonindex.info\/SID14597-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Sudden Destruction",
            "url": "https:\/\/sermonindex.info\/SID16005",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:1-3",
            "topic": "Destruction",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID16005-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Prayer Life of Our Lord",
            "url": "https:\/\/sermonindex.info\/SID26373",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:17",
            "topic": "Prayer",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID26373-download",
            "preacher_name": "Paul Washer",
            "preacher_image": "\/images\/paul_washer.gif",
            "preacher_description": "Paul Washer (1961 - Present)\r\nListen to freely downloadable audio sermons by the speaker Paul Washer in mp3 format. Brother Washer is the founder of Heart Cry Missionary society that funds and supports indigenous missionaries all across the world. He served as a missionary personally in Peru for many years. He has a passion for the glory of God and the preaching of the Gospel of Jesus Christ.\r\n\r\nWell-known on the internet for the audio and video message: \"Shocking Message to Youth\" he has been an in-demand speaker for many conventions and gatherings. He has recently published a new book: \"The Gospel's Power and Message\" that is highly recommended by many.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Sacrifice of Praise",
            "url": "https:\/\/sermonindex.info\/SID19831",
            "size": "0",
            "format": "mp3",
            "scripture": "Hebrews 13:15, Ephesians 5:20, 1 Thessalonians 5:18",
            "topic": "Praise",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID19831-download",
            "preacher_name": "Ed Mohr",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "13"
                },
                {
                    "book": "Ephesians",
                    "chapter": "5"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Spirit",
            "url": "https:\/\/sermonindex.info\/SID24787",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:19",
            "topic": "Holy Spirit",
            "description": "The Old Testament was filled with rules and laws which left us helpless. As Christians, we are instead led by the Spirit, but here are 3 very powerful commands we for us. We need the Spirit all day, every day.",
            "download": "https:\/\/sermonindex.info\/SID24787-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "The Times And The Seasons",
            "url": "https:\/\/sermonindex.info\/SID13694",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:1",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID13694-download",
            "preacher_name": "Jack Hibbs",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Wholly Sanctified #1",
            "url": "https:\/\/sermonindex.info\/SID13822",
            "size": "0",
            "format": "mp3",
            "scripture": "Genesis 2:7, 1 Thessalonians 5:23-24",
            "topic": "Sanctification",
            "description": "Stephen discusses the origin of the spirit, soul, and body of man, and how these parts of man interact.",
            "download": "https:\/\/sermonindex.info\/SID13822-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "Genesis",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Wholly Sanctified #2 - Spirit",
            "url": "https:\/\/sermonindex.info\/SID13824",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 20:27, 1 Thessalonians 5:23-24",
            "topic": "Sanctification",
            "description": "Stephen discusses the 3 functions of the spirit: Communion, Conscious, Intuition. He also discusses the need and means to exercise our spirit, strengthen our spirit, and purify our spirit.",
            "download": "https:\/\/sermonindex.info\/SID13824-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "Proverbs",
                    "chapter": "20"
                }
            ]
        },
        {
            "title": "Wholly Sanctified #3 - The Soul",
            "url": "https:\/\/sermonindex.info\/SID13828",
            "size": "0",
            "format": "mp3",
            "scripture": "Matthew 10:38-39, 1 Thessalonians 5:23-24, Hebrews 4:12-13",
            "topic": "Sanctification",
            "description": "Stephen discusses the interaction of the spirit, soul, and body, and how the soul is sanctified through the life of Christ.",
            "download": "https:\/\/sermonindex.info\/SID13828-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "Hebrews",
                    "chapter": "4"
                },
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "Matthew",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Wholly Sanctified #4 - Body",
            "url": "https:\/\/sermonindex.info\/SID13829",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 6:12-20, 1 Thessalonians 5:23-24",
            "topic": "Sanctification",
            "description": "Stephen discusses sanctification in relation our physical bodies.",
            "download": "https:\/\/sermonindex.info\/SID13829-download",
            "preacher_name": "Stephen  Kaung",
            "preacher_image": "\/images\/stephen_kaung.gif",
            "preacher_description": "Stephen Kaung ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Stephen Kaung in mp3 format. Stephen Kaung is a Chinese Chrisitan speaker and writer, and now living in Richmond, Virgina. At an early age was converted to Christianity and was active in the Methodist Church in China, with home his father was a minister. He first met watchman need in the early 1930's and joined Nee's indigenous christian work full-time, working with him until 1949 when he left China and became involved with Christian work in other ares of the Far East.\r\n\r\nStephen Kaung worked very closely with T Austin-Sparks until his death in 1972. His burden has been to allow a testimony of the Lord in the local assembly, and to help the saints see the great importance of the Church as God intended it. Stephen Kaung's major work has been to translate the writings of Watchman Nee into English, over 50 titles which have been published by his own organisation, Christian Fellowship Publishers (CFP), In Richmond, Virgina.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                },
                {
                    "book": "1 Corinthians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Why is it so Hard to Pray?",
            "url": "https:\/\/sermonindex.info\/SID15832",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Thessalonians 5:17",
            "topic": "Hinderances",
            "description": "June 12, 2007 - Our whole life is to be a walking, breathing prayer. Satan will oppose prayer because He knows it is our life line to God. This message speaks of 3 reasons why people stop praying. First, our journey and will are not in line with God. Second, unconfessed sin. And lastly, a wrong perception of what prayer is. Prayer is simply knowing the mind of God and moving forward in faith with Him. We can come boldly with an honest heart and agree with what He has spoken to us until He brings it to pass.",
            "download": "https:\/\/sermonindex.info\/SID15832-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Thessalonians",
                    "chapter": "5"
                }
            ]
        }
    ]
}