{
    "name": "Daniel 10",
    "book": "Daniel",
    "chapter": 10,
    "sermons": [
        {
            "title": "(Belarus) Crisis Praying",
            "url": "https:\/\/sermonindex.info\/SID15642",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 10:10",
            "topic": "Prayer Life",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID15642-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(Daniel) Antiochus and Antichrist Revisited",
            "url": "https:\/\/sermonindex.info\/SID10751",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 10-11, Revelation 1:12-16",
            "topic": "Antichrist",
            "description": "Daniel saw a great vision of a man clothed very much like the Lord Jesus at the start of Revelation. In this passage we read of an angel coming to Daniel to answer his prayer on the very day that Daniel lifted his hands up to the Lord God , yet this angel was resisted and hindered by demonic forces within the spirit realm, thus the answer didn't get through to Daniel till the 21st day, this is a great lesson in persistent and prevailing prayer as the answer would not have come to Daniel if he had given up on the 19th day, the angelic messenger was of course helped by Micheal who seems to have a protective role over the nation of Israel.  In the prophetic vision that is revealed to Daniel the king of the north is the king of Syria and the king of the south the king of Egypt, historically these 2 kings were 2 of Alexander the greats generals which have been mentioned before, and Israel was caught inbetween their disputes, this was just before the reign of Antiochus, the antichristn of the Old Testament.",
            "download": "https:\/\/sermonindex.info\/SID10751-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "1"
                },
                {
                    "book": "Daniel",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "(Daniel) Twenty One Days of Prayer",
            "url": "https:\/\/sermonindex.info\/SID13850",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 10:1-11, Ephesians 6:11-12",
            "topic": "Prayer",
            "description": "Willie Mullan preaches expositionally through the first part of the tenth chapter of Daniel. He exhorts and uses many examples and scriptures towards praying, true praying. \"Some of us have not been at it yet\" (in reference to true praying). The devil fights most strongly against us when we pray. What a need to understand the schemes of the devil and principalities and powers that we fight against.",
            "download": "https:\/\/sermonindex.info\/SID13850-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                },
                {
                    "book": "Daniel",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "He Who loves us",
            "url": "https:\/\/sermonindex.info\/SID27962",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 10:11",
            "topic": "Love",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27962-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "The Sudden Appearing of Christ",
            "url": "https:\/\/sermonindex.info\/SID18541",
            "size": "0",
            "format": "mp3",
            "scripture": "Malachi 3:1-6, Daniel 10:8-12, Revelation 1:12-18",
            "topic": "Second Coming",
            "description": "February 15, 2009 - What is it like when the Lord visits His People? This sudden appearing will come as a strong inner voice of conviction. When the Holy Spirit comes we become aware of the ungodliness of our speech. The closer we get to the presence of Christ the more undone we feel and we are made aware of the grace and mercy that continually covers us. This visitation comes to gives us a heart for the poor and when the Spirit of God is flowing through us spiritual poverty is broken. Christ inside of us will heal us and give us fresh vision of the future.",
            "download": "https:\/\/sermonindex.info\/SID18541-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Malachi",
                    "chapter": "3"
                },
                {
                    "book": "Daniel",
                    "chapter": "10"
                },
                {
                    "book": "Revelation",
                    "chapter": "1"
                }
            ]
        }
    ]
}