{
    "name": "Daniel 11",
    "book": "Daniel",
    "chapter": 11,
    "audio_sermons": [
        {
            "title": "(Daniel) A Chapter of Detailed Prophecy",
            "url": "http:\/\/sermonindex.net\/SID13851",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 11:1-20",
            "topic": "Prophecy",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13851-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Daniel) A Powerful Pernicious Personality",
            "url": "http:\/\/sermonindex.net\/SID13852",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 11:21-45",
            "topic": "Personality",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13852-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Through The Bible) Daniel 11-12",
            "url": "http:\/\/sermonindex.net\/SID6478",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 11-12",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6478-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "A Word for those Who Want to Know God",
            "url": "http:\/\/sermonindex.net\/SID11192",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 11:32",
            "topic": "Knowing God",
            "description": "March 19, 2006 – We are called to be a partaker in full measure of a victory that has already been conquered for us. Those who see the end from the beginning because of their deep desire to be separated from the world to glorify God will have their eyes opened to the power of God. They will become intimately acquainted with God and in this intimacy draw the strength that they need to slay every giant we face. The people that know their God shall be strong and do exploits.",
            "download": "http:\/\/sermonindex.net\/SID11192-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "11"
                }
            ]
        }
    ]
}