{
    "name": "Daniel 4",
    "book": "Daniel",
    "chapter": 4,
    "sermons": [
        {
            "title": "(Daniel) The Conversion of Nebuchadnezzar",
            "url": "http:\/\/api.sermonindex.net\/SID13843",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4:1-3",
            "topic": "Nebuchadnezzar",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13843-download",
            "speaker_name": "Willie Mullan",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Daniel) The Fall and Rise of Nebuchadnezzar",
            "url": "http:\/\/api.sermonindex.net\/SID10744",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4",
            "topic": "Nebuchadnezzar",
            "description": "Daniel chapter four is unique within the Bible as it is the only portion that was written by a gentile king, and thus could almost be renamed, 'The testimony of Nebuchadnezzar' as it bears witness to what God had done in the life of this great king.  Again he has a disturbing dream and calls for his councillors and yet calls Daniel last, and how is this a type of us today, when trouble comes we go to all the ends of the earth seeking council without asking what God has to say about the situation.  In his dream he sees a great tree that provides everything that the world needs, he then sees an angelic being saying 'cut it down'. Everyone knew what this dream meant yet only Daniel probably with a heavy heart and tears in his eyes would tell the king, Daniel implured him to repent yet even through this he didn't and thus fell mightily he probably went mad and for seven years ate grass like an ox.  Interestingly in secular Babylonian history there is a seven year preiod where there were no royal decrees. This passage teaches us that if we do not humble ourselves then God will do it because He will not share His glory with anyone.",
            "download": "http:\/\/api.sermonindex.net\/SID10744-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Daniel) The Kings Experience",
            "url": "http:\/\/api.sermonindex.net\/SID13844",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4:4-37",
            "topic": "King",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13844-download",
            "speaker_name": "Willie Mullan",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(Daniel: The Man God Uses #4) Fragrance of Christ",
            "url": "http:\/\/api.sermonindex.net\/SID15370",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4-5, 2 Corinthians 2:14-16",
            "topic": "Christ",
            "description": "A man who chooses Christ and sees Christ in the Word is an aroma of Christ to God.  Daniel spends just ten minutes with the king but the fragrance of Christ lingered many years later.  All God has called you to do is to live before Him, and He will see to it that His fragrance permeates our family members and the lost world around us.",
            "download": "http:\/\/api.sermonindex.net\/SID15370-download",
            "speaker_name": "Ed Miller",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "2"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "God's Word To Our Nation (1)",
            "url": "http:\/\/api.sermonindex.net\/SID16047",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 4:34-35, Job 12:23-25, Psalm 9:7",
            "topic": "America",
            "description": "A brief series of four messages addressing the moral condition of our nation in a focused way. The first message deals with the relationship of God to all the nations, including our own. In this introductory message we see: 1. the subjugation of all the nations to the sovereign rule of God. 2. the accountability of the nations to the just judgment of God. 3. the responsibility of the nations to hear the word of God.  4. the solidarity of believers with the nation in which they are found. Subsequent messages address more pointedly our nations’ sins of bloodguiltiness, sexual perversion and religious apostasy.",
            "download": "http:\/\/api.sermonindex.net\/SID16047-download",
            "speaker_name": "Albert N. Martin",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "9"
                },
                {
                    "book": "Job",
                    "chapter": "12"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Who",
            "url": "http:\/\/api.sermonindex.net\/SID0247",
            "size": "5267456",
            "format": "mp3",
            "scripture": "Daniel 4,1 Chronicles 29",
            "topic": "Sovereignty Of God",
            "description": "Who holds supreme religious authority today? Who has the  sovereignty to rule? It resides only in God and numerous proofs of this claim are found in Scripture. Dr. Tozer uses just two passages to prove the point - in I Chronicles 29 and Daniel 4.",
            "download": "http:\/\/api.sermonindex.net\/SID0247-download",
            "speaker_name": "A.W. Tozer",
            "_scripture": [
                {
                    "book": "1 Chronicles",
                    "chapter": "29"
                },
                {
                    "book": "Daniel",
                    "chapter": "4"
                }
            ]
        }
    ]
}