{
    "name": "Daniel 5",
    "book": "Daniel",
    "chapter": 5,
    "audio_sermons": [
        {
            "title": "(Daniel) The Writing on the Wall",
            "url": "http:\/\/sermonindex.net\/SID13845",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5:1-31",
            "topic": "Nebuchadnezzar",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13845-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Daniel) The Writing on the Wall",
            "url": "http:\/\/sermonindex.net\/SID10745",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Belshazzer",
            "description": "During the reign of Belshazzar the king, Darius the Mede laid seige to the city of Babylon, Belshazzar though was so unconcerned about this seige that he decided to hold a party for all his friends, this is so common today how the world is teetering on the brink of destruction and eveyone, in the west at least, is partying and concerned with what is on the television.  But God decides to 'crash' this party  and manifests a disembodied hand to write on the wall, this terrifies the king and he calls for Daniel to interpret the writing.  This is a type of how the world seek out the children of God when 'the writing is on their walls'.  Belshazzar offers Daniel riches and power but Daniel isn't interested and rebukes Belshazzar saying that he should have humbled himself like Nebuchadnezzar, but because he hadn't the kingdom would be taken from him and divided, and this was fullfilled that very night when Darius' army stormed Babylon",
            "download": "http:\/\/sermonindex.net\/SID10745-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Daniel: The Man God Uses #5) Fragrance of Christ",
            "url": "http:\/\/sermonindex.net\/SID15371",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Christ",
            "description": "God's hand is in the life of the ungodly, but not all the ungodly will positively respond to the fragrance of Christ.  Belshazzar could read the handwriting on the wall but didn't have the life to understand what it meant.  The lesson we learn from Daniel's life is that it's our business to know Him; it's His business to make Himself known through us.",
            "download": "http:\/\/sermonindex.net\/SID15371-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "(Through The Bible) Daniel 5-8",
            "url": "http:\/\/sermonindex.net\/SID6476",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5-8",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6476-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "3) Ministry From Spring Harvest - Chapter 5",
            "url": "http:\/\/sermonindex.net\/SID10958",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Failure",
            "description": "Verwer emphasizes that God will let failures happen; he will not always overrule and save us from ourselves. When this happens we should not expect that he will withhold judgment. Daniel’s wisdom is shown yet again not only in translating the message from God but in his refusal to take the gifts the king offered for his service.",
            "download": "http:\/\/sermonindex.net\/SID10958-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Belshazzer",
            "url": "http:\/\/sermonindex.net\/SID10176",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Belshazzer",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10176-download",
            "preacher_name": "Welcome Detweiler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Check your weight - on the scales of Scripture",
            "url": "http:\/\/sermonindex.net\/SID27968",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5:27",
            "topic": "Scripture",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27968-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Daniel 5",
            "url": "http:\/\/sermonindex.net\/SID7882",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5",
            "topic": "Daniel",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7882-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Evil Is At The Gate",
            "url": "http:\/\/sermonindex.net\/SID27806",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5, Galatians 6:7",
            "topic": "Evil",
            "description": "Carter Conlon speaks of the great moral and spiritual evil at the doorstep of the Church and America. He speaks of the history of sins in the culture of America and in the Church including slavery. Evil is becoming good and good is becoming evil. It is time to turn away godless false religion and seek God in prayer now because evil is at the gate.",
            "download": "http:\/\/sermonindex.net\/SID27806-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                },
                {
                    "book": "Galatians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Weighed and Found Wanting",
            "url": "http:\/\/sermonindex.net\/SID9124",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 5:27",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9124-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "Weighed in the balance (Sermon Reading)",
            "url": "http:\/\/sermonindex.net\/SID1915",
            "size": "22240768",
            "format": "mp3",
            "scripture": "Daniel 5:27",
            "topic": "Reading",
            "description": "Though not the actual voice of the great evangelist, this sermon is well read and worth the listen. The reader does an excellent job preserving the heart of Moody in the delivery. Taken from Daniel 5, the story of the finger writing on the wall 'Mene Mene Tekel Parsin', Moody expounds on how we will all be weighed in the balance of God's Ten Commandments, and our position in Christ will define the outcome. This is a solid sermon revealing further insight into the style and message of the late D.L. Moody.",
            "download": "http:\/\/sermonindex.net\/SID1915-download",
            "preacher_name": "D. L. Moody",
            "preacher_image": "\/images\/d_l_moody.gif",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "5"
                }
            ]
        }
    ]
}