{
    "name": "Daniel 7",
    "book": "Daniel",
    "chapter": 7,
    "audio_sermons": [
        {
            "title": "(Daniel) A Survey of Five World Empires",
            "url": "http:\/\/sermonindex.net\/SID10747",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 7",
            "topic": "Vision",
            "description": "Daniel's vision in chapter 7 was probably chronologically between Daniel chaoters 4 and 5.  In this vision the lion depicts the empire of Babylon that overwhelmed it's enemies like a lion overwhelms it's prey, but this lion was brought low and humbled just like Nebuchadnezzar king of Babylon.  The bear depicts the Medo-Persian empire that was slower in conquest than the Babylonian empire but was very crushing in the way it dominated it's enemies, inerestingly Daniel says this beast was raised up on one side and this is because the Persians were more dominant than the Medes' in the alliance.  The third beast is a four winged leopard which shows speed this beast depicts the greek empire under Alexander the great that conquered most of the known world in just 12 years, the beast also has 4 heads and Alexander divided his kingdom between his 4 generals.  The forth beast is different to all other beasts and represents the roman empire, however this beast hasn't been completely destroyed and is still around in the form of the European Union from which David Guzik believes the anitchrist (little horn in this chapter) will arise.  The final empire is the reign of Christ after his scond coming, this kingdom Jesus will give to his saints, notice it is given to them not earned by them.",
            "download": "http:\/\/sermonindex.net\/SID10747-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "(Daniel) Daniel's Great Vision",
            "url": "http:\/\/sermonindex.net\/SID13847",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 7:1-28",
            "topic": "Vision",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13847-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Church History - Session 5 (History and Old Testament Prophecy)",
            "url": "http:\/\/sermonindex.net\/SID1366",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 2, Daniel 7, Revelation 17",
            "topic": "Church History",
            "description": "Did prophecy foresee the significant events in the Church age, or did it overlook them?  Is the book of Revelation speaking of things totally in the future, or are there legitimate evidence from the historical record that indeed show that prophecy has been completed?  Join Edgar Parkyns as he sheds light upon the often mysterious apocalyptic language of prophecy--\"the ten horns\", \"the man of sin\"--and presents these alongside the obvious events of the history of the Church.  You be the judge!",
            "download": "http:\/\/sermonindex.net\/SID1366-download",
            "preacher_name": "Edgar F. Parkyns",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Revelation",
                    "chapter": "17"
                },
                {
                    "book": "Daniel",
                    "chapter": "7"
                },
                {
                    "book": "Daniel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Approaching Wave of Persecution",
            "url": "http:\/\/sermonindex.net\/SID17276",
            "size": "0",
            "format": "mp3",
            "scripture": "Habakkuk 2:1-4, Daniel 7:21-25, Daniel 8:23-27",
            "topic": "Persecution",
            "description": "Brother Denny Kenaston shares his burden on the coming persecution that will come in the end times but very possibly soon to Christianity world-wide. He clearly shows biblically that if we are of the kingdom of Christ the kingdom of this world will be in opposition against us. We need to prepare for this and prepare to love our enemies and share the Gospel.",
            "download": "http:\/\/sermonindex.net\/SID17276-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                },
                {
                    "book": "Daniel",
                    "chapter": "7"
                },
                {
                    "book": "Habakkuk",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "The Priority of Christ\t- Part 2",
            "url": "http:\/\/sermonindex.net\/SID13063",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 7:13-15, Matthew 28:16-20",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13063-download",
            "preacher_name": "Tom Wells",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "7"
                },
                {
                    "book": "Matthew",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "The Wearing Down Of The Saints",
            "url": "http:\/\/sermonindex.net\/SID15873",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 7:21-22",
            "topic": "Antichrist",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15873-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "7"
                }
            ]
        }
    ]
}