{
    "name": "Daniel 8",
    "book": "Daniel",
    "chapter": 8,
    "audio_sermons": [
        {
            "title": "(Common Market) Palestine in relation to the common market",
            "url": "http:\/\/sermonindex.net\/SID8332",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 8:23-26",
            "topic": "Common Market",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8332-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(Daniel) Antiochus and Antichrist",
            "url": "http:\/\/sermonindex.net\/SID10748",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 8",
            "topic": "",
            "description": "the Eigth chapter of Daniel is a passage in the Bible so outstanding in it's historical fulfillment that many liberal scholars think that it could not possibly have been written by Daniel because it reveals future events in such detail.  The ram's horns represent the kings of Media and Persia.  The goat represents the grecian empire and it's one mighty horn Alexander the great, who split his kingdom into 4 parts at his death at the age of only 32 years old. Out of these 4 rulers arose 1 called Antiochus Epiphanes who behaved abhorently towards the jews, he defiled the temple by erecting a statue of Zeus and slaughtering a pig on the altar, he was also responsible for the murder of possibly 100,000 Jews, and is called by many comentators'the antichrist of the Old Testament'.  The cultural influence of the greek empire was massive though, and still greatly influences modern thought even more than 2000 years later.  The hand of the Lord was in this huge influence of greek thinking though in that by the time Jesus came to the world the whole of civilization spoke one language, greek, and hence Paul could go anywhere in the civilized world and preach in greek and be understood.",
            "download": "http:\/\/sermonindex.net\/SID10748-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(Daniel) Daniel's Second Vision",
            "url": "http:\/\/sermonindex.net\/SID13863",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 8:1-27",
            "topic": "Vision",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13863-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "The Approaching Wave of Persecution",
            "url": "http:\/\/sermonindex.net\/SID17276",
            "size": "0",
            "format": "mp3",
            "scripture": "Habakkuk 2:1-4, Daniel 7:21-25, Daniel 8:23-27",
            "topic": "Persecution",
            "description": "Brother Denny Kenaston shares his burden on the coming persecution that will come in the end times but very possibly soon to Christianity world-wide. He clearly shows biblically that if we are of the kingdom of Christ the kingdom of this world will be in opposition against us. We need to prepare for this and prepare to love our enemies and share the Gospel.",
            "download": "http:\/\/sermonindex.net\/SID17276-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Daniel",
                    "chapter": "8"
                },
                {
                    "book": "Daniel",
                    "chapter": "7"
                },
                {
                    "book": "Habakkuk",
                    "chapter": "2"
                }
            ]
        }
    ]
}