{
    "name": "Acts 23",
    "book": "Acts",
    "chapter": 23,
    "sermons": [
        {
            "title": "Acts 23",
            "url": "http:\/\/sermonindex.net\/SID13501",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 23",
            "topic": "Expositional",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13501-download",
            "preacher_name": "Bill Gallatin",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Book of Acts Series - Part 41 | Accusations",
            "url": "http:\/\/sermonindex.net\/SID25684",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 23:23-29",
            "topic": "Book Of Acts",
            "description": "It happened to Jesus, it happened to Paul, it happened to the Apostles and it happens today. We live in the day of accusations and false representations all of which come from the accuser of the brethren. Listen carefully to hear how we are to deal with accusations. Acts 23:23-29 & Acts 4:19-20",
            "download": "http:\/\/sermonindex.net\/SID25684-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Find the Prisoner",
            "url": "http:\/\/sermonindex.net\/SID17595",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 23:1-11",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID17595-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "23"
                }
            ]
        },
        {
            "title": "Get Ready to Stand in the Fire",
            "url": "http:\/\/sermonindex.net\/SID19408",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 23:1-5, 1 Peter 4:12",
            "topic": "Last Days",
            "description": "November 8, 2009 - The evidence that we are true Christians is a deep seated understanding that no matter what fiery trial God allows us to go through we understand that He is in absolute control and that there is a divine plan behind all of it. It is through these fiery trials that we come out with an inner strength that declares mo matter what happens the life of God in us cannot be triumphed over! The key to this kind of life is to be free of offence and to have a good conscience towards God and man and to refuse to speak evil in a difficult situation. It doesn't matter how we feel or what happens, we must always allow the Holy Spirit to lead us back in line with the truth of God's Word. Do you want to stand in the fire? Your strength comes from allowing God's Word to have the last say in every circumstance!",
            "download": "http:\/\/sermonindex.net\/SID19408-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Peter",
                    "chapter": "4"
                },
                {
                    "book": "Acts",
                    "chapter": "23"
                }
            ]
        }
    ]
}