{
    "name": "Acts 28",
    "book": "Acts",
    "chapter": 28,
    "audio_sermons": [
        {
            "title": "(Through The Bible) Acts 28",
            "url": "http:\/\/sermonindex.net\/SID6564",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 28",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6564-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "Acts 28",
            "url": "http:\/\/sermonindex.net\/SID10058",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 28",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10058-download",
            "preacher_name": "Gerry Covenhoven",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "The Unhindered Gospel",
            "url": "http:\/\/sermonindex.net\/SID13888",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 28:16",
            "topic": "",
            "description": "July 24, 2005. When God places us in the body and we choose to stay in that position without murmuring or complaining we will become a channel for the gospel to flow through us. The Gospel of Jesus Christ is unstoppable. It is only we who preach it or we who live it can hinder the gospel. It is through the spirit of unbelief that the gospel is hindered.",
            "download": "http:\/\/sermonindex.net\/SID13888-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "Unhindered",
            "url": "http:\/\/sermonindex.net\/SID0261",
            "size": "6013952",
            "format": "mp3",
            "scripture": "Acts 28:30-31",
            "topic": "Missions",
            "description": "Brother Andrew says there are no \"doors\" in this world that are closed to prevent the proclaiming of the Good News of Jesus Christ. Though the messenger may be bound in chains, the message still gets through. Brother Andrew cites Paul's situation in Acts 28:30-31. Even as a prisoner of Rome, the Apostle continued to deliver the message. But once through the \"door,\" could a believer return if he wanted to and still be true to Christ? Could Paul? Could Peter? Could Stephen? Could the martyrs?",
            "download": "http:\/\/sermonindex.net\/SID0261-download",
            "preacher_name": "Brother Andrew",
            "preacher_image": "\/images\/brother_andrew.gif",
            "preacher_description": "Brother Andrew ( - )\r\nListen to freely downloadable audio sermons by the speaker Brother Andrew in mp3 format. Known in English-speaking countries as Brother Andrew, is a Christian missionary famous for his exploits smuggling Bibles to communist countries in the height of the Cold War, a feat that has earned him the nickname \"God's smuggler\". Brother Andrew studied at the WEC Missionary Training College in Glasgow, Scotland. \r\nIn 1967, he published the first edition of God's Smuggler, written with John and Elizabeth Sherrill. God's Smuggler tells the story of Brother Andrew's early childhood, conversion to Christianity, and adventures as a Bible-smuggler behind the Iron Curtain. It has now sold over 10 million copies in thirty-five languages. After the fall of communism in Europe, Brother Andrew shifted his focus to the Middle East and has worked to strengthen the church in the Islamic world. In the 70s he visited war-torn Lebanon several times, stating that \"global conflict in the end times will focus on Israel and its neighboring countries\".",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "When the Serpent Bites Your Hand, Victory is at the Door",
            "url": "http:\/\/sermonindex.net\/SID15017",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 28:1-3",
            "topic": "Victory",
            "description": "March 4, 2007 - Satan is terrified of the man or woman who has determined in his or her heart to fulfill the call that God has placed on their lives no matter what the cost. One of the final traps of Satan on these Christians is to bite our hands and infuse us with his poisonous logic. It's always been Satan's desire to either have man withdraw his hand from being extended on God's behalf, or to distort the image of God's hand as He is revealed through man's hand. For those of us whose hands have been bitten by the very people God has sent us to help, God is saying DONT GIVE UP. God is calling us to a militant forgiveness so that God's hands will be extended through our hands to reach a fallen world. The weakness in our hands will be strengthened by the resurrected Hands of Jesus Christ.",
            "download": "http:\/\/sermonindex.net\/SID15017-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "28"
                }
            ]
        }
    ]
}