{
    "name": "Acts 29",
    "book": "Acts",
    "chapter": 29,
    "sermons": [
        {
            "title": "Acts Chapter 29",
            "url": "http:\/\/sermonindex.net\/SID15428",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 29",
            "topic": "Book Of Acts",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15428-download",
            "preacher_name": "Dean Taylor",
            "preacher_image": "",
            "preacher_description": "Dean Taylor ( Â– Present)\r\nListen to freely downloadable audio sermons by the speaker Dean Taylor in mp3 format. Dean Taylor is the general editor of The Remnant of the Charity church movement. He has written a powerful book on non-resistance: A Change of Allegiance. His teachings on suffering and martyrdom are important for the body of Christ and we must learn again from our forefathers and how they suffered for Christ.\r\n\"Every day IÂ’m more convinced that the only thing worth putting my life into is the simple, child-like acceptance of the teachings of Jesus. I believe that Jesus meant what He said. But even more, I believe that JesusÂ’ plan for humanity is actually a great idea! Sometimes the ways and wisdom of Jesus donÂ’t make sense.\" - Dean Taylor",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "29"
                }
            ]
        },
        {
            "title": "What happened to Acts Ch 29",
            "url": "http:\/\/sermonindex.net\/SID21179",
            "size": "0",
            "format": "mp3",
            "scripture": "Acts 29",
            "topic": "Missions",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID21179-download",
            "preacher_name": "George Verwer",
            "preacher_image": "\/images\/george_verwer.gif",
            "preacher_description": "George Verwer (1938 - Present)\r\nListen to freely downloadable audio sermons by the speaker George Verwer in mp3 format. Founder of Operation Mobilization an missions organization that sends out full-time and part-time missionaries to many countries in the world. One of the burdens of brother George has been to distribute powerful literature to Christians such as: \"The Calvary Road by Roy Hession,\" and many others. \r\n\r\nGeorge Verwer has written many books including the powerful book: \"Come, Live, Die!\" He has mobilized and encouraged thousands of Christian workers to fulfill their calling in the Lord to reach the lost world with the Gospel of Jesus Christ.",
            "_scripture": [
                {
                    "book": "Acts",
                    "chapter": "29"
                }
            ]
        }
    ]
}