{
    "name": "Nehemiah 1",
    "book": "Nehemiah",
    "chapter": 1,
    "audio_sermons": [
        {
            "title": "(Godly Home) Part 20 - Father is a Watchman",
            "url": "http:\/\/sermonindex.net\/SID7425",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1:3-4, Psalm 101:2-4",
            "topic": "Godly Home Series",
            "description": "\"The father is the Nehemiah of the house\", brother Denny cautions, the one to raise up the wall of biblical standards to protect the family and the gatekeeper to watch for subtle influences that gradual erode the spiritual life of it.  Kenaston blows a bold trumpet of alarm against many harmful and destructive influences of our day, such as television, movies, toys, computer games, books, Internet, Christian \"rock\" music, and children's videos.",
            "download": "http:\/\/sermonindex.net\/SID7425-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "101"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) Nehemiah 1-7",
            "url": "http:\/\/sermonindex.net\/SID6367",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1-7",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID6367-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Call to Anguish",
            "url": "http:\/\/sermonindex.net\/SID3663",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Revival",
            "description": "David Wilkerson speaks about the perversion in America and the sinfulness of the church. He points out how the church today is married to the world. People are seeking places where smooth messages are being preached. Christians no longer want to hear about God's coming wrath and the necessary correction of their lives. This broken and God-fearing man denounces the passivity of God's people. Christians are blind to the lukewarmness and the sinful mixture that has crept in little by little. He warns how the spirit of blindness is the least recognizable thing. He calls believers to leave their passivity: \"You have lost your fight. That's all the devil wants to do is get the fight out of you and kill it. So you won't labor in prayer anymore, you won't weep before God anymore. You can sit and watch television and your family goes to hell. If you are expecting somebody else to win your family or to do this work you are mistaken.\" Through this very deep, challenging and anointed message, God calls believers to a baptism of anguish and to fervently pray for the recovery of a nation.",
            "download": "http:\/\/sermonindex.net\/SID3663-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "A Call to Those Who Care About the Honor of God",
            "url": "http:\/\/sermonindex.net\/SID19379",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1:1-11",
            "topic": "Honor Of God",
            "description": "October 4, 2009 - There is a spiritual wall that separates those who are truly serving God and those who are bringing carnality into His church. If God is going to be honored in this generation we must begin to rebuild the testimony of Christ in our lives. You may ask yourself how does this happen? How do I begin to rebuild this wall? The first thing we do is apply the truth of God's Word to every area of our life where we are not in agreement with Him. Secondly, we must remove the rubble in our homes that has blocked the door to the prayer closet. Lastly, call our children by example into the work of God. Suddenly there will be a people arise and begin to build according the ways of God and they will do it all for His honor!",
            "download": "http:\/\/sermonindex.net\/SID19379-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Conference 1989-01 ~ Nehemiah 1",
            "url": "http:\/\/sermonindex.net\/SID27937",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID27937-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Greenwood Hills Conference 1989-01 Nehemiah 1",
            "url": "http:\/\/sermonindex.net\/SID11838",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Conference",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11838-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The High Cost of Caring",
            "url": "http:\/\/sermonindex.net\/SID13546",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13546-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "The order of the grain of mustard seed\t",
            "url": "http:\/\/sermonindex.net\/SID24168",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 1",
            "topic": "Moravians",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID24168-download",
            "preacher_name": "Kevin Horton",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "1"
                }
            ]
        }
    ]
}