{
    "name": "Nehemiah 2",
    "book": "Nehemiah",
    "chapter": 2,
    "sermons": [
        {
            "title": "(Daniel) The 70 Weeks of Daniel",
            "url": "http:\/\/api.sermonindex.net\/SID10750",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9: 20-27, Nehemiah 2:1, Luke 19:37-40",
            "topic": "Seventy Weeks",
            "description": "After Daniels great intercession for the nation of Israel the angel Gabriel appears to him and tells him that he is about to be shown a great prophecy.  This is amazingly characteristic of the abundance with which the Lord gives to His people, Daniel has been asking the Lord to show mercy to the nation of Israel yet the Lord does that and more, He answers Daniel's prayer but goes so much further.  Gabriel reveals to Daniel that there will be a period of 490 years that will concern the Jews and particularly the city of Jerusalem.  The prophecy began to be fulfilled in 445BC at the decree of Cyrus to rebuild the city of Jerusalem.  483 Jewish years (360 days) later was the exact that the Lord Jesus rode into Jerusalem on the donkey, but as predicted the Messiah was executed and the temple destoyed.  So we await the fulfillment of Daniels 70th week, when the Antichrist will confirm a covenant with the jews, his people destroyed the temple and Jerusalem before he even came to the world, many believe he will probably be European.",
            "download": "http:\/\/api.sermonindex.net\/SID10750-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "Luke",
                    "chapter": "19"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                },
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "Come let us build",
            "url": "http:\/\/api.sermonindex.net\/SID14340",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17",
            "topic": "Building",
            "description": "A certain lady was worried that she was getting older and remaining single. One day she was very distressed and went to pray outside under a tree for a husband. She worked herself up emotionally and eventually she shouted (some Christians like to pray louder and louder and work themselves up to a crechendo, thinking that by their sheer volume they will be heard of God. They fail to distinguish between the soul and spirit). An owl in the tree was startled by her crying and let out \"whooo\". She replied, \"anybody, Lord\". Don't be obsessed with marriage lest you end up with a washout of a husband. Let God be your first priority.",
            "download": "http:\/\/api.sermonindex.net\/SID14340-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Diligence in God´s Work - more lessons from Nehemiah",
            "url": "http:\/\/api.sermonindex.net\/SID14339",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17- 20",
            "topic": "Gods Work",
            "description": "The matter we find here is not directly related to the Christmas story but nevertheless contains and essential part of the Gospel for Jesus came into this world to \"save His people from their sins\" and set them on fire for Him and make them truly diligent in His work. Nehemiah had a cushy job in Persia. His position meant that the King's life was in His hands and he was also an advisor to him. Yet, his concern was for the condition of God's work in Jerusalem. As distant as he was Nehemiah still felt godly zeal for the Lord and His people. We find that he was able to inspire the Lord's people to work so zealously that they completed the rebuilding of the walls in 52 days - humanly impossible but with God, all things are possible. They both defended God's work and built, at the same time, despite all opposition.",
            "download": "http:\/\/api.sermonindex.net\/SID14339-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Nothing Can Stop What God is Doing",
            "url": "http:\/\/api.sermonindex.net\/SID4289",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 2:17-20",
            "topic": "Gods Purpose",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4289-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "2"
                }
            ]
        }
    ]
}