{
    "name": "Nehemiah 5",
    "book": "Nehemiah",
    "chapter": 5,
    "sermons": [
        {
            "title": "Witnesses Against You",
            "url": "https:\/\/sermonindex.info\/SID14348",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 5:7",
            "topic": "",
            "description": "“I set a great assembly against them.” — Nehemiah 5:7. THE facts are these. At the time when certain of the Jews returned with Nehemiah to Jerusalem, many of them were in very straitened circumstances; and, contrary to the Jewish law, the richer Jews lent them money upon usurious interest, amounting to the hundredth per month, or twelve per cent. per annum. They took from their poorer brethren their lands, or put a heavy mortgage upon them; and in some cases took the men themselves to be slaves for debts which they had unavoidably incurred. Now, as you know, every Jew was a landholder, and his land, if mortgaged for a time, must return free to him in the fiftieth year; and, though a Jew might for a while become a servant to his Jewish brother, yet he must go out free at the end of the seventh year. He could only be bound for a short period of servitude. Nehemiah called to him, therefore, the elders, and nobles, and rulers of Jerusalem, and showed them how wrong they were to hold their poorer brethren in bondage. 'Ye exact usury, every one of his brother,' he says; and he rebukes them sharply for it. When he found that his own words were scarcely powerful enough with them, he gathered together the people, and let them all have a voice, and in the many voices there was power...",
            "download": "https:\/\/sermonindex.info\/SID14348-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "5"
                }
            ]
        }
    ]
}