{
    "name": "Nehemiah 7",
    "book": "Nehemiah",
    "chapter": 7,
    "sermons": [
        {
            "title": "Who Is Guarding The Front Door Of Your Home",
            "url": "http:\/\/api.sermonindex.net\/SID4333",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 7,Isaiah 44:1-4",
            "topic": "",
            "description": "We must examine ourselves for how we raised our children, and live our lives, for we will stand before a holy God and give account. Parents are responsible for what comes into their homes. Watchmen and guards must be appointed and we must all fast and pray for our homes and families. Pastor Wilkerson uses Nehemiah as an example of a caring watchman who was burdened for Israel when they were rebuilding the walls of the broken down city of Jerusalem.",
            "download": "http:\/\/api.sermonindex.net\/SID4333-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "7"
                },
                {
                    "book": "Isaiah",
                    "chapter": "44"
                }
            ]
        }
    ]
}