{
    "name": "Nehemiah 9",
    "book": "Nehemiah",
    "chapter": 9,
    "sermons": [
        {
            "title": "Delivered by a Cry",
            "url": "http:\/\/sermonindex.net\/SID4176",
            "size": "0",
            "format": "mp3",
            "scripture": "Judges 2, Nehemiah 9:24-28, Exodus 3:7-8",
            "topic": "Deliverance",
            "description": "Pastor Wilkerson goes through several chapters and verses in the book of Judges showing how Israel repeatedly turned from God, which gave the enemy opportunity to oppress them, and yet, when they cried out to God, he did not rail on them, he sent them a deliverer. God was angry at their sin, yet when they cried out he delivered. He wanted them to see they needed him. If you are struggling with a besetting sin, this message will show you the way to deliverance!",
            "download": "http:\/\/sermonindex.net\/SID4176-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Exodus",
                    "chapter": "3"
                },
                {
                    "book": "Nehemiah",
                    "chapter": "9"
                },
                {
                    "book": "Judges",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Nehemiah 9",
            "url": "http:\/\/sermonindex.net\/SID7902",
            "size": "0",
            "format": "mp3",
            "scripture": "Nehemiah 9",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7902-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Nehemiah",
                    "chapter": "9"
                }
            ]
        }
    ]
}