{
    "name": "1 Samuel 10",
    "book": "1 Samuel",
    "chapter": 10,
    "sermons": [
        {
            "title": "(1 Samuel) A Good Start for Saul",
            "url": "http:\/\/sermonindex.net\/SID10631",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 10",
            "topic": "",
            "description": "Here is the time in history of the nation of Israel when they are about to receive their first king.  Samuel the prophet takes Saul, the future king, and anoints him king privately and in a way that shows how the Lord wants to anoint every believer with the Holy Ghost, how He should fill our lives.  The Lord then confirms that Saul is to be made king by giving Saul 3 very specific signs.  The last sign was that thje Holy Ghost would come upon Saul and change him into a new man as spiritual confirmation of the physical anointing that Saul had received.  So Saul was turned into another man, Samuel gathered all the people of Israel together and revealed Saul as their future king and the people rejoiced because he 'looked the part' but Samuel knew that Saul had very little spiritual subsatnce.",
            "download": "http:\/\/sermonindex.net\/SID10631-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "10"
                }
            ]
        },
        {
            "title": "Wait",
            "url": "http:\/\/sermonindex.net\/SID24231",
            "size": "0",
            "format": "",
            "scripture": "1 Samuel 10:1",
            "topic": "Waiting On God",
            "description": "The Lord wanted to show Saul that He'd make him king, but God also wanted to show him what he must do. Saul disobeyed a simple command to wait. Let's wait on the Lord as He tells us what to do. 1 Samuel 10:1, 8-9; 13:6-14",
            "download": "http:\/\/sermonindex.net\/SID24231-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "10"
                }
            ]
        }
    ]
}