{
    "name": "1 Samuel 11",
    "book": "1 Samuel",
    "chapter": 11,
    "sermons": [
        {
            "title": "(1 Samuel) Saul’s Wise Early Years",
            "url": "http:\/\/sermonindex.net\/SID10632",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 11",
            "topic": "",
            "description": "Nahash king of the Ammonites comes against the people of Jabesh Gilead a city of Israel and threaten to kill the them and take all the possessions from their city, so the people offer to make him a deal in exchange for their lives, Nahash agrees and demands all their right eyes in exchange for their lives.  So the people of jabesh Gilead ask for one week to ask for help of the rest of Israel, Nahash agrees.  So the men of Jabesh Gilead send out messengers to ask for help, one of which come to Saul and tells him all that is going on, Saul is infuriated and the Spirit of the Lord comes upon him and he calls upon all Israel to come and fight the Ammonites with him, so Saul amasses and army of 330,000 people and the make their way to Jabesh Gilead.  Where Nahash is utterly defeated by the armies of Israel and the people hail Saul as their new king, but thankfully Saul gives all the glory to the Lord who fought for them, so both outward and inward battles were won.",
            "download": "http:\/\/sermonindex.net\/SID10632-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "11"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Samuel 11-16",
            "url": "http:\/\/sermonindex.net\/SID6344",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 11-16",
            "topic": "",
            "description": "Saul was hiding inadmist the people. God told Samuel the prophet where to find him so that he could be anointed King of Israel. Samuel is stepping down and is basically be dealing with Saul and other figures but not with the people. Samuel told the people that the Lord treated them right and that God was faithful to Israel through Egypt and coming into the promised land. They were delivered from the hands of their enemies. God was fair and just and so God gives this plea of His faithfulness to the people but they still wanting in their hearts to have a king. And by choosing this they are rejecting God as king and are wanting a human king like all the nations. But still God gives them mercy saying if you have a king you still will have to keep the commandments of God and He will show mercy. So therefore God gave Israel another chance through their weakness and the calling is to serve the Lord will all their heart.",
            "download": "http:\/\/sermonindex.net\/SID6344-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "11"
                }
            ]
        }
    ]
}