{
    "name": "1 Samuel 12",
    "book": "1 Samuel",
    "chapter": 12,
    "audio_sermons": [
        {
            "title": "(1 Samuel) A Prophet Speaks to the Nation",
            "url": "http:\/\/sermonindex.net\/SID10633",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 12:1-12",
            "topic": "",
            "description": "Samuel, the man of God, comes before the people to publically pass the torch on to Saul as the new ruler of the people of Israel.  He stands before the people and asks them to declare if he has ever wronged them or defrauded them or let them down in any way, which is a challenging thing for a leader to do before their people.  The people respond and say that Samuel has not wronged them at any time.  By this public challenge Samuel confirmed that he was passing on a good legacy to Saul and that if the nation went downhill from their it was not Samuels fault.  He declares to them all the righteous acts that the Lord has done to them how He brought them out of Egypt, raised up judges to rule over them and taught them discipline through affliction.  He recalls the events that effected the nation of Israel right up to the battle with Nahash in the previous chapter and shows the people the big picture of how the Lord has been faithful to them.",
            "download": "http:\/\/sermonindex.net\/SID10633-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "(1 Samuel) Great Things God Has Done for Us",
            "url": "http:\/\/sermonindex.net\/SID10634",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 12:13-25",
            "topic": "",
            "description": "Samuel addresses the people and shows them how that wanting a king beofre the Lord's time was a sin and a wrond thing to do, but he reassures them that the Lord is rich in mercy and that if they will turn to the Lord and worship and serve Him from that day on that the Lord will bless them.  This is like us in our christian walk how it does not matter what wrong we have done or sin we have committed that if we will turn to the Lord and worship Him now He will send blessing.  The people of Israel had a head knwoledge of God but no heart knwoledge they knew all about the Lord but did not know Him.  Despite the behavior of the people in the past Samuel promises to continue to interceed for the people and instruct them in the way of the Lord and encourages them to serve Him because of all the good He has done to them.",
            "download": "http:\/\/sermonindex.net\/SID10634-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "12"
                }
            ]
        },
        {
            "title": "Breaking Strongholds-When the Past is Your Teacher",
            "url": "http:\/\/sermonindex.net\/SID3192",
            "size": "9043968",
            "format": "mp3",
            "scripture": "1 Samuel 7-8,1 Samuel 12-13,Psalm 63:1-4",
            "topic": "",
            "description": "This is a message about the strongholds of fear and unbelief and the disastrous consequences it had on Israel, and Saul.  Even though the Lord gave them victories, they were not loyal, they rejected his rulership in favor of man's.  God warned them of the consequences. They wanted to have a man to fight their battles, someone they could see, like the world around them had, to go before them, rather than the undefeatable, Almighty God fighting for them. They didn't want to forsake their own ideals and let God be Lord of their life. Saul was representative of this rebellion and illustrates the danger of this kind of stronghold.",
            "download": "http:\/\/sermonindex.net\/SID3192-download",
            "preacher_name": "Teresa Conlon",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "12"
                },
                {
                    "book": "Psalms",
                    "chapter": "63"
                }
            ]
        }
    ]
}