{
    "name": "1 Samuel 13",
    "book": "1 Samuel",
    "chapter": 13,
    "sermons": [
        {
            "title": "(1 Samuel) Various Passages - Three Lives, Three Choices",
            "url": "https:\/\/sermonindex.info\/SID10664",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 3:18, 1 Samuel 13:11-12, 1 Samuel 16:12",
            "topic": "",
            "description": "Samuel, Saul and David, three of the most memorable people to appear in the scriptures made choices early on in their lives that would influence their entire lives from then on. As a child Samuel served in the house of the Lord at Shiloh under Eli the High priest, Eli had chosen not to rebuke his sons for their wickedness and for this the Lord held him responsible, one night the Lord told Samuel, still a child, to tell Eli that he would take the priesthood from Eli.  Eli asked Samuel what the Lord had said and Samuel told him everything.  He chose to obey the Lord over popularity.  Saul was anointed king over Israel but in a moment of panic offered a sacrifice to the Lord which was forbidden to do, when Samuel, now the prophet of God, challenged him Saul chose to make excuses for his actions instead of repenting.  David was a man after God's own heart and chose to love the Lord when he was alone with the sheep in the fields where there were none to see him, David still a boy became and man of God and most likely in this time wrote Psalm 23.",
            "download": "https:\/\/sermonindex.info\/SID10664-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "13"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "(1 Samuel) When God Rejects a Leader",
            "url": "https:\/\/sermonindex.info\/SID10635",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 13:1-14",
            "topic": "",
            "description": "Here we are introduced to one of the great men in this book of 1 Samuel, Jonathan who was a remarkable military leader and also son of Saul the king.  Jonathan leads an army against the local philistine garrison and wins a resounding victory, even though Saul his father took the credit for it, but the philistines didn't like this at all and decided to amass an army to put down this 'rebellion' in the people of Israel who they oppessed.  the people of Israel were fearful before going into battle and realised they need the Lord to fight for them, so Saul calls for Samuel to offer a sacrifice and bless them before the battle.  After a few days of Samuel not coming to offer the sacrifice Saul decides to off the sacrifice himself, which was a major sin as he was a king not a priest, and just after the sacrifice is offered Samuel comes over the hill to find to his horror Saul has not waited for him, and thus not waited for the Lord's timing.  Samuel offers Saul an opportunity to repent but instead he makes excuses, so Samuel tells him that the Lord has rejected him as king and has found a man after His own heart to rule the people.",
            "download": "https:\/\/sermonindex.info\/SID10635-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "God's Pursuit Of Man",
            "url": "https:\/\/sermonindex.info\/SID19753",
            "size": "0",
            "format": "",
            "scripture": "1 Samuel 13:14, Genesis 2:7, John 3:16",
            "topic": "Relationship",
            "description": "We are familiar with A.W. Tozer's book on \"The Pursuit of God.\" In this message Brother Denny points to the ways God pursues us. A great message of the heart of God towards His own creation.",
            "download": "https:\/\/sermonindex.info\/SID19753-download",
            "preacher_name": "Denny Kenaston",
            "preacher_image": "\/images\/denny_kenaston.gif",
            "preacher_description": "Denny Kenaston (1949 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Denny Kenaston in mp3 format. Denny were saved in 1972 out of the “Hippy culture.” The Lord Jesus delivered them from drugs, drinking, and many other things that go along with that life style. They felt the Lord call them to help establish Charity Christian Fellowship in Lancaster county.\r\nBro Denny served as an elder in his church for many years. He also traveled extensively in a church planting, and preaching ministry. God has placed an anointing upon him to call the church back to a burden for the family. Tens of thousands of tape set have been sent out all over the world in the last twelve years. Many families have fallen on their faces in repentance, and received a new vision for a Godly Home.",
            "_scripture": [
                {
                    "book": "John",
                    "chapter": "3"
                },
                {
                    "book": "Genesis",
                    "chapter": "2"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "13"
                }
            ]
        },
        {
            "title": "Keys to Mental Health",
            "url": "https:\/\/sermonindex.info\/SID4306",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 16:14-15, 1 Samuel 13:11-14",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4306-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "16"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "13"
                }
            ]
        }
    ]
}