{
    "name": "1 Samuel 14",
    "book": "1 Samuel",
    "chapter": 14,
    "sermons": [
        {
            "title": "(1 Samuel) A Foolish Oath and Consequences",
            "url": "http:\/\/api.sermonindex.net\/SID10637",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 14:24-52",
            "topic": "",
            "description": "It was critical that Israel pursued thye retreating Philistines after what the Lord had done but king Saul placed the people under a forced forced fast in order that he would appear spiritual before them, thus he did it for his own glory and not the glory of God.  This day the Israelite army needed their physical strength to totally wipe out the oppresive Philistines but they had none due to Sauls fast.  Jonathan however had not taken the oath to fast because he had been off fighting the Philistines with his armour bearer, so he came back and ate some honey, which was when he was challenged by one of the people, and when he heard this he said how wrong his father had been and told of how if it wasn't for his fathers fast they would have defeated the Philistines in a mighty way.  Saul had sinned greatly against the Lord in this and thus when he went to enquire of the Lord what he should do the Lord would not answer him.",
            "download": "http:\/\/api.sermonindex.net\/SID10637-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "A Time To Do Nothng But Trust",
            "url": "http:\/\/api.sermonindex.net\/SID3593",
            "size": "21161472",
            "format": "mp3",
            "scripture": "1 Samuel 14",
            "topic": "Trust",
            "description": "This sermon is best described by the title alone.  It is a faith building sermon that is a must hear for all.  Wilkerson preaches out of 1 Samuel and the story of King Saul.  There is a time when we are left with nothing to do but either trust or be disobedient.",
            "download": "http:\/\/api.sermonindex.net\/SID3593-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Taking the Stronghold",
            "url": "http:\/\/api.sermonindex.net\/SID4291",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 14:13-17",
            "topic": "Spiritual Warfare",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID4291-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        }
    ]
}