{
    "name": "1 Samuel 14",
    "book": "1 Samuel",
    "chapter": 14,
    "audio_sermons": [
        {
            "title": "(1 Samuel) A Foolish Oath and Consequences",
            "url": "http:\/\/sermonindex.net\/SID10637",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 14:24-52",
            "topic": "",
            "description": "It was critical that Israel pursued thye retreating Philistines after what the Lord had done but king Saul placed the people under a forced forced fast in order that he would appear spiritual before them, thus he did it for his own glory and not the glory of God.  This day the Israelite army needed their physical strength to totally wipe out the oppresive Philistines but they had none due to Sauls fast.  Jonathan however had not taken the oath to fast because he had been off fighting the Philistines with his armour bearer, so he came back and ate some honey, which was when he was challenged by one of the people, and when he heard this he said how wrong his father had been and told of how if it wasn't for his fathers fast they would have defeated the Philistines in a mighty way.  Saul had sinned greatly against the Lord in this and thus when he went to enquire of the Lord what he should do the Lord would not answer him.",
            "download": "http:\/\/sermonindex.net\/SID10637-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "A Time To Do Nothng But Trust",
            "url": "http:\/\/sermonindex.net\/SID3593",
            "size": "21161472",
            "format": "mp3",
            "scripture": "1 Samuel 14",
            "topic": "Trust",
            "description": "This sermon is best described by the title alone.  It is a faith building sermon that is a must hear for all.  Wilkerson preaches out of 1 Samuel and the story of King Saul.  There is a time when we are left with nothing to do but either trust or be disobedient.",
            "download": "http:\/\/sermonindex.net\/SID3593-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        },
        {
            "title": "Taking the Stronghold",
            "url": "http:\/\/sermonindex.net\/SID4291",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 14:13-17",
            "topic": "Spiritual Warfare",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4291-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "14"
                }
            ]
        }
    ]
}