{
    "name": "1 Samuel 15",
    "book": "1 Samuel",
    "chapter": 15,
    "sermons": [
        {
            "title": "(1 Samuel) How to Be Rejected by God",
            "url": "http:\/\/api.sermonindex.net\/SID10639",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:17-35",
            "topic": "",
            "description": "Samuel rebukes Saul for his and his pride, but Saul argues that he has indeed followed the Word of God, but this is because he was self deceived and goes even furhter as to blame the people for bringing back the animals for sacrifice.  If these animals would have been sacrificed to the Lord as Saul desired it would have been a sacrifice of disobedience and the Lord would not have accepted it anyway, as to obey is better than sacrifice.  The Lord could see Saul's heart in all this and saw how rebellious and stubborn he was for this the Lord had to reject Saul from being king over Israel, but even through all this Saul did not repent but begged for Samuel to honor him before the people, Samuel turned and worshipped the Lord as he knew that the Lord would deal with Saul and he no longer had anything to say to Saul.  Agag king of the Amalekites was then brought before Samuel, but Samuel hacked him to pieces before the Lord and was unmerciful towards him as the Lord had commanded.",
            "download": "http:\/\/api.sermonindex.net\/SID10639-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "(1 Samuel) What God Regrets",
            "url": "http:\/\/api.sermonindex.net\/SID10638",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:1-16",
            "topic": "",
            "description": "Samuel comes to Saul and gives him a message from the Lord, the command was simple, 'Go and wipe out all the Amalekites, every single one of the including all their livestock'  this was due to what they had done in the past in that as the children of Israel were on their way into the promised land from egypt, Amalek had come up behind them and started to attack the very weakest of them.  This was over 400 years ago but shows us that time does not erase sin beofre the Lord and He had given the Amalekites all this time to repent but they didn't so the Lord pronounced judgement on them.  So Saul went and attacked the Amalekites and killed some of them but kept Agag, their king alive, and also some of their best livestock.  This grieved the Lord and Samuel and when Saul told Samuel what he had done Samuel rebuked him fopr his pride as it had led to self deception.  Saul tried to blame everyone else and that he was being actually being spiritual but Samuel gave him a word from the Lord...",
            "download": "http:\/\/api.sermonindex.net\/SID10638-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "1 Samuel 15",
            "url": "http:\/\/api.sermonindex.net\/SID7866",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7866-download",
            "speaker_name": "Robert F. Adcock",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "1 Samuel 15 vs. 10 ",
            "url": "http:\/\/api.sermonindex.net\/SID20815",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:10 ",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID20815-download",
            "speaker_name": "Leonard Ravenhill",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Sermon Proof Christians",
            "url": "http:\/\/api.sermonindex.net\/SID15403",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15, Ezekiel 33:30-32",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID15403-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "Stubbornness",
            "url": "http:\/\/api.sermonindex.net\/SID15704",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 16:26-28, Psalms 32:9, 1 Samuel 15:23",
            "topic": "Stubbornness",
            "description": "May 27, 2007 - A stubborn person is a person who is fixed in purpose or condition, resistant to change and unreasonably obstinate. A stubborn person has an inner flaw and this inner flaw doesn't show until they are called to put all they are in the hands of God and walk in obedience. A stubborn person can appear humble, zealous and even excercise spiritual gifts, but there comes a certain point they can't get passed. They can't lay down their inner thoughts of the way things should be done and surrender to God's ways. God will allow a sense of emptiness come into our souls to get our attention. He is looking for a sincere heart to submit to the authority of His Word. When we choose to obey Him the power of sin and decay is cancelled in our lives. The only way out of stubbornness is to HUMBLE ourselves before God.",
            "download": "http:\/\/api.sermonindex.net\/SID15704-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Exodus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Danger of Substitutes",
            "url": "http:\/\/api.sermonindex.net\/SID13542",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:13-31",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID13542-download",
            "speaker_name": "Warren Wiersbe",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Great Insurrection",
            "url": "http:\/\/api.sermonindex.net\/SID24682",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15",
            "topic": "Apostasy",
            "description": "God's Kingdom was a place of perfect peace until Lucifer established his will as an alternative to God's. That same lawless spirit will one day possess the Antichrist and is already at work within the Church. Apostate Christians are willing to obey God so long as it doesn't interfere with what they want. There are four lies they tell themselves to justify their rebellion to God's authority.",
            "download": "http:\/\/api.sermonindex.net\/SID24682-download",
            "speaker_name": "Steve Gallagher",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Greatest Sin In The Church",
            "url": "http:\/\/api.sermonindex.net\/SID13370",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22",
            "topic": "Obedience",
            "description": "Stephen Olford shares a powerful message on the need for obedience to the voice of the Lord. Apart from sacrifice, christian ministry, busyness the Lord desires us to deal with God about sin. There is a deception that can easily take us over and we can be blind to our condition. The greatest sin is partial obedience.",
            "download": "http:\/\/api.sermonindex.net\/SID13370-download",
            "speaker_name": "Stephen Olford",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Greatest Sin In The Church by Stephen Olford",
            "url": "http:\/\/api.sermonindex.net\/SID20549",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22",
            "topic": "Classics Podcast",
            "description": "Stephen Olford shares a powerful message on the need for obedience to the voice of the Lord. Apart from sacrifice, christian ministry, busyness the Lord desires us to deal with God about sin. There is a deception that can easily take us over and we can be blind to our condition. The greatest sin is partial obedience.",
            "download": "http:\/\/api.sermonindex.net\/SID20549-download",
            "speaker_name": "SermonIndex.net Classics Podcast",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "True repentance",
            "url": "http:\/\/api.sermonindex.net\/SID14333",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:24",
            "topic": "",
            "description": "God had sent Samuel to Saul to tell him to go and utterly destroy the Amalekites. When the children of Israel came out of Egypt the Amalekites resisted them and fought against them, and they never put it right. When Saul returned from the victory over the Amalekites, he met Samuel and told him that he had performed the commandment of the Lord. He was blind to his own disobedience. Saul killed off the worthless lifestock and that which was despised, but the good and precious he held back. He also let Agag, the most evil of all the Amalekites live. He dealt friendly with him and made friends with God's enemies. But when Samuel saw the brazenness of Agag, he took the sword himself and hewed him in pieces before God. Samuel showed Saul his folly of befriending evil men.",
            "download": "http:\/\/api.sermonindex.net\/SID14333-download",
            "speaker_name": "Erlo Stegen",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "When Obedience Makes You Dance",
            "url": "http:\/\/api.sermonindex.net\/SID20369",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22-23",
            "topic": "Obedience",
            "description": "May 16, 2010 - \"Obey God,\" the words of Evan Roberts that started the Welsh Revival. What would be the outcome if we would simply choose to obey God? At some point we have to realize that the same God who created the universe lives inside of us and will enable us to accomplish all that He's called us to do. There comes a time when God doesn't have to speak anymore because you already know what He wants you to do. God says put away the old man and put away the old nature. He is seeking for a man after His own heart who would simply walk in obedience with Him. Are you embracing something that God has clearly told you to put away? The word of the Lord to you today is obey God! Obedience is the beginning of the journey of dancing.",
            "download": "http:\/\/api.sermonindex.net\/SID20369-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Witchcraft In The Church",
            "url": "http:\/\/api.sermonindex.net\/SID3075",
            "size": "10567680",
            "format": "mp3",
            "scripture": "1 Samuel 15:22-23",
            "topic": "",
            "description": "This is not a message on actual witches pulling their hoodoo voodoo on the church but is a message that should bring conviction on a large part of the church population today.  If you hate godly conviction and enjoy your lukewarm or cold state then pass this message by.",
            "download": "http:\/\/api.sermonindex.net\/SID3075-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        }
    ]
}