{
    "name": "1 Samuel 15",
    "book": "1 Samuel",
    "chapter": 15,
    "sermons": [
        {
            "title": "(1 Samuel) How to Be Rejected by God",
            "url": "http:\/\/sermonindex.net\/SID10639",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:17-35",
            "topic": "",
            "description": "Samuel rebukes Saul for his and his pride, but Saul argues that he has indeed followed the Word of God, but this is because he was self deceived and goes even furhter as to blame the people for bringing back the animals for sacrifice.  If these animals would have been sacrificed to the Lord as Saul desired it would have been a sacrifice of disobedience and the Lord would not have accepted it anyway, as to obey is better than sacrifice.  The Lord could see Saul's heart in all this and saw how rebellious and stubborn he was for this the Lord had to reject Saul from being king over Israel, but even through all this Saul did not repent but begged for Samuel to honor him before the people, Samuel turned and worshipped the Lord as he knew that the Lord would deal with Saul and he no longer had anything to say to Saul.  Agag king of the Amalekites was then brought before Samuel, but Samuel hacked him to pieces before the Lord and was unmerciful towards him as the Lord had commanded.",
            "download": "http:\/\/sermonindex.net\/SID10639-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "(1 Samuel) What God Regrets",
            "url": "http:\/\/sermonindex.net\/SID10638",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:1-16",
            "topic": "",
            "description": "Samuel comes to Saul and gives him a message from the Lord, the command was simple, 'Go and wipe out all the Amalekites, every single one of the including all their livestock'  this was due to what they had done in the past in that as the children of Israel were on their way into the promised land from egypt, Amalek had come up behind them and started to attack the very weakest of them.  This was over 400 years ago but shows us that time does not erase sin beofre the Lord and He had given the Amalekites all this time to repent but they didn't so the Lord pronounced judgement on them.  So Saul went and attacked the Amalekites and killed some of them but kept Agag, their king alive, and also some of their best livestock.  This grieved the Lord and Samuel and when Saul told Samuel what he had done Samuel rebuked him fopr his pride as it had led to self deception.  Saul tried to blame everyone else and that he was being actually being spiritual but Samuel gave him a word from the Lord...",
            "download": "http:\/\/sermonindex.net\/SID10638-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "1 Samuel 15",
            "url": "http:\/\/sermonindex.net\/SID7866",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID7866-download",
            "preacher_name": "Robert F. Adcock",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "1 Samuel 15 vs. 10 ",
            "url": "http:\/\/sermonindex.net\/SID20815",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:10 ",
            "topic": "Christian Life",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID20815-download",
            "preacher_name": "Leonard Ravenhill",
            "preacher_image": "\/images\/leonard_ravenhill.gif",
            "preacher_description": "Leonard Ravenhill (1907 Â– 1994)\r\nListen to freely downloadable audio sermons by the speaker Leonard Ravenhill in mp3 format. A revivalist and man of God who sought God's will above all else. He was a man of prayer who practiced what he preached. He wrote the book: 'Why Revival Tarries' which has become a classic on revival. His prophetic edge and burden made him to be respected by some and disliked by others. Yet he stayed true to God's call on his life prayed and pleading for true heaven sent revival. \r\n\r\n\"Those who know of Leonard Ravenhill recognize in him the religious specialist, the man sent from God to battle the priests of Baal on their own mountain top, to shame the careless priest at the altar, to face the false prophet, and to warn the people who are being led astray by him. \" - Tozer | \"Leonard Ravenhill was one of the few men I have ever known who was a true prophet.\" - David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Sermon Proof Christians",
            "url": "http:\/\/sermonindex.net\/SID15403",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15, Ezekiel 33:30-32",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID15403-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                },
                {
                    "book": "Ezekiel",
                    "chapter": "33"
                }
            ]
        },
        {
            "title": "Stubbornness",
            "url": "http:\/\/sermonindex.net\/SID15704",
            "size": "0",
            "format": "mp3",
            "scripture": "Exodus 16:26-28, Psalms 32:9, 1 Samuel 15:23",
            "topic": "Stubbornness",
            "description": "May 27, 2007 - A stubborn person is a person who is fixed in purpose or condition, resistant to change and unreasonably obstinate. A stubborn person has an inner flaw and this inner flaw doesn't show until they are called to put all they are in the hands of God and walk in obedience. A stubborn person can appear humble, zealous and even excercise spiritual gifts, but there comes a certain point they can't get passed. They can't lay down their inner thoughts of the way things should be done and surrender to God's ways. God will allow a sense of emptiness come into our souls to get our attention. He is looking for a sincere heart to submit to the authority of His Word. When we choose to obey Him the power of sin and decay is cancelled in our lives. The only way out of stubbornness is to HUMBLE ourselves before God.",
            "download": "http:\/\/sermonindex.net\/SID15704-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                },
                {
                    "book": "Psalms",
                    "chapter": "32"
                },
                {
                    "book": "Exodus",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "The Danger of Substitutes",
            "url": "http:\/\/sermonindex.net\/SID13542",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:13-31",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID13542-download",
            "preacher_name": "Warren Wiersbe",
            "preacher_image": "\/images\/warren_wiersbe.gif",
            "preacher_description": "Warren Wiersbe (1929 - Present)\r\nListen to freely downloadable audio sermons by the speaker Warren Wiersbe in mp3 format. Warren W. Wiersbe is best known as a Bible teacher, author, and conference speaker. He has ministered in churches and conferences in Canada, Central and South America, Europe, and the United States. He has published more than 150 books and was awarded the Gold Medallion Lifetime Achievement Award by the Evangelical Christian Publishers Association.\r\n\r\n   He is known as a \"pastors' pastor,\" and his speaking,writing and radio ministries have brought new understanding of the truths of God's Word to people around the world. Wiersbe is perhaps best known for his series of 50 books in the \"BE\" series: Be Real, Be Rich, Be Obedient, Be Mature, Be Joyful, etc. and other theological works.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Great Insurrection",
            "url": "http:\/\/sermonindex.net\/SID24682",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15",
            "topic": "Apostasy",
            "description": "God's Kingdom was a place of perfect peace until Lucifer established his will as an alternative to God's. That same lawless spirit will one day possess the Antichrist and is already at work within the Church. Apostate Christians are willing to obey God so long as it doesn't interfere with what they want. There are four lies they tell themselves to justify their rebellion to God's authority.",
            "download": "http:\/\/sermonindex.net\/SID24682-download",
            "preacher_name": "Steve Gallagher",
            "preacher_image": "",
            "preacher_description": "Steve Gallagher ( - )\r\nListen to freely downloadable audio sermons by the speaker Steve Gallagher in mp3 format. Steve Gallagher holds an Associates of Arts degree from Sacramento City College and a Master’s Degree in Pastoral Ministry from Master’s International School of Divinity. He is also a certified Biblical Counselor through the International Association of Biblical Counselors (IABC) in Denver, CO. He is the founder of Pure Life Ministries.\r\nHe has also authored 14 books, including the best-selling At the Altar of Sexual Idolatry, Intoxicated with Babylon, Standing Firm Through the Great Apostasy, and his latest work, The Time of Our Lives in Light of Eternity. The new mission God has called Steve Gallagher to became the Eternal Weight of Glory website which exposes the great apostasy, calls people to repentance and leads Christians into an eternal perspective.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Greatest Sin In The Church",
            "url": "http:\/\/sermonindex.net\/SID13370",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22",
            "topic": "Obedience",
            "description": "Stephen Olford shares a powerful message on the need for obedience to the voice of the Lord. Apart from sacrifice, christian ministry, busyness the Lord desires us to deal with God about sin. There is a deception that can easily take us over and we can be blind to our condition. The greatest sin is partial obedience.",
            "download": "http:\/\/sermonindex.net\/SID13370-download",
            "preacher_name": "Stephen Olford",
            "preacher_image": "",
            "preacher_description": "Stephen Olford (1918 - 2004)\r\nListen to freely downloadable audio sermons by the speaker Stephen Olford in mp3 format. Was a 20th-century Christian leader. Dr. Billy Graham called him \"the man who most influenced my ministry.\" He was a personal confidant of Graham. Olford was also a role model and friend to prominent pastors such as Charles Stanley and Adrian Rogers. He was a pioneer in Christian television programming with his show, Encounter, in New York. His Sunday morning sermons were also broadcast around the world on radio.[1] He was the Founder and Chairman of the Board of Olford Ministries International in Memphis, Tennessee which became The Stephen Olford Center at Union University. His authorized biography, Only One Life, was written by John Philipps.\r\nIn 1953, Dr. Stephen F. Olford's years of pastoral ministry began by serving the Duke Street Baptist Church in Richmond, Surrey England (1953–1959) and then the Calvary Baptist Church in New York City (1959–1973).[1] Olford systematized his method of expository preaching and formed a curriculum used to train preachers at the Olford Institute for Biblical Preaching in Memphis, Tennessee. Pastors and scholars migrated to the institute for inspiration and instruction that often resulted in upgraded pulpit ministries.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "The Greatest Sin In The Church by Stephen Olford",
            "url": "http:\/\/sermonindex.net\/SID20549",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22",
            "topic": "Classics Podcast",
            "description": "Stephen Olford shares a powerful message on the need for obedience to the voice of the Lord. Apart from sacrifice, christian ministry, busyness the Lord desires us to deal with God about sin. There is a deception that can easily take us over and we can be blind to our condition. The greatest sin is partial obedience.",
            "download": "http:\/\/sermonindex.net\/SID20549-download",
            "preacher_name": "SermonIndex.net Classics Podcast",
            "preacher_image": "",
            "preacher_description": "SermonIndex.net Classics Podcast ( - )\r\nListen to freely downloadable audio sermons by SermonIndex.net Classics Podcast in mp3 format.  The work and ministry of SermonIndex can be encapsulated in this one word: Revival. Concepts such as Holiness, Purity, Christ-Likeness, Self-Denial and Discipleship are hardly the goal of much modern preaching. Thus the main thrust of the speakers and articles on the website encourage us towards a reviving of these missing elements of Christianity\r\nYou can subscribe to this free Christian podcast via iTunes Subscribe or RSS Feed. Download over 100 of the best classical sermons by many speakers from the past and present. This is a great starting place to benefit from the archive of SermonIndex.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "True repentance",
            "url": "http:\/\/sermonindex.net\/SID14333",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:24",
            "topic": "",
            "description": "God had sent Samuel to Saul to tell him to go and utterly destroy the Amalekites. When the children of Israel came out of Egypt the Amalekites resisted them and fought against them, and they never put it right. When Saul returned from the victory over the Amalekites, he met Samuel and told him that he had performed the commandment of the Lord. He was blind to his own disobedience. Saul killed off the worthless lifestock and that which was despised, but the good and precious he held back. He also let Agag, the most evil of all the Amalekites live. He dealt friendly with him and made friends with God's enemies. But when Samuel saw the brazenness of Agag, he took the sword himself and hewed him in pieces before God. Samuel showed Saul his folly of befriending evil men.",
            "download": "http:\/\/sermonindex.net\/SID14333-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "When Obedience Makes You Dance",
            "url": "http:\/\/sermonindex.net\/SID20369",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 15:22-23",
            "topic": "Obedience",
            "description": "May 16, 2010 - \"Obey God,\" the words of Evan Roberts that started the Welsh Revival. What would be the outcome if we would simply choose to obey God? At some point we have to realize that the same God who created the universe lives inside of us and will enable us to accomplish all that He's called us to do. There comes a time when God doesn't have to speak anymore because you already know what He wants you to do. God says put away the old man and put away the old nature. He is seeking for a man after His own heart who would simply walk in obedience with Him. Are you embracing something that God has clearly told you to put away? The word of the Lord to you today is obey God! Obedience is the beginning of the journey of dancing.",
            "download": "http:\/\/sermonindex.net\/SID20369-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        },
        {
            "title": "Witchcraft In The Church",
            "url": "http:\/\/sermonindex.net\/SID3075",
            "size": "10567680",
            "format": "mp3",
            "scripture": "1 Samuel 15:22-23",
            "topic": "",
            "description": "This is not a message on actual witches pulling their hoodoo voodoo on the church but is a message that should bring conviction on a large part of the church population today.  If you hate godly conviction and enjoy your lukewarm or cold state then pass this message by.",
            "download": "http:\/\/sermonindex.net\/SID3075-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "15"
                }
            ]
        }
    ]
}