{
    "name": "1 Samuel 17",
    "book": "1 Samuel",
    "chapter": 17,
    "sermons": [
        {
            "title": "(1 Samuel) How to Kill a Giant",
            "url": "https:\/\/sermonindex.info\/SID10643",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17:31-58",
            "topic": "",
            "description": "David is brought before Saul because of his willingness to challenge Goliath, but Saul see the battle from an earthly perspective, and purely in the flesh, he thought there was no way that David could win, but David knew that the Lord was with him and that there was no way he could lose!  So David told Saul how the Lord had delivered a lion and a bear into his hand and that he had killed them when they came to attack the sheep he looked after, this was the Lord training David to fight Goliath.  Saul tried to put his fleshly armour on David but it didn't and David renounced it for his trust was in the armour of God.  So David took 5 stones from the brook and drew near to Goliath to challenge him, Goliath mocked him but David filled with the Spirit charged at Goliath hurled a stone at him and killed him in one hit, then David took Goliaths sword and cut off his head.  The Philistines were shocked and fled but the army of Israel chased after them led by David.",
            "download": "https:\/\/sermonindex.info\/SID10643-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "(1 Samuel) Where the Battle Is Won",
            "url": "https:\/\/sermonindex.info\/SID10642",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17:1-30",
            "topic": "",
            "description": "This is the account of Davids fight with Goliath.  Goliath was mountain of a man some say he was aroung 9ft tall, and this is reflected in the size and weight of his armour, he was a man of war from his youth and was in the philistine army army for one reason, to instill fear into their enemies.  On the first day of battle Goliath headed out and stood before the army of Israel and challenged them to send out one man to fight with him, one on one, and this terrified the Israelites and their king Saul, who was the tallest in their army.  Satan today uses the exact same tactics as Goliath did in that he roars at us and makes us afraid when God is on our side and there is no reason to fear what he or man might do to us.  David arrives at the battle to bring supplies to his brothers who were in the army at the time and hears Goliath's challenge, but David instead of seeing Goliaths size and armour saw an uncircumsized idolater who was defying the living God, David knew this was a cause worth fighting for so he accepted Goliaths challenge.",
            "download": "https:\/\/sermonindex.info\/SID10642-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Samuel 17-25",
            "url": "https:\/\/sermonindex.info\/SID6345",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17-25",
            "topic": "",
            "description": "Goliath came out in the battlefield of the philistines being over 9 feet tall. The bible gives a detailed description of his armor and was said to be an awesome sight in the sight of the children of Israel. He comes out every day for 40 days to challenge the children of Israel and nobody goes out to the challenge. David was sent to give some food and get word from his brothers about the army and the battle, then he hears Goliaths challenge and has a godly stirring in his heart against this uncircumcised heathen. Goliath is defying the armies of the living God and David went into Saul to ask permission being only a child. David carries around the head of Goliath for 2 whole days even into the presence of King Saul after the slaughter of the giant. Jonathan and David had a deep bond which they had right away. Saul kept David with the army and would not allow him to leave for awhile. Wherever Saul would go he stayed with him and he was accepted in the sight of the people even though he was so young.",
            "download": "https:\/\/sermonindex.info\/SID6345-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "78. What is forbidden in the ninth commandment?",
            "url": "https:\/\/sermonindex.info\/SID22432",
            "size": "0",
            "format": "mp3",
            "scripture": "Proverbs 19:5, 1 Samuel 17:28",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22432-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "Proverbs",
                    "chapter": "19"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "How Satan Destroys a Church - Part 7 (WHO'S THE KING OF THE JUNGLE?)",
            "url": "https:\/\/sermonindex.info\/SID17298",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17, Ephesians 6:10-13",
            "topic": "Spiritual Warfare",
            "description": "If Satan can draw us to fight with his ways we'll lose the battle.  David fought Goliath with the weapons that God gave him, not with Saul's armor.  Satan will seek to draw us away from loving and obeying God, from prayer, and from our position of faith.  To do so will result in failure.  But we must stand strong in the Lord and believe Christ for the victory.",
            "download": "https:\/\/sermonindex.info\/SID17298-download",
            "preacher_name": "Don Courville",
            "preacher_image": "",
            "preacher_description": "Don Courville ( - )\r\nListen to freely downloadable audio sermons by the speaker Don Courville in mp3 format. Brother Don has been involved in the work of revival for many years. He was involved in the Nebraska revival in the 1980's and had a radio program that aired in the mid-western United States. He has been involved in church plants and works of the Lord where great unity of faith was expressed.\r\nCurrently he is pastoring the Maranatha Baptist Church in Missouri and running a annual Family Camp where Keith Daniel is the keynote speaker. He also arranges Keith Daniels annual tour of the USA. Brother Don has been a moderator for many SermonIndex Revival Conferences across the world and has a great heart for genuine revival in our day.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "The Five Smooth Stones",
            "url": "https:\/\/sermonindex.info\/SID14045",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17:32-52, Ephesians 6:10-18",
            "topic": "Overcoming",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID14045-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "Ephesians",
                    "chapter": "6"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        },
        {
            "title": "The Reformation Spirit - Dead Or Alive?",
            "url": "https:\/\/sermonindex.info\/SID12107",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 17:1-20",
            "topic": "",
            "description": "Do we see a cause today to stand up against  the dark powers ot this world? David saw the cause to stand against goliath.Luther saw the cause to stand against the Roman church.  Do we see the cause to fight?",
            "download": "https:\/\/sermonindex.info\/SID12107-download",
            "preacher_name": "Quek Suan Yew",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "17"
                }
            ]
        }
    ]
}