{
    "name": "1 Samuel 18",
    "book": "1 Samuel",
    "chapter": 18,
    "audio_sermons": [
        {
            "title": "(1 Samuel) Attacked, but Blessed",
            "url": "http:\/\/sermonindex.net\/SID10646",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 18:17-30",
            "topic": "",
            "description": "Saul in trying to bring about Davids death offers his daughters hand in mnarriage knowing that David will not be able to pay the dowery due to coming from a rural family.  David however does not approach Saul to discuss a dowery and so Saul offers his daughter to another man in order that he might make David jelous.  But David keeps a pure heart before the Lord and actually wins a victory by being submissive and humble before the Lord.  David also did not suspect that Saul had ulterior motives in offering his daughter to David. Then Sauls youngest daughter Michal fell in love with David and this pleased Saul as he could again manipulate this situation for David's hurt, so Saul proposes a price for his daughter, 100 Philistine foreskins, knowing that it was highly likely that David would be killed in meeting the price, however the Lord was with David and delivered him 200 Philistine foreskins.  This extra effort is straight out of the teaching of the Lord Jesus who commanded to 'go the second mile' and thus show a humility and a servants heart, which David surely had.",
            "download": "http:\/\/sermonindex.net\/SID10646-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "(1 Samuel) How to Not Fight Back",
            "url": "http:\/\/sermonindex.net\/SID10645",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 18:10-16",
            "topic": "",
            "description": "Saul returns to his palace and the evil spirit comes upon him, so David is sent for to play some soothing music to the king.  David arrives and plays and worships the Lord before Saul, but this time Saul is not pacified and responds with violence and attempts to kill David by throwing a spear at him.  Somehow either by Saul's bad aim or by David's quickness the spear misses him, and David esacpes, this amazingly he does twice, how many of us would have gone back into that environment knowing that the second time it could mean our very lives.  David though even though he was a mighty warrior who could have retaliated and killed Saul, did not fight back but instead escaped knowing that the Lord would avenge him of Saul.  So Saul then made David leader of an elite group of men thinking that David would be killed on the battle field by the Philistines, but David remained wise before the Lord and He kept him, and David, to Sauls great dismay, grew even more popular with the people as the Lord blessed him.",
            "download": "http:\/\/sermonindex.net\/SID10645-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "(1 Samuel) The Battle after the Battle",
            "url": "http:\/\/sermonindex.net\/SID10644",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 18:1-9",
            "topic": "",
            "description": "David comes before Saul after killing Goliath and tells the king all about the batle with Goliath and the Philistines and testifies to the glory of God how the the Lord delivered Israel's enemies into their hands.  It was here that the soul of Jonathan the heir to the throne was knit to the soul of David, youngest son of a sheep farmer, why? becuase of their love of the Lord.  Jonathan takes off all his princely apparel and gives it to David as he knows that David, not himself, is going to be the next king of Israel.  This is a picture of our relationship with the Lord Jesus who, laid aside His glory and dwelt amongst us so that He could array in His robe of righteousness.  This was the high point of David and Sauls relationship, Saul sent David out to fight the Philistines, and David won a resounding victory, becaue the Lord was with him, but the people began to love David more than Saul and this caused Saul to become Jealous and he became suspicious of David from that day on, David on the other hand did not get proud but acted wisely before the Lord.",
            "download": "http:\/\/sermonindex.net\/SID10644-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "(Montana) Daniel",
            "url": "http:\/\/sermonindex.net\/SID11547",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 6, 1 Samuel 18:14-15",
            "topic": "Daniel",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID11547-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                },
                {
                    "book": "Daniel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(Mount Vernon) Daniel",
            "url": "http:\/\/sermonindex.net\/SID8286",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 6, 1 Samuel 18:14-15",
            "topic": "Daniel",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID8286-download",
            "preacher_name": "Keith Daniel",
            "preacher_image": "\/images\/keith_daniel.gif",
            "preacher_description": "Keith Daniel ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Keith Daniel in mp3 format. Keith Daniel of Cape Town, South Africa is an evangelist with the African Evangelistic Band. He travels extensively across South Africa preaching the Word of God, and also lectures at Glenvar Bible College in Cape Town. He has made over twenty tours to North America over the past two decades.\r\n\r\nBrother Keith has a passion to preach God's uncompromising Word to this generation and calls out to pastors and theologians of our day to believe God's truth over man's reason. He has preached in many conventions including SermonIndex.net Conferences in the last 5 years.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                },
                {
                    "book": "Daniel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Learning How to Encourage Yourself in the Lord",
            "url": "http:\/\/sermonindex.net\/SID4150",
            "size": "13041664",
            "format": "mp3",
            "scripture": "1 Samuel 18:7-9",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID4150-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "18"
                }
            ]
        }
    ]
}