{
    "name": "1 Samuel 19",
    "book": "1 Samuel",
    "chapter": 19,
    "audio_sermons": [
        {
            "title": "(1 Samuel) How God Protects",
            "url": "http:\/\/sermonindex.net\/SID10648",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 19:11-24",
            "topic": "",
            "description": "Michal, David's wif ans Sauls dughter, warns David that Saul has sent men to their house to kill him, and that if he doesn't escape he will die.  The men from Saul come to the house and demand of Michal that they bring out David, but Michal tells them that David is sick and in bed.  Just before this David had escaped from his house and Michal had put the household idol in his bed to make it look like David was there.  So the men from Saul look in and think David is sick so they return to Saul, to tell him David is sick, Saul deosn't care and wants him killed anyway.  So the servants head back and discover David has escaped.  David in the meentime has gone to see Samuel, who is overseeing a 'prayer meeting'  David get into the prescence of the Lord and the servants of Saul turn up to kill him, but they get involved in the prayer meeting too and head back to Saul empty handed, so Saul send more men to get David but the same thing happens twice.  So Saul goes himself to kill David and is also overcome by the Holy Spirit, as the Lord shows Saul that He is in control of the whole situation.",
            "download": "http:\/\/sermonindex.net\/SID10648-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "(1 Samuel) Patching Things Up",
            "url": "http:\/\/sermonindex.net\/SID10647",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 19:1-10",
            "topic": "",
            "description": "Saul openly commands all his servants, including his own son Jonathan to kill David.  Jonathan of course goes to David to warn him of his fathers intentions to have David killed, in this Jonathan submitted to the authority of the Lord more than the authority of his own father and king.  The word of God instructs us to obey those in authority but when a command coms that is directly against the will of the Lord we must not obey as this would be sin.  Jonathan defended David before Saul, just as the Lord Jesus defends us when Satan attacks and accuses us, sometimes correctly, but the Lord will not allow Satan to prevail over us so long as we are in His will.  Jonathan gives a good account of David to Saul and Saul repents of the wrong that he wanted to do to David,  Saul voowes that David shall not be kiled, which ironically was true as he wouldn't be killed by Saul.  Then war returned to Israel and the evil spirit came upon Saul again and again he tried to kill David, this time David fled and did not return to the palace.",
            "download": "http:\/\/sermonindex.net\/SID10647-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "19"
                }
            ]
        }
    ]
}