{
    "name": "1 Samuel 2",
    "book": "1 Samuel",
    "chapter": 2,
    "audio_sermons": [
        {
            "title": "(1 Samuel) Blessed Sons and Wicked Sons",
            "url": "http:\/\/sermonindex.net\/SID10621",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 2:1-21",
            "topic": "",
            "description": "Hannah gave Samuel back to the Lord with a song of joy in her heart, she was full of joy even though she had to give up her 3 year old son, she praised God but also explains how we should humble ourselves before God, or He will humble us, the Lord resists the proud but gives grace to the humble and lifts them up and out of their dire situations just as he did with Hannah.  She exalts the King, the Anointed One, the Messiah and was the first person to proclaim the God would be the Messiah a theme that was later shwon through all the prophets but Hannah saw it first.  There isw a shift in this passage though in the form of the corrupt sons of the high priest Eli, who didn't know the Lord and by their actions were causing the people of God to hate offering to God as the people knew that the priesthood was so corrupt.  Samuel however served the Lord as a small child and was dressed in priests clothes that his mother would make for him and bring to Shiloh every year, and the Lord further blessed her with 3 more sons and 2 daughters.",
            "download": "http:\/\/sermonindex.net\/SID10621-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(The Path Of The Ark #2) Enemy",
            "url": "http:\/\/sermonindex.net\/SID15374",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 2-4",
            "topic": "",
            "description": "The capturing of the Ark of God by the Philistines is both a sad event but also good news, for it is the first step towards finding a resting place at Solomon's temple.  The Philistines are that natural part of me (the flesh, the old man) that must be dealt with first.  Having Samuel (the child heart, the resting heart, the listening ear) in our lives does not secure victory over the lordship of the Philistines; it is only the starting point.  (NOTE: the message was cut off at 41 minutes).",
            "download": "http:\/\/sermonindex.net\/SID15374-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "God Is Training A Holy Remnant",
            "url": "http:\/\/sermonindex.net\/SID3079",
            "size": "9563648",
            "format": "mp3",
            "scripture": "1 Samuel 2:27,1 Samuel 3:11-21",
            "topic": "Remnant",
            "description": "In these last days, God is doing a work that will impact the world.  He is training a holy remnant that will be solely dedicated to God and His work during these last days. God is raising up a people who are committed to him and his cause who are a holy remnant, and who are steadfast and sure of their God. Eli was judged soft on sin and allowed wickedness in the tabernacle at Shiloh; even his own sons. Today, the church world is a laughing stock because of wickedness in the house of God, there is no power or spiritual authority, no presence of the Lord in many churches. But there is an unseen remnant of people, who would surprise you, because they are not prominent, or well known, but they are shut in with and hearing a word from God. And the word is prepare, for judgment is coming.",
            "download": "http:\/\/sermonindex.net\/SID3079-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Ichabod: The Glory Departed",
            "url": "http:\/\/sermonindex.net\/SID26099",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4:21, 1 Samuel 2:12-25",
            "topic": "Ichabod",
            "description": "Brother Bakht Singh speaks a message on the glory of God departing. Hophni and Phinehas the 2 sons of Eli were doing wickedly before the presence of God. There comes a point when God's people transgress and God withdraws His presence. This is a warning to us in the New Covenant that we are not to test the Lord and not presume His presence with us without following Him in obedience.",
            "download": "http:\/\/sermonindex.net\/SID26099-download",
            "preacher_name": "Bakht Singh",
            "preacher_image": "\/images\/bakht_singh.gif",
            "preacher_description": "Bakht Singh (1903 - 2000)\r\nListen to freely downloadable audio sermons by the speaker Bakht Singh in mp3 format. He is often regarded as one of the most well-known bible teachers and preachers and pioneers of the Indian Church movements. He was India's foremost evangelist, preacher and indigenous church planter who founded churches based on New Testament principles. He began a worldwide indigenous church-planting movement in India that eventually saw more than 10,000 local churches. Norman Grubb missionary statesman, author and teacher: \"In all my missionary experience I think these churches on their New Testament foundations are the nearest I have seen to a replica of the early church and a pattern for the birth and growth of the young churches in all the countries which we used to talk about as mission fields.\"\r\nLife of prayer. Brother Bakht Singh was a man of prayer. He spent hours upon his knees in communion with the Lord seeking the Lord's mind regarding His will concerning the work and ministry. Therefore, the Lord also honored him and blessed him beyond any human understanding. This is one of the reasons why the Lord has used him so mightily for the edification of His Body and for the extension of His glorious kingdom both in India and abroad.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "There is a Song in Every Barren Womb",
            "url": "http:\/\/sermonindex.net\/SID11732",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 2:27-36",
            "topic": "Barren",
            "description": "April 23, 2006 – God will cause the deepest desires of our to go unmet to create a longing in our heart. He wil keep us from the things we ve asked for until there is a cry from the depths of our spirit that will bring back to God the very thing we are asking Him for. God waits for this cry that comes from the barreness of our souls and He wil come at His appointed time and bring forth fruit that wil cahnge a generation ang bring Him glory.",
            "download": "http:\/\/sermonindex.net\/SID11732-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Two Ministries Two Priesthoods",
            "url": "http:\/\/sermonindex.net\/SID1232",
            "size": "6830080",
            "format": "mp3",
            "scripture": "1 Samuel 2:27-36",
            "topic": "",
            "description": "From the \"Call to Repentance\" conference in Tifton, Ga. in 1986, this message looks at the ministries in the Church today and shows how they compare to two priesthoods in the Old Testament: the Zadok priesthood and the Abiathar (Eli) priesthood. We see that those of Zadok are righteous and concerned with holiness while those of Abiathar are concerned with gain and \"minister to the people's idols.\" The text ranges through the ministries of Zadok and Abiathar in 1 and 2 Samuel and finishes with Ezekiel's vision of faithful Zadokite priests in God's new Temple (the Body of Christ).",
            "download": "http:\/\/sermonindex.net\/SID1232-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Zadok and Abaithar Priesthoods - Part 1",
            "url": "http:\/\/sermonindex.net\/SID1376",
            "size": "12615680",
            "format": "mp3",
            "scripture": "1 Samuel 2:27-35",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1376-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Zadok and Abaithar Priesthoods - Part 2",
            "url": "http:\/\/sermonindex.net\/SID1377",
            "size": "16416768",
            "format": "mp3",
            "scripture": "1 Samuel 2:27-35",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID1377-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        }
    ]
}