{
    "name": "1 Samuel 21",
    "book": "1 Samuel",
    "chapter": 21,
    "sermons": [
        {
            "title": "(1 Samuel) David on the Decline",
            "url": "http:\/\/api.sermonindex.net\/SID10650",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21 1-9, Leviticus 24:5-9",
            "topic": "",
            "description": "David is on the run from king Saul, he is afraid, hasnt eaten or slept properly for days, he is confused and had just had to bid farewell to his closest friend Jonathan, but it was here that the Lord would train David to be a king.  David goes to the tabernacle of God at Nob, to Ahimelech the priest, this was th right thing to for David to do to go to the house of the Lord.  But when he is asked what is going on by Ahimelech David lies to him several times in order to protect himself and maybe also Ahimelech from Saul.  David asks the priest for food, and all that is available is the shew bread which was used in the tabernacle to symbolize how the Lord desires to have fellowship with us.  So Ahimelech gives David the shewbread even though it was usually eaten by the priests, this shows that serving a human need is of greater importance than observing priestly traditions.  Does the Edomite, a servant of Saul was there and witnessed what was happening.  Finally David asks for a weapon from Ahimelech and he gioves him Goliaths sword, which David takes, the Lord was probably reminding David that the last time he held that sword he won a great victory as he was in the will of God and didn't need to resort to the flesh to deliver him.",
            "download": "http:\/\/api.sermonindex.net\/SID10650-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Leviticus",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "(1 Samuel) God Helps the Undeserving",
            "url": "http:\/\/api.sermonindex.net\/SID10651",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21:10 - 22:1, Psalm 56, Psalm 34, Psalm 142",
            "topic": "",
            "description": "David, still on the run from Saul, heads to the Philistines to take refuge, and ends up in Gath the hometown of Goliath!  This was a very strange thing for David to do as he has also killed thousands of Philistines, as well as Goliath.  So David is captured by them and imprisoned.  David knowing he has done wrong does the right thing and cries out to God, this is when he wrote Psalm 56 and it can be seen in this Psalm how David's heart is turned back to the Lord as he cries out for mercy.  He is then brought before Achish the king, David pretends to be mad which must have taken great humility to act that way before his enemies so Achish releases David and on his way from Gath David praises the Lord mightily, Psalm 34.  The Lord showed His love to David even though David did not deserve it, which shows the great love and mercy of God.  David then heads for the cave of Adullam from which you can see the valley where David slew Goliath and David lamented and wrote Palm 142.",
            "download": "http:\/\/api.sermonindex.net\/SID10651-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                },
                {
                    "book": "Psalms",
                    "chapter": "56"
                },
                {
                    "book": "Psalms",
                    "chapter": "34"
                },
                {
                    "book": "Psalms",
                    "chapter": "142"
                }
            ]
        },
        {
            "title": "John Wesley: A Man of One Book",
            "url": "http:\/\/api.sermonindex.net\/SID7119",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 21:9",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID7119-download",
            "speaker_name": "Edward Panosian",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "21"
                }
            ]
        }
    ]
}