{
    "name": "1 Samuel 22",
    "book": "1 Samuel",
    "chapter": 22,
    "sermons": [
        {
            "title": "(1 Samuel) God’s Idea of a Team",
            "url": "http:\/\/sermonindex.net\/SID10652",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 22  Psalm 52, Ruth 4:17",
            "topic": "",
            "description": "David is know in hiding in the cave of Adullam, he's tired and afraid and doesn't know what to do, but he cries out to the Lord and the Lord meets his every need.  Th ifrst thing the Lord did was to give David Himkself, and David was filled with a great sense of the Lord's power and glory.  The second thing the Lord gave to David was the support of his family, who in times past had been harsh towards David.  Then the Lord brough the needy and discouraged to David, and he became their leader, he took care of his parents by taking them to the Moabites, who were David's ancestors.  King saul in the meentime is plotting against David and accusing all his military commanders of being against him, one steps forward, Doeg the Edomite and informs Saul that he saw David being helped by Ahimelech the priest, Sauls is furiuos and goes to Ahuimelech and accueses him of aiding the enemies of the king, Ahimelech had no idea that David was on the run from Saul due to Davids lies, but Saul didn't care and commanded all the priests and their families to be slaughtered, Sauls servants wouldn't do it but Doeg would and massacred a great number of people, when David heard of this he mourned and wrote Psalm 52.",
            "download": "http:\/\/sermonindex.net\/SID10652-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "22"
                },
                {
                    "book": "Ruth",
                    "chapter": "4"
                }
            ]
        }
    ]
}