{
    "name": "1 Samuel 24",
    "book": "1 Samuel",
    "chapter": 24,
    "sermons": [
        {
            "title": "(1 Samuel) How to Overcome Evil with Good",
            "url": "http:\/\/sermonindex.net\/SID10655",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 24",
            "topic": "",
            "description": "Saul, after his battle with Philistines, resumes his pursuit of David.  So David and his men go to hide in the wilderness on Engedi, but the sscouts see Saul coming towards them with 3000 men.  So David and his band hide deep in the back of one of the caves, Saul and his men are about to pass by the cave when they stop and Saul comes into the cave alone.  David's men compel him to kill Saul, so David quietly sneeks up to where Saul is and cuts of a piece of his robe and returns to his men.  Saul leaves the cave and Davids men cannot believe that he didn't kill Saul.  But David because of his tender heart before the Lord goes even further and, walks out of the cave and crys to Saul in great humility.  He declares that he does not want to kill Saul as some people think and as proof shows Saul the piece of the robe he cut off, Saul seeing this repents for wanting to kill David and goes home, but David returns to his stronghold, in case Saul changes his mind again.",
            "download": "http:\/\/sermonindex.net\/SID10655-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "24"
                }
            ]
        },
        {
            "title": "Life of David",
            "url": "http:\/\/sermonindex.net\/SID12244",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 24",
            "topic": "David",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID12244-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "24"
                }
            ]
        }
    ]
}