{
    "name": "1 Samuel 25",
    "book": "1 Samuel",
    "chapter": 25,
    "sermons": [
        {
            "title": "(1 Samuel) How NOT to Respond to an Insult",
            "url": "https:\/\/sermonindex.info\/SID10656",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 25:1-22",
            "topic": "",
            "description": "Samuel the prophet and last judge of Israel dies at the beginning of this chapter and all Israel laments his passing, it is notable that he probably recveived more appreciation when he died than when he was alive.\r\nThere was a man of Carmel whose name was Nabal (which in the hebrew means fool) and he was a rich and very successful sheep farmer, and he had a wifie, Abigail, who was very beautiful and wise and completely different to Nabal.  David and his men had been protecting Nabal and his possessions for some time from bands of marauders and theives, and so when the sheep shearing season started, which was the best and most prosperous time of the year, David requests a gift from Nabal for services rendered, Nabal not only says no but 'no' in the most insulting way possible, and when David hears of this he is enraged and vows to kill Nabal and al his household.  Now when Abigail hears what Nabal has done she collects as much food as she can and heads out to meet David knowing he is intent on massacre.",
            "download": "https:\/\/sermonindex.info\/SID10656-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "(1 Samuel) What Submission Is and Is Not",
            "url": "https:\/\/sermonindex.info\/SID10657",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 25:23-44",
            "topic": "",
            "description": "David is on his way to Nabals house to massacre everone there when, suddenyl a woman leading a large company meets him on his way, she gets off her mount and bows herself down to the ground before him, this is quite a surprise for David as Abigail was a woman of great status and so to see her humbling herself in this way is very odd.  She asks David for mercy and to lay the blame on herself, she reminds David that he is the one who goes out and fights the Lord's battles, this must have pricked Davids heart as he surely knew that what he was intending to do was not in the heart of the Lord, David by the grace of God realises what he is doing and departs praising the Lord for sending Abigail.  Nabal on the other hand is totally unaware of what could have happened and is throwing a party when Abigail returns, the morning after she tells him of the previous days events and he is so shocked that he dies 10 days later.  David sends fo Abigail and takes her and Ahinoam for his wives as Sauls daughter had been given to someone else.",
            "download": "https:\/\/sermonindex.info\/SID10657-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "The Devil's Twins - Fret and Fear",
            "url": "https:\/\/sermonindex.info\/SID4264",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 37:1,1 Samuel 25,Psalm 46:1-11",
            "topic": "",
            "description": "Scripture says in the last days evil men will wax worse and worse, and often the righteous are enflamed with anger when they see and hear of the wickedness perpetrated against the innocent, such as abortion. Bro. Wilkerson illustrates through the life of David in the scriptures how not to react to the wickedness of men when you are angry, in the flesh. We need to learn to stand in the gap in intercession and not fear what is coming on the earth in these last days, because the Lord will keep his own secure.",
            "download": "https:\/\/sermonindex.info\/SID4264-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "37"
                },
                {
                    "book": "Psalms",
                    "chapter": "46"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "The Restraining Power of the Holy Ghost",
            "url": "https:\/\/sermonindex.info\/SID4270",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 25",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4270-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        },
        {
            "title": "Unusual Thanks",
            "url": "https:\/\/sermonindex.info\/SID27545",
            "size": "0",
            "format": "",
            "scripture": "1 Samuel 25:27-35",
            "topic": "Thanksgiving",
            "description": "In addition to being thankful for God's many blessings, we need to thank God for protection, grace and mercy as well as Jesus' death on the cross for our sins. 1 Sam 25:27-35; Matt 26:26-28 (GNB)",
            "download": "https:\/\/sermonindex.info\/SID27545-download",
            "preacher_name": "Jim Cymbala",
            "preacher_image": "\/images\/jim_cymbala.gif",
            "preacher_description": "Jim Cymbala (1949 - Present)\r\nListen to freely downloadable audio sermons by the speaker Jim Cymbala in mp3 format. Brother Jim Cymbala was called into ministry without formal training in Brooklyn, New York to pastor a small gathering. God showed him the great need of prayer and depending on the work of the Holy Spirit in the ministry. God blessed and grew the brooklyn tabernacle to a large church of thousands because of this reliance.\r\n\r\nThe burden of his ministry is to show the vital need for prayer, deependence on God and that God uses the weak and lowly to build His kingdom. He has written many books including the best-selling: \"Fresh Wind, Fresh Fire\" and his newer book \"Spirit Rising\" speaking of the neglected work of the Holy Spirit in our churches these days.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "25"
                }
            ]
        }
    ]
}