{
    "name": "1 Samuel 26",
    "book": "1 Samuel",
    "chapter": 26,
    "sermons": [
        {
            "title": "(1 Samuel) Measure for Measure",
            "url": "http:\/\/api.sermonindex.net\/SID10658",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 26",
            "topic": "",
            "description": "Saul again is in pursuit of David even though the last time they met he swore to cease from his quest for Davids life.  The army  come to halt to rest for the night and David sends out scouts to find where they are, when he knows David personally goes into the very midst of the sleeping camp right to where Saul is asleep next to Abner his personal bodyguard and captain of Israels armies.  Abishai who is with David in the midst of the camp requests that David give him permission to plunge Saul's own spear, which is stuck in the ground near his head, through his heart, Abishai says he only needs one chance and he will kill Saul there and then.  But David still shows great mercy to Saul, in that he wont allow Abishai to do it, so they take the spar and the jug that is near Saul and leave the camp.  David then when he is a long way away cries to Abner, and accuses him of not being vigilent for his king and shows the spear and the jug.  Saul again realising that David could have easily killed him realises his wrong again and asks for David to forgive him, which David does, showing the principle that the Lord Jesus laid down that if someone sins against us we are to forgive everytime.  Saul again leaves off his pursuit of David and this was the last time that they ever met.",
            "download": "http:\/\/api.sermonindex.net\/SID10658-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Samuel 26-31",
            "url": "http:\/\/api.sermonindex.net\/SID6346",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 26-31",
            "topic": "",
            "description": "In the wilderness area where David was hiding there are lots of places to hide and spot out people moving about. David is a very daring and courageous person, he sneaks out into the camp of Saul and creeps right into the cave where Saul was sleeping. David said who can stretch out his hand against the anointed of God. Even though the anointing has left Saul; David still had a deep respect for Gods calling and use of King Saul. Some people murmur and complain against pastors and think they can do a better job then the pastor. There needs to be a sense of Gods calling on a pastor and letting him hear from God of what he should be doing. Once a person gets his mind on critism then it grows and grows and becomes a cancer and they become critical in all things. There needs to be a respect for Gods calling on a man in authority. God was still using King Saul and had plans for his life and its awesome to see David recognize that even in the position he was in fleeing from Saul’s unjust attacks on him.",
            "download": "http:\/\/api.sermonindex.net\/SID6346-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "26"
                }
            ]
        },
        {
            "title": "Playing the Fool",
            "url": "http:\/\/api.sermonindex.net\/SID9204",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 26:21",
            "topic": "Foolish",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9204-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "26"
                }
            ]
        }
    ]
}