{
    "name": "1 Samuel 27",
    "book": "1 Samuel",
    "chapter": 27,
    "sermons": [
        {
            "title": "(1 Samuel) Discouraged and Running Away",
            "url": "http:\/\/api.sermonindex.net\/SID10659",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27",
            "topic": "",
            "description": "David was disparing that one day Saul would kill him and so made up his mind to escape, leave the people of God and go and live amongst the ungodly Philistines.  t this point David was so low that he had forgotten the promises of the Lord towards him how he would one day be king and that Saul would not take his life.  However David did not go alone to Gath in Philistia but took all his men and their families with him,  so much depends upon godly leaders walking with the Lord that when they depart from the way many folow them.  David goes to the king of Gath and asks for a city to dwell in and the king gives him Ziklag, for this David declared himself to be a servant of the king, what a sad time this must have been, that the champion of the armies of Israel was now the servant of the king of the philistines.  During this time David leared to play the instrument of Gath as ssen in the titels of Psalm 8, 84 and 87 but he didn't write any Psalms to the Lord during this time, sadly he became a marauder and attacked cities and robbed their dead.",
            "download": "http:\/\/api.sermonindex.net\/SID10659-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "Life of David",
            "url": "http:\/\/api.sermonindex.net\/SID12245",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27",
            "topic": "David",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID12245-download",
            "speaker_name": "Alan Redpath",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "The Danger of Doubting",
            "url": "http:\/\/api.sermonindex.net\/SID13289",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27:1",
            "topic": "",
            "description": "To doubt the lovingkindness of God is thought by some to be a very small sin; in fact, some have even exalted the doubts and fears of God's people into fruits and grace, and evidences of great advancement in experience. It is humiliating to observe that certain ministers have pampered and petted men in unbelief and distrust of God, being in this matter false to their Master, and to the souls of his people. Far be it from me to smite the feeble of the flock; but their sins I must and will smite, since it is my firm conviction, that to doubt the kindness, the faithfulness, and the love of God, is a very heinous offense. Unbelief is akin to Atheism. Atheism denies God's existence- unbelief denies his goodness, and since goodness is essential to God, these doubts do, in reality, stab at his very being. That can be no light sin which makes God a liar; and yet unbelief does in effect, cast foul and slanderous suspicion upon the veracity of the Holy One of Israel. That can be no small offense which charges the Creator of heaven and earth with perjury; and yet, if I mistrust his oath, and will not believe his promise, sealed with the blood of his own Son, I count the oath of God to be unworthy of my trust...",
            "download": "http:\/\/api.sermonindex.net\/SID13289-download",
            "speaker_name": "C. H. Spurgeon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        }
    ]
}