{
    "name": "1 Samuel 27",
    "book": "1 Samuel",
    "chapter": 27,
    "sermons": [
        {
            "title": "(1 Samuel) Discouraged and Running Away",
            "url": "https:\/\/sermonindex.info\/SID10659",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27",
            "topic": "",
            "description": "David was disparing that one day Saul would kill him and so made up his mind to escape, leave the people of God and go and live amongst the ungodly Philistines.  t this point David was so low that he had forgotten the promises of the Lord towards him how he would one day be king and that Saul would not take his life.  However David did not go alone to Gath in Philistia but took all his men and their families with him,  so much depends upon godly leaders walking with the Lord that when they depart from the way many folow them.  David goes to the king of Gath and asks for a city to dwell in and the king gives him Ziklag, for this David declared himself to be a servant of the king, what a sad time this must have been, that the champion of the armies of Israel was now the servant of the king of the philistines.  During this time David leared to play the instrument of Gath as ssen in the titels of Psalm 8, 84 and 87 but he didn't write any Psalms to the Lord during this time, sadly he became a marauder and attacked cities and robbed their dead.",
            "download": "https:\/\/sermonindex.info\/SID10659-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "Life of David",
            "url": "https:\/\/sermonindex.info\/SID12245",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27",
            "topic": "David",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12245-download",
            "preacher_name": "Alan Redpath",
            "preacher_image": "\/images\/alan_redpath.gif",
            "preacher_description": "Alan Redpath (1907 - 1989)\r\nListen to freely downloadable audio sermons by the speaker Alan Redpath in mp3 format. Redpath was a well-known preacher from England who pastored the famous Moody church in chicago for 7 years. He ministered at Keswick conventions and also deeper life meetings on the subject of revival, prayer, full-surrender. He spent the later years of his life ministering Capernwray bible school movement founded by Major Ian Thomas.\r\n\r\nDr. Redpath authored six books; the first one, Victorious Christian Living, was published in 1955. Others were Victorious Prayer (1956), Victorious Christian Service (1958), The Royal Route to Heaven (1960), Blessings Out of Buffettings (1965), The Making of a Man of God (1962), and Law and Liberty and Captivity to Conquest (1978).",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "The Danger of Doubting",
            "url": "https:\/\/sermonindex.info\/SID13289",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 27:1",
            "topic": "",
            "description": "To doubt the lovingkindness of God is thought by some to be a very small sin; in fact, some have even exalted the doubts and fears of God's people into fruits and grace, and evidences of great advancement in experience. It is humiliating to observe that certain ministers have pampered and petted men in unbelief and distrust of God, being in this matter false to their Master, and to the souls of his people. Far be it from me to smite the feeble of the flock; but their sins I must and will smite, since it is my firm conviction, that to doubt the kindness, the faithfulness, and the love of God, is a very heinous offense. Unbelief is akin to Atheism. Atheism denies God's existence- unbelief denies his goodness, and since goodness is essential to God, these doubts do, in reality, stab at his very being. That can be no light sin which makes God a liar; and yet unbelief does in effect, cast foul and slanderous suspicion upon the veracity of the Holy One of Israel. That can be no small offense which charges the Creator of heaven and earth with perjury; and yet, if I mistrust his oath, and will not believe his promise, sealed with the blood of his own Son, I count the oath of God to be unworthy of my trust...",
            "download": "https:\/\/sermonindex.info\/SID13289-download",
            "preacher_name": "C. H. Spurgeon",
            "preacher_image": "\/images\/c_h_spurgeon.gif",
            "preacher_description": "C.H. Spurgeon (1834 - 1892)\r\nListen to freely downloadable audio sermons by the speaker C.H. Spurgeon in mp3 format. Spurgeon quickly became known as one of the most influential preachers of his time. Well known for his biblical powerful expositions of scripture and oratory ability. In modern evangelical circles he is stated to be the \"Prince of Preachers.\" He pastored the Metropolitan Tabernacle in downtown London, England. \r\n\r\nHis church was part of a particular baptist church movement and they defended and preached Christ and Him crucified and the purity of the Gospel message. Spurgeon never gave altar calls but always extended the invitation to come to Christ. He was a faithful minister in his time that glorified God and brought many to the living Christ.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "27"
                }
            ]
        }
    ]
}