{
    "name": "1 Samuel 28",
    "book": "1 Samuel",
    "chapter": 28,
    "sermons": [
        {
            "title": "(1 Samuel) When God Won’t Talk to You",
            "url": "http:\/\/sermonindex.net\/SID10660",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 28",
            "topic": "",
            "description": "The Philistines again attack Israel in a very aggresive way, reaching right into the heart of the land.  So Saul not knowing what to do goes to enquire of the Lord, but the Lord wouldn't answer him either by dreams, Urim or prophets, this is because Saul had been in open rebellion to the Lord for years now andhad departed from Him.  So Saul panics and seeks a medium who would give him advice.  So the servants of Saul tell him of a woman in Endor, so Saul disguises himself and goes to her and asks her to bring up Samuel the prophet from the dead, and when Samuel comes the medium is terrified and realises who Saul is.  Samuel asks Saul why he has brought him up and Saul says that the Lord has departed from him, when really Saul had departed from the Lord, and he doesn't know what to do, but Samuel reminds Saul that the Lord had promised to tear the kingdom out of his hands and that is just what is going to happen because the time that had elapsed had not atoned for Saul's sin.  So Samuel tells Saul that the day after he would die and gave Saul one last chance to repent, but he didn't.",
            "download": "http:\/\/sermonindex.net\/SID10660-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "28"
                }
            ]
        },
        {
            "title": "Attaining Immortality",
            "url": "http:\/\/sermonindex.net\/SID11160",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Corinthians 15:12-26, 1 Samuel 28:11, Matthew 27:52",
            "topic": "",
            "description": "Dr. Thompson presents a very thorough, fascinating case for focusing our hope on the resurrection of the body instead of the ascension (rapture). He discusses why it is so important that we are raised from the dead, and how focusing on ‘gaining entrance heaven’ is actually counterproductive, since it bypasses the very heart of God and His grand plan. (1 hr 8 min 25 sec)",
            "download": "http:\/\/sermonindex.net\/SID11160-download",
            "preacher_name": "Robert B. Thompson",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Corinthians",
                    "chapter": "15"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "28"
                },
                {
                    "book": "Matthew",
                    "chapter": "27"
                }
            ]
        },
        {
            "title": "When God Quits Speaking",
            "url": "http:\/\/sermonindex.net\/SID9205",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 28:6",
            "topic": "Silence Of God",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID9205-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "28"
                }
            ]
        }
    ]
}