{
    "name": "1 Samuel 29",
    "book": "1 Samuel",
    "chapter": 29,
    "sermons": [
        {
            "title": "(1 Samuel) Bottomed Out and Starting to Rise",
            "url": "https:\/\/sermonindex.info\/SID10661",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 29:1-30:6",
            "topic": "",
            "description": "David and his men are preparing to fight a war, against Israel and with the Philistines, he was in a place where he never thought he'd be fighting against the people of God with the enemies of God, but the Philistine rulers were suspicious of him, they hadn't forgotten who David was even if he had, so they would not allow him to fight with them and wanted him to leave.  David discouraged by this went, with his men, back to their home in Ziklag, but when thy get in sight of the city they see smoke coming up out of it and not smoke from cooking, so they rush home to find the city totally empty, all their families had been taken by the Amalekites, then men began to dispair and turned on David desiring that they might stone him to death.  David also deeply concerned did the only thing he could do in the situation, strengthened himself in the Lord his God.",
            "download": "https:\/\/sermonindex.info\/SID10661-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "29"
                }
            ]
        }
    ]
}