{
    "name": "1 Samuel 3",
    "book": "1 Samuel",
    "chapter": 3,
    "sermons": [
        {
            "title": "(1 Samuel) Various Passages - Three Lives, Three Choices",
            "url": "http:\/\/api.sermonindex.net\/SID10664",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 3:18, 1 Samuel 13:11-12, 1 Samuel 16:12",
            "topic": "",
            "description": "Samuel, Saul and David, three of the most memorable people to appear in the scriptures made choices early on in their lives that would influence their entire lives from then on. As a child Samuel served in the house of the Lord at Shiloh under Eli the High priest, Eli had chosen not to rebuke his sons for their wickedness and for this the Lord held him responsible, one night the Lord told Samuel, still a child, to tell Eli that he would take the priesthood from Eli.  Eli asked Samuel what the Lord had said and Samuel told him everything.  He chose to obey the Lord over popularity.  Saul was anointed king over Israel but in a moment of panic offered a sacrifice to the Lord which was forbidden to do, when Samuel, now the prophet of God, challenged him Saul chose to make excuses for his actions instead of repenting.  David was a man after God's own heart and chose to love the Lord when he was alone with the sheep in the fields where there were none to see him, David still a boy became and man of God and most likely in this time wrote Psalm 23.",
            "download": "http:\/\/api.sermonindex.net\/SID10664-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "13"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "16"
                }
            ]
        },
        {
            "title": "God Is Training A Holy Remnant",
            "url": "http:\/\/api.sermonindex.net\/SID3079",
            "size": "9563648",
            "format": "mp3",
            "scripture": "1 Samuel 2:27,1 Samuel 3:11-21",
            "topic": "Remnant",
            "description": "In these last days, God is doing a work that will impact the world.  He is training a holy remnant that will be solely dedicated to God and His work during these last days. God is raising up a people who are committed to him and his cause who are a holy remnant, and who are steadfast and sure of their God. Eli was judged soft on sin and allowed wickedness in the tabernacle at Shiloh; even his own sons. Today, the church world is a laughing stock because of wickedness in the house of God, there is no power or spiritual authority, no presence of the Lord in many churches. But there is an unseen remnant of people, who would surprise you, because they are not prominent, or well known, but they are shut in with and hearing a word from God. And the word is prepare, for judgment is coming.",
            "download": "http:\/\/api.sermonindex.net\/SID3079-download",
            "speaker_name": "David Wilkerson",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Holy Harmony - Part 2",
            "url": "http:\/\/api.sermonindex.net\/SID17557",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 3:18 ",
            "topic": "Unity",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID17557-download",
            "speaker_name": "Elisabeth Elliot",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Why Doesn't My Christianity Work At Home",
            "url": "http:\/\/api.sermonindex.net\/SID3966",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 3:1,Matthew 12:14-19",
            "topic": "",
            "description": "When we get into strife, striving in our spirit, communicating and relating to others with harshness, or argumentative debate, that hinders the flow of God's power and presence in our lives. We need to have the power to not get into strife in our household, not be drawn into it. Not making loud demands of others. The Holy Spirit will not move over that. There won't be a noise and striving to be recognized. That is the person in whose life the Holy Spirit can be released. Some people nullify a good word from heaven because they get in strife, whether it's other's behaviors, or our own. When God gives us a word, he intends to stand by it. But when our lifestyle is out of order, it's hard for us to know God. It restricts what God wants to do in our homes. This is why Christianity doesn't work at home.",
            "download": "http:\/\/api.sermonindex.net\/SID3966-download",
            "speaker_name": "Neil Rhodes",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "3"
                },
                {
                    "book": "Matthew",
                    "chapter": "12"
                }
            ]
        }
    ]
}