{
    "name": "1 Samuel 30",
    "book": "1 Samuel",
    "chapter": 30,
    "sermons": [
        {
            "title": "(1 Samuel) Winning Back More than You Lost",
            "url": "http:\/\/api.sermonindex.net\/SID10662",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 30:7-31",
            "topic": "",
            "description": "David arrives back home in Ziklag to find that everything has gone, all his family and his mens families too, but he strengthened himself in the Lord his God and asks the Lord what He wants him to do, the Lord tells David to go after the Amalekites who had taken all their families, and that he will recover all that he had lost.  David recieved the promise from the Lord and heads off with his 600 men.  But 200 of them were too weary to cross the river so David instructs them to wait there and look after the supplies, a little further and the find an Egyptian alone, David gives him food and water and asks where he has come from, the Egyptian tells him that he is one of the servants of the Amalekites and that if David will spare him he will lead him to them.  When David and his men find the Amalekites they are throwing a party so David and his men wait till the morning after win a great victory, and recover all they had before and the spoil of battle too.  David being the great leader that he was gives an equal portion to the men who stayed behind at the river.",
            "download": "http:\/\/api.sermonindex.net\/SID10662-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "30"
                }
            ]
        },
        {
            "title": "Encouraging Yourself in the Lord",
            "url": "http:\/\/api.sermonindex.net\/SID9206",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 30:6",
            "topic": "Encouragement",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9206-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "30"
                }
            ]
        }
    ]
}