{
    "name": "1 Samuel 31",
    "book": "1 Samuel",
    "chapter": 31,
    "sermons": [
        {
            "title": "(1 Samuel) How to Be Free From Bitterness",
            "url": "http:\/\/api.sermonindex.net\/SID10663",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 31",
            "topic": "",
            "description": "The final day of king Sauls life finally arrives, the day the Lord warned him about probably 15-20 years before,  Saul goes into battle with the armies of Israel against the Philistines.  The battle goes very badly for Saul and he finds himself in the heat of the fight due to his army retreating, Saul sons including Jonathan Davids close beloved friend are killed and Saul is pierced with arrows.  Knowing that he is going to die he asks his armour bearer to kill him so that he will not be captured and ridiculed by the philistines, but his amrour bearer doesn't and so Saul falls upon his own sword and takes his own life, even here on the last day of his life knowing how soon he will stand before almighty God Saul doesn't repent.  The people of Israel in the surrounding area hear of what has happened and abandon their homes and flee.  The Philistines take Sauls body and cut off his head and use it as a grisly trophy to show their victory.  But the men of Jabesh Gilead go to the city where the philistines have chained up the bodies of Saul and his sons and take them back and give them proper burial and mourne for the loss.  David mourns when he hears that his king has been killed he shows no bitterness or rejoicing but calls Saul the beauty of Israel.",
            "download": "http:\/\/api.sermonindex.net\/SID10663-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "How to Comment Spiritual Suicide",
            "url": "http:\/\/api.sermonindex.net\/SID19841",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 31:3-4",
            "topic": "Suicide",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19841-download",
            "preacher_name": "Charlie Orr",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "31"
                }
            ]
        }
    ]
}