{
    "name": "1 Samuel 4",
    "book": "1 Samuel",
    "chapter": 4,
    "sermons": [
        {
            "title": "(1 Samuel) The Raiding of the Ark",
            "url": "http:\/\/api.sermonindex.net\/SID10624",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4:1-11",
            "topic": "",
            "description": "Here the Israelites are at war with their neighbours the Philistines, who had superior military technology for that time due to their widespread trade routes.  After suffering a crushing defeat of 4000 men the leaders of Israel tried to persuade god to fight for them by bringing the Ark of the Covenant, this was a great mistake as they put their faith in the Ark of God and not in the God of the Ark.  This displayed the vain superstitions the people of Israel were embracing at the time.  The priests that brough the Ark tio the camp were the two sons of Eli who the Lord had already declared were under judgement.  When the Ark arrived their was a great shout in the camp and the Philistines became afraid as they knew that the Ark represented the God of Israel and that He was mightier than their gods, but despite this they did not submit to Him but fought the more viciously against the Israelites.  Becasue God was not with Israelites they not only lost awefully but the Ark was taken and the sons of Eli were killed in the smae day, just as the Lord had said would happen.",
            "download": "http:\/\/api.sermonindex.net\/SID10624-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "(The Path Of The Ark #3) God Rejects Flesh",
            "url": "http:\/\/api.sermonindex.net\/SID15375",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4:1-6:18",
            "topic": "",
            "description": "The public enemy number one was not the Philistines but the corrupt priesthood.  The Philistines' capture of the Ark revolves around our natural man trying to make the Ark (Jesus) happy.  God humbles us with plagues and does a mighty miracle to show us that there is no resting place for Him in our flesh.",
            "download": "http:\/\/api.sermonindex.net\/SID15375-download",
            "speaker_name": "Ed Miller",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Ancient Revival",
            "url": "http:\/\/api.sermonindex.net\/SID1133",
            "size": "6586880",
            "format": "mp3",
            "scripture": "1 Samuel 4:1-3, 1 Samuel 7:3, Isaiah 42:5",
            "topic": "",
            "description": "Brother Maxwell speaks on the main hindrance to revival in the Scripture, and the main hindrance today: our own sin. The reason we don't see God move is that we think that someone else besides us is blocking the moving of the Spirit. Included is a very interesting narrative about Dr. Ernest M. Wadsworth that documents his efforts for ministers to look inward to unblock the hindrance to revival, as well as many angry church members that called him during the week after being told to 'make your crooked places straight.' \"I went to the office of the mayor and was ushered into a private room. After I was seated, he said, 'I heard your sermon yesterday morning, now; man to man, I want to know who's been telling you about me?'\"",
            "download": "http:\/\/api.sermonindex.net\/SID1133-download",
            "speaker_name": "L.E. Maxwell",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "42"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Ichabod: The Glory Departed",
            "url": "http:\/\/api.sermonindex.net\/SID26099",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4:21, 1 Samuel 2:12-25",
            "topic": "Ichabod",
            "description": "Brother Bakht Singh speaks a message on the glory of God departing. Hophni and Phinehas the 2 sons of Eli were doing wickedly before the presence of God. There comes a point when God's people transgress and God withdraws His presence. This is a warning to us in the New Covenant that we are not to test the Lord and not presume His presence with us without following Him in obedience.",
            "download": "http:\/\/api.sermonindex.net\/SID26099-download",
            "speaker_name": "Bakht Singh",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "2"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Ark of the Covenant: In Dagon’s Temple Part IV",
            "url": "http:\/\/api.sermonindex.net\/SID16670",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4",
            "topic": "Ark Of The Covenant",
            "description": "Roy Hession speaks about Israel’s defeat by the Philistines & how the Ark of the Covenant was taken & placed in the heathen temple of Dagon.  The Israelites thought that by recovering the Ark that “it” would save them.  They were trusting in the Ark of the Lord instead of the Lord of the Ark.",
            "download": "http:\/\/api.sermonindex.net\/SID16670-download",
            "speaker_name": "Roy Hession",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "The Glory Is Departed by Harold Vaughn",
            "url": "http:\/\/api.sermonindex.net\/SID16438",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 4",
            "topic": "Revival Conference",
            "description": "Harold Vaughn speaks of great need of revival and the declension of the nation of Israel under the priesthood of Eli. There is a similarity between the story found in 1st Samuel and the current state of America spiritually. This message gives a clear call for repentance for the Church of Jesus Christ.",
            "download": "http:\/\/api.sermonindex.net\/SID16438-download",
            "speaker_name": "Revival Conference Canton 2007",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        }
    ]
}