{
    "name": "1 Samuel 6",
    "book": "1 Samuel",
    "chapter": 6,
    "sermons": [
        {
            "title": "(1 Samuel) The Holiness of God",
            "url": "http:\/\/api.sermonindex.net\/SID10627",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 6:13-21",
            "topic": "",
            "description": "The Ark of the Lord returns to Israel and the people rejoice to see it in much the same way the dicsciple must have rejoiced to see the risen Lord Jesus, they offered a sacrifice unto the Lord using the wood from the cart and the cows that had pulled the cart back, these were expensive commodities in those days.  However it wasn't long before the men of Bethshemesh became curious to know what was actually in the Ark, so they opened it and the Lord kiled them for it.  This shows that there are some things that God has chosen not to reveal to us and it is sin to press God to try an find out things that He does not want to reveal to us.  This judgement lead to a great fear spreading over the people as they realized the holiness of God, that God is not man and is far beyond us and thus is seperate from us.  This is what attracts people to God because He is beyond us, but when people come to know Him and see his holiness and 'otherness' we become fearful as we are not holy before a holy God.  But praise God there is someone who can stand between us and God, the Lord Jesus.",
            "download": "http:\/\/api.sermonindex.net\/SID10627-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "(1 Samuel) What Happens by Chance",
            "url": "http:\/\/api.sermonindex.net\/SID10626",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 6:1-12",
            "topic": "",
            "description": "After an amazing 7 months of affliction because of the Ark of God, the Philistines finally decide to send the Ark back to the people of Israel with an offering to show their humility towards the Lord.  They had learned lesson from their Biblical history in that would no longer harden their hearts towards the Lord as the Egyptians had done inb the time of Moses.  But before sending the Ark back they decided to perform on last test to see if what had happened was at the hand of the Lord or all the events had just happened by chance.  They placed the Ark on a cart pulled by 2 milk cows, which had never pulled anything before in their lives, they took the cows from their calves, set them on a road they had never been on and sent them away with no driver.  The philistines had 'stacked the deck' against God to see if it was actually Him who had punished them for these 7 months.  So they stood back and watched in amazement as the cows took the exact route to Bethshemesh guided by the invisible hand of Almighty God, God will get His glory even if He has to glorify Himself.",
            "download": "http:\/\/api.sermonindex.net\/SID10626-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Unrelenting Humility of God",
            "url": "http:\/\/api.sermonindex.net\/SID13140",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 113:1-9, Revelation 4:5-8, 1 Samuel 6:12-19",
            "topic": "Humility",
            "description": "This message begins Scriptures on the holiness, power and might of God, and His requirement of worship of which He is worthy. From there, Pastor Conlon takes us on an incredible journey through the Old Testament and back to the New, illustrating through the Word the incredible humility this awesome God of unimaginable power has shown toward mankind. This is one of the best illustrations of the Lord Jesus Christ-it's not so much a sermon as a verbal portrait painted with love and care of our Lord that every Christian needs to hear. It will change how you deal with others and it will forever change how you see the Lord if you listen with an open and hungry heart. He goes through many Scriptures, so I'd recommend having a pencil and paper on hand.",
            "download": "http:\/\/api.sermonindex.net\/SID13140-download",
            "speaker_name": "Carter Conlon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "6"
                },
                {
                    "book": "Revelation",
                    "chapter": "4"
                },
                {
                    "book": "Psalms",
                    "chapter": "113"
                }
            ]
        }
    ]
}