{
    "name": "1 Samuel 7",
    "book": "1 Samuel",
    "chapter": 7,
    "sermons": [
        {
            "title": "(1 Samuel) God Blesses When We Get Right",
            "url": "http:\/\/api.sermonindex.net\/SID10628",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Samuel 7",
            "topic": "",
            "description": "The Ark is brought to the men of Kirjathjearim who consecrate a priest to look after it and the Ark stays there for 20 years.  After this time the people begin to lament, yes they have the Ark back but the prescence of the Lord is still absent and they know this so they began at last to seek the God of the Ark.  The Lord sends Samuel to them who speaks to them what is in the heart of God, they should turn away from their idolatry and worship of Baal and Ashtaroth, who are the modern gods of money and sex.  The people heeded the word of the Lord and put away the idolatry and repented and lamented over their sin before to Lord.  The Philistines saw this as a sign of weakness and decided they would finally defeat the Israelites.  But the Lord was on their side now and the Philistines couldn't even get to the battle before the Lord struck them with fear and the Israelites won without even going into battle.",
            "download": "http:\/\/api.sermonindex.net\/SID10628-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                }
            ]
        },
        {
            "title": "Ancient Revival",
            "url": "http:\/\/api.sermonindex.net\/SID1133",
            "size": "6586880",
            "format": "mp3",
            "scripture": "1 Samuel 4:1-3, 1 Samuel 7:3, Isaiah 42:5",
            "topic": "",
            "description": "Brother Maxwell speaks on the main hindrance to revival in the Scripture, and the main hindrance today: our own sin. The reason we don't see God move is that we think that someone else besides us is blocking the moving of the Spirit. Included is a very interesting narrative about Dr. Ernest M. Wadsworth that documents his efforts for ministers to look inward to unblock the hindrance to revival, as well as many angry church members that called him during the week after being told to 'make your crooked places straight.' \"I went to the office of the mayor and was ushered into a private room. After I was seated, he said, 'I heard your sermon yesterday morning, now; man to man, I want to know who's been telling you about me?'\"",
            "download": "http:\/\/api.sermonindex.net\/SID1133-download",
            "speaker_name": "L.E. Maxwell",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "42"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "4"
                }
            ]
        },
        {
            "title": "Breaking Strongholds-When the Past is Your Teacher",
            "url": "http:\/\/api.sermonindex.net\/SID3192",
            "size": "9043968",
            "format": "mp3",
            "scripture": "1 Samuel 7-8,1 Samuel 12-13,Psalm 63:1-4",
            "topic": "",
            "description": "This is a message about the strongholds of fear and unbelief and the disastrous consequences it had on Israel, and Saul.  Even though the Lord gave them victories, they were not loyal, they rejected his rulership in favor of man's.  God warned them of the consequences. They wanted to have a man to fight their battles, someone they could see, like the world around them had, to go before them, rather than the undefeatable, Almighty God fighting for them. They didn't want to forsake their own ideals and let God be Lord of their life. Saul was representative of this rebellion and illustrates the danger of this kind of stronghold.",
            "download": "http:\/\/api.sermonindex.net\/SID3192-download",
            "speaker_name": "Teresa Conlon",
            "_scripture": [
                {
                    "book": "1 Samuel",
                    "chapter": "7"
                },
                {
                    "book": "1 Samuel",
                    "chapter": "12"
                },
                {
                    "book": "Psalms",
                    "chapter": "63"
                }
            ]
        }
    ]
}