{
    "name": "1 Kings 1",
    "book": "1 Kings",
    "chapter": 1,
    "sermons": [
        {
            "title": "(1 Kings) Solomon Receives the Throne",
            "url": "http:\/\/api.sermonindex.net\/SID10717",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 1-2",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10717-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Kings 1-4",
            "url": "http:\/\/api.sermonindex.net\/SID6350",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 1-4",
            "topic": "Through The Bible",
            "description": "1 and 2 kings cover a period of approximately 400 years. 1 and 2 Chronicles repeated a lot of information but are just about the kings of Judah whereas the 1 and 2 kings take up most of its information about the kings of Israel and some of Judah. It is sad to see a person stricken in years when they age they become an invalid but God is still active in people of these days. God delivers us from circumstances but being a child of God does not give us super protection against trials and problems. If we know as a child of God that we will face problems like the rest of the world then in my problems God will be with us and we will have the assurance that God will see us through. What a hope that we have.. same as David saying: As the Lord liveth that shall deliver me out of all the distresses of my soul. God promises to us then what we ask, now to him that is able to give exceedingly abundantly above all that we can ask. God desires to give to us so much beyond what we need just as parents desire to do to children.",
            "download": "http:\/\/api.sermonindex.net\/SID6350-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "1"
                }
            ]
        }
    ]
}