{
    "name": "1 Kings 1",
    "book": "1 Kings",
    "chapter": 1,
    "audio_sermons": [
        {
            "title": "(1 Kings) Solomon Receives the Throne",
            "url": "http:\/\/sermonindex.net\/SID10717",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 1-2",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10717-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Kings 1-4",
            "url": "http:\/\/sermonindex.net\/SID6350",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 1-4",
            "topic": "Through The Bible",
            "description": "1 and 2 kings cover a period of approximately 400 years. 1 and 2 Chronicles repeated a lot of information but are just about the kings of Judah whereas the 1 and 2 kings take up most of its information about the kings of Israel and some of Judah. It is sad to see a person stricken in years when they age they become an invalid but God is still active in people of these days. God delivers us from circumstances but being a child of God does not give us super protection against trials and problems. If we know as a child of God that we will face problems like the rest of the world then in my problems God will be with us and we will have the assurance that God will see us through. What a hope that we have.. same as David saying: As the Lord liveth that shall deliver me out of all the distresses of my soul. God promises to us then what we ask, now to him that is able to give exceedingly abundantly above all that we can ask. God desires to give to us so much beyond what we need just as parents desire to do to children.",
            "download": "http:\/\/sermonindex.net\/SID6350-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "1"
                }
            ]
        }
    ]
}