{
    "name": "1 Kings 19",
    "book": "1 Kings",
    "chapter": 19,
    "sermons": [
        {
            "title": "(Depressed Disciples) The Fear Of Death",
            "url": "https:\/\/sermonindex.info\/SID7313",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:1-16",
            "topic": "Fear Of Death",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID7313-download",
            "preacher_name": "Willie Mullan",
            "preacher_image": "",
            "preacher_description": "Willie Mullan (1911 - 1980)\r\nListen to freely downloadable audio sermons by the speaker Willie Mullan in mp3 format. Was a Northern Irish Evangelist. He was born in Newtownards, County Down, Ireland in 1911. In his book Tramp after God, he tells of living for more than three years as a tramp abusing alcohol and involved in crime. Willie Mullan had a religious conversion and from that time forward he decided he would strive to serve God.\r\n\r\n In 1953 Willie Mullan was called to Lurgan Baptist church, and in August of that year he commenced the work in Lurgan. One of his great accomplishments during this time was the Tuesday night Bible class. Every Tuesday night hundreds attended to hear the exposition of the Word. In 1957 William Hewitt and a team of helpers commenced the tape recordings of the Bible class. At least 1500 of these recordings remain until this day.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "A Day's Journey Into the Wilderness",
            "url": "https:\/\/sermonindex.info\/SID4316",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19",
            "topic": "Wilderness",
            "description": "Ever suffer from spiritual despression -- even at times when, no matter how great you feel the power of God working in your life, you still feel as if you could rise from your bed only to eat, then lie back down again? In I Kings 19, Elijah felt that way, even after God had defeated the priests of Baal by answering Isaiah's prayer and accepting his sacrifice. Isaiah even wished to die. In this sermon, Pastor Conlon discusses spiritual depression and how it may strike any one of us at any time -- and what to do about it if it does.",
            "download": "https:\/\/sermonindex.info\/SID4316-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Believing the Whispers of God",
            "url": "https:\/\/sermonindex.info\/SID14208",
            "size": "0",
            "format": "mp3",
            "scripture": " 1 Kings 19:11-13, Isaiah 30:20-21",
            "topic": "Guidance Of God",
            "description": "December 10, 2006 - We may be experiencing adversity and various trials but if you have an honest heart God will instruct us and guide us with His Word. When the Lord has used His servant and His touch has come upon us there is a season of weeping and spiritual fatigue that will follow. It is in these seasons that satan himself will come with roaring accusations and attempt to lead us into a wilderness and a sense of powerlessness. It is complete fiction to believe the devil has any power to take you as a sincere believer from the security of your position through Christ in God. The devil can only come against us with roaring lies but in REALITY he has no power to do this. God Himself will come and whisper His mercy and love to show us we are not alone and evil will not triumph over us. He will vanquish our enemies with a still small voice and comfort and nourish us.",
            "download": "https:\/\/sermonindex.info\/SID14208-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "Isaiah",
                    "chapter": "30"
                },
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Cause\/Cure of the Drug Epidemic",
            "url": "https:\/\/sermonindex.info\/SID0543",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:11",
            "topic": "Drug Addiction",
            "description": "Dr. Smith here addresses the different kinds of hard drugs and specifically the ones that are labeled as “sorcery” in the King James Version of Galatians.  Smith shows how sorcery is really speaking of drug induced “religious” experience or pharmakeia.  Smith argues that these drug induced stupor’s are a means of compensating for true spirituality, in the sense that they crowd out the senses God has given us in order that we might choose to enter our prayer closets, reduce our sensory input, and hear from God",
            "download": "https:\/\/sermonindex.info\/SID0543-download",
            "preacher_name": "Dr. A.E. Wilder-Smith",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Kiss The Son",
            "url": "https:\/\/sermonindex.info\/SID18526",
            "size": "0",
            "format": "mp3",
            "scripture": "Psalm 2:12, 1 Kings 19:18, Job 31:24",
            "topic": "Wrath Of God",
            "description": "Throughout the Scriptures the Kiss is found in different relationships all of which are to be applied to Christ and none of which stand alone. The Kiss of Worship (I Kings 19:18; Job 31:24-27). The Kiss of Allegiance (I Samuel 10:1; Hosea 13:2). The Kiss of Love (Song of Solomon 1:2). The kiss of love without shame (Song of Solomon 8:1).",
            "download": "https:\/\/sermonindex.info\/SID18526-download",
            "preacher_name": "Aaron Dunlop",
            "preacher_image": "",
            "preacher_description": "Aaron Dunlop ( - )\r\nListen to freely downloadable audio sermons by the speaker Aaron Dunlop in mp3 format. Mr. Dunlop who is originally from Northern Ireland, graduated from the Geneva Reformed Seminary, SC. and is currently pioneering a Free Presbyterian Church in Victoria, British Columbia.\r\nReformed in Doctrine, believing in the divine authority and verbal inspiration of the Bible, and the great fundamental doctrines of grace it contains. The Scriptures alone are the supreme authority in matters of faith and practice. Separatist in Practice, believing and practicing the doctrine of Biblical separatism. In accordance with this, the Free Presbyterian Church has no association with the modern Ecumenical or Charismatic movements, nor will it fellowship with any church which has departed from the fundamental doctrines of the Word of God.",
            "_scripture": [
                {
                    "book": "Psalms",
                    "chapter": "2"
                },
                {
                    "book": "1 Kings",
                    "chapter": "19"
                },
                {
                    "book": "Job",
                    "chapter": "31"
                }
            ]
        },
        {
            "title": "Listen to God's whisper",
            "url": "https:\/\/sermonindex.info\/SID27964",
            "size": "0",
            "format": "mp3",
            "scripture": "1 King 19:9-13",
            "topic": "Voice Of God",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID27964-download",
            "preacher_name": "Erlo Stegen",
            "preacher_image": "\/images\/erlo_stegen.gif",
            "preacher_description": "Erlo Stegen (1935 - Present)\r\nListen to freely downloadable audio sermons by the speaker Erlo Stegen in mp3 format. Used of God in the Zulu revival in South Africa. He helped found the Kwasizabantu Mission where a few thousand live on the mission doing work for the Lord. He shares a powerful burden for the purity of the Church and revival in the Church. \r\n\r\nMany ministers have preached in their large conventions through the years namely David Wilkerson who enjoyed greatly the mission's work. They have established over 30 other missions around the work as a work of the Spirit of God.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Miracles Of Elisha, Message 1",
            "url": "https:\/\/sermonindex.info\/SID11421",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:19-21, 2 Kings 2:9-17",
            "topic": "",
            "description": "Ed Miller introduces Elisha, the one person in the Old Testament who looks like Jesus in an all inclusive way.  \"Elisha is God's illustration of the Christian life in seed form,\" teaches Miller.  This first part of 5 sessions draws out the three secrets of how life in Christ must begin.  (This series of messages was delivered at Del-Mar-Va Labor Day Retreat 2002)",
            "download": "https:\/\/sermonindex.info\/SID11421-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                },
                {
                    "book": "2 Kings",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Seven Thousand Did Not Bow",
            "url": "https:\/\/sermonindex.info\/SID4211",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:18",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID4211-download",
            "preacher_name": "David Wilkerson",
            "preacher_image": "\/images\/david_wilkerson.gif",
            "preacher_description": "David Wilkerson (1931 – 2011)\r\nListen to freely downloadable audio sermons by the speaker David Wilkerson in mp3 format. Founder of Times Square Church in New York City with over 100 different languages spoken in the congregation. Wilkerson wrote many powerful books such as: The Vision and Cross and the Switchblade. His ministry was prophetic as God called him to be a watchman to the Church in North America. He gave clear messages on repentance to the Church. \r\n\r\nWilkerson also founded Teen Challenge where there are hundreds of centres for Christ-centered drug recovery and addiction recovery. He also organized and spoke at pastors gatherings in many countries where he gave prophetic strong messages to encourage pastors and leaders.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        },
        {
            "title": "Tis Not The Season To Be Discouraged",
            "url": "https:\/\/sermonindex.info\/SID16573",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:11-13, 1 Kings 18:46",
            "topic": "Discouragement",
            "description": "December 16, 2007 - The Christmas season for many is a time of loneliness and discouragement. There is a moment in everyone's life when God will come and whisper His truth in our hearts, that ALL THINGS ARE POSSIBLE when Christ is at the center of our lives. God has the power to break us into pieces and consume us, and He would be be completely justified in doing so, but it is not in His heart to do so. Christmas is a season that reminds us that no matter how many times we fail Him, He sent His son Jesus to carry us through our journey. God walks with those who walk with Him. He restores, He gives strength, He gives hope and provision. This season we are lovingly reminded that the supernatural life of Christ is entwined with the natural life of man and we become a new creation. This Christmas listen to the still small voice of Jesus and let Him fill your heart with JOY.",
            "download": "https:\/\/sermonindex.info\/SID16573-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                },
                {
                    "book": "1 Kings",
                    "chapter": "18"
                }
            ]
        },
        {
            "title": "What Are You Doing?",
            "url": "https:\/\/sermonindex.info\/SID9221",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 19:9",
            "topic": "Choosing",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID9221-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "19"
                }
            ]
        }
    ]
}