{
    "name": "1 Kings 8",
    "book": "1 Kings",
    "chapter": 8,
    "sermons": [
        {
            "title": "(1 Kings) Dedicating the Temple",
            "url": "http:\/\/api.sermonindex.net\/SID10720",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10720-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "(The Path Of The Ark #6) The Glory of God",
            "url": "http:\/\/api.sermonindex.net\/SID15378",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8, 2 Chronicles 5:1-7:10",
            "topic": "",
            "description": "The Ark coming to its resting place experienced two surprise appearances of the glory of the Lord--Jesus Christ.  What led up to the first filling was the oceans of animal blood and praise to the Lord.  The glory of God that drove you out for justification will keep you out for sanctification.  This clincher lesson is just loaded with spiritual truth to turn your eyes to the Lord Jesus!",
            "download": "http:\/\/api.sermonindex.net\/SID15378-download",
            "preacher_name": "Ed Miller",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                },
                {
                    "book": "2 Chronicles",
                    "chapter": "5"
                }
            ]
        },
        {
            "title": "82. Is any man able perfectly to keep the commandments of God?",
            "url": "http:\/\/api.sermonindex.net\/SID22436",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8:46, Genesis 6:5",
            "topic": "Audio Books",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID22436-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                },
                {
                    "book": "Genesis",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "Looking On The Heart",
            "url": "http:\/\/api.sermonindex.net\/SID9217",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8:17-18",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID9217-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                }
            ]
        },
        {
            "title": "Practical Response Resulting From Our View of God",
            "url": "http:\/\/api.sermonindex.net\/SID19876",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 8:40, Proverbs 23:17, Ecclesiastes 3:14",
            "topic": "Character Of God",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID19876-download",
            "preacher_name": "Lou Sutera",
            "preacher_image": "",
            "preacher_description": "Lou Sutera ( - )\r\nListen to freely downloadable audio sermons by the speaker Lou Sutera in mp3 format. Twin brothers Used of God in revival since 1971. Single and joint church revival ministries usually two and one-half weeks in length. Characterized by straight-forward preaching, visual presentations, follow-through teaching, personal counselling by lay-team workers, etc. Crusades include sessions for men, ladies, youth, children, church leaders and pastoral staffs.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                },
                {
                    "book": "Proverbs",
                    "chapter": "23"
                },
                {
                    "book": "Ecclesiastes",
                    "chapter": "3"
                }
            ]
        },
        {
            "title": "Returning To God In Enemy Territory",
            "url": "http:\/\/api.sermonindex.net\/SID3409",
            "size": "0",
            "format": "mp3",
            "scripture": "Daniel 9:1-3, Daniel 6:10, 1 Kings 8:44-53",
            "topic": "Revival",
            "description": "January 25, 2004 - When we find ourselves captive in enemy territory and come to Christ with an honest heart and sincere hatred for our sin- we can cry out to God and He will set us free. We must have the heart attitude that says I hate sin and hate what sin does to the name of Christ .",
            "download": "http:\/\/api.sermonindex.net\/SID3409-download",
            "preacher_name": "Carter Conlon",
            "preacher_image": "\/images\/carter_conlon.gif",
            "preacher_description": "Carter Conlon ( - Present)\r\nListen to freely downloadable audio sermons by the speaker Carter Conlon in mp3 format. Carter Conlon is the Senior Pastor of Times Square Church. David Wilkerson is the Founding Pastor of Times Square Church. God called Brother Carter to full-time ministry in Canada by faith and He has been serving the Lord with the same faith till this day. \r\n\r\nGod has used brother Carter Conlon to preach across the world at pastors conferences and evangelism crusades. He has also recently written 2 books with the newest title: \"Fear Not\" in which he is strengthening the body of Christ for what is coming upon the world in the end-times.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "8"
                },
                {
                    "book": "Daniel",
                    "chapter": "6"
                },
                {
                    "book": "Daniel",
                    "chapter": "9"
                }
            ]
        }
    ]
}