{
    "name": "1 Kings 9",
    "book": "1 Kings",
    "chapter": 9,
    "sermons": [
        {
            "title": "(1 Kings) Signs of Danger",
            "url": "http:\/\/sermonindex.net\/SID10721",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 9-10",
            "topic": "",
            "description": "",
            "download": "http:\/\/sermonindex.net\/SID10721-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Kings 9-16",
            "url": "http:\/\/sermonindex.net\/SID6352",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 9-16",
            "topic": "",
            "description": "Solomon completed the temple, which took 7 years to build, and also his own house that took 13 years to build. God says he is going to hallow the temple that he built for God. If you serve other Gods then God will cut off the house of Israel if they forsook the Lord their God. If you will obey me and follow me then your family will be on the throne and because they did forsake the Lord they were cut out of the land. A lot of times there are warnings that come from the Lord through many ways, but whenever God speaks to you it is important if God took the time to speak to you. God always warns people in areas they are going to be tempted and tested later on in your life. Even if its something that I am confident in but God knows that down the road you will need to be relying on Him in that area. We need to glory in our weaknesses because we are depending on the Lord but rather Satan tries to trip us up in the areas that we feel confident in because we are not fully relying on the Lord in those areas.",
            "download": "http:\/\/sermonindex.net\/SID6352-download",
            "preacher_name": "Chuck Smith",
            "preacher_image": "\/images\/chuck_smith.gif",
            "preacher_description": "Chuck Smith (1927 - 2013)\r\nListen to freely downloadable audio sermons by the speaker Chuck Smith in mp3 format. Pastor Chuck was used in the Jesus People revival where he was used along with others to minister to the hippy young people. They saw a work of the Spirit where many were added to the church and discipled. He has raised up many pastors who are a part of the Calvary Chapel movement now and where he pastors the large Costa Mesa church in California.\r\n\r\nThe Calvary Chapel movement is based of simple principles that Chuck Smith taught over the years such as: The priority of agape love, Simple fellowship amongst the saints, the breaking of bread, the teaching of God's word chapter by chapter and verse by verse. And lastly and most importantly the principle not by might nor by power but by my spirit saith the Lord.",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "9"
                }
            ]
        }
    ]
}