{
    "name": "1 Kings 9",
    "book": "1 Kings",
    "chapter": 9,
    "sermons": [
        {
            "title": "(1 Kings) Signs of Danger",
            "url": "http:\/\/api.sermonindex.net\/SID10721",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 9-10",
            "topic": "",
            "description": "",
            "download": "http:\/\/api.sermonindex.net\/SID10721-download",
            "speaker_name": "David Guzik",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "9"
                }
            ]
        },
        {
            "title": "(Through The Bible) 1 Kings 9-16",
            "url": "http:\/\/api.sermonindex.net\/SID6352",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Kings 9-16",
            "topic": "",
            "description": "Solomon completed the temple, which took 7 years to build, and also his own house that took 13 years to build. God says he is going to hallow the temple that he built for God. If you serve other Gods then God will cut off the house of Israel if they forsook the Lord their God. If you will obey me and follow me then your family will be on the throne and because they did forsake the Lord they were cut out of the land. A lot of times there are warnings that come from the Lord through many ways, but whenever God speaks to you it is important if God took the time to speak to you. God always warns people in areas they are going to be tempted and tested later on in your life. Even if its something that I am confident in but God knows that down the road you will need to be relying on Him in that area. We need to glory in our weaknesses because we are depending on the Lord but rather Satan tries to trip us up in the areas that we feel confident in because we are not fully relying on the Lord in those areas.",
            "download": "http:\/\/api.sermonindex.net\/SID6352-download",
            "speaker_name": "Chuck Smith",
            "_scripture": [
                {
                    "book": "1 Kings",
                    "chapter": "9"
                }
            ]
        }
    ]
}