{
    "name": "1 Timothy 2",
    "book": "1 Timothy",
    "chapter": 2,
    "sermons": [
        {
            "title": "(1 Timothy) God The Savior Of All Men",
            "url": "https:\/\/sermonindex.info\/SID11990",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:1-6",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11990-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(1 Timothy) The Christian And The State",
            "url": "https:\/\/sermonindex.info\/SID11989",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:1-8",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11989-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "(1 Timothy) The Role Of Women In The Church",
            "url": "https:\/\/sermonindex.info\/SID11991",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:9-15",
            "topic": "",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11991-download",
            "preacher_name": "Brian Brodersen",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "21. Who is the Redeemer of God’s elect?",
            "url": "https:\/\/sermonindex.info\/SID22375",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:5, John 1:1",
            "topic": "Audio Books",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID22375-download",
            "preacher_name": "Westminster Shorter Catechism",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                },
                {
                    "book": "John",
                    "chapter": "1"
                }
            ]
        },
        {
            "title": "Church History - Martin Luther & the Anabaptists",
            "url": "https:\/\/sermonindex.info\/SID6817",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:5",
            "topic": "",
            "description": "During the reformation Luther revived the doctrine of the priesthood of all believers, and empasised that every man was his own priest and that there is only Jesus Christ between man and God, this inturn lead to the foundations for modern democracy.  While Luther was abscent from his church in Wittenberg he was replaced by his co-pastor who was zealous for reform and implimented the ordinances he read about in the Bible, such as communion.  When Luther returned he rebuked his co-pastor who was only following in Luthers own steps but a bit to energetically for Luther.  The Anabaptists were radical reformers who wanted to reform the quickly they read in the scriptures that the church was a called out peple and thus opposed the movemnts of the time that called for church and state to be united.",
            "download": "https:\/\/sermonindex.info\/SID6817-download",
            "preacher_name": "David Guzik",
            "preacher_image": "",
            "preacher_description": "David Guzik ( - )\r\nListen to freely downloadable audio sermons by the speaker David Guzik in mp3 format.  David Guzik is the pastor of Calvary Chapel Santa Barbara, having come to serve that congregation in July 2010. For 7 years before that, David was the director of Calvary Chapel Bible College Germany, near Siegen, Germany. David took this position in January of 2003, after serving for 14 years as the founding and Senior Pastor of Calvary Chapel of Simi Valley. He has been in pastoral ministry since 1982.\r\nDavid has no formal Bible College or seminary training, but does have a Bachelors of Arts degree from the University of California, Santa Barbara. David, his wife Inga-Lill, live in Santa Barbara, California. Their three children are grown; Aan-Sofie serves as a missionary in Ireland, Nathan lives in Los Angeles, and Jonathan lives in Santa Barbara.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Intercession in Prayer",
            "url": "https:\/\/sermonindex.info\/SID25069",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:1-4",
            "topic": "Intercession",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID25069-download",
            "preacher_name": "Paris Reidhead",
            "preacher_image": "\/images\/paris_reidhead.gif",
            "preacher_description": "Paris Reidhead (1919 - 1992)\r\nListen to freely downloadable audio sermons by the speaker Paris Reidhead in mp3 format. Was a Christian missionary, teacher, writer, and advocate of economic development in impoverished nations. A spiritual crisis during this period—as he described two decades later in what is probably his best-known recorded teaching, \"Ten Shekels and a Shirt\"--left Reidhead with the conviction that much of evangelicalism had adopted utilitarian and humanistic philosophies contradictory to Biblical teaching. The end of all being, he came to believe, was not the happiness of man, but the glorification of God. This theme would recur throughout his later teaching.\r\n\r\nSince Mr. Reidhead's death in 1992, Bible Teaching Ministries, Inc. continues under the leadership of his wife, Marjorie, and daughter, Virginia Teitt, a dedicated Board, and the many people who have donated time and talent after being changed by God’s Word through this message. The message of the Gospel is reaching an ever-widening audience all over the world.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Lake Geneva Bible Conference 1984-06 1 Timothy 2:15",
            "url": "https:\/\/sermonindex.info\/SID11861",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:15",
            "topic": "Conference",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID11861-download",
            "preacher_name": "William MacDonald",
            "preacher_image": "\/images\/william_macdonald.gif",
            "preacher_description": "William MacDonald (1917 - 2007)\r\nListen to freely downloadable audio sermons by the speaker William MacDonald in mp3 format. Was President of Emmaus Bible College, teacher, Plymouth Brethren theologian and a prolific author of over 84 published books. MacDonald refused to accept royalties for his books but established a fund for translating his work Believers Bible Commentary into foreign languages.\r\n\r\n   Bill will be not only be remembered for the thousands upon thousands of lives he touched through his books, teaching and many personal letters, but for his Christ-like character and gentleness, yet powerful life lived by faith in Christ. One of his most impact-ful books is the small booklet called: \"True Discipleship\" it is recommended reading for every serious disciple of Christ.",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Prayer And Revival - Part 1",
            "url": "https:\/\/sermonindex.info\/SID13989",
            "size": "0",
            "format": "mp3",
            "scripture": "Ephesians 6:18, 1 Timothy 2:8, 2 Corinthians 1:11",
            "topic": "Revival Praying",
            "description": "Pastor McLeod shares many passages of scripture and examples from his own experience of revival and some from the experience of others, emphasizing the importance of prayer, especially in the preparation of the work of God in the midst of His people. After a summary of testimonials that led up to the revival in Saskatoon, Bill touches upon several vital aspects that prayer has in effecting revival, which he defines as \"Christians coming up to a New Testament level.\"  \"Prayer,\" he says, \"is the first thing and only thing.\"",
            "download": "https:\/\/sermonindex.info\/SID13989-download",
            "preacher_name": "Bill McLeod",
            "preacher_image": "\/images\/bill_mcleod.gif",
            "preacher_description": "Bill McLeod (1919 - 2012)\r\nListen to freely downloadable audio sermons by the speaker Bill McLeod in mp3 format. Bill Mcleod was the pastor of Ebenezer Baptist Church for many years where ultimately God sent revival to that affecting much of Canada. He had a passion to know God and His word. Paul Washer said he was one of the most godly men he met in Canada.\r\n\r\nBill Mcleod had been praying and had his congregation praying for revival for years. On, October 17, 1971, God in His sovereignty came in revival. Without human means or explanation, the revival spread from church to church, community to community, city to city, and not long after from province to province. This has become known as the 1971 Canadian Revival movement.",
            "_scripture": [
                {
                    "book": "2 Corinthians",
                    "chapter": "1"
                },
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                },
                {
                    "book": "Ephesians",
                    "chapter": "6"
                }
            ]
        },
        {
            "title": "The Soul Of Modesty",
            "url": "https:\/\/sermonindex.info\/SID22315",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2:8-10",
            "topic": "Modesty",
            "description": "The dangers of immodesty and indiscretion are prevalent in today's society. It's tempting for women to want to give in to the world's pressure and wear what is fashionable and available. But modesty deals more with the heart than the body. In a Sunday message primarily directed toward women, C.J. Mahaney speaks from Scripture on the attitude, appearance, and allegiance of the modest woman.",
            "download": "https:\/\/sermonindex.info\/SID22315-download",
            "preacher_name": "C.J. Mahaney",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        },
        {
            "title": "Timothy, I #2 Ch. 2",
            "url": "https:\/\/sermonindex.info\/SID12117",
            "size": "0",
            "format": "mp3",
            "scripture": "1 Timothy 2",
            "topic": "Timothy",
            "description": "",
            "download": "https:\/\/sermonindex.info\/SID12117-download",
            "preacher_name": "Chuck Missler",
            "preacher_image": "",
            "preacher_description": "",
            "_scripture": [
                {
                    "book": "1 Timothy",
                    "chapter": "2"
                }
            ]
        }
    ]
}